[
{"id": "a-drop-to-drink", "title": "A Drop to Drink", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Jim Meador", "collection_id": ["a-question-of-size"], "related_id": ["big-chair-little-chair", "soap-film-painting"], "tagline": "Getting a drink of water would be very different if you were the size of a doll.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Surface Tension of Liquids"], "keywords": ["scale", "water"]},
{"id": "career-criminal", "title": "Career Criminal", "aliases": "Prisoner's Dilemma", "location": "This exhibit is not currently on view.", "byline": "Mary Elizabeth Yarbrough and David Torgersen , 2014", "collection_id": ["science-of-sharing"], "related_id": ["sip-or-squirt", "survival-game", "team-snake", "text-fish"], "tagline": "Do you trust your partner in crime?", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "a-cell-in-motion", "title": "A Cell in Motion", "aliases": "3D Cell Zoetrope", "location": "Gallery 4: Living Systems", "byline": "Denise King , 2017", "collection_id": ["cells-to-self"], "related_id": [], "tagline": "This 3-D animation of microscope images shows how cells move.", "description": "Turn the crank and watch a moving cell model. Different parts of the cell extend and retract, and the cell’s internal bulk sometimes shifts from one area to another. ", "whats_going_on": "", "going_further": "", "details": " How were the models made?  The cell models for this exhibit were 3-D printed from a microscope video of a real cell crawling in the lab. The cell is from a white blood cell cancer.  Why and how do cells move  Most cells in the human body stay put. But some need to move—white blood cells need to find their way to infections, and newly developing brain cells need to migrate to where they belong. A moving cell crawls by extending a pseudopod , or fake foot, to grab on to its surroundings, then it pulls its rear end forward.  Meet the Scientists  To create this exhibit, the Exploratorium worked with scientists who study how white blood cells crawl through the human body, patrolling for infections. Using a microscope that captures 3-D images, cell biologist Lillian Fritz-Laylin recorded video of real human cells moving. Then, visualization scientist Megan Riel-Mehan processed the raw data into clearer, more useful images. The 3D-printed cells in this exhibit were based on that movie.  Learn more about the research from cell biologists Lillian Fritz-Laylin from University of Massachusetts, and Dyche Mullins from University of California, San Francisco. Pictured: Molecular biologist and biochemist Peter Walter of UCSF tests out the prototype of Cells in Motion.", "phenomena": [], "keywords": ["cells movement animation"]},
{"id": "community-garden", "title": "Community Garden,", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "Can gardens transport you to another place?", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español         Can a garden transport you to another place? Andi Xoch thinks so. Her work explores the way gardeners in the Latinx neighborhood of Boyle Heights, Los Angeles create personalized outdoor spaces. This installation is inspired by community gardens throughout the neighborhood. With food plants, flowers, and places to relax, the space responds to the practical and spiritual needs of the community.   Creating with What You’ve Got   As we built this installation, we relied, wherever possible, on used objects instead of new. It’s not only a sustainable choice, it’s a stylistic one. Collaborator Andi Xoch of Latinx with Plants encouraged the Exploratorium to adopt the design aesthetic called rasquachismo. The word “rasquache” once referred to something cheap or reused. Chicano artists invented rasquachismo in the 1960s and 70s, inspired by the cleverly repurposed objects in their communities.  “Rasquachismo is a working class art movement and art practice bestowed upon us by our migratory matriarchs. It’s rooted in resourcefulness and is an aesthetic expression of the underdog. The idea is to create something of beauty through fervent ingenuity.” —Andi Xoch, Latinx with Plants    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "scent-memories", "title": "Aromas y recuerdos", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "Los aromas de las plantas pueden evocar recuerdos poderosos.", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   English         Tritura suavemente diferentes materiales vegetales con un mortero, y descubre qué aromas y recuerdos liberan.   Más información sobre las aromas   Las hojas de cítricos huelen como frutas cítricas mezcladas con hierba. Los mismos aceites que le dan a las frutas como las naranjas, los limones y las limas su aroma refrescante también se encuentran en las hojas.   Los pétalos de rosa  tienen un olor dulce y fuerte. Muchas culturas hacen té de rosas o usan los pétalos para perfume. El la historia oral de los ohlone, la rosa es un protagonista muy querido que sana a los enfermos.  La madera resinosa, llamada “ocote” en México, proviene del corazón de un viejo pino. La madera es rica en savia y resina, lo que la hace buena para encender el fuego y le da un olor distintivo.   Las bayas de enebro son un ingrediente clave en la ginebra. Es posible que reconozcas su aroma a pino en un elegante cóctel.  La menta es popular en muchos estilos de cocina y hay cientos de variedades. En el área de la bahía, puedes encontrar una menta silvestre llamada yerba buena que crece en áreas boscosas.   Las hojas verdes de remolacha y las cáscaras de papa contienen una sustancia química llamada geosmina, que huele a tierra después de una lluvia.  El sokóote es una planta importante para las personas de nuestro pueblo originario ohlone. Reunimos todas las partes de esta respetada planta: sus hojas se utilizan para fines ceremoniales, culinarios y medicinales; las frutas y frutos secos se comen como un manjar fino; su madera se convierte en hermosos objetos culturales como cubos para un juego tradicional ohlone; las ramas de sokóote se entrelazan para formar coronas que se usan alrededor de la cabeza, entremezclados con flores de primavera. Los ohlone amamos su olor, ya que el sokóote es intensamente aromático, un poco dulce y picante al mismo tiempo. —Vincent Medina y Louis Trevino,  Cafe Ohlone    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "cafe-wall-illusion", "title": "Café Wall Illusion", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Peter Richards and Richard Gregory", "collection_id": [], "related_id": [], "tagline": "These tiles aren't really crooked–they just look that way.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Color", "Patterns"], "keywords": ["eyes"]},
{"id": "chladni-singing", "title": "Chladni Singing", "aliases": "Scream into Sand", "location": "This exhibit is not currently on view.", "byline": "Artist-in-Residence Meara O'Reilly , 2013", "collection_id": ["artist-in-residence", "listen"], "related_id": ["sound-bite", "seismograph", "aeolian-harp", "oscylinderscope"], "tagline": "Use your voice to make visible patterns in sand.", "description": "Sand scattered on a large metal square vibrates and jumps in response to the sound of your voice. When you hit just the right note(s), the sand spontaneously migrates into elegant geometrical patterns. ", "whats_going_on": "A speaker transmits the vibrations created by your voice to the center of the metal square. From there, they radiate outward, reflecting off the edges of the square, then overlapping to create patterns of stillness and vibration. Sand bounces off the strongly vibrating places and collects in the still places, leaving a visual record of the vibrations in the square. Different notes vibrate the square at different rates; some special notes are resonant , meaning they vibrate the square at one of its preferred or natural frequencies , leading to extra strong vibrations and a clear and definite pattern on the square.  Chladni patterns make surface vibrations visible: Neighboring clear zones are moving in opposite directions, and sand collects in areas where the surface is still. (click image to enlarge)  Physicist-musician Ernst Chladni came up with the idea to use sand to reveal the pattern of vibrations on a surface in 1787. Today, some makers of violins, cellos, and similar musical instruments still use Chladni patterns to help them craft the belly and back of each instrument, the shapes of which are crucial to the instrument’s unique voice. The mathematics underlying Chladni patterns also helped shed light on the quantum mechanical understanding of electron orbital patterns.", "going_further": "Physicist-musician Ernst Chladni came up with the idea to use sand to reveal the pattern of vibrations on a surface in 1787. Today, some makers of violins, cellos, and similar musical instruments still use Chladni patterns to help them craft the belly and back of each instrument, the shapes of which are crucial to the instrument’s unique voice. The mathematics underlying Chladni patterns also helped shed light on the quantum mechanical understanding of electron orbital patterns.", "details": "", "phenomena": ["Harmonics", "Natural Frequency", "Motion: Periodic Motion", "Nodes and Antinodes", "Patterns", "Resonance", "Techniques to Make the Invisible Visible", "Wave Excitation", "Waves: Standing", "Waves: Transverse"], "keywords": ["sand", "Chladni"]},
{"id": "buckyball", "title": "Buckyball", "aliases": "", "location": "Plaza", "byline": "Artist Leo Villareal , 2016", "collection_id": [], "related_id": ["cubatron-core", "lumen-illusion"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "Inspired by the shape first explored by futurist and inventor Buckminster Fuller Buckyball is a towering 25-foot illuminated sculpture featuring two nested geodesic spheres. Composed of 4,500 LED nodes arranged along a series of pentagons and hexagons, Buckyball is animated by custom software programmed by Villareal to display over 16 million distinct colors. The lights dynamically shift and fade in both sequenced patterns and random order, generating vibrant hues that enliven the Exploratorium’s public space in both daylight and moonlight. The spherical, soccer ball–like form of Buckminster Fuller’s geodesic domes, which informs Villareal’s work, was discovered in a carbon molecule by scientists in 1985. It was coined the “Buckminsterfullerene,” or “Buckyball,” in homage to him, and has since been avidly researched by scientists and material engineers.", "phenomena": [], "keywords": []},
{"id": "christmas-tree-balls", "title": "Christmas Tree Balls", "aliases": "Spherical Reflections", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Artist Robert Larue (Bob) Miller", "collection_id": ["seeing-the-light"], "related_id": ["shadow-kaleidoscope", "corner-reflector", "all-eyes-on-me", "giant-mirror"], "tagline": "There are captivating reflections in a box of ornaments.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Blackness", "Close Packing", "Image Formation", "Light Gathering", "Reflection", "Symmetry"], "keywords": ["mirrors"]},
{"id": "bronze-hand", "title": "Bronze Hand", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Jessica Strick , 2005", "collection_id": ["mind"], "related_id": ["velvet-hands", "tactile-dome", "black-sand"], "tagline": "Can this artificial hand feel like part of your body?", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": ["illusions"]},
{"id": "chaotic-pendulum", "title": "Chaotic Pendulum", "aliases": "", "location": "Ray and Dagmar Dolby Atrium", "byline": "Artist Ned Kahn , 1986", "collection_id": ["turbulent-landscapes"], "related_id": ["pendulum-snake", "drawing-board", "coupled-pendulums", "harmonograms"], "tagline": "When you set these pendulums swinging, the motion of each one affects the others.", "description": "", "whats_going_on": "", "going_further": "", "details": "Chaotic Pendulum contains a deceptively simple set of pendulums in a steel and Plexiglas case. A central, T-shaped bar supports three bearing-mounted bars from its ends. The “T” is itself bearing mounted at the intersection of the upright and the cross arm. The visitor gives an initial twist to the pendulums with a protruding knob. Intuition says that the resulting motion of this system should be, if not simple, at least predictable. Intuition, however, does not work with this device since its motion is chaotic, extremely complicated and long-lived.", "phenomena": ["Conservation of Angular Momentum", "Energy: Conservation of Energy", "Gravitational Forces", "Inertia: Rotational", "Motion: Accelerated Gravitational Motion", "Motion: Accelerated Rotational Motion", "Motion: Pendular Motion", "Nonlinear Behavior", "Oscillation", "Randomness", "Symmetry", "Torque"], "keywords": ["balance", "center of gravity", "chaos", "pendulums"]},
{"id": "braided-stream", "title": "Braided Stream", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Artist Ned Kahn , 1998", "collection_id": [], "related_id": ["when-water-turns-red-it-means-is-salt-forming", "saltscapes", "water-waves-time-horizon"], "tagline": "Air—not water—erupts through fine powder to sculpt these roiling streams.", "description": "", "whats_going_on": "", "going_further": "", "details": "This artwork features air bubbling up through a fine powder constrained between two glass plates tilted at a 45 degree angle. The tilting creates a continually changing landscape evocative of aerial photographs of river drainage networks on Earth and on Mars. As air is pumped into the powder, it carves small streams. After the initial currents of rising air have carved channels in the powder, subsequent streams follow the paths of least resistance, further deepening and elaborating the drainage network.", "phenomena": [], "keywords": ["weather"]},
{"id": "bright-black", "title": "Bright Black", "aliases": "Black Card/White Card", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Ulrika Andersson and Richard O. Brown , 2001", "collection_id": ["seeing"], "related_id": ["gray-step", "disagreeing-about-color", "benhams-disk", "color-of-water"], "tagline": "Can you tell the difference between black and white?", "description": "At this exhibit, find out how subjective brightness can be as you struggle—and fail—to correctly decide whether the squares you see are black or white. ", "whats_going_on": "Your perception of an object’s color is affected by both its lighting and its surroundings. The first card you see in this exhibit is actually black—but it’s brightly lit. When it’s the only card in the light, it may look gray or even white. But as you raise lighter cards, each new card looks white and the previous cards look darker by comparison. Our moon is also a brightly lit dark object—it’s dark gray, but in the spotlight of the Sun, it looks white. This photograph of the moon’s surface shows how dark it really is. Photo courtesy of NASA.gov. (click image to enlarge)   Alan Gilchrist website .", "going_further": "Our moon is also a brightly lit dark object—it’s dark gray, but in the spotlight of the Sun, it looks white. This photograph of the moon’s surface shows how dark it really is. Photo courtesy of NASA.gov. (click image to enlarge)   Alan Gilchrist website .", "details": "", "phenomena": ["Albedo", "Color", "Reflection"], "keywords": ["moon", "simultaneous contrast"]},
{"id": "blood-o-meter", "title": "Blood-o-Meter", "aliases": "Blood Cell Scale", "location": "Gallery 4: Living Systems", "byline": "Chris Cerrito , 2017", "collection_id": ["cells-to-self"], "related_id": ["blood-cells-in-your-eye", "give-heart-cells-a-beat"], "tagline": "How many blood cells do you have?", "description": "", "whats_going_on": "", "going_further": "", "details": "You're body is constantly making new cells. Step on this platform, and find out how many red blood cells, white blood cells, and platelets are in your blood, and how many new blood cells you're body has made.", "phenomena": [], "keywords": []},
{"id": "blood-cells-in-your-eye", "title": "Blood Cells in Your Eye", "aliases": "Corpuscles in the Eye, Blood Vessels in Your Eye", "location": "Gallery 4: Living Systems", "byline": "Exploratorium Founder Frank Oppenheimer , 1973", "collection_id": ["cells-to-self", "seeing", "seeing-the-light"], "related_id": ["floater-theater"], "tagline": "This blue light lets you see microscopic blood cells in your eye.", "description": "", "whats_going_on": "", "going_further": "", "details": " What’s going on?  Peer into the blue light, and you'll see little dots or squiggles made by white blood cells moving through capillaries—the narrowest blood vessels—at the back of your eye. White cells let blue light pass through them, creating the moving dots; red cells block blue light, creating shadows that follow the dots. Blood cells are pushed along by pumping of your heart. So if your heart speeds up, the rhythm of the dots (cells) speeds up too. Although these cells are always there, you ordinarily don’t see them unless you’re gazing at a deep blue sky. White blood cells are barely big enough to move through a capillary, while red cells are smaller. So a traffic jam of red cells forms behind each white cell. That's why you see a bright dot followed by a darker shadow.", "phenomena": [], "keywords": ["eyes"]},
{"id": "black-sand", "title": "Black Sand", "aliases": "Magnetic Sand", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Richard Gagnon , 1977", "collection_id": ["young-kids"], "related_id": ["magnet-plus-electricity-equals-motor", "magnetic-clouds", "circles-of-magnetism", "circuit-workbench"], "tagline": "Get your hands into magnetic sand.", "description": "At this simple but ever-popular exhibit,  black sand from nearby beaches make spiky patterns that reveal the invisible magnetic field between the poles of two giant magnets. ", "whats_going_on": "The black sand at this exhibit is magnetite , a naturally occurring iron oxide mineral found in almost all igneous and metamorphic rocks. The black sand we use at this exhibit comes from nearby Ocean Beach—but it originates in the Sierra Nevada Mountains to the east. There, granite containing iron ore breaks down into tiny grains of black sand that then erode, getting carried by rivers to San Francisco Bay and beyond. Not usually magnetic in and of itself, black sand can and will become magnetized in the presence of another magnet. As each tiny grain of magnetized black sand becomes a (temporary) magnet itself, the magnetic field in that spot gets amplified, and more black sand gets attracted—ultimately creating the porcupine-like spikes that you see here.", "going_further": "", "details": "", "phenomena": ["Electromagnetic Forces", "Ferromagnetism", "Magnetization"], "keywords": ["magnetic field", "sand"]},
{"id": "bird-in-a-cage", "title": "Bird in a Cage", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Exploratorium Founder Frank Oppenheimer and Richard O. Brown , 1975", "collection_id": ["seeing", "seeing-the-light"], "related_id": ["gray-step", "disagreeing-about-color", "colored-shadows", "hoop-nightmares"], "tagline": "When your eyes adapt to color, you can see things that aren’t really there.", "description": "Stare at a bird’s eye for 30 seconds, then look into the empty cage. You’ll see a ghostly bird—of a very different color—inside the cage ", "whats_going_on": "The ghostly colored images you see, called afterimages , are the result of adaptation in the color-sensitive cells in your eyes. There are three types of color-sensitive cone cells in your eyes; each responds to reddish, greenish, or bluish light. When you stare at the red parrot, your red-sensitive cones “get used to” the image and stop responding as strongly. When you suddenly look at a white background, the relatively strong response of your blue and green cones produces an image of a blue-green parrot. Similarly, staring at a blue-green parrot will produce an image of a red parrot. In general, staring at any color will produce an afterimage that is that color’s complement , or opposite.", "going_further": "", "details": "", "phenomena": ["Color", "Color: Complimentary", "Color Separation", "Color Vision", "Fatigue", "Persistence of Vision", "Time Effects in Perception"], "keywords": ["adaptation", "afterimage", "CMY retina"]},
{"id": "bike-rope-squirter", "title": "Bike Rope Squirter", "aliases": "Bicycle Rope Squirter", "location": "Gallery 5: Outdoor Exhibits", "byline": "Shawn Lani , Eric Dimond , and Steve Gennrich , 2013", "collection_id": ["young-kids"], "related_id": ["lariat-chain"], "tagline": "Loops dance along the ground as visitors play an Exploratorium-style game of jump rope.", "description": "", "whats_going_on": "", "going_further": "", "details": "These upside down, bike-powered machines are built to throw ropes twenty feet into the air. Acting a bit like water and a bit like rope, the loops dance along the ground as visitors play an Exploratorium-style game of jump rope.", "phenomena": [], "keywords": []},
{"id": "big-wood-300-years-of-photosynthesis", "title": "Big Wood: 300 Years of Photosynthesis", "aliases": "The Tree Experience", "location": "This exhibit is not currently on view.", "byline": "Artist Michael Brown and Evan Shively, 2013", "collection_id": [], "related_id": [], "tagline": "Explore the complexity and enormity of this grand, once-living organism.", "description": "", "whats_going_on": "", "going_further": "", "details": "Developed by artist Michael Brown in collaboration with reclaimed wood specialist Evan Shively, Big Wood has been created out of a several-hundred-year-old Douglas fir split down the center to reveal its rings, immersing visitors in a fascinating study of dendrochronology. The wood of the tree forms the walls of an intimate, contemplative space with a center bench. The enormous, lacy root structure compels visitors to appreciate the complexity and sheer enormity of this grand, once-living organism.", "phenomena": [], "keywords": []},
{"id": "big-tuning-fork", "title": "Big Tuning Fork", "aliases": "Giant Tuning Fork", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Andrew Forrest", "collection_id": [], "related_id": ["pitch-slider"], "tagline": "Distinct tones combine in the hum of this tuning fork.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Resonance"], "keywords": []},
{"id": "bicycle-wheel-gyro", "title": "Bicycle Wheel Gyro", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Exploratorium Founder Frank Oppenheimer and Tom Tompkins , 1975", "collection_id": ["finding-your-way"], "related_id": ["downhill-race", "turntable", "lariat-chain"], "tagline": "Let this gyroscope take you for a spin.", "description": "Tilt a spinning bicycle wheel while you’re sitting in a swivel chair and—surprise—you’ll start spinning in circles, too. You can also witness the same phenomenon here by hanging a spinning wheel from its axle. ", "whats_going_on": "A spinning wheel has angular momentum, which gives it a natural tendency to keep spinning at the same speed in the same direction. When you tilt the gyroscope, you change its angular momentum. The spinning wheel resists this change, pushing back and causing you to spin in the chair. The natural tendency of spinning objects to resist changes in direction can be useful. Have you ever wondered why bicycles are easy to balance when they’re rolling, but tend to fall over when they’re not? The bicycle wheels are gyroscopes that naturally resist tilting—at least while they’re turning. When a quarterback throws a football, putting a spin on the ball helps keep it pointing forward as it travels through the air. Ships, aircraft, and spacecraft use gyroscopes in navigation equipment to help stay on course. Mounted in a frictionless cage, a gyroscope maintains its orientation no matter how the craft moves. Gyroscopes in the Hubble Space Telescope help aim it by keeping constant track of which way is up.", "going_further": "The natural tendency of spinning objects to resist changes in direction can be useful. Have you ever wondered why bicycles are easy to balance when they’re rolling, but tend to fall over when they’re not? The bicycle wheels are gyroscopes that naturally resist tilting—at least while they’re turning. When a quarterback throws a football, putting a spin on the ball helps keep it pointing forward as it travels through the air. Ships, aircraft, and spacecraft use gyroscopes in navigation equipment to help stay on course. Mounted in a frictionless cage, a gyroscope maintains its orientation no matter how the craft moves. Gyroscopes in the Hubble Space Telescope help aim it by keeping constant track of which way is up.", "details": "", "phenomena": ["Conservation of Angular Momentum", "Frame of Reference", "Gyroscopics", "Inertia: Rotational", "Precession"], "keywords": ["spinning"]},
{"id": "big-chair-little-chair", "title": "Big Chair, Little Chair", "aliases": "Big/Little Chair, Big Chair/Little Chair, Giant Chair", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Juanita Miller, Claire Pillsbury , and David Robb, 1996", "collection_id": ["a-question-of-size"], "related_id": ["distorted-room", "hoop-nightmares", "bright-black", "a-drop-to-drink"], "tagline": "What happens when you double the size of a chair?", "description": "Each of the chairs in this series has dimensions that are twice that of the smaller chair. But doubling the dimension of a chair doesn’t double its strength. ", "whats_going_on": "The dimensions of the biggest chair are twice that of the regular chair. Meanwhile, the little chair has dimensions that are half those of a normal chair. But doubling the linear dimensions of a chair doesn’t mean that everything about the chair is doubled. For example, the area of the seat of a double-dimension chair is four times larger, as is the cross-sectional area of each of the legs—which is what gives a chair it’s weight-bearing strength. Meanwhile, the weight of the chair depends on volume, a three-dimensional property. So the weight of a double-dimension chair isn’t twice that of a normal chair. It’s 2 x 2 x 2 or 8 times greater. If you look closely, you may notice a crisscross pattern of wire underneath the largest chair. Doubling the dimensions of a normal chair to get the largest chair means increasing its weight by a factor of eight . This chair is so heavy that the added wires are necessary to keep it from collapsing—visible proof of the impact of “scaling up.” This exhibit helps explain why ants don’t grow to be giant sized, as in horror sci-films. Scaled up to colossal proportions, a giant ant would have legs too skinny to support itself. There’d be no need to squash it—it would collapse under its own weight.", "going_further": "If you look closely, you may notice a crisscross pattern of wire underneath the largest chair. Doubling the dimensions of a normal chair to get the largest chair means increasing its weight by a factor of eight . This chair is so heavy that the added wires are necessary to keep it from collapsing—visible proof of the impact of “scaling up.” This exhibit helps explain why ants don’t grow to be giant sized, as in horror sci-films. Scaled up to colossal proportions, a giant ant would have legs too skinny to support itself. There’d be no need to squash it—it would collapse under its own weight.", "details": "", "phenomena": ["Perception: Spatial"], "keywords": ["perspective", "proportion", "ratio"]},
{"id": "balancing-ball", "title": "Balancing Ball", "aliases": "Beach Ball Blower, Bernoulli Blower", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Exploratorium Founder Frank Oppenheimer and Charles Glorioso , 1970", "collection_id": ["young-kids"], "related_id": ["fluttering"], "tagline": "Suspend a ball in a stream of air.", "description": "Levitating on an invisible stream of air, a beach ball seems to defy gravity. If you try to pull the ball out, you can feel a force pulling it back in—the same force that keeps an airplane in flight. ", "whats_going_on": "When the ball is suspended in the air stream, the air flowing upward hits the bottom of the ball and slows down, generating a region of higher pressure. The high-pressure region of air under the ball holds the ball up against the pull of gravity.  When you pull the ball partially out of the air stream, air curves around the ball and flows outward. This outward-flowing air exerts an inward force on the ball, in keeping with Newton’s Third Law : For every action, there is an equal and opposite reaction. Similarly, the downward flow of air beneath a helicopter exerts an upward force on the blades of the helicopter. You can also explain the ball’s behavior in terms of Bernoulli’s principle : When the speed of a fluid increases, the pressure in that fluid decreases. As you pull the ball out of the air stream, air flows faster over only one side of the ball. The difference in pressure between the still air and the moving air pushes the ball back into the center of the air stream. Airplanes, too, fly by deflecting air. A flat wing tipped into the wind forces air downward. The reaction to the downward force of the wing on the air is the upward force of the air on the wing. You can feel this lifting force if you hold your hand out the window of a moving car and tip your hand so that it forces the air downward. A wing that’s curved on top will fly even if it isn’t tipped, thanks to what’s called the Coand ă effect , the tendency of a fluid stream to adhere to a surface it passes over.  Air passing over the curved wing top “sticks” and follows the arc of the wing, ultimately getting deflected downward. This downward deflection of air produces an upward force on the wing. The Coandă effect also makes possible the curve balls of baseball and the banana kicks of soccer.", "going_further": "Airplanes, too, fly by deflecting air. A flat wing tipped into the wind forces air downward. The reaction to the downward force of the wing on the air is the upward force of the air on the wing. You can feel this lifting force if you hold your hand out the window of a moving car and tip your hand so that it forces the air downward. A wing that’s curved on top will fly even if it isn’t tipped, thanks to what’s called the Coand ă effect , the tendency of a fluid stream to adhere to a surface it passes over.  Air passing over the curved wing top “sticks” and follows the arc of the wing, ultimately getting deflected downward. This downward deflection of air produces an upward force on the wing. The Coandă effect also makes possible the curve balls of baseball and the banana kicks of soccer.", "details": "", "phenomena": ["Bernoulli Effect", "Coandă  Effect", "Fluid Mechanics", "Gas Flow"], "keywords": ["balance", "equilibrium", "gases", "levitation", "Newton's Laws"]},
{"id": "bay-bridge-model", "title": "Bay Bridge Model", "aliases": "", "location": "Koret Foundation Bay Walk", "byline": "Dave Fleming , 2013", "collection_id": [], "related_id": ["golden-gate-bridge"], "tagline": "Every bridge has built in rhythms.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "bay-lexicon", "title": "Bay Lexicon", "aliases": "Bay Lexicon Columns, Land/Water", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Jane Wolff , 2013", "collection_id": [], "related_id": ["the-atmosphere-a-guide"], "tagline": "Jane Wolff's writings guide visitors on a walk along San Francisco's waterfront.", "description": "", "whats_going_on": "", "going_further": "", "details": " Bay Lexicon, a visual dictionary made up of illustrated flash cards, defines a working vocabulary for observing, exploring, and coming to terms with the complicated environment of San Francisco Bay. Its premise is that language is the first tool for perception: we cannot recognize what we cannot name. The project includes forty-eight flash cards that describe San Francisco’s boundary with the bay and ask questions about the scenes they depict. Twenty-four of the cards deal with the landscape that is visible from the Fisher Bay Observatory’s windows and the other twenty-four describe places and phenomena along the shoreline between Fort Point and Hunters Point. Every card is an invitation to look closely at the landscape and to wonder about its meanings. The cards’ display cart serves as an orientation device. It includes a map of San Francisco’s dynamic shoreline and drawings of the views from the gallery so that viewers can identify the flash cards’ locations in the landscape. Designed to move around the gallery and into the city, the project will serve as a field guide for tours of the Observatory and the shoreline beyond.", "phenomena": ["Modeling Landscapes"], "keywords": []},
{"id": "bay-windows", "title": "Bay Windows", "aliases": "", "location": "Koret Foundation Bay Walk", "byline": "Andrew Forrest , 2013", "collection_id": [], "related_id": ["settling-column", "glass-settling-plate", "bay-sediment-cores"], "tagline": "Compare how gravel, sand, and fine silt settle out of swirling waters.", "description": "", "whats_going_on": "", "going_further": "", "details": "Five clear, rotating disks provide beautiful windows into the motion of sediments in the Bay. Spin them to compare the behavior of gravel, sand, and fine silt—how the currents carry them and how they settle out of the swirling waters.", "phenomena": ["Turbulent Flow", "Upwelling"], "keywords": []},
{"id": "bacteriopolis", "title": "Bacteriopolis", "aliases": "Bacteria Wall, Bacteriopolis Wall, Living Colors, Winogradsky Column", "location": "Gallery 4: Living Systems", "byline": "Denise King , Charles Carlson , and Sitara Cave , 2002", "collection_id": ["traits-of-life"], "related_id": ["glass-settling-plate", "plankton-populations"], "tagline": "This colorful wall is a living terrarium.", "description": "Thousands of distinct species live and breathe (or not) in this colorful bacterial terrarium. Look for green cyanobacteria, orange iron oxidizers, and gray cellulose eaters. What you see today will be gone tomorrow in this living artwork in a perpetual state of change.​ ", "whats_going_on": "To make this colorful culture, we mixed bucket loads of mud from a pond in Golden Gate Park together with eggs and toilet paper. Yum. The ultimate low-maintenance exhibit, it can live and thrive indefinitely, requiring only sunlight and the occasional addition of water. The different colors you see here come from different types of bacteria: Blue-green cyanobacteria absorb carbon dioxide (CO 2 ) and produce oxygen in much the same way that plants do. The orange-colored bacteria are iron oxidizers; they get their energy from the chemical decomposition of iron into rust. The grayish bacteria get their energy not from light, but by consuming cellulose, or plant fibers. This exhibit is a giant version of a Winogradsky column , named after Ukrainian biologist Sergei Winogradsky. You can make your own by putting pond mud, newspaper, eggs, and water in a blender.  CYANOBACTERIA Like plants, cyanobacteria absorb carbon dioxide (C0 2 ) and produce oxygen. Unlike plants, they absorb light with a blue-green pigment, called phycocyanin.   IRON OXIDIZERS These orange bacteria live somewhat lower down, where there's less oxygen.  ANAEROBIC PHOTOSYNTHESIZERS  Anaerobic means these bacteria live where there's no oxygen. Photosynthesizers means they get energy from light.  CELLULOSE DEGRADERS AND SULPHUR REDUCERS These gray bacteria do not harvest light, but instead get energy by consuming cellulose, or plant fibers.  Zoomable High-Resolution Image of Bacteriopolis . © GigaMicro. Charkoudian, L. K., Fitzgerald, J. T., Khosia, C, and Champlin, A. 2010. “ In Living Color: Bacterial Pigments as an Untapped Resource in the Classroom and Beyond .” © PLOS.", "going_further": "This exhibit is a giant version of a Winogradsky column , named after Ukrainian biologist Sergei Winogradsky. You can make your own by putting pond mud, newspaper, eggs, and water in a blender.  CYANOBACTERIA Like plants, cyanobacteria absorb carbon dioxide (C0 2 ) and produce oxygen. Unlike plants, they absorb light with a blue-green pigment, called phycocyanin.   IRON OXIDIZERS These orange bacteria live somewhat lower down, where there's less oxygen.  ANAEROBIC PHOTOSYNTHESIZERS  Anaerobic means these bacteria live where there's no oxygen. Photosynthesizers means they get energy from light.  CELLULOSE DEGRADERS AND SULPHUR REDUCERS These gray bacteria do not harvest light, but instead get energy by consuming cellulose, or plant fibers.  Zoomable High-Resolution Image of Bacteriopolis . © GigaMicro. Charkoudian, L. K., Fitzgerald, J. T., Khosia, C, and Champlin, A. 2010. “ In Living Color: Bacterial Pigments as an Untapped Resource in the Classroom and Beyond .” © PLOS.", "details": "", "phenomena": ["Color", "Decomposition", "Photosynthesis"], "keywords": ["unicellular organisms"]},
{"id": "aurora", "title": "Aurora", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Artist Robert Larue (Bob) Miller , 1977", "collection_id": ["colorfest", "seeing", "young-kids"], "related_id": ["colored-shadows", "sun-painting", "spectral-meadow", "soap-film-painting"], "tagline": "A reflector stretches light from colored tiles into long bright ribbons.", "description": "", "whats_going_on": "", "going_further": "", "details": " Aurora shows how reflections are created both by the shape of the light and the shape of the reflector. The reflector is a large curved sheet of brushed stainless steel. The tiny ridges in the steel act like tiny mirrors, each reflecting an image. When the images from all the ridges add up, they blend into a single, elongated image that looks like a ribbon of light. The many colored tiles with the exhibit let you experiment with both the shape and color of the reflections.", "phenomena": ["Color", "Color: Complimentary", "Color Mixing", "Parallax", "Reflection", "Scattering"], "keywords": []},
{"id": "as-one", "title": "As One", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist Amery Kessler, 2015", "collection_id": ["science-of-sharing"], "related_id": ["collaborative-shapes", "text-fish", "team-snake", "survival-game"], "tagline": "How closely can you and a partner mirror your movements?", "description": "", "whats_going_on": "", "going_further": "", "details": "The Exploratorium commissioned Ohio artist Amery Kessler to create an interactive work for the Science of Sharing exhibition. As with many Exploratorium exhibits, Amery developed As One through a process of iterative prototyping—creating an initial mockup, observing and talking to visitors as they experimented with it, then refining the concept to produce the final exhibit.  Science of Sharing was designed to give visitors opportunities to experiment with social phenomena like cooperation, negotiation, intergroup conflict, and collaborative problem solving.  As One invites two participants to partner, and take turns in the roles of leader or follower as they mirror one another’s movements. Amery's work explores similar social territory, and adds a new dimension to the exhibit collection. The experience draws its power from the unspoken communication and sense of shared purpose it prompts as users bring their movements and thoughts into alignment. Reflecting upon the work, Kessler remarks, \"Whether you are sitting across from a familiar face or a stranger, connecting on these simple terms can reveal the subtle elements of relating in the moment.”", "phenomena": [], "keywords": []},
{"id": "are-your-cells-you", "title": "Are Your Cells You?", "aliases": "HeLa Cells", "location": "Gallery 4: Living Systems", "byline": "Jennifer Berry, Angela Armendariz , and Kevin Boyd , 2017", "collection_id": ["cells-to-self"], "related_id": ["give-heart-cells-a-beat", "look-inside-developing-fish", "live-chicken-embryos"], "tagline": "Explore ethical and philosophical questions about the first \"immortal\" cell line.", "description": "", "whats_going_on": "", "going_further": "", "details": "As visitors examine a microscope view of living HeLa cells—the first “immortal” cell line—they explore ethical and philosophical questions about these historic and controversial cells. HeLa cells can divide indefinitely, and helped revolutionize biomedical research. However, they also were taken by medical researchers without permission from Henrietta Lacks, an African American woman in the 1950s. Are HeLa cells merely cells, or are they part of the self of Henrietta Lacks? Website about the book: The Immortal Life of Henrietta Lacks by Rebecca Skloot.  Press release: “NIH, Lacks Family Reach Understanding to Share Genomic Data of HeLa Cells.” National Institutes of Health, 2013 Article: “The Good, The Bad, and The HeLa,” by Alexandra del Carpio, Berkeley Science Review, 2014", "phenomena": [], "keywords": []},
{"id": "archimedes", "title": "Archimedes", "aliases": "", "location": "Plaza", "byline": "Artist Douglas Hollis , 2017", "collection_id": ["over-the-water"], "related_id": ["listening-vessels", "giant-mirror", "all-eyes-on-me"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": " Archimedes is a reimagined, thirtieth anniversary edition of Listening Vessels, a beloved and iconic Exploratorium exhibit. Douglas Hollis originally created Listening Vessels for the Berkeley Art Museum Matrix program in 1987 and gifted the work to the Exploratorium soon after. Made of cast bronze and installed on the Exploratorium’s Plaza, Archimedes is comprised of two 8-foot diameter dish-like chairs placed 80 feet apart. Each dish’s parabolic curve collects and focuses sound waves and reflects them to participants seated within them. When both dishes are occupied, even whispers uttered from one dish can be clearly heard by the surprised listener seated in the opposite dish. Ambient sounds become intensified when one experiences a dish solo. The artwork’s name pays homage to Greek scientist and inventor Archimedes who is described as having designed parabolic reflectors, an array of highly polished bronze or copper shields to burn enemy Roman ships during the Siege of Syracuse ( c. 214–212 BC). While Hollis’ Archimedes could theoretically be used to focus both light and sound, the interior is textured to avoid focusing light that could result in fire. ", "phenomena": ["Parabolic Arc", "Reflection"], "keywords": ["amplification", "focal point", "parabolas"]},
{"id": "animation-station", "title": "Animation Station", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Sebastian Martin , Creative Machines, and Joe O'Connell, 2012", "collection_id": [], "related_id": ["animation-tower", "robot-dance", "flourish-bloom", "magic-wand"], "tagline": "A stop-motion animation is made of many pictures, each slightly different from the last.", "description": "", "whats_going_on": "", "going_further": "", "details": "See the latest animations made by our visitors.", "phenomena": [], "keywords": []},
{"id": "anti-gravity-mirror", "title": "Anti-Gravity Mirror", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist Robert Larue (Bob) Miller , 1979", "collection_id": ["seeing-the-light"], "related_id": ["giant-mirror", "all-eyes-on-me", "corner-reflector", "cylindrical-mirror"], "tagline": "Take off and fly in a mirror that makes half your body look whole.", "description": "Here’s an exhibit where watching is at least half the fun. Positioned at one end of this large flat mirror, you can create any number of gravity-defying illusions that will amaze you and your friends: Levitate, fly, swim though the air, grow limbs (and dissolve them), crawl straight up the wall like a lizard—the sky’s the limit. ", "whats_going_on": "Standing with the edge of this large mirror bisecting your body, you appear whole to a person who’s observing from the front. To the observer, the mirror image of the visible half of your body looks exactly like the real half that is obscured behind the mirror. You look whole because the human body is symmetrical. The observer’s brain is tricked into believing that an image of your right side is really your left side. So just straddle the mirror, raise one leg, and you’re flying. You can try this out anywhere where there’s a good-sized mirror that you can straddle or stand alongside—at home, in a department store, or in a dance studio with a doorway cut into a mirrored wall.  \"Reflections on Anti-Gravity Mirror \" (pdf) by artist Bob Miller   The illusion of flight you see at this exhibit was used to create a low-tech, precomputer graphics special effect in the original Star Wars movie. The anti-gravity Landspeeders that floated across the desert landscape of Tatooine actually had wheels, but these were hidden by a full-length mirror attached along the vehicles’ lower edge. A camera filming a rolling Landspeeder saw a view of reflected sand and shadow in the mirror instead of wheels—so the car appeared to float above the sand.", "going_further": "The illusion of flight you see at this exhibit was used to create a low-tech, precomputer graphics special effect in the original Star Wars movie. The anti-gravity Landspeeders that floated across the desert landscape of Tatooine actually had wheels, but these were hidden by a full-length mirror attached along the vehicles’ lower edge. A camera filming a rolling Landspeeder saw a view of reflected sand and shadow in the mirror instead of wheels—so the car appeared to float above the sand.", "details": "", "phenomena": ["Image Formation", "Reflection", "Symmetry"], "keywords": ["mirrors"]},
{"id": "animation-tower", "title": "Animation Tower", "aliases": "Praxinoscope Tower", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown and Jessica Strick , 2012", "collection_id": [], "related_id": ["robot-dance", "animation-station", "magic-wand", "flourish-bloom"], "tagline": "Quick-changing views create the illusion of motion.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "anamorphic-bench", "title": "Anamorphic Bench", "aliases": "Disorted Bench", "location": "Plaza", "byline": "", "collection_id": ["geometry-playground"], "related_id": ["anti-gravity-mirror", "giant-mirror", "cylindrical-mirror", "all-eyes-on-me"], "tagline": "A cylindrical mirror and a circular bench make for visual fun.", "description": "", "whats_going_on": "", "going_further": "", "details": "A cylindrical mirror turns a curved bench into something that looks quite different, taking a Renaissance-era illusion into the third dimension. The installation encourages playful interactions among users, bringing people together both visually and socially as they explore the unexpected effects.", "phenomena": [], "keywords": []},
{"id": "all-flowers-me", "title": "All the Flowers Are for Me (Turquoise)", "aliases": "", "location": "Osher Gallery 1, Black Box", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文  Filipino    Who are the flowers for?  The ethereal lacy shadows that cover every surface are for everyone who enters the Black Box. The artist aims to create a space where visitors of all genders, races, nationalities, and religions feel welcome, and to offer an opportunity to explore our similarities and differences. Islamic textiles, architecture, and floral motifs inspired the patterns Agha produced using light and shadow. A single beacon of light glows from within a suspended steel cube, producing immersive patterns that ripple and change as visitors move through the space.   All the Flowers Are for Me (Turquoise) appears in the Exploratorium’s Black Box , a gallery space dedicated to an ongoing series of media art installations.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.  Photo: Drew Baron. Courtesy of The Columbia Museum of Art. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "museum-of-the-moon", "title": "Museum of the Moon", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文 Filipino      What do you think of when you gaze up at the moon? Moon cakes? Lunar landers? High tides? Earth’s protector? Every culture has found scientific and artistic inspiration in Earth’s glowing satellite. Our moon acts as a cultural mirror, reflecting not just the Sun’s light, but the stories and beliefs of people around the world.  Luke Jerram’s Museum of the Moon (2016) was inspired by the huge tidal range in the artist’s home city of Bristol, England. The artwork is printed from 120 dpi NASA imagery that shows every cliff and crater at an approximate scale of 1:700,000; one centimeter represents about 7 kilometers (one inch equals about 11 miles) of the lunar surface.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.   Photo: © Exploratorium Archives  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "entangled-attraction", "title": "Entangled Attraction", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文 Filipino      In the darkened Wattis Studio, visitors gaze up at an array of 300 spiraling lights.  When viewed from a distance, each pinpoint of light seems to be in orbit around another, evocative of galaxies rotating and twisting as they sweep through space. But when viewed from below, the lights fill our field of vision and transform into unpredictable 3-D patterns dancing overhead.  Our eyes see the light from each LED as a spiraling pattern because our visual system “remembers” the light’s image for up to a tenth of a second. This surprising effect is called persistence of vision. You may also see traces of color around each orbit.  A score by Jonathan Crawford accompanies Entangled Attraction.   On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.  Photo: Courtesy of Sally Weber and Craig Newswanger ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "enchanted-tree", "title": "The Enchanted Tree", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文  Filipino      If you visited the Exploratorium in the 1970s or 1980s, you might remember this tree lighting up—mysteriously, delightfully—at the sound of clapping. “This tree was created by Burt Libe as a fantastic approach to the new field of electronic art,” the artist wrote.  A feat of engineering in 1971, this beloved work is now over 50 years old. Though The Enchanted Tree no longer functions fully, it’s still a wonderful expression of one tinkerer’s skill and vision. You can tap a pedal to light up the tree and its circuits. The circuit board is hand-built, unique in design, and too fragile to disassemble; its exact logic remains a mystery.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.   Photo: The Enchanted Tree at the Palace of Fine Arts in 1976. Photo © Exploratorium Archives.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "ames-chairs", "title": "Ames Chairs", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Claire Pillsbury and Adelbert Ames II", "collection_id": ["seeing"], "related_id": ["distorted-room", "big-chair-little-chair", "perspective-drawing-window"], "tagline": "What we see can depend on what we expect to see.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Size-Distance", "Binocular Vision"], "keywords": []},
{"id": "spacetime", "title": "Spacetime", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": ["becoming-horizon"], "tagline": "", "description": "Take a quiet journey into the infinite expanses of space and time. Inside a cube of two-way mirrors, Nick Dong’s light sculpture reflects and expands chaotically as it turns. Keep observing—for a brief moment, the chaos resolves to reveal an orderly, exact, and infinite vision. Then the cycle begins again.  “Lost in space, lost in time, found in Spacetime, ” Dong writes. He invites you to “bring your own chaos” to your observation of Spacetime (2021), an artwork that is incomplete without you.   Photo courtesy of the artist.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "neon-works", "title": "The Art of Neon", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": "The seductive glow of neon once ruled skylines and storefronts around the world. Neon signs became synonymous with the late-night energy of city living.  Although neon’s popularity has dimmed, artists such as Ames Palms keep its handmade beauty alive. Palms fell in love with neon in art school, where they learned the delicate craft of bending glass tubes into sculptures and signs.   Photo courtesy of the artist.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "galaxy01", "title": "GALAXY03", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": "Gaze up into this LED galaxy and share a moment of discovery with those around you. GALAXY03 (2021) is a site-specific sculpture that visualizes waves of light energy passing through the people below.  “I make site-specific, interactive light installations to connect people,” CHiKA writes. “My inspiration comes from living in opposite worlds—East and West, non-physical and physical, invisible and visible, latest technology and minimalism—and amidst Japanese philosophy, Zen, Taoism, visual content, light design, and experimental sound.”  On view in Glow: Discover the Art of Light , November 18, 2021–January 30, 2022.   Image courtesy of the artist.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "all-the-light", "title": "All the Light You See (Infinity)", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": "When you look at the stars—or Alicia Eggert's mirrored neon sculpture—how far back in time can you see? The speed of light is fast (about 186,000 miles per second), but even light takes time to travel. By the time the light reaches your eyes, what you see is in the past.  Moonlight bounced off the lunar surface about 1.3 seconds ago. Sunlight travels about 8 minutes 20 seconds to warm your skin. The farther out in space we look, the further back in time we see. In the case of starlight, we’re seeing stars as they were—years, centuries, thousands, even millions of years ago.   Photo courtesy of the artist.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "peacemaker", "title": "Peacemaker", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": "Hold hands with friends or strangers to create human circuits between poles arranged in the shape of a skewed peace sign.  Ekene Ijeoma’s interactive installation invites you to connect physically and energetically with others. Ijeoma uses a human phenomenon—your body is around 60% salty water, making it a conductor of electricity—to illuminate Peacemaker (2021) and activate networks of care.   Peacemaker appears in the Exploratorium's Black Box , a gallery space dedicated to an ongoing series of media art installations.  On view through Sunday, February 27, 2022.   ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "becoming-horizon", "title": "Becoming Horizon", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "", "collection_id": [], "related_id": ["spacetime"], "tagline": "", "description": "Immerse yourself in this shared space of meditative light play. Can you envision water (ever changing) becoming the horizon (ever constant)? Or perhaps you can imagine the ethereal events of the Big Bang—the universe’s origin as a hot, dense point; the explosion and rapid expansion of space; and finally, matter coalescing into galaxies.   Becoming Horizon (2021) fills the senses with motion, music, and dancing light for a meditative experience that is joyful and calm. This hand-crafted artwork incorporates over 100,000 handsewn mirror tiles.  On view in Glow: Discover the Art of Light , November 18, 2021–January 30, 2022.   Nick Dong's Becoming Horizon at USC Pacific Asia Museum. Photo courtesy of the artist.  ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "glass-settling-plate", "title": "Glass Settling Plate", "aliases": "Big Magnifier, Creatures from the Sea Settling Plate", "location": "Gallery 4: Living Systems", "byline": "Denise King , 2012", "collection_id": [], "related_id": ["bacteriopolis", "bay-windows", "plankton-populations", "tidal-flow"], "tagline": "Explore the variety of organisms that live on our piers in the Bay.", "description": "Almost any hard object submerged in San Francisco Bay—from pier pilings to the sides of sailboats—quickly becomes a habitat for an ever-changing community of living things. Here you can use a joystick-driven microscope to take a tour of the wonderland of living creatures that have settled on a glass plate that has spent some time submerged in the Bay. ", "whats_going_on": "Drifting in San Francisco Bay are millions of tiny larvae. Each one needs a hard surface where it can settle and grow. The organisms you can see at this exhibit all grew on our “settling plates” after just a few weeks. What you might find on the settling plate on any particular day at this exhibit is anyone’s guess. Skeleton shrimp with eerie red eyes, barnacles grabbing for prey, the occasional polka-dotted nudibranch—it’s an exciting world in the briny Bay beneath the museum. And the cast of characters changes with the seasons.  Zoomable High-Resolution Image of the top of a Glass Settling Plate . © GigaMicro.  Zoomable High-Resolution Image of the bottom of a Glass Settling Plate . © GigaMicro.", "going_further": "", "details": "", "phenomena": [], "keywords": ["habitat", "organisms"]},
{"id": "giant-mirror", "title": "Giant Mirror", "aliases": "Giant Spherical Mirror", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Loan from Smithsonian Institution, 2009", "collection_id": ["reflections", "young-kids"], "related_id": ["all-eyes-on-me", "listening-vessels", "anti-gravity-mirror", "cylindrical-mirror"], "tagline": "Pause to reflect in an oversized mirror with endless possibilities.", "description": "This giant mirror was originally part of a flight simulator. Its size and near-perfect smoothness makes for astonishing optical (and acoustic) effects. ", "whats_going_on": "This jaw-dropping spherical mirror was loaned to us by friends at the Smithsonian Institution. Designed to be part of a flight simulator, a small flaw (you can look, but you won’t find it) made it unusable for its intended purpose. And boy, are we glad, because this is probably our single most popular exhibit. Is it narcissism—or love of optics? This mirror’s concave spherical shape focuses incoming light to a point—called the focal point —about 1.5 meters (5 feet) from its surface. Depending on where you stand relative to this focal point, you can give yourself a high five, watch a friend’s head shrink and explode, or enjoy a super-sharp view of distant objects. Walk slowly toward the mirror from beyond the focal point and you’ll see your own head seem to explode just as you pass through it. As astounding as this mirror appears in person, the optical tricks it plays are not fundamentally different from those you can see in other concave spherical reflectors, such as a magnifying makeup mirror or even just the hollow side of a metal spoon. The main difference is its spectacular size—and a near-perfect smoothness that makes for exceptional clarity. Can you come up with any new tricks? Let us know.  Like all concave mirrors, the Giant Mirror focuses incoming light (and sound) to a single point, called the focal point. (click image to enlarge)", "going_further": "", "details": "", "phenomena": ["Image Formation", "Images: Real", "Parabolic Mirrors", "Reflection"], "keywords": ["mirrors", "parabolas"]},
{"id": "freeloader", "title": "Freeloader", "aliases": "Washer Game, Button Game", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Chris Cerrito and Doug Thistlewolf , 2014", "collection_id": ["science-of-sharing"], "related_id": ["survival-game", "team-snake", "text-fish", "sip-or-squirt"], "tagline": "Your dilemma: Play for yourself—or for the group?", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Judgment", "Mental Activity", "Resource Sharing", "Social Dilemma"], "keywords": []},
{"id": "fog-bridge-72494", "title": "Fog Bridge #72494", "aliases": "Fog Bridge", "location": "Plaza", "byline": "Artist Fujiko Nakaya , 2013", "collection_id": ["over-the-water"], "related_id": ["icy-bodies", "vortex", "tornado", "cloud-rings"], "tagline": "Lose yourself in a sudden, swirling mass of fog.", "description": "In a city notorious for fog, this immense artwork by Fujiko Nakaya intermittently shrouds a pedestrian bridge spanning Piers 15 and 17 with clouds of mist, enveloping all in its gauzy embrace. ", "whats_going_on": "Debuted at the Exploratorium’s reopening in April 2013, Nakaya’s fog installation stretches across the 150-foot-long pedestrian bridge that spans the water between Piers 15 and 17. Water pumped at high pressure through more than 800 nozzles lining the bridge creates an immersive environment that shrouds all in its midst in mist. To help conserve water, Fog Bridge was temporarily deactivated in 2014 in response to California's multi-year drought. After being reconfigured to run on desalinated water from the Bay, it now once again bathes the bridge in periodic fog. Although Nakaya’s fog environments have been presented around the world, this is her first project in the San Francisco Bay Area, a region famous for its dramatic fog. San Francisco owes its fog largely to the California Current , a cold, southward-moving coastal current in the Pacific Ocean. Incoming air cools as it passes over this cold water, causing moisture in the air to condense into fog droplets.", "going_further": "Although Nakaya’s fog environments have been presented around the world, this is her first project in the San Francisco Bay Area, a region famous for its dramatic fog. San Francisco owes its fog largely to the California Current , a cold, southward-moving coastal current in the Pacific Ocean. Incoming air cools as it passes over this cold water, causing moisture in the air to condense into fog droplets.", "details": "", "phenomena": ["Evaporation", "Change of State", "Scattering"], "keywords": ["fog", "weather", "evaporation"]},
{"id": "give-heart-cells-a-beat", "title": "Give Heart Cells a Beat", "aliases": "Cardiac Myocytes, Visitor Pulse, Responsive Heart Cells", "location": "Gallery 4: Living Systems", "byline": "Chris Cerrito , 2018", "collection_id": ["cells-to-self"], "related_id": ["are-your-cells-you", "look-inside-developing-fish", "live-chicken-embryos", "microscope-imaging-station"], "tagline": "Use your heart rate to drive the beating of human heart cells.", "description": "", "whats_going_on": "", "going_further": "", "details": "See live, beating human heart cells, and use your pulse to control their beating. Grab hold of the heart rate sensor and watch as the heart cells on the screen adjust their rhythmic contractions to match your heart beat. If you do a few jumping jacks, you can give those heart cells a workout!   This exhibit is part of the Cells to Self  collection, which is expected to open in 2019. ", "phenomena": [], "keywords": []},
{"id": "gas-model", "title": "Gas Model", "aliases": "Small Monatomic Molecules", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Tom Tompkins and Frank Oppenheimer , 1979", "collection_id": [], "related_id": [], "tagline": "These bouncing balls act like molecules in a gas.", "description": "", "whats_going_on": "", "going_further": "", "details": "Gas Model is a transparent plastic cylinder with bouncing balls activated by a vibrating plate. The moving balls lift a disk to a height which depends on the amount of energy introduced by the vibrating plate. This exhibit demonstrates the properties of molecules of a gas. The bouncing balls represent molecules of a warm gas. When a gas is heated, energy is added. This energy can raise the temperature of the gas by increasing the motion of the molecules. The effect is seen when boiling a lidded pot of water—it's the energy in the heated gas (water vapor and air) at the top of the pot that can lift up the pot lid. On the other hand, if the temperature of a substance is lowered to absolute zero, the molecules will stop moving.", "phenomena": [], "keywords": []},
{"id": "fluttering", "title": "Fluttering", "aliases": "Fluttering Silk", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Ned Kahn , 1994", "collection_id": ["turbulent-landscapes"], "related_id": ["circling-wave-umbrella", "balancing-ball"], "tagline": "A piece of fabric undulates in complex ways.", "description": "", "whats_going_on": "", "going_further": "", "details": "A constant stream of air forces a lightweight piece of free-flowing fabric up into the air. The normally invisible air current is suddenly transformed into a colorful visualization of the complexity of the air stream.", "phenomena": ["Modeling Landscapes", "Damping", "Fluid Mechanics", "Motion: Visual Motion Detection", "Nonlinear Behavior", "Patterns", "Resonance", "Techniques to Make the Invisible Visible", "Wave Excitation", "Wind"], "keywords": ["complexity"]},
{"id": "flock", "title": "Flock", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Jill Fantauzza , 2016", "collection_id": ["core-experience:-math"], "related_id": [], "tagline": "Experiment with a mathematical model of birds in flight", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Patterns", "Feedback"], "keywords": []},
{"id": "fluorescent-tube", "title": "Fluorescent Tube", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Joshua Myers", "collection_id": [], "related_id": ["newtons-prism", "distilled-light", "monochromatic-room", "spectral-meadow"], "tagline": "Powder inside a fluorescent tube makes invisible light visible.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Atoms and Particles", "Color", "Electric Current", "Electromagnetic Radiation Spectrum", "Fluorescence", "Light Production", "Techniques to Make the Invisible Visible", "Wave Excitation", "Absorption: Light"], "keywords": []},
{"id": "everyone-is-you-and-me", "title": "Everyone Is You and Me", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Robert Larue (Bob) Miller and Sally Duensing , 1976", "collection_id": ["boundaries", "reflections", "seeing-the-light"], "related_id": ["all-eyes-on-me", "bright-black", "colored-shadows", "sun-painting"], "tagline": "Blend your face with a friend’s.", "description": "By adjusting the light levels on either side of this half-silvered glass, you and a friend can merge your faces into a single composite face. ", "whats_going_on": "Coated with a thin layer of aluminum, this special glass works like both a mirror and a window. It reflects some light, and lets some light pass through. When your side is brighter, it’s easier to see your own reflection. When your friend’s side is brighter, you see more of their face. Sometimes called two-way mirrors , glass windows of this type allow viewers on the more dimly lit side to observe people on the other side without detection. They’re used in market research and psychology studies, interrogation rooms, for security observation, and also in the filming of reality TV shows.", "going_further": "Sometimes called two-way mirrors , glass windows of this type allow viewers on the more dimly lit side to observe people on the other side without detection. They’re used in market research and psychology studies, interrogation rooms, for security observation, and also in the filming of reality TV shows.", "details": "", "phenomena": ["Cues: Amibiguous", "Image Formation", "Reflection", "Visual Edge Effects"], "keywords": ["mirrors"]},
{"id": "flourish-bloom", "title": "Flourish (Bloom)", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist John Edmark , 2014", "collection_id": ["core-experience:-math"], "related_id": ["animation-tower", "animation-station", "robot-dance", "geometron"], "tagline": "Edmark’s 3-D printed sculptures, called blooms, animate when spun under a strobe light.", "description": "", "whats_going_on": "", "going_further": "", "details": " John Edmark’s 3-D printed sculptures, called blooms, are designed to animate when spun under a strobe light. The bloom’s animation effect is achieved by progressive rotations of the golden ratio, phi ( ϕ ) , the same ratio that nature employs to generate the spiral patterns we see in pinecones and sunflowers. If you count the number of spirals on any part of the sculpture you will find that they correlate with Fibonacci numbers. The rotational speed and strobe rate of the bloom are synchronized so that one flash occurs every time the bloom turns 137.5º, the golden angle (the angular version of phi ). Each bloom’s particular form and behavior is determined by a unique parametric seed that Edmark calls a phi-nome (/ f ī  n ō m /) .", "phenomena": ["Apparent Motion", "Frequency", "Motion: Rotational Motion", "Number Series", "Patterns", "Symmetry", "Time Effects in Perception"], "keywords": []},
{"id": "energy-from-death", "title": "Energy from Death", "aliases": "Living on Death, Rotting Carcass", "location": "Gallery 4: Living Systems", "byline": "Sitara Cave , Richard Gagnon , and Denise King , 2001", "collection_id": ["field-trip-guide:-it", "traits-of-life"], "related_id": ["big-wood-300-years-of-photosynthesis", "still-life", "live-chicken-embryos", "look-inside-developing-fish"], "tagline": "One creature’s end is another’s beginning.", "description": "A decaying carcass makes a perfect meal for an assortment of scavengers, including the dermestid beetles you can see in this exhibit. As they feast on these carcasses, the dermestid beetles and their larvae get their energy and nutrients from the dried flesh, skin, and other tissues. ", "whats_going_on": "While it may appear there are two distinct scavengers at work in this exhibit, they are actually one and the same—dermestid beetles—in their smaller, brown, larval stage and as larger, shiny, black adults.   Demestid beetle and larva  Dermestid beetles are used by museums and bone collectors—and now and then by criminal investigators—to clean the flesh from specimens. Creature corpses of all stripes have found their way into this decay display: cats, rats, snakes, frogs. Most often what you’ll find here are rats intended as pet food, purchased online and delivered frozen. In this exhibit, dermestid beetles have the carcasses to themselves, but in the wild, they compete with many other insect scavengers. On a fresh carcass, most of the insects are flies. Dermestids and other beetles arrive later on in the decomposition process. The types of insects on a carcass can help forensic scientists estimate how long ago the animal died.  Flesh-Eating Dermestid Beetle Time-Lapse . © 2014 California Academy of Sciences.  Living on Death . © Denise King.", "going_further": "In this exhibit, dermestid beetles have the carcasses to themselves, but in the wild, they compete with many other insect scavengers. On a fresh carcass, most of the insects are flies. Dermestids and other beetles arrive later on in the decomposition process. The types of insects on a carcass can help forensic scientists estimate how long ago the animal died.  Flesh-Eating Dermestid Beetle Time-Lapse . © 2014 California Academy of Sciences.  Living on Death . © Denise King.", "details": "", "phenomena": ["Decomposition", "Natural Frequency"], "keywords": []},
{"id": "emotion-tracer", "title": "Emotion Tracer", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Erik Thogersen and Bill Meyer , 2007", "collection_id": ["mind"], "related_id": [], "tagline": "This exhibit displays physiological arousal, a key part of your emotional state.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Emotion", "Feedback", "Metacognition"], "keywords": []},
{"id": "echo-tube", "title": "Echo Tube", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Thomas Humphrey , 1975", "collection_id": ["young-kids"], "related_id": ["lariat-chain", "listening-vessels", "out-quiet-yourself", "echo-tubes"], "tagline": "Talk, clap, yodel, yell—your sounds bounce back at you.", "description": "Make a sound into the echo tube and listen for it to reflect back from the far end. You’ll hear a half-second delay, and strange distortions created by the journey. ", "whats_going_on": "Sound travels to the far end of the tube and bounces back to make an echo. As it travels, the sound bounces off the sides of the tube. If you clap into the tube, the echo that returns sounds like a drawn out whine that begins with a high pitch and ends with a lower pitch. Higher-pitched sounds take a more direct path than lower-pitched sounds do, so they get back to you sooner and stronger—causing the strange high-to-low “pinging” you hear when you clap into the tube. For your ear to hear a reflected sound as a distinct echo, the delay between the initial sound and the arrival of the reflected sound must be greater than about a tenth of a second. Since sound travels at roughly 340 meters (1,100 feet) per second, a sound-reflecting surface has to be at least 17 meters (56 feet) away to produce an echo.  Challenge: Our Echo Tube is about 60 meters (200 feet) long. Can you use the speed of sound (340 meters per second) to estimate the expected time delay between a sound and its echo? Photo © 2013 Bruce Damonte, all rights reserved. (click to image to enlarge)   An Echo Tube doesn’t need to be straight to work—sound travels by bouncing between the walls of the tube, be it straight or curly. (click image to enlarge) ", "going_further": "For your ear to hear a reflected sound as a distinct echo, the delay between the initial sound and the arrival of the reflected sound must be greater than about a tenth of a second. Since sound travels at roughly 340 meters (1,100 feet) per second, a sound-reflecting surface has to be at least 17 meters (56 feet) away to produce an echo.  Challenge: Our Echo Tube is about 60 meters (200 feet) long. Can you use the speed of sound (340 meters per second) to estimate the expected time delay between a sound and its echo? Photo © 2013 Bruce Damonte, all rights reserved. (click to image to enlarge)   An Echo Tube doesn’t need to be straight to work—sound travels by bouncing between the walls of the tube, be it straight or curly. (click image to enlarge) ", "details": "", "phenomena": ["Feedback", "Reflection", "Resonance", "Wave Guide"], "keywords": []},
{"id": "elastotron", "title": "Elastotron", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Eric Socolofsky , 2009", "collection_id": ["reflections"], "related_id": ["dioximoirekinesis"], "tagline": "Explore light and dimension.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Feedback", "Image Formation", "Light Production", "Motion: Visual Motion Detection", "Patterns", "Perception: Spatial", "Reflection"], "keywords": []},
{"id": "drawing-board", "title": "Drawing Board", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "John Ravilious, 1969", "collection_id": ["cybernetic-serendipity", "explainer-demonstrations"], "related_id": ["harmonograms", "sand-graph", "chaotic-pendulum", "coupled-pendulums"], "tagline": "The Drawing Board is a pendulum that draws a unique design.", "description": "", "whats_going_on": "", "going_further": "", "details": "Draw hypnotically flowing patterns with a swinging table, and watch friction cause the patterns to slowly shrink along a spiral path. Pick up a ticket to reserve your spot in line for this popular activity.", "phenomena": ["Damping", "Friction", "Feedback", "Motion: Composition of Perpendicular Motion", "Motion: Pendular Motion", "Motion: Periodic Motion", "Motion: Simple Harmonic Motion", "Oscillation", "Patterns", "Superposition"], "keywords": ["pendulums", "phase angle"]},
{"id": "drip-chamber", "title": "Drip Chamber", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Charles Sowers , 2011", "collection_id": [], "related_id": [], "tagline": "Liquid glycerin drips down, creating unique shapes and shadow patterns.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Patterns", "Projections", "Scattering", "Shadows", "Techniques to Make the Invisible Visible"], "keywords": []},
{"id": "duck-into-a-kaleidescope", "title": "Duck Into a Kaleidoscope", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Robert Larue (Bob) Miller and Frank Oppenheimer", "collection_id": ["reflections", "seeing-the-light"], "related_id": ["look-into-infinity", "anti-gravity-mirror", "giant-mirror", "cylindrical-mirror"], "tagline": "Step inside—and reflect.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Image Formation", "Patterns", "Reflection", "Symmetry"], "keywords": ["mirrors"]},
{"id": "pulling-together", "title": "Pulling Together", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Doug Thistlewolf , 2019", "collection_id": ["middle-ground"], "related_id": ["unseen-stories", "sharing-faces", "freeloader", "team-snake"], "tagline": "Working together, do you pull your weight?", "description": "Do you work your hardest when you’re working with others? Does it make a difference if other people can see how hard you’re working? Grab a rope, get ready to pull, and discover the phenomenon of social loafing firsthand. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Social Influence", "Social Loafing"], "keywords": ["cooperation"]},
{"id": "downhill-race", "title": "Downhill Race", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Tom Tompkins , 1984", "collection_id": ["active-prolonged-engagement"], "related_id": ["bicycle-wheel-gyro", "turntable", "lariat-chain"], "tagline": "Which wheel rolls downhill the fastest?", "description": "Believe it or not, when objects roll downhill, it’s not their weight or size that determines their speed—it’s how their weight is distributed. ", "whats_going_on": "Many people expect that a heavier wheel will naturally roll downhill faster than a lighter one. But when an object rolls downhill, its speed depends not on the weight of the wheel, but on where the weight is located. When weight is located far from the center of the wheel, the wheel is harder to get rolling. (A physicist would say it has more rotational inertia .) So even though they may weigh the same, a metal disk will accelerate down a hill faster than a metal hoop, because the hoop’s weight is farther from the center of rotation. Likewise, sliding the adjustable brass weights on the wheels of this exhibit inward decreases their rotational inertia, allowing them to roll downhill faster. Serious skateboarders choose the size of their wheels with rotational inertia in mind. Smaller wheels are easier to get spinning, and also make for a more maneuverable skateboard, which is why they’re the preferred choice of most street skaters.", "going_further": "Serious skateboarders choose the size of their wheels with rotational inertia in mind. Smaller wheels are easier to get spinning, and also make for a more maneuverable skateboard, which is why they’re the preferred choice of most street skaters.", "details": "", "phenomena": ["Energy: Conservation of Energy", "Energy: Kinetic", "Energy: Potential", "Inertia: Linear", "Inertia: Rotational", "Motion: Accelerated Linear Motion", "Motion: Accelerated Rotational Motion", "Motion: Rotational Motion", "Torque"], "keywords": ["bicycle wheel", "spinning"]},
{"id": "distorted-room", "title": "Distorted Room", "aliases": "Ames Room", "location": "This exhibit is not currently on view.", "byline": "Adelbert Ames II , 1971", "collection_id": ["a-question-of-size", "seeing-the-light"], "related_id": ["big-chair-little-chair", "ames-chairs", "perspective-drawing-window"], "tagline": "See your friends go from tiny to towering in a few steps.", "description": "From one view, this room looks like a normal room, but people and things inside may seem quite strange.  Peer into what looks like a perfectly normal room and you’ll see an astonishing effect straight out of Alice In Wonderland : People seeming to grow and shrink as they wander around the checkered floor of this unusual room. ", "whats_going_on": "What makes the illusion of this special room, called an Ames room , so effective is a carefully chosen vantage point. Viewed from a particular angle, this slanted room looks square, even though the ceiling on one side is actually about twice the height as the other. Since square rooms are the norm in our world, your brain decides the room is square—a decision that causes the people inside to seem to grow and shrink as they move from one side to the other.  This illusion has been used widely to create special effects in movies and television. In The Lord of the Rings , for example, several scenes set in the Shire relied on Ames rooms to make the hobbits look tiny relative to Gandalf. (click diagram to enlarge)", "going_further": "", "details": "", "phenomena": ["Cues: Dominant", "Perception: Spatial", "Size-Distance"], "keywords": ["perspective"]},
{"id": "probably-chelsea", "title": "Probably Chelsea", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Artist-in-Residence Heather Dewey-Hagborg and Chelsea E. Manning, 2017", "collection_id": ["cells-to-self"], "related_id": ["is-it-genetic"], "tagline": "Twenty different sculptural portraits, all based on the same person's DNA information.", "description": "These twenty different possible portraits were based on the DNA information from one person—Chelsea Manning. It shows how the same DNA data can be interpreted in many different ways. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": ["genetics", "DNA", "identity"]},
{"id": "recollections", "title": "Recollections", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist-in-Residence Ed Tannenbaum , 1981", "collection_id": ["artist-in-residence", "seeing", "seeing-the-light", "young-kids"], "related_id": ["shadow-box", "water-drop-photography", "bird-in-a-cage", "mood-lighting"], "tagline": "Create vivid images of yourself as you explore movement.", "description": "", "whats_going_on": "", "going_further": "", "details": "This work addresses the poetics of motion, time and color. Participants are able to explore animated effects such as how sequences of images create movement. By displaying sequences simultaneously, movement forms are created. The history of the movement is expressed through multiple rainbow-colored images that evoke memories of legendary photographer Harold Edgerton's work.", "phenomena": ["Color", "Feedback", "Hand-Eye Coordination", "Information Processing and Encoding", "Image Formation", "Light Gathering", "Motion Detection", "Patterns", "Persistence of Vision", "Reflection", "Shadows"], "keywords": ["mirrors"]},
{"id": "plankton-rainbow", "title": "Plankton Rainbow", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Denise King , 2013", "collection_id": [], "related_id": ["plankton-populations", "glass-settling-plate"], "tagline": "Plankton can distinguish between different colors of light.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Phototaxis"], "keywords": ["plankton"]},
{"id": "pinscreen", "title": "Pinscreen", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Artist-in-Residence Ward Fleming , 1980", "collection_id": ["artist-in-residence", "young-kids"], "related_id": ["jacques-cousteau-seashells"], "tagline": "Create ghostly images with the touch of a hand.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Close Packing", "Color", "Natural Frequency", "Motion: Pendular Motion", "Motion: Periodic Motion", "Oscillation", "Reflection", "Wave Excitation"], "keywords": ["mirrors"]},
{"id": "pitch-slider", "title": "Pitch Slider", "aliases": "Pitch Twanger", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "David Torgersen and Maz Kattuah , 2006", "collection_id": ["listen"], "related_id": ["big-tuning-fork", "pentaphone", "find-the-highest-note"], "tagline": "The length of this vibrating rod affects the sound it makes.", "description": "", "whats_going_on": "", "going_further": "", "details": "This strange instrument makes sound with a vibrating metal bar. Twang to get it going, then listen as you move a slider up and back along the bar. Like a slider on a steel guitar string, moving it changes the vibration. Varying the vibration varies the pitch, so play around with the sounds. How do they change as you speed up or slow down the vibration? Can you play a tune? This exhibit was inspired by the work of Bart Hopkin , who builds and plays unusual musical instruments.", "phenomena": ["Resonance"], "keywords": []},
{"id": "pier-piling-pivot", "title": "Pier Piling Pivot", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Steve Gennrich and Jesse Marsh , 2016", "collection_id": ["outdoor-exploratorium-at-fort-mason"], "related_id": ["life-on-the-rocks", "life-in-a-drop-of-water", "what-lives-here", "glass-settling-plate"], "tagline": "Raise a piling to see what grows.", "description": "", "whats_going_on": "", "going_further": "", "details": "This exhibit uses a geared motor to swing a specially designed piling out of the water so that visitors can examine it in detail. Accompanying panels identify the intertidal zones on the piling and the species of plant and animal life occupying this unique shoreline environment.", "phenomena": [], "keywords": []},
{"id": "pi-shrine", "title": "Pi Shrine", "aliases": "Pi Marker", "location": "Gallery 5: Outdoor Exhibits", "byline": "Ron Hipschman and Steve Gennrich , 1988", "collection_id": [], "related_id": ["pi-has-your-number", "pi-toss"], "tagline": "This circular piece of Exploratorium history has held pride of place in π Day festivities since 1988.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Numbers"], "keywords": []},
{"id": "pi-toss", "title": "Pi Toss", "aliases": "Buffon's Needles, Throw Pi, Try Pi", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Diane Whitmore , 2005", "collection_id": ["core-experience:-math"], "related_id": ["pi-has-your-number", "pi-shrine"], "tagline": "Toss some chips to estimate pi.", "description": "", "whats_going_on": "", "going_further": "", "details": "This exhibit features a low table etched with evenly spaced lines. When you toss some chips on the table some of them will cross a line and some will not:   Using a calculator at the exhibit you can divide the number chips by the number of crossings. The more chips you throw the closer this ratio gets to pi. This surprising method of calculating pi, known as Buffon's Needle, was discovered by accident over 300 years ago by a French mathematician–Count Buffon. He wanted to calculate the odds of winning in a then-popular game of chance, where you tossed a needle onto the floor and bet on whether it would land on a seam between the floorboards.  Statistically, the more tosses you make, the better your estimate of pi will be. Notice how the average result in this graph improves over the course of sixty trials (click to enlarge). ", "phenomena": ["Numbers", "Probability", "Randomness"], "keywords": []},
{"id": "pi-has-your-number", "title": "Pi Has Your Number", "aliases": "Pi Search", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Paul Dancstep , 2016", "collection_id": ["core-experience:-math"], "related_id": ["pi-toss", "pi-shrine"], "tagline": "Use a touchscreen to search for any number hidden in the first 3 million digits of pi.", "description": "", "whats_going_on": "", "going_further": "", "details": "The digits of pi go on forever, without ever falling into a repeating pattern. Therefore any sequence of numbers you can think of—your ZIP code, your birthday, your phone number—are bound to appear in the digits of pi sooner or later. This exhibit features a 12-foot long poster containing over three million tiny digits of pi. A computer at the exhibit lets you look up the position of any number sequence while a sliding magnifier can be positioned for you to see the sequence for yourself. The odds are pretty good that your six digit birthday is somewhere on this poster. But to have an equally good chance of finding your 10-digit phone number you'd need 4 billion digits–and the poster would need to stretch all the way across the Bay to Oakland.", "phenomena": ["Numbers", "Randomness"], "keywords": []},
{"id": "pendulum-snake", "title": "Pendulum Snake", "aliases": "Snake Pendulum", "location": "Crossroads: Getting Started", "byline": "Erik Thogersen , 2000", "collection_id": [], "related_id": ["coupled-pendulums", "chladni-singing", "oscylinderscope", "rolling-through-the-bay"], "tagline": "These balls dance in changing patterns as they swing to their own rhythms.", "description": "Lift the handle to start this row of pendulums swinging, and then watch as they move in and out of a repeating series of mesmerizing patterns. ", "whats_going_on": "Each of these swinging balls is a pendulum that swings back and forth at a slightly different rate, determined by the length of string supporting it. The longest pendulum swings back and forth exactly 15 times in 30 seconds. Its neighbor swings 16 times in 30 seconds, the next 17, and so on down to the shortest one, which swings exactly 24 times in 30 seconds. Since every pendulum completes a whole number of swings in 30 seconds, they all come back together every 30 seconds. After 15 seconds, the even-numbered pendulums have completed a whole number of swings and are back where they started. The odd-numbered pendulums are exactly halfway through one of their swings and are opposite where they started. The result is two opposing lines of pendulums that seem to dance with each other.", "going_further": "", "details": "", "phenomena": ["Motion: Pendular Motion", "Motion: Periodic Motion", "Motion: Simple Harmonic Motion", "Phase", "Resonance"], "keywords": ["pendulums"]},
{"id": "observatory-library", "title": "Observatory Library", "aliases": "Prelinger Map Archive and Library, Prelinger Library", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Prelinger Library and Archives , 2013", "collection_id": [], "related_id": ["library-of-earth-anatomy"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "The Observatory Library is the Bay Observatory’s research center, providing context and historical insight to the local landscape just beyond the windows. The library holds selected literature about regional history—including new works of merit, rare and out-of-print books, magazines, and government documents—enabling visitors to browse or conduct research. Five atlases specially prepared for the library animate archival materials to explore natural and social forces that have impacted the bay's landscape. The library also includes moving images that show scenes from local landscapes that have been eclipsed by history.", "phenomena": ["Modeling Landscapes"], "keywords": []},
{"id": "oscylinderscope", "title": "Oscylinderscope", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Artist Norman Tuck , 1998", "collection_id": [], "related_id": ["aeolian-harp", "sound-bite", "chladni-singing", "humming-plates"], "tagline": "See how strings behave when they vibrate and make sound.", "description": "", "whats_going_on": "", "going_further": "", "details": "This piece consists of a cylinder and guitar strings, that when plucked, demonstrate how strings behave when they vibrate to produce sound. Both the tension and the length of a string effect the frequency of vibration (pitch of the sound). Shorter or tighter strings vibrate faster to make higher tones and vice a versa, while the horizontal distance between the peaks and valleys of each wave reflects the loudness of the sound.", "phenomena": ["Resonance"], "keywords": ["musical instruments"]},
{"id": "pedal-generator", "title": "Pedal Generator", "aliases": "", "location": "Gallery 2: Tinkering", "byline": "Frank Oppenheimer and Tom Tompkins", "collection_id": [], "related_id": ["circuit-workbench", "magnet-plus-electricity-equals-motor"], "tagline": "Power these appliances with your feet!", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Electric Current", "Energy: Conservation of Energy", "Electric Fields and Forces"], "keywords": []},
{"id": "out-quiet-yourself", "title": "Out Quiet Yourself", "aliases": "Fox Walking, Rock Box, Shaking, Walking on Gravel", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Mary Elizabeth Yarbrough , 2006", "collection_id": ["listen", "young-kids"], "related_id": ["listening-vessels", "echo-tube", "shhhh-quiet", "archimedes"], "tagline": "How quietly can you tread this gravel path?", "description": "As you walk across the gravel floor of this short tunnel, a sound meter measures your loudness and gives you a score. Can you beat your previous score? Can you beat your friends’ scores? ", "whats_going_on": "Walking quietly isn’t easy. Here are a few tips from an expert Apache tracker: The secret to ultra quiet walking is patience—and practice, practice, practice.", "going_further": "", "details": "", "phenomena": [], "keywords": ["attentive listening"]},
{"id": "oculus-table", "title": "Oculus Table", "aliases": "", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Rebecca Cummins and Woody Sullivan , 2013", "collection_id": [], "related_id": ["solar-hour-benches", "sky-theater", "sun-dial"], "tagline": "Explore a contemporary twist on a common ancient Greek sundial.", "description": "", "whats_going_on": "", "going_further": "", "details": " Oculus Table introduces a contemporary twist on a common ancient Greek sundial, the scaphe (σκάφη or \"bowl\"). With sunlight streaming through the oculus—the hole in the ceiling of the Fisher Bay Observatory—the movable table can be visually aligned with landmarks on the skyline (Coit Tower, Transamerica Pyramid, etc.) to discover the Sun's position in the sky and the current time and date.", "phenomena": [], "keywords": []},
{"id": "moving-objects", "title": "Moving Objects", "aliases": "", "location": "Ray and Dagmar Dolby Atrium", "byline": "Artist Pe Lang , 2012", "collection_id": [], "related_id": ["flourish-bloom"], "tagline": "These rings on a string pass through each other—don’t they?", "description": "", "whats_going_on": "", "going_further": "", "details": "Captured inside a large round window, hundreds of black rings travel randomly left and right along more than fifty horizontal strings. Closer examination reveals that the strings are driven at each end by small motors and that the rings that seem to pass through each other are actually bouncing against one another. Moving Objects is a site-specific piece partially supported by SwissNex San Francisco.", "phenomena": [], "keywords": []},
{"id": "mirrorly-a-window", "title": "Mirrorly a Window", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Robert Larue (Bob) Miller , 1976", "collection_id": ["mind", "seeing", "seeing-the-light"], "related_id": ["anti-gravity-mirror", "bronze-hand", "ames-chairs", "velvet-hands"], "tagline": "Confusing sensory information can be profoundly disturbing.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Hand-Eye Coordination", "Image Formation"], "keywords": ["mirrors"]},
{"id": "mood-lighting", "title": "Mood Lighting", "aliases": "Color Ball, Glow Ball", "location": "This exhibit is not currently on view.", "byline": "Denise King , 2006", "collection_id": ["colorfest", "mind"], "related_id": ["disagreeing-about-color", "recollections", "color-your-judgment", "spectral-meadow"], "tagline": "Surround yourself in color—do you feel a shade different?", "description": "Sit down in a cozy chair and bathe your brain in a bubble of color of your choosing, dialing up anything from amber to violet. As you spend a few moments with each color, you may feel a shift in your own emotional hue. ", "whats_going_on": "An entire field of research— color psychology —devotes itself to exploring this phenomenon, the ability of color to manipulate our emotions. Thought to be partly a matter of cultural training and partly a matter of biology, the power that color has to subtly sway our feelings has been confirmed in a wide range of environments. Not only does color have measurable affects on mood, it can alter the way food tastes, the outcome of a sporting match, and the effectiveness of a (placebo) pill. Color can even distort your perception of time. In one study, participants bathed in either red or blue light were asked to estimate when a minute had passed—perceived duration was 11 seconds shorter for the blue-light crew. Abstract of Ma, J. 2012. “ Listening for Self-Reflective Talk in Visitors’ Conversations: A Case Study of the Exploratorium's Mind Collection .” Visitor Studies 15 (2): 136-156.", "going_further": "", "details": "", "phenomena": ["Emotion", "Mental Activity"], "keywords": ["ganzfeld effect"]},
{"id": "mapping-migrations", "title": "Mapping Migrations", "aliases": "Ocean Tracks", "location": "Gallery 4: Living Systems", "byline": "Graduate students from the UC Davis Center for Visualization, and Exploratorium staff", "collection_id": ["living-liquid"], "related_id": ["visualizing-the-bay-area", "plankton-populations", "flock"], "tagline": "Explore the tracks of ocean animals tagged by scientists.", "description": "Where do marine animals go during their Pacific migrations? This interactive data visualization reveals the migration pathways of sharks, whales, sea turtles, tuna, and other marine creatures, and lets visitors explore differences in timing, geographic location, and male versus female migration routes. ", "whats_going_on": "At this large, touch-screen exhibit, visitors can choose which animals to follow, and look at how they differ in migration speed, timing, and location. They can also see the differences between male and female migration pathways. To collect the data displayed in this exhibit, scientists tagged whales, sharks, sea turtles, and other creatures in the Pacific Ocean, then tracked their movements over time. The data has helped scientists make discoveries about where these animals go throughout the year. For example, they've learned that white sharks flock to an area 1,500 miles west of Baja California—known as the White Shark Café. The data was collected as part of the Tagging of Pacific Predators project, part of the Census of Marine Life.", "going_further": "", "details": "", "phenomena": ["Patterns", "Techniques to Make the Invisible Visible"], "keywords": ["Marine", "Migrations", "Ocean", "Pacific", "Sharks", "Turtles", "Whales"]},
{"id": "monochromatic-room", "title": "Monochromatic Room", "aliases": "Bridge Light, Yellow Room, Jellybean Room", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown and Jessica Strick , 2010", "collection_id": ["seeing", "young-kids"], "related_id": ["sun-painting", "mood-lighting", "whats-hot-whats-not", "disagreeing-about-color"], "tagline": "Where did all the colors go?", "description": "Things look oddly colorless in this room because they’re lit by light of only one color—a sodium vapor lamp of the type often used for streetlights. ", "whats_going_on": "Ordinarily, the world around you is lit by light of many different colors. When this many-colored light bounces off of things, some colors get absorbed, while others get reflected. It’s the light reflecting off objects that give them their apparent color. For example, a sweater looks red because it reflects red light into your eyes. In this room, there is no red light to bounce off of things and make them look red. There’s no blue light or green light either. With only a single color to absorb or reflect, objects look to be more or less the same color. The yellowish light in this room is produced by sodium vapor lamps, which are commonly used in streetlights because they’re energy efficient. They also help reduce light pollution problems at astronomical observatories. (Light pollution of a single color is easier to filter out.) Sodium vapor lamps like the one illuminating this room emit light that is monochromatic , that is, of a single color or wavelength—589 nanometers, to be precise. (click image to enlarge)", "going_further": "The yellowish light in this room is produced by sodium vapor lamps, which are commonly used in streetlights because they’re energy efficient. They also help reduce light pollution problems at astronomical observatories. (Light pollution of a single color is easier to filter out.) Sodium vapor lamps like the one illuminating this room emit light that is monochromatic , that is, of a single color or wavelength—589 nanometers, to be precise. (click image to enlarge)", "details": "", "phenomena": ["Color Mixing: Subtractive", "Light Production"], "keywords": []},
{"id": "magnetic-fluid-patterns", "title": "Magnetic Fluid Patterns", "aliases": "Magnetic Labyrinth", "location": "This exhibit is not currently on view.", "byline": "Charles Sowers , 2003", "collection_id": ["active-prolonged-engagement"], "related_id": ["black-sand", "magnetic-clouds"], "tagline": "A magnet's force gathers and disperses a magnetic fluid in dynamic patterns.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Magnetization", "Patterns"], "keywords": ["magnet", "magnetic field"]},
{"id": "zephyr-trio", "title": "Zephyr Trio", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Douglas Hollis , 1997", "collection_id": [], "related_id": ["aeolian-harp", "archimedes", "listening-vessels", "vortex"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "In the parking lot outside the former Exploratorium building stood three steel poles with mounted weather vanes and vertical hollow tubes that turned depending on the wind direction. When the wind was just right, mysterious organ tones could be heard from the tubes of this exhibit.", "phenomena": ["Resonance"], "keywords": ["acoustics", "wind"]},
{"id": "your-turn-counts", "title": "Your Turn Counts", "aliases": "", "location": "Gallery 2: Tinkering", "byline": "Artist Norman Tuck , 2013", "collection_id": [], "related_id": ["tinkerers-clock"], "tagline": "Turn the crank and add to the tally kept by this whimsical counter.", "description": "", "whats_going_on": "", "going_further": "", "details": "From simple wooden gears to metal flip type, glow discharge tubes, and iPads, Your Turn Counts actually counts the turns of a handle in increasingly modern technology as the orders of magnitude grow. A playful experiment in participation and patience.", "phenomena": [], "keywords": []},
{"id": "water-drop-photography", "title": "Water-Drop Photography", "aliases": "Frozen Water Drop", "location": "Crossroads: Getting Started", "byline": "Erik Thogersen , 2010", "collection_id": [""], "related_id": ["icy-bodies", "liquid-litmus", "startle-response", "time-to-think"], "tagline": "Catch the momentary beauty of a water drop falling into a pool.", "description": "Here you can select and photograph a precise moment—to within a millisecond—as a water droplet falls into a small pool of water. Freezing the action reveals both the complexity and the beauty of fluid motion. ", "whats_going_on": "The fantastic shapes and patterns you can see in this exhibit are largely due to the strong cohesive forces between water molecules, also known as surface tension . Water molecules are polar , that is, the electric charges within them are arranged so that each molecule has a positive and a negative side. This polarity makes water molecules tend to stick strongly to one another, causing water droplets to form spheres and water surfaces to ripple as if covered in a skin of fabric.  Harold Edgerton, Milk Drop Coronet.  Photo: 1957, © 2010 MIT. Courtesy of MIT Museum. (click image to enlarge)   “Splash! Droplets of Water and Milk Photographed by Corrie White Using a Macro Lens.”  The Telegraph. © of Telegraph Media Group Limited 2018.", "going_further": "", "details": "", "phenomena": ["Image Formation"], "keywords": ["lenses", "magnification", "photography", "water"]},
{"id": "within-15-minutes", "title": "Within 15 Minutes", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Artist Alma Haser, 2017", "collection_id": ["cells-to-self"], "related_id": ["is-it-genetic"], "tagline": "A jigsaw puzzle recombination of photographs of identical twins.", "description": "Alma Haser photographed sets of identical twins and made them into identical jigsaw puzzles. She then swapped every other piece of their puzzles, completely mixing them half and half. Not always knowing where their eyes mouth, and lips would end up, the result is a pair of eerie, unrecognizable portraits. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": ["identical twins", "genetics", "artwork", "photography", "portraits", "appearance"]},
{"id": "the-wave-organ", "title": "Wave Organ", "aliases": "", "location": "San Francisco Marina jetty", "byline": "Artist-in-Residence Peter Richards and George Gonzalez, 1986", "collection_id": [], "related_id": ["water-waves-time-horizon", "catch-the-sound-waves", "echo-tube"], "tagline": "Listen to the sound of the sea.", "description": "", "whats_going_on": "", "going_further": "", "details": " Wave Organ is a wave-activated acoustic sculpture located on a jetty that forms a boat harbor in the San Francisco Bay. The concept was developed by Peter Richards and was installed in collaboration with sculptor and master stone mason George Gonzalez. Inspiration for the piece came from artist Bill Fontana’s recordings made of sounds emanating from a vent pipe of a floating concrete dock in Sydney, Australia. In 1980, Richards (a Senior Artist at the Exploratorium for many years) received a planning grant from the National Endowment for the Arts that enabled him to conduct an extensive period of investigation into the physicality of the Wave Organ phenomenon. A prototype, built at the same location, was presented as part of the New Music ’81 Festival. Though very rudimentary in nature, it generated enthusiasm and support for a permanent work. Permit acquisition and fundraising efforts by Frank Oppenheimer, Founding Director of the Exploratorium, began soon after, but actual construction did not start until September 1985, seven months after Oppenheimer’s death. The Wave Organ was completed in May 1986 and was dedicated in June to the memory of Frank Oppenheimer. The jetty itself was constructed with material taken from a demolished cemetery, providing a wonderful assortment of carved granite and marble, which was used in the construction of this piece. The installation includes 25 organ pipes made of PVC and concrete located at various elevations within the site, allowing for the rise and fall of the tides. Sound is created by the impact of waves against the pipe ends and the subsequent movement of the water in and out of the pipes. The sound heard at the site is subtle, requiring visitors to become sensitized to its music, and at the same time to the music of the environment. The Wave Organ sounds best at high tide. Check the tides   RoadTripAmerica visits the Wave Organ   Join In! Tag the Wave Organ on Instagram #WaveOrgan ", "phenomena": ["Harmonics", "Natural Frequency", "Resonance", "Wave Guide", "Wind"], "keywords": ["musical instruments", "tides", "water", "weather"]},
{"id": "whats-hot-whats-not", "title": "What's Hot, What's Not?", "aliases": "Heat Camera, IR Camera", "location": "Crossroads: Getting Started", "byline": "Diane Whitmore and Richard O. Brown , 2000", "collection_id": ["active-prolonged-engagement", "reflections", "revealing-bodies", "young-kids"], "related_id": ["monochromatic-room", "hot-spot", "sun-painting"], "tagline": "See yourself with infrared vision.", "description": "At this exhibit, an infrared camera detects the heat radiating from warm objects and projects it on a big screen, allowing you to see what’s hot (and not) about you and the other people and objects in your surroundings. ", "whats_going_on": "This camera is sensitive to infrared light , an invisible form of energy given off by objects and people alike. Warmer objects radiate more infrared light than cooler objects do, and appear brighter on the projected image. The aluminum table in front of the bench at this exhibit is a good thermal conductor: heat moves through it quickly. When you touch a shape, heat flows easily from your hand to the metal, cooling your skin and creating a dark pattern. As your skin warms, the pattern fades. The various panels behind the bench at this exhibit reflect some forms of energy better than others. Acrylic reflects visible light but not infrared radiation, so your reflection doesn’t show up on the screen. The unpolished copper reflects visible light poorly, so you can’t see yourself in it. But copper does reflect infrared rays—which is why you can see reflected images in the copper panel when you look at it on the screen. Infrared cameras are used in some night vision systems, in industry, astronomy, and to help find heat leaks in insulated homes. Like the camera in this exhibit, rattlesnakes can “see” infrared light—but not with their eyes. Instead, they use infrared-sensing organs called pits, found between the nostril and eye. Being able to sense infrared light helps rattlesnakes and other pit vipers track their warm-blooded prey.", "going_further": "Infrared cameras are used in some night vision systems, in industry, astronomy, and to help find heat leaks in insulated homes. Like the camera in this exhibit, rattlesnakes can “see” infrared light—but not with their eyes. Instead, they use infrared-sensing organs called pits, found between the nostril and eye. Being able to sense infrared light helps rattlesnakes and other pit vipers track their warm-blooded prey.", "details": "", "phenomena": ["Electromagnetic Radiation Spectrum", "Light Production", "Techniques to Make the Invisible Visible"], "keywords": ["heat transfer"]},
{"id": "water-spinner", "title": "Water Spinner", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Richard Gagnon", "collection_id": ["core-experience:-math"], "related_id": ["vortex", "turbulent-orb", "catenary-arch", "voussoir-arch-bridge"], "tagline": "Spinning water makes a mathematical curve.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Fluid Mechanics", "Parabolas"], "keywords": ["rotation", "water", "curves"]},
{"id": "watch-water-freeze", "title": "Watch Water Freeze", "aliases": "Ice Crystals, Ice Painting, Ice Window", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Charles Sowers , 2000", "collection_id": ["active-prolonged-engagement"], "related_id": ["glass-settling-plate", "water-drop-photography", "soap-film-painting", "sun-painting"], "tagline": "Freezing water forms a spiky kaleidoscope of colorful crystals.", "description": "Ordinarily, water freezes too slowly to be appreciated. Here, polarized light and an ultra cold slab let you watch water crystalize rapidly in real time. The colorful mosaic of ice that forms is different every time. ", "whats_going_on": "You can see colors in this ice thanks to special light filters called polarizers. The various colors appear for two reasons: slightly different thicknesses in the ice, and tiny stresses that develop within the ice as the crystals form and collide. Chilled by coolant from below, the glass is so cold that when you squirt water on it, the water freezes into crystals. On some lucky occasions, you may witness a sudden, abrupt freezing of all the water on the slab. Ice crystals needs a surface or seed crystal on which to form. If none are present, the water becomes supercooled —cooled to well below the freezing point—until a seed crystal forms and ice suddenly spreads.", "going_further": "On some lucky occasions, you may witness a sudden, abrupt freezing of all the water on the slab. Ice crystals needs a surface or seed crystal on which to form. If none are present, the water becomes supercooled —cooled to well below the freezing point—until a seed crystal forms and ice suddenly spreads.", "details": "", "phenomena": ["Change of State", "Color", "Crystallization", "Freezing", "Interference", "Polarization", "Refraction", "Temperature: Effect of"], "keywords": ["water"]},
{"id": "vortex", "title": "Vortex", "aliases": "Water Tornado", "location": "Crossroads: Getting Started", "byline": "Artist-in-Residence Douglas Hollis , 1979", "collection_id": ["artist-in-residence", "turbulent-landscapes"], "related_id": ["icy-bodies", "fog-bridge-72494", "tornado", "archimedes"], "tagline": "A silvery, dancing vortex appears in rotating water.", "description": "A twist of a knob sets water jets in motion, causing water in this giant cylindrical tank to spin. Soon, a tiny vortex appears at the surface, gradually swelling in size as it snakes downward. ", "whats_going_on": "The pattern you see here is called a vortex, found in rapidly rotating fluids. Funnel-shaped forms such as this occur in both liquids and gases. You make a vortex every time you stir your coffee, flush a toilet, or empty your bathtub. Tornadoes, waterspouts, and dust devils are also vortices. Look closely and you may notice a corkscrew-shaped pattern on the surface of the spiraling water. This pattern is a profile view of surface waves that have formed on the inside of the vortex. Although the waves appear to be stationary, they are actually traveling up the downward-moving water. The effect is the same as a person walking up a down escalator.", "going_further": "Look closely and you may notice a corkscrew-shaped pattern on the surface of the spiraling water. This pattern is a profile view of surface waves that have formed on the inside of the vortex. Although the waves appear to be stationary, they are actually traveling up the downward-moving water. The effect is the same as a person walking up a down escalator.", "details": "", "phenomena": ["Motion: Accelerated Gravitational Motion", "Conservation of Angular Momentum", "Fluid Mechanics", "Gravitational Forces", "Nonlinear Behavior", "Pressure", "Torque", "Vortices", "Motion: Rotational Motion"], "keywords": ["gravity", "pressure", "water", "weather"]},
{"id": "velvet-hands", "title": "Velvet Hands", "aliases": "Chicken Wire, Tactile Harp, Velvet Harp", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Pearl Tesler and Jessica Strick , 2001", "collection_id": ["mind"], "related_id": ["bronze-hand", "tactile-dome", "black-sand"], "tagline": "Your sense of touch can surprise you.", "description": "A surprising—and as yet unexplained—tactile illusion can occur when you slowly rub your palms across this mesh. You may feel a strange, slippery sensation, as if there’s a thin film of velvet between your hands. ", "whats_going_on": "There are many types of touch-sensitive nerves in your skin. Some nerves respond to pressure, some to fast vibrations, some only to slow vibrations. Everything you touch—water, a rubber ball, a feather—stimulates a distinct combination of nerves that helps you identify what you’re touching. Here, there’s clearly something special about the combination of nerves stimulated, creating what many people describe as a slippery or velvety sensation. But no one knows exactly why this happens. This strange phenomenon was first noticed by a staff member when she was a kid, idly stroking a playground fence.", "going_further": "", "details": "", "phenomena": [], "keywords": ["nerves", "skin", "chicken wire"]},
{"id": "unseen-stories", "title": "Unseen Stories", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "David Torgersen , 2019", "collection_id": ["middle-ground"], "related_id": ["sharing-faces", "pulling-together"], "tagline": "There's what people see—and then there's the unseen story.", "description": "The people we pass by on the street have stories to tell—and so do we. Slow down your thinking and consider these questions: What do people assume about me based on how I look, talk, dress, or carry myself? What do I assume about others, and what might the real story be? ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Biases", "Judgment", "Stereotypes"], "keywords": []},
{"id": "uroborus", "title": "Uroborus: A Snake Chasing Its Tail", "aliases": "", "location": "Gallery 2: Tinkering", "byline": "Artist-in-Residence Norman Tuck , 1994", "collection_id": ["artist-in-residence"], "related_id": ["lariat-chain", "your-turn-counts"], "tagline": "This \"tail-devourer\" symbolizes an eternal loop.", "description": "", "whats_going_on": "", "going_further": "", "details": "A motorized serpent’s tail repeatedly strikes a snake-headed switch,triggering a never-ending mechanical loop. There are a number ofinterpretations of the ancient uroborus snake symbol (also spelled ouroboros and uroboros ). In an effort to preserve a style that had become the hallmark of theExploratorium’s pioneer days, elements of the Uroborus had been scavenged from an older, discarded Exploratorium exhibit.", "phenomena": ["Rhythm", "Motion: Periodic Motion", "Oscillation"], "keywords": []},
{"id": "turntable", "title": "Turntable", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Uwe Langmesser , 1986", "collection_id": ["young-kids"], "related_id": ["bicycle-wheel-gyro", "downhill-race", "lariat-chain"], "tagline": "Get things rolling.", "description": "Experiment with rotational motion (and collisions) at one of our most addictive exhibits. Disks and balls moving on and across this spinning table swoop and veer hypnotically—and also reveal why storm systems often follow curved paths on weather maps. ", "whats_going_on": "As disks and balls roll in a straight line across the spinning turntable, they appear to take a curved path. This apparent curving of things that move on a rotating surface is called the Coriolis effect . This rotating table moves faster near the outer edges than it does at the center. When you place a disk on the table, the disk begins rotating at the same speed as that part of the table. The disk retains this speed as it moves through the faster-rotating outer areas, making it curve against the direction of rotation. Earth’s rotation has a similar curving effect on the movement of air in the atmosphere and water in the oceans. That’s why you often see storm systems—such as hurricanes and nor’easters—take curving paths on weather maps. It’s also why winds circulate around storm centers.", "going_further": "", "details": "", "phenomena": ["Motion: Accelerated Gravitational Motion", "Motion: Accelerated Rotational Motion", "Conservation of Angular Momentum", "Friction", "Gravitational Forces", "Gyroscopics", "Nonlinear Behavior"], "keywords": ["spinning"]},
{"id": "turbulent-orb", "title": "Turbulent Orb", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Artist-in-Residence Ned Kahn , 1994", "collection_id": ["artist-in-residence", "turbulent-landscapes"], "related_id": ["vortex", "geysers", "confused-sea", "settling-column"], "tagline": "Swirling turbulent patterns evoke the atmosphere of our own spinning planet.", "description": "", "whats_going_on": "", "going_further": "", "details": "Turbulent Orb is a half-meter diameter sphere full of special, colored, flow-visualization fluid. The sphere is mounted on top of a pedestal, it spins on a good bearing. Visitors grasp a metal ring on the pedestal and spin the sphere choosing the direction and speed of rotation. The fluid in the sphere shows swirls and waves of internal fluid motions produced by the actions of the visitors. The turbulence of the fluid in the sphere is reminiscent of the turbulent flows that occur in planetary atmospheres. This exhibit shows the complexities of fluid motion that can be produced by very simple circumstances.", "phenomena": ["Fluid Mechanics", "Turbulent Flow"], "keywords": []},
{"id": "touch-the-spring", "title": "Touch the Spring", "aliases": "Can You Believe Your Eyes?, Touch the Teapot", "location": "Crossroads: Getting Started", "byline": "", "collection_id": ["seeing"], "related_id": ["magic-wand", "hot-spot", "shadow-kaleidoscope", "corner-reflector"], "tagline": "It‘s all done with mirrors.", "description": "Touching the spring seems easy, but the image of a spring is made by a big curved concave mirror. Light from a real spring bounces off the mirror to form the image you see. If you shine a flashlight at the image of the spring, the light reflects from the mirror and lights up the real spring. Because the real spring is lit up, it’s reflected image is lit up, too. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Parabolas", "Depth Perception", "Images: Real", "Parabolic Mirrors"], "keywords": ["mirrors", "reflections", "illusions"]},
{"id": "tinkerers-clock", "title": "Tinkerer's Clock", "aliases": "Tinkering Clock", "location": "Gallery 2: Tinkering", "byline": "Artist Tim Hunkin , 2013", "collection_id": [], "related_id": ["sweepers-clock", "timepieces", "your-turn-counts", "time-shift"], "tagline": "Check out a clock full of tinkerers that chimes the time.", "description": "", "whats_going_on": "", "going_further": "", "details": "Just outside the Tinkering Studio stands a twenty-two-foot-high clock. Small cartoon characters are poised to oil, brush, weld, or otherwise tinker with the numerals; knobs let visitors animate the characters so they can attend to their tasks. On the hour, the work is finished. The numbers swing out to form a clock face and a mellow Chinese gong rings. “Science museums used to display all sorts of mechanisms,” says the maker of the clock, artist/engineer Tim Hunkin. “But now so many things are electronic. The clock takes us back a bit in time. You can see how it works.”  Read Tim Hunkin's stories about the various mechanisms that make this clock work, and the challenges he faced in designing and building it. (click image to enlarge)   Go behind the scenes to learn more about the Tinkerer's Clock.", "phenomena": [], "keywords": []},
{"id": "timepieces", "title": "Timepieces (Solar System)", "aliases": "", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Katie Paterson, 2014", "collection_id": [], "related_id": ["tinkerers-clock", "sweepers-clock", "time-shift", "sun-dial"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "Katie Paterson’s Timepieces provokes us to reconsider everyday timekeeping by presenting the time on other celestial bodies. These nine clocks show the current time on other planets and our moon. All the clocks use standard Earth hours and minutes to measure time. Our own familiar units of time may seem absolute and unchanging. But clock time depends on celestial rhythms, and solar days are radically different elsewhere in our universe.", "phenomena": [], "keywords": []},
{"id": "tornado", "title": "Tornado", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Artist Ned Kahn , 1986", "collection_id": ["turbulent-landscapes", "young-kids"], "related_id": ["icy-bodies", "fog-bridge-72494", "vortex", "watch-water-freeze"], "tagline": "Step into an indoor version of a powerful natural vortex.", "description": "Fans simulate the swirling airflow in a thunderstorm and fog machines make the pattern visible, creating a miniature tornado that you can disturb with the wave of a hand. ", "whats_going_on": "In this haunting, interactive artwork by Ned Kahn, an overhead fan draws air upward, imitating the updraft that occurs in the core of a tornado-spawning thunderstorm. Air blowing from the sides of the aluminum tubes starts the updraft spinning, creating an air vortex , a small-scale tornado. A fog machine injects tiny droplets of water that make the airflow visible. The tornado vortex is one of many types of vortices that occur in our atmosphere. Hurricanes, waterspouts, and dust devils are other examples of atmospheric vortices. Air vortices occur in the air around you all the time, revealing themselves only when they capture something you can see. For instance, when you see leaves whirling around on a sidewalk, an air vortex is present.  Dust Devil  Photo © Paul Doherty. (click image to enlarge) ", "going_further": "", "details": "", "phenomena": ["Nonlinear Behavior", "Techniques to Make the Invisible Visible", "Turbulent Flow", "Vortices", "Wind", "Motion: Rotational Motion"], "keywords": ["fog", "weather"]},
{"id": "too-slow-to-notice", "title": "Too Slow to Notice", "aliases": "Water Evaporation, Too Slow to See", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Erik Thogersen , 2010", "collection_id": [], "related_id": [], "tagline": "This is a glass of water sitting on scale doing nothing. Or is it nothing?", "description": "", "whats_going_on": "", "going_further": "", "details": "A cup of water sitting on a table appears to just sit there. But second by second it’s losing billions of water molecules to the air through a process called evaporation . As the water evaporates, the glass of water gets lighter and lighter. A digital scale shows that it loses .0001 grams of water every second. At that rate, it takes about 16 minutes for a single drop to evaporate. And if you left the glass alone, all the water would be gone after 10 days. \"I wanted to make visitors think about our perspective on Time by noticing that a process that appears to be at a stop can be moving quickly, if your sense of time was that of a redwood tree.  I was gratified to discover that the scale in the bio lab was sensitive enough to show constant change.\" —Exhibit Developer Erik Thogersen", "phenomena": [], "keywords": ["evaporation"]},
{"id": "triple-aye-lightstick", "title": "Triple-Aye Lightstick", "aliases": "Triple Aye Stick", "location": "This exhibit is not currently on view.", "byline": "Artist Bill Bell , 1983", "collection_id": [], "related_id": ["magic-wand"], "tagline": "A sweeping glance creates images that appear and disappear in the blink of an eye.", "description": "", "whats_going_on": "", "going_further": "", "details": "A strip of 64 computer-controlled LEDs flashes on and off extremely rapidly. When you look in the mirror and quickly move it from side to side—or sweep your eyes sideways—the changing pattern of light leaves a visual imprint on the light sensitive cells at the back of your eye. Your visual system “remembers” light for up to a tenth of a second, long enough for you to see the complete image. This phenomenon, called persistence of vision, is also at work in videos and movie projections, which also flash on and off rapidly.", "phenomena": ["Persistence of Vision"], "keywords": []},
{"id": "time-to-think", "title": "Time to Think", "aliases": "Reaction Time 2, Time 2 Think", "location": "Crossroads: Getting Started", "byline": "Erik Thogersen , 2006", "collection_id": ["mind"], "related_id": ["sweepers-clock", "shadow-box"], "tagline": "As a task becomes more complex, it requires more mental effort—and that takes time.", "description": "At this exhibit, you can test your reaction time in three different scenarios—each requiring an increasing amount of thought. In the process, you can actually measure the time it takes your brain to accomplish the extra work of making a (fast) decision. ", "whats_going_on": "The extra time it takes to think before acting—or not acting—is perhaps no surprise. For hockey goalies and gamers alike, practice, practice, practice is the key to shaving precious fractions of a second from any performance requiring both speed and speedy decisions. Studies on reaction time confirm another thing you might already suspect: Age matters. You are at your speediest in your mid-twenties. After that, it’s a gentle downhill slide, reaction time–wise, until about age seventy, when the downhill slide steepens. But take heart, oldsters: A slower reaction time doesn’t necessarily mean slower overall performance. Research on older typists showed that though their finger speed sagged, their overall typing speed did not, likely due to improved “motor preparation,” that is, an ability to look ahead and anticipate. Gender, too, matters: While males are on average 10–20 milliseconds faster to react, females are more accurate. Lefties, athletes, and musicians also enjoy slight speed benefits. Abstract of Ma, J. 2012. “ Listening for Self-Reflective Talk in Visitors’ Conversations: A Case Study of the Exploratorium's Mind Collection .” Visitor Studies 15 (2): 136–156.", "going_further": "", "details": "", "phenomena": ["Attention", "Hand-Eye Coordination", "Information and Noise", "Mental Activity", "Mental Tasks", "Time Effects in Perception", "Reaction Time"], "keywords": []},
{"id": "theyre-identical-or-are-they", "title": "They're Identical . . . Or Are They?", "aliases": "twins photos", "location": "Gallery 4: Living Systems", "byline": "Amy Snyder and Kevin Boyd , 2019", "collection_id": ["cells-to-self"], "related_id": ["within-15-minutes", "is-it-genetic", "probably-chelsea"], "tagline": "Carefully comparing identical twins can reveal how our surroundings help to shape who we become.", "description": "", "whats_going_on": "", "going_further": "", "details": "Identical twins are born with identical DNA, and raised in mostly identical environments. Yet they don’t turn out exactly the same. From birth, and increasingly as they get older, twins show their individuality—both physically and in how they behave. That’s because genetic sequences are just one of many factors that make us who we are. For decades, scientists have studied identical twins, trying to tease apart the relative importance of genes and environment—nature and nurture. They’ve found that genes influence a wide range of human traits, from talent and personality to disease risk. But genes never tell the whole story. Throughout our lives, genes and environment move together like partners in a dance that shapes our lives.   Ila and Sabine Minn-Murray  Age: 3 Live in: Berkeley At first, even their brothers and grandmother couldn’t tell them apart. (Twins tend to be most similar at birth.) But they’re not the same. Sabine, born first, has always been a bit bigger; and she’s left-handed, while Ila is right-handed. And their mother says their voices are quite distinct.   Allison and Amanda Chan  Age: 16 Live in: San Francisco Their parents and close friends can easily tell them apart, but others get confused. They’re almost always together, which might be why they tend to finish each other’s sentences. “We’ve never been separated for more than a day,” Amanda says. They agree that Amanda is more studious and more of a rule-follower, while Allison (older by one minute) is more outgoing, and more mischievous.   John and William Grady  Age: 30 Live in: Berkeley and San Francisco William became the Exploratorium’s Manager of Custodial Services soon after John left that same job. Some museum staff didn’t realize he was a different person. But compare them closely, and you’ll find that William’s a bit taller and heavier than John. John is married, while William is still single. And John is more outgoing.   Brian and Anthony Pancharoen  Age: 41 Live in: Vallejo and Benicia The children of Thai immigrants, Anthony and Brian are both firefighters for the San Francisco Fire Department (Anthony started six months before Brian). Growing up, their parents dressed them in different colors (Anthony, red; Brian, blue). Anthony’s half an inch taller, more outgoing, and loves to cook. Brian is quieter and more artistic. Anthony’s divorced, while Brian’s engaged.   Andrea and Amy Barish  Age: 58 Live in: Marin County and Oakland Amy and Andrea weren’t certain that they were identical twins until they got a genetic test at age 40. And while acquaintances sometimes mix them up, they’re less alike than most twins. Andrea’s an inch and a half taller. She’s also had breast cancer, while her sister hasn’t. Andrea’s more adventuresome, and Amy’s more mechanically inclined.   Hannah Nunn and Helen Colcord  Age: 81 Live in: Napa and Portola Valley All but inseparable as girls, Helen and Hannah wore matching clothes, answered to each other’s names, and sometimes even went on dates for each other. Then in high school their parents sent them to separate boarding schools where they began developing their own identities. Hannah studied ballet at the University of Utah, married, and moved to California, while Helen studied art at Bennington College, and moved to New York City to work in design. (They both later worked in interior design.) After some 50 years on opposite coasts, Helen recently rejoined Hannah in they Bay Area. “But I still feel like an east coast person,” she says.", "phenomena": [], "keywords": []},
{"id": "time-shift", "title": "Time Shift", "aliases": "Shifting Time", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Ken Murphy , 2013", "collection_id": [], "related_id": ["sweepers-clock", "tinkerers-clock", "timepieces"], "tagline": "Select archived time-lapse sequences that reveal human and natural processes at work.", "description": "", "whats_going_on": "", "going_further": "", "details": " Time Shift is a visual work that allows viewers to browse and select from an archive of time-lapse image sequences that reveal human and natural processes—many of which might otherwise go unnoticed—at work in the local landscape. Artist Ken Murphy photographed scenes throughout the Bay Area, including locations that are within sight of the Fisher Bay Observatory Gallery.", "phenomena": [], "keywords": []},
{"id": "the-atmosphere-a-guide", "title": "The Atmosphere: A Guide", "aliases": "", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Amy Balkin , 2013", "collection_id": [], "related_id": ["sky-theater", "research-buoy", "bay-lexicon"], "tagline": "See human influences on the sky and their accumulated traces.", "description": "", "whats_going_on": "", "going_further": "", "details": " The Atmosphere: A Guide is a poster-essay depicting various human influences on the sky and their accumulated traces, whether chemical, narrative, spatial, or political. Visually referencing the Cloud Code Chart, another interpretive aid for looking up, the guide visualizes some ways that humans literally and figuratively occupy the present, past, and future atmosphere, organized from sea level to the exosphere.", "phenomena": [], "keywords": []},
{"id": "tactile-dome", "title": "Tactile Dome", "aliases": "Tactile Gallery, The Dome", "location": "This exhibit is not currently on view.", "byline": "August Coppola , 1971", "collection_id": [], "related_id": ["bronze-hand", "velvet-hands", "black-sand"], "tagline": "Take an interactive excursion through total darkness.", "description": "Originally created in 1971 , the Tactile Dome was designed and built by Dr. August F. Coppola (father of actor Nicolas Cage and brother of filmmaker Francis Ford Coppola and actress Talia Shire). The Tactile Dome was redesigned and rebuilt for Pier 15 and opened in 2013.  You can journey through total darkness in this twisting, turning, tactile sculpture. Walk, crawl, climb, and slide your way through a wonderland of textures using only your sense of touch as a guide. ", "whats_going_on": "", "going_further": "", "details": " Tactile Dome Reservations ", "phenomena": ["Blackness"], "keywords": []},
{"id": "sweepers-clock", "title": "Sweeper's Clock", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Maarten Baas , 2010", "collection_id": [], "related_id": ["tinkerers-clock", "timepieces", "time-shift", "time-to-think"], "tagline": "Two performers replicate an analog clock by sweeping two piles of garbage.", "description": "", "whats_going_on": "", "going_further": "", "details": "Maarten Baas combines theater, art, film, and design in Sweeper's Clock to make a 12-hour-long movie in which two performers replicate an analog clock by sweeping two piles of garbage (one for the hour hand, one for the minute hand) to indicate the time.", "phenomena": [], "keywords": []},
{"id": "survival-game", "title": "Survival Game", "aliases": "Cattle Game, Cows, Need-Based Transfer Economy, The Cow Game", "location": "Osher Gallery 1: Human Phenomenon", "byline": "David Torgersen , 2017", "collection_id": ["science-of-sharing"], "related_id": ["making-meaning", "text-fish", "sort-and-switch", "team-snake"], "tagline": "Keep your herd alive—with a little help (maybe) from your friends.", "description": "Players struggle to keep their livestock herds alive and thriving—despite disease, drought, and other dangers. When your neighbor suffers a major loss, the question arises: Can you afford to share? But the real question may be, can you afford not to? ", "whats_going_on": "The Survival Game is based on the lives of Maasai cow herders in Africa. The Maasai live on milk and meat from their herds. When rains are heavy, cows have plenty of grass to eat, and herds and people alike thrive. But when rains are poor and cows starve or get sick, herders ask neighbors for cows to tide them over. “Lucky” herders share with “unlucky” ones because they may need help in the future. The Maasai refer to these helping relationships as osutua , or “umbilical cord.” This cooperation helps Maasai communities remain intact when disaster strikes. This exhibit was designed with the Human Generosity Project , a group of scientists studying osotua and other mutual aid systems around the world.", "going_further": "", "details": "", "phenomena": ["Economic Exchange", "Resource Sharing"], "keywords": ["cooperation", "human generosity project"]},
{"id": "sun-swarm", "title": "Sun Swarm", "aliases": "Rotating Light", "location": "Gallery 5: Outdoor Exhibits", "byline": "Artist Chris Bell , 2013", "collection_id": [], "related_id": ["rotating-shadow-house", "sun-dial", "sun-painting", "sophisticated-shadows"], "tagline": "Mounted mirrors sway with the tide in unpredictable ways, dispersing sunlight across the deck.", "description": "", "whats_going_on": "", "going_further": "", "details": "An elevated topography of silvered squares inserted between the water and the sky, Sun Swarm is an architectural intervention that collects and disperses bits of sunlight across the deck of Pier 17. Clusters of tiny mirrors on the end of steel rods reach up from a series of pier pilings, swaying with the tide in unpredictable ways. Stretching for nearly 75 feet, Sun Swarm is an understated and elegant complement to the natural light play that occurs elsewhere over the water.  Sun Swarm was redesigned and reinstalled in 2019.", "phenomena": [], "keywords": ["mirrors", "sun"]},
{"id": "scent-memories", "title": "Scent Memories", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "Plant scents can evoke powerful memories.", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español         Gently crush different plant materials using a mortar and pestle, and discover what scents and memories they release.   About the Plant Scents   Citrus Leaves Citrus leaves smell like citrus fruit, mixed with grass. The same oils that give fruit like oranges, lemons, and limes their bright scent are also found in the leaves.  Rose Petals Rose petals have a sweet, heavy smell. Many cultures make tea from rose hips or use the petals for perfume. In Ohlone stories, the rose plant is a beloved character, who heals the sick.  Fatwood Fatwood, called “ocote” in Mexico, is wood from the heart of an old pine tree. The wood is rich in sap and resin, which makes it a good for starting fires and gives it a distinctive smell.  Juniper Berries Juniper berries are a key ingredient in gin. You might recognize their piney scent from a fancy cocktail.  Mint Mint is popular in many cuisines, and there are hundreds of varieties. In the Bay Area, you can find a wild mint called yerba buena growing in forested areas.  Beet Greens and Potato Skins Beet greens and potato skins contain a chemical called geosmin, which smells like soil after a rain.  Bay Laurel, or sokóote “sokóote is an important plant for Ohlone people. We gather all parts of this respected plant: its leaves are used for ceremonial, culinary, and medicinal purposes; its fruit and nuts are eaten as a fine delicacy; its wood is made into beautiful cultural objects such as stick dice, a traditional Ohlone game; sokóote boughs are wrapped into wreaths worn around the head, interspersed with springtime flowers. Its smell is beloved by Ohlone people as sokóote is intensely aromatic—both sweet and peppery at the same time.” —Vincent Medina and Louis Trevino, East Bay Ohlone and Rumsen cultural leaders    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "plant-tunes", "title": "Plant Tunes", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "Connect with a plant to make music.", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español         Touch a plant to unlock beautiful music. You and a partner create an electrical connection via metal pads and a live plant.   What’s Going On?   By touching the plant and both arm rests, you and your partner complete an electrical circuit that’s built into this bench. Both plants and people are mostly made of salty water, which conducts electricity. So the mild electric current flows through you, your partner, and the plant, turning on the music.    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "community-garden", "title": "Jardín comunitario,", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "¿Puede un jardín transportarte a otro lugar?", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   English         ¿Puede un jardín transportarte a otro lugar? Andi Xoch cree que sí. Su trabajo explora la forma en que los jardineros del barrio latino de Boyle Heights, Los Ángeles, crean espacios al aire libre personalizados. Esta instalación está inspirada en los jardines comunitarios de todo el vecindario. Con plantas de alimentos, flores y lugares para relajarse, el espacio responde a las necesidades prácticas y espirituales de la comunidad.   Crear con lo que haya   Al construir esta instalación, hemos recurrido, siempre que ha sido posible, a objetos usados en lugar de nuevos. No solo es una opción sostenible, sino también es estilística. La colaboradora Andi Xoch de Latinx with Plants alentó al Exploratorium a adoptar la estética de diseño llamada rasquachismo . La palabra “rasquache” se refirió alguna vez a algo barato o reutilizado. Los artistas chicanos inventaron el rasquachismo en los años 60 y 70, inspirados en los objetos inteligentemente reutilizados de sus comunidades.  “El Rasquachismo es un movimiento artístico de clase trabajadora y una práctica artística que nos conceden nuestras matriarcas migrantes. Está arraigada en el ingenio y es una expresión estética de los desamparados. La idea es crear algo de belleza a través de un ingenio ferviente”. —Andi Xoch, Latinx with Plants    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "plant-tunes", "title": "Melodías de plantas", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "", "collection_id": [], "related_id": [], "tagline": "Conéctate con una planta para hacer música.", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   English         Toca una planta para desbloquear música hermosa. Tú y un compañero crean una conexión eléctrica a través de almohadillas metálicas y una planta viva.   ¿Qué está sucediendo?   Al tocar la planta y ambos reposabrazos, tú y tu compañero/a completan un circuito eléctrico que está integrado en este banco. Tanto las plantas como las personas están compuestas principalmente de agua salada, que conduce la electricidad. Así que la corriente eléctrica leve fluye a través de ti, tu compañero/a y la planta, y enciende la música.    ", "whats_going_on": "", "going_further": "", "details": " ", "phenomena": [], "keywords": []},
{"id": "sun-painting", "title": "Sun Painting", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Artist Robert Larue (Bob) Miller , 1971", "collection_id": ["artist-in-residence", "colorfest", "seeing"], "related_id": ["colored-shadows", "soap-film-painting", "newtons-prism", "spectral-meadow"], "tagline": "Sunlight–reflected and refracted–paints an ever-changing color composition.", "description": "Created by artist Bob Miller, this classic Exploratorium exhibit is a “live” painting that uses light from the Sun as its palette. ", "whats_going_on": "On the roof of the museum, a device called a heliostat tracks the Sun throughout the day and reflects the Sun’s light through a window in the roof. Mirrors direct the sunlight through two banks of prisms, breaking it up into a rainbow of spectral colors. These dispersed colors are then recombined (thanks to more mirrors) on a giant screen “canvas” as a delicate, complex, and ever-changing pattern of color.  This extraordinary painting in light is a perpetual work in progress, responding to changing light conditions and to the presence of viewers, who, with their bodies, can block and sculpt the light that reaches the screen. (click image to enlarge)  Poet Muriel Rukeyser was so taken with this exhibit that she was inspired to write a poem about it, which she dedicated to the artist, Bob Miller. An excerpt from her poem accompanies the exhibit; the complete text appears below.   The Sun Artist for Bob Miller I The opening of the doors. Dark. The opening of the large doors. Out of the daylight and the scent of trees and that lake where generations of swans no longer move among children. In a poisoned time. But the bright-headed children move. Dark, high, the beams of a huge building exposed in the high dark air. I see brightness with a shock of joy. II Past the darkness a lashing of color. Not color, strands of light. Not light but pure deep color beyond color, like the pure fierce light I once knew, before a minute of blindness. These colors are deeper; the entire range in its millions, twisting and brilliant traveling. III I stand in the strong sun before a bank of prisms. On the screen in front of me, tangled colors of light, twined, intertwined. A sensitive web of light changing, for the sun moved, the air moves The perceiver moves. I dance my slow dance. IV The deepest blue, green, not the streams of the sea, the clear yellow of yellows, not California, more, not Mediterranean, not the Judean steeps. Red beyond blood over flame, more even than visionary America.  All light, A man braced on the sun, where the sun enters through the roof, where the sun-follower, A man-made motor with a gentle motion just counters the movement of the earth, holds this scene in front of us on the man-made screen. Light traveling, meets, leaps and becomes art. V Colors move on a screen. The doors open again. They run in, the California children. They run past the colors and the colors change. The laughter of running. They cry out, bird-voices, ninety seven children,Wow! Wow! Howcome? VI Another day. I stand before the screen, Alone I move, selecting out my green, choose out the red with my arm, I let the orange stand, a web of yellow, the blue stays and shines. I am part of the color, I am part of the sun. VII You have made an art in which the sun is standing. It changes, goes dark, goes grey. The sun appears. You have led me through eleven states of being. You have invited us all. Allow the sunlight, dance your dance. VIII Another day. No sun. the fog is down, doing its slow dance into the city, it enters the Gate and my waking. There will be no colors but the range of white. Before the screen, I wait.", "going_further": "Poet Muriel Rukeyser was so taken with this exhibit that she was inspired to write a poem about it, which she dedicated to the artist, Bob Miller. An excerpt from her poem accompanies the exhibit; the complete text appears below.   The Sun Artist for Bob Miller I The opening of the doors. Dark. The opening of the large doors. Out of the daylight and the scent of trees and that lake where generations of swans no longer move among children. In a poisoned time. But the bright-headed children move. Dark, high, the beams of a huge building exposed in the high dark air. I see brightness with a shock of joy. II Past the darkness a lashing of color. Not color, strands of light. Not light but pure deep color beyond color, like the pure fierce light I once knew, before a minute of blindness. These colors are deeper; the entire range in its millions, twisting and brilliant traveling. III I stand in the strong sun before a bank of prisms. On the screen in front of me, tangled colors of light, twined, intertwined. A sensitive web of light changing, for the sun moved, the air moves The perceiver moves. I dance my slow dance. IV The deepest blue, green, not the streams of the sea, the clear yellow of yellows, not California, more, not Mediterranean, not the Judean steeps. Red beyond blood over flame, more even than visionary America.  All light, A man braced on the sun, where the sun enters through the roof, where the sun-follower, A man-made motor with a gentle motion just counters the movement of the earth, holds this scene in front of us on the man-made screen. Light traveling, meets, leaps and becomes art. V Colors move on a screen. The doors open again. They run in, the California children. They run past the colors and the colors change. The laughter of running. They cry out, bird-voices, ninety seven children,Wow! Wow! Howcome? VI Another day. I stand before the screen, Alone I move, selecting out my green, choose out the red with my arm, I let the orange stand, a web of yellow, the blue stays and shines. I am part of the color, I am part of the sun. VII You have made an art in which the sun is standing. It changes, goes dark, goes grey. The sun appears. You have led me through eleven states of being. You have invited us all. Allow the sunlight, dance your dance. VIII Another day. No sun. the fog is down, doing its slow dance into the city, it enters the Gate and my waking. There will be no colors but the range of white. Before the screen, I wait.", "details": "", "phenomena": ["Color", "Color Mixing", "Dispersion", "Electromagnetic Radiation Spectrum", "Light Production", "Reflection", "Refraction", "Scattering", "Shadows"], "keywords": ["sun", "prisms"]},
{"id": "still-life", "title": "Still Life", "aliases": "", "location": "Gallery 4: Living Systems", "byline": "Artist Sam Taylor-Wood , 2001", "collection_id": [], "related_id": ["energy-from-death", "big-wood-300-years-of-photosynthesis"], "tagline": "An impossibly beautiful bowl of fruit decays at an accelerated pace via time-lapse editing.", "description": "", "whats_going_on": "", "going_further": "", "details": "In the celebrated film Still Life , an impossibly beautiful bowl of fruit decays at an accelerated pace via time-lapse editing, transforming a timeless scene into a visceral memento mori. The work has been placed in close proximity to Energy from Death, a floor exhibit concerning decay and the transfer of energy from one form to another. On loan from the Doris and Donald Fisher Collection.", "phenomena": [], "keywords": []},
{"id": "spectral-meadow", "title": "Spectral Meadow", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Pete Stephens, 2013", "collection_id": [], "related_id": ["sun-painting", "mood-lighting", "soap-film-painting", "colored-shadows"], "tagline": "Watch the patterns change as the Earth turns and the Sun moves across the sky.", "description": "", "whats_going_on": "", "going_further": "", "details": " Spectral Meadow is an art piece comprised of an array of patches of colored light created by the transmission of sunlight through diffraction gratings covering the windows above Osher Gallery 1. These gratings spread light into rainbows more efficiently than do prisms. My intent was to provide an intense color experience for the very young, who seem to like to crawl on the floor engulfed in a field of color—but adults seem to appreciate the experience as well. The colorful patches change throughout the day as the Earth turns and the Sun moves across the sky. Many have speculated about the connection between this piece, which is certainly a celebration of the rainbow, with the rainbow flag. To me, rainbows are a symbol of inclusiveness of all living things. The rainbow is the ultimate symbol of an inclusive cosmos, as it fades from our visibility into the infrared at one end and the ultraviolet at the other, implying an unbroken continuum with the invisible energies of the total universe. Pete Stephens, Exhibit Developer", "phenomena": ["Diffraction"], "keywords": []},
{"id": "sound-bite", "title": "Sound Bite", "aliases": "Bite-O-Phone", "location": "This exhibit is not currently on view.", "byline": "Mary Elizabeth Yarbrough , 2006", "collection_id": ["listen"], "related_id": ["chladni-singing", "oscylinderscope", "aeolian-harp", "out-quiet-yourself"], "tagline": "Listen with your bones.", "description": "Bite down on a straw and listen to music that only you can hear, as sound travels to your inner ear via your teeth and bones. ", "whats_going_on": "Ordinarily, you hear sounds when vibrations traveling through the air get captured by the outer ear (or pinna ) and sent to the inner ear (or cochlea ), where they are transformed into nerve impulses and sent to the brain. Here, sound waves from a vibrating rod travel directly to your inner ear via bone conduction —sound vibrations travel through your teeth and bones when you bite down on the rod. Sound travels much more efficiently through solids than through air. A person biting the rod can hear music loud and clear, others standing nearby don’t hear a thing.  This early hearing aid, called a Dentaphone, worked by bone conduction; using it required biting down on a sheet of hardened rubber. Some modern hearing aids still rely on bone conduction—but through the skull, not the teeth. Photo courtesy of Becker Medical Library, Washington University School of Medicine. (click image to enlarge) ", "going_further": "", "details": "", "phenomena": ["Resonance"], "keywords": ["vibration"]},
{"id": "square-wheel", "title": "Square Wheel", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Richard Gagnon and Claire Pillsbury", "collection_id": [], "related_id": [], "tagline": "A square wheel can roll smoothly—if the \"road\" is the right shape.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "sophisticated-shadows", "title": "Sophisticated Shadows", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Artist Robert Larue (Bob) Miller , 1979", "collection_id": ["artist-in-residence", "seeing-the-light", "young-kids"], "related_id": ["colored-shadows", "gray-step", "shadow-box", "rotating-shadow-house"], "tagline": "Explore images made from shadows.", "description": "If you think shadows are a straightforward business, prepare for a surprise—actually, a whole bunch of surprises. Combining various light sources in various ways, you’ll quickly discover that there’s nothing simple about a simple shadow. ", "whats_going_on": "There’s really no end to the discoveries possible at this exhibit. But there’s one phenomenon that most people find delightfully baffling: Hold up a screen with holes of various shapes punched in it—a circle, a square, a star—and the patterns of light and shadow made by each aren’t at all what you’d expect. You don’t see a circle, a square, or a star—but instead an upside-down image of the letter F—which happens to be the shape of the light source. Light passing through small holes or gaps behaves like light in a pinhole camera—light rays from the source cross and invert as they make their way through the hole. Provided the light source is far enough away, the exact shape of the hole doesn’t matter. Similar optics are in play when you see dappled circles of light beneath a leafy tree. Those perfect circles of light don’t come from perfectly circular gaps between the leaves—they are images of the circular Sun.   During an eclipse, it’s easy to see that light passing through a small hole takes the shape not of the hole, but of the light source. (click image to enlarge) ", "going_further": "", "details": "", "phenomena": ["Image Formation", "Lateral Inhibition", "Parallax", "Projections", "Shadows"], "keywords": []},
{"id": "solar-hour-benches", "title": "Solar Hour Benches", "aliases": "Sun Benches", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Rebecca Cummins and Woody Sullivan , 2013", "collection_id": [], "related_id": ["oculus-table", "sun-dial", "timepieces", "rotating-shadow-house"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "The Solar Hour Benches are a set of six oval benches, each with a slit aperture aligned with the Sun for one particular hour: 10:00 a.m., 11:00 a.m., noon, 1:00 p.m., 2:00 p.m. or 3:00 p.m. solar time. Throughout the year, for only twenty minutes before and after the corresponding hour, sunlight travels through the aperture and projects onto inscriptions on the ground. Scientific and cultural aspects of time and sundials are also depicted on each bench.", "phenomena": ["Shadows"], "keywords": ["sun", "sundial"]},
{"id": "sip-or-squirt", "title": "Sip or Squirt", "aliases": "Drinking Fountain, Trust Fountain", "location": "This exhibit is not currently on view.", "byline": "Chris Cerrito , 2014", "collection_id": ["science-of-sharing"], "related_id": ["making-meaning", "team-snake", "sort-and-switch", "career-criminal"], "tagline": "Do you trust your partner—or wind up all wet?", "description": "This two-person drinking fountain was inspired by the Prisoner's Dilemma , a famous paradox of game theory: Do you choose to sacrifice your companion—and to some degree yourself—rather than risk being a trusting chump? ", "whats_going_on": "The original Prisoner’s Dilemma centers on two accused criminals deciding whether or not to rat on their partner, with the least punishment only possible if both decide to trust one other. The concept applies more broadly though to economics, politics, environmental issues, and even sports. In professional cycling, for example, many athletes engage in doping out of fear of being the only person not doping. Can you think of a Prisoner’s Dilemma you’ve encountered in your own life?  This rubric details the possible outcomes based on your choice—and your partner’s. As in other Prisoner’s Dilemma scenarios, the best outcome for all requires trust on both parts. (click image to enlarge)  Gutwill, J. P., and Dancstep (née Dancu), T. 2017. “ Boosting Metacognition in Science Museums: Simple Exhibit Label Designs to Enhance Learning .”", "going_further": "", "details": "", "phenomena": ["Metacognition", "Prisoner's Dilemma", "Social Dilemma"], "keywords": []},
{"id": "soap-film-painting", "title": "Soap Film Painting", "aliases": "Bubble Well, Bubble Sheet", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Kit Kube, 1985", "collection_id": ["boundaries", "colorfest", "seeing-the-light", "young-kids"], "related_id": ["monochromatic-room", "newtons-prism"], "tagline": "A thin window of soap creates an ever-shifting array of colors.", "description": "Soap film hits the big time at this exhibit, featuring a giant square soap bubble the size of a picture window. The cascading colors you see here arise from overlapping light waves that reflect from the front and back surfaces of the soap film—a phenomenon called interference . ", "whats_going_on": "This five-foot-square soap film, created by pulling a cord, is a soapy-water sandwich, with two outside layers of soap molecules around an inner layer of soapy water. The thickness of the soap film changes as the water drains down the inside of the film. When white light (made up of many colors) shines on the soap film, some of the light is reflected and the rest is transmitted through to the rear surface. At the rear surface of the soap film, more of the light is reflected back to your eyes. The light reflecting from the front of the film meets up with the light reflecting from the back of the film, and the waves overlap. It’s this overlapping of the light waves that creates the beautiful interference colors you see on the soap film. Interference colors are created as two reflected waves overlap and line up either in phase or out of phase. If two waves line up in phase—that is, with crests together and troughs together—we say that the waves are interfering constructively. When two waves line up out of phase, crest to trough, we say that the waves are interfering destructively.   Constructive interference  Destructive interference White light can be considered a mixture of three additive primary colors: red, green, and blue. If the thickness of the soap film is just right to cause the destructive interference of one of these additive primaries, you perceive a mixture of the two remaining colors:  white – red = blue + green = cyan (bluish green)   white – green = red + blue = magenta (reddish blue)   white – blue = red + green = yellow  In other words, everywhere you see yellow, the film is just the right thickness to destructively interfere with the blue light waves, removing them. Where you see cyan, the red light has been removed. And where you see magenta, the green light has been removed. When all the colors disappear, watch out: the soap film has gotten so thin that it’s about to pop.  You can find interference colors in all sorts of places—including butterfly wings, opal, oil slicks, and peacock feathers. (click image to enlarge)  If you wet your hand in the soapy water, you may be able to put your fingers through the film. You can also use a plastic ring to put a porthole in the bubble wall. The surface tension that allows a soap film to form is caused by the tendency of water to minimize its surface area. Soap reduces surface tension by separating water molecules from each other. When a finger, pencil, or piece of PVC pipe is coated with bubble solution and inserted into the soap film, the film stays in contact with the object without disruption. But a dry finger interrupts the continuity of the reduced surface tension “membrane,” causing the bubble to burst.", "going_further": "If you wet your hand in the soapy water, you may be able to put your fingers through the film. You can also use a plastic ring to put a porthole in the bubble wall. The surface tension that allows a soap film to form is caused by the tendency of water to minimize its surface area. Soap reduces surface tension by separating water molecules from each other. When a finger, pencil, or piece of PVC pipe is coated with bubble solution and inserted into the soap film, the film stays in contact with the object without disruption. But a dry finger interrupts the continuity of the reduced surface tension “membrane,” causing the bubble to burst.", "details": "", "phenomena": ["Color", "Color Mixing: Subtractive", "Fluid Mechanics", "Interference", "Iridescence", "Reflection", "Surface Tension of Liquids", "Superposition", "Thin Films"], "keywords": ["bubbles", "cells", "membrane", "model", "soap", "wavelength"]},
{"id": "shadow-box", "title": "Shadow Box", "aliases": "Capture a Moment in Time, Light Box", "location": "Crossroads: Getting Started", "byline": "Artist Carl Bucher, 1973", "collection_id": ["artist-in-residence", "colorfest", "seeing", "young-kids"], "related_id": ["colored-shadows", "water-drop-photography", "recollections", "time-to-think"], "tagline": "Capture a moment in time.", "description": "A bright flash of light illuminates a phosphorescent wall—imprinting temporary shadows that capture a moment in time. ", "whats_going_on": "A strobe light and a giant phosphorescent screen offer endless posing possibilities in this popular and long-lived exhibit favorite. The shadow-catching phosphorescent material on this wall is the same as you’ve probably seen in various “glow-in-the-dark” products. Energy from incoming light gets absorbed in this material in the form of excited electrons, that is, electrons raised to a higher energy state. As these electrons gradually de-excite, they release their energy as a visible glow.  Glow-in-the-dark products contain phosphorescent compounds—usually either zinc sulfide or strontium aluminate—that absorb the energy of incoming light and then release it over time. Photo © Lưu Ly. ", "going_further": "", "details": "", "phenomena": ["Phosphoresence", "Shadows"], "keywords": []},
{"id": "sharing-faces", "title": "Sharing Faces", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Artist Kyle McDonald and Doug Thistlewolf , 2019", "collection_id": ["middle-ground"], "related_id": ["unseen-stories", "pulling-together"], "tagline": "See yourself in the faces of others.", "description": "Sit down at this new-media exhibit and you'll see someone else's face looking back at you. When you move around or make a face, your movements and expressions are matched by images of countless others who have done the same thing. How does it feel to see your expressions reflected back at you in other people's faces? Do you feel a sense of connection with others? ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "sky-theater", "title": "Sky Theater", "aliases": "Heliorama, Sky Panorama", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Terence McArdle , 2013", "collection_id": [], "related_id": ["oculus-table"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": " Sky Theater is a rear-projected enclosure designed to reveal and celebrate the unseen patterns of the daytime sky. Viewers enter and experience an unobscured 360° view (with correct compass orientation) of the sky in miniature, creating the illusion of a private sky-space mimicking what one would see standing atop the Fisher Bay Observatory. A composite of annotated time-lapse images allows visitors to see one year compressed into a single day, with multiple Suns—tracing the equinox and two solstices—simultaneously marching across the sky.", "phenomena": [], "keywords": []},
{"id": "seismograph", "title": "Seismograph", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Thomas Humphrey , 1978", "collection_id": ["faultline"], "related_id": ["aeolian-harp", "chladni-singing", "oscylinderscope", "sound-bite"], "tagline": "Stamp your feet and make a miniature earthquake.", "description": "This seismograph is an earthquake detector that records the up-and-down motion of the ground—whether made by tectonic activity or by you. ", "whats_going_on": "This seismograph records ground movements using an electromagnetic motion sensor. The basic components of the motion sensor are a suspended coil of wire and a magnet that’s attached to the floor. When the floor moves, the magnet moves with it, inducing a small electrical current in the coil. An amplifier then boosts this current so it’s strong enough to move the pen on the revolving drum, creating a graph of the motion—also known as a seismograph. Seismographs measure not only the seismic waves emanating from an earthquake, but also their precise time of arrival. By comparing the data collected by several seismographs in different places, scientists can determine the true strength of an earthquake and locate its starting point, or epicenter .", "going_further": "Seismographs measure not only the seismic waves emanating from an earthquake, but also their precise time of arrival. By comparing the data collected by several seismographs in different places, scientists can determine the true strength of an earthquake and locate its starting point, or epicenter .", "details": "", "phenomena": ["Exponentials", "Frequency"], "keywords": ["earthquakes"]},
{"id": "seeing-and-listening-explainer-station", "title": "Seeing and Listening Explainer Station", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": ["explainer-demonstrations"], "related_id": ["living-systems-explainer-station", "human-phenomena-explainer-station"], "tagline": "", "description": "Explainers are stationed throughout the Exploratorium doing structured and open-ended demonstrations. Ask an orange-vested Explainer to help you explore. ", "whats_going_on": "", "going_further": "", "details": " Light Explore all things light! Make a working lightbulb model and play games comparing different unknown light sources.  Speaker Dissection Tune in to surrounding sounds by experimenting with strings and vibrations, and use electromagnets to build a basic speaker. Learn how to listen with your bones, and explore the workings of the inner ear.  Cow's Eye Dissection Do cows see color? How does a lens work? Examine the intricate structure of a cow eye to learn about similar structures in our own eyes, as well as some key differences.", "phenomena": ["Electromagnetic Forces", "Image Formation", "Refraction"], "keywords": ["eyes", "dissection", "lasers", "speakers"]},
{"id": "scrapple", "title": "Scrapple", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Golan Levin, 2013", "collection_id": [], "related_id": [], "tagline": "Everyday objects are placed on a table and interpreted as sound-producing marks in an \"active score.\"", "description": "", "whats_going_on": "", "going_further": "", "details": "This audiovisual installation uses everyday objects placed on a table that are interpreted as sound-producing marks in an \"active score.\" Scrapple works as a simple form of augmented reality: the system scans the table surface as if it were a kind of music notation, producing a four-second music loop in real time from any objects lying there. The installation makes use of a variety of playful forms; in particular, long, flexible curves allow for the creation of variable melodies, while an assemblage of cloth shapes and small objects yield ever-changing rhythms. Visitors can experiment freely with tangible, interactive audiovisual composition.", "phenomena": [], "keywords": []},
{"id": "saltscapes", "title": "Saltscapes", "aliases": "Salt Ponds from the Sky", "location": "Gallery 4: Living Systems", "byline": "Artist Cris Benton , 2013", "collection_id": [], "related_id": ["life-in-a-drop-of-water", "when-water-turns-red-it-means-is-salt-forming"], "tagline": "Aerial views reveal otherwise hidden colors and textures.", "description": "", "whats_going_on": "", "going_further": "", "details": "The South San Francisco Bay salt evaporation ponds take on a variety of colors due to halophilic organisms that adapt to the various salinities of the ponds. Photographer Cris Benton captures this vibrant landscape in a series of aerial photos taken from homemade kite-cameras flown over the ponds.", "phenomena": [], "keywords": []},
{"id": "rift-zone", "title": "Rift Zone", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Artist Ned Kahn , 1993", "collection_id": ["turbulent-landscapes"], "related_id": ["aeolian-landscape", "avalanche"], "tagline": "Bubbling sand evokes a geothermal landscape.", "description": "", "whats_going_on": "", "going_further": "", "details": "Rift Zone uses air bubbling up through fine sand to suggest a small-scale geothermal landscape. By turning a knob, viewers can change the pressure of the air rising up through the sand and alter the shapes and patterns of the landscape. The aerators that activate the sand are arranged in a composition of three elements: a circle, a line and a dot, corresponding to the three kinds of rift zones that occur on earth: solitary volcanoes, fracture zones such as the one spreading on the island of Hawaii, and the ring dike that forms in the crater of a volcano as the central plug cools and then a new eruption occurs around the perimeter in a circle.", "phenomena": [], "keywords": ["sand", "volcanoes"]},
{"id": "research-buoy", "title": "Research Buoy", "aliases": "NOAA Buoy", "location": "Gallery 5: Outdoor Exhibits", "byline": "", "collection_id": [], "related_id": ["visualizing-the-bay-area"], "tagline": "This NOAA buoy gathers data on CO 2 levels, which are increasing in our oceans and affecting marine life.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "rolling-through-the-bay", "title": "Rolling Through the Bay", "aliases": "Toothpick Roller Coaster, Toothpick Sculpture", "location": "Gallery 2: Tinkering", "byline": "Artist Scott Weaver , 2003", "collection_id": [], "related_id": ["coupled-pendulums", "pendulum-snake", "tinkerers-clock"], "tagline": "Ping-pong balls take a spin through a toothpick San Francisco.", "description": "Artist Scott Weaver has been painstakingly constructing this replica of the city of San Francisco out of toothpicks since 1974. Ping-pong balls added here or there wind their way through the model, visiting various famous sites along the way. ", "whats_going_on": "This work-in-progress by charismatic artist Scott Weaver has a permanent home at the Exploratorium—lucky visitors may run into the artist himself, busily making additions. It’s made from nothing but toothpicks—118,423 1 / 2 of them, at last count—and wood glue. There are 15 different entrance points for ping-pong balls, each conducting a different “tour” through the toothpick city. There are countless “Easter egg” surprises hidden in this sculpture. Can you find the toothpick heart Scott left in San Francisco? (Hint: Look in the Palace of Fine Arts rotunda.)", "going_further": "", "details": "", "phenomena": ["Energy: Kinetic", "Energy: Potential"], "keywords": ["model", "ping pong balls"]},
{"id": "redblue", "title": "Red/Blue", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Chris Cerrito , 2014", "collection_id": ["science-of-sharing"], "related_id": ["team-snake", "text-fish", "freeloader", "survival-game"], "tagline": "Even randomly formed groups can generate instant rivalries.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "red-phone", "title": "Red Phone", "aliases": "Cooperative Red Phone", "location": "This exhibit is not currently on view.", "byline": "Lauren Allen, 2011", "collection_id": ["mind"], "related_id": ["survival-game", "team-snake", "freeloader", "redblue"], "tagline": "Want to see what's inside? You'll need help!", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "lumen-illusion", "title": "Lumen-Illusion", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Artist-in-Residence Christian Schiess , 1983", "collection_id": ["artist-in-residence"], "related_id": ["flourish-bloom", "animation-tower", "silage-beach"], "tagline": "Flashing lights create the illusion of motion.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Afterimage", "Apparent Motion", "Color", "Color Mixing", "Motion Detection", "Patterns", "Persistence of Vision", "Phase", "Time Effects in Perception"], "keywords": ["Neon"]},
{"id": "machine-with-concrete", "title": "Machine with Concrete", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Artist Arthur Ganson , 1992", "collection_id": [], "related_id": ["your-turn-counts"], "tagline": "Movement is reduced to stillness, given an astronomical gear ratio.", "description": "", "whats_going_on": "", "going_further": "", "details": "Legendary kinetic and mechanical sculptor Arthur Ganson has lent us one of his simplest and most potent works. A motor is connected to a block of concrete via a simple system of gears. The final gear, embedded in concrete, is set up to make one revolution once every 13.7 billion years, yet the machine whirs uninterrupted.", "phenomena": [], "keywords": []},
{"id": "look-into-infinity", "title": "Look Into Infinity", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Robert Larue (Bob) Miller", "collection_id": ["seeing-the-light"], "related_id": ["duck-into-a-kaleidescope", "anti-gravity-mirror", "giant-mirror", "cylindrical-mirror"], "tagline": "Reflections bounce back and forth into infinity.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Image Formation", "Patterns", "Reflection", "Symmetry"], "keywords": ["mirrors"]},
{"id": "live-chicken-embryos", "title": "Live Chicken Embryos", "aliases": "Chick Embryos, Chicken Eggs, Developing Chick Embryos", "location": "Gallery 4: Living Systems", "byline": "Charles Carlson and Denise King , 1980", "collection_id": ["cells-to-self", "cycles", "diving-into-the-gene-pool", "traits-of-life"], "related_id": ["look-inside-developing-fish", "can-you-spot-the-human", "are-your-cells-you", "give-heart-cells-a-beat"], "tagline": "Take a look at living chicken embryos in various stages of development.", "description": "It takes just 21 days for an egg to go from just laid to newly hatched chick, and a lot goes on in just the first week. Look closely and you’ll find blood vessels, a backbone, wing buds, eyes, a brain, and—throbbing prominently by day 5 or so—a beating heart. ", "whats_going_on": "The life of a chicken embryo begins inside the hen, before the egg is laid. A rooster deposits sperm into the hen’s reproductive tract. A sperm unites with a yolk cell, forming an embryo. The hard shell then grows around the yolk before it is laid. After an egg is laid, an incubated egg develops quickly. What starts as a white spot on day one develops visible blood vessels on day two. Four or five days after being laid, the embryo has a visible backbone and a beating heart. After six or seven days, the wing buds, eyes, and brain are visible.  Zoomable High-Resolution Image of a Chicken Embryo . © GigaMicro.", "going_further": "", "details": "", "phenomena": ["Embryonic Development", "Reproduction"], "keywords": ["embryology"]},
{"id": "look-inside-developing-fish", "title": "Look Inside a Developing Fish", "aliases": "DICE, Seeing Scientifically, Zebrafish Embryos", "location": "Gallery 4: Living Systems", "byline": "Joyce Ma , Eyal Shahar , and Kristina Yu , 2017", "collection_id": ["cells-to-self", "diving-into-the-gene-pool", "traits-of-life"], "related_id": ["live-chicken-embryos", "can-you-spot-the-human", "are-your-cells-you", "give-heart-cells-a-beat"], "tagline": "Use a microscope to investigate live embryos—developing eggs—from zebrafish.", "description": "Here you can see inside living zebrafish embryos, watch their blood circulate, and compare your own pulse to theirs. ", "whats_going_on": "Zebrafish are widely studied in biology, and for good reason. Not only are they hardy and easy to grow in a lab, their embryos are translucent, so it’s easy to observe how they develop from a single cell into a newly hatched fish. A fertilized zebrafish egg develops and hatches within 48 hours. It then takes three months for it to reach adulthood.  Although zebrafish don’t look much like humans, our embryos follow a similar path during early development, so we can study zebrafish to learn about human development. For example, there are genetic mutations in zebrafish that cause heart defects that are very similar to mutations that cause defects in human hearts. You may encounter some of these mutant zebrafish in this exhibit. They’re easy to spot because their strangely shaped hearts don’t pump blood very well. Website: FishScope: Time-Lapse Recordings and Confocal Images Dealing with the Developmental Biology of Fish. © 1995, 1996, 1997, 1998, 1999, and 2000 by Mark Cooper. Website: The Zebrafish Information Network (ZFIN). © University of Oregon, 1994–2018, Eugene Oregon.", "going_further": "Although zebrafish don’t look much like humans, our embryos follow a similar path during early development, so we can study zebrafish to learn about human development. For example, there are genetic mutations in zebrafish that cause heart defects that are very similar to mutations that cause defects in human hearts. You may encounter some of these mutant zebrafish in this exhibit. They’re easy to spot because their strangely shaped hearts don’t pump blood very well. Website: FishScope: Time-Lapse Recordings and Confocal Images Dealing with the Developmental Biology of Fish. © 1995, 1996, 1997, 1998, 1999, and 2000 by Mark Cooper. Website: The Zebrafish Information Network (ZFIN). © University of Oregon, 1994–2018, Eugene Oregon.", "details": "", "phenomena": ["Embryonic Development", "Microscopy", "Reproduction"], "keywords": ["embryology", "fish eggs", "model organisms", "zebrafish"]},
{"id": "listening-vessels", "title": "Listening Vessels", "aliases": "Whispering Dishes", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist Douglas Hollis , 1987", "collection_id": ["artist-in-residence", "listen"], "related_id": ["all-eyes-on-me", "giant-mirror", "archimedes", "focused-conversation"], "tagline": "Hear here—with the help of a giant parabolic “ear.”", "description": "Enormous parabolic sculptures transmit a conversation—or even a whisper—from one person to another across a great distance. ", "whats_going_on": "The parabolic shape of this pair of sculptures amplifies sound by reflection: Incoming sounds reflect from the surface of each vessel and get focused to a single spot called the focal point . The seats in each vessel are carefully situated to put this focal point roughly in the location of your own ears, allowing you to hear the faintest whisper—loud and clear—from across a crowded room.  The parabolic shape of the Listening Vessels serves to redirect sound to a signal point called the focal point—here labeled with an F. (click image to enlarge)  Before the invention of radar, acoustic mirrors made of concrete gave early warning of incoming enemy aircraft by concentrating the sound of their engines. (click image to enlarge) Radio telescopes and satellite dishes collect and focus electromagnetic waves in the same way that the Listening Vessels focus sound waves. In architecture, curved walls and domes can create acoustic effects similar to what you experience here. Statuary Hall, in Washington, D.C.’s Capitol Building, is legendary for its tricky acoustics. A whisper on one side of this half-domed room can be heard more than 15 meters (about 50 feet) away.", "going_further": "Radio telescopes and satellite dishes collect and focus electromagnetic waves in the same way that the Listening Vessels focus sound waves. In architecture, curved walls and domes can create acoustic effects similar to what you experience here. Statuary Hall, in Washington, D.C.’s Capitol Building, is legendary for its tricky acoustics. A whisper on one side of this half-domed room can be heard more than 15 meters (about 50 feet) away.", "details": "", "phenomena": ["Parabolic Arc", "Reflection"], "keywords": ["amplification", "focal point", "parabolas"]},
{"id": "leaves-sprout-plants", "title": "Leaves that Sprout Plants", "aliases": "Creating Life With Just One Parent, Kalanchoe, Leaves That Sprout", "location": "Gallery 4: Living Systems", "byline": "Frank Millero and Michael Sgambellone , 2001", "collection_id": ["diving-into-the-gene-pool", "traits-of-life"], "related_id": ["life-on-the-rocks"], "tagline": "These plants reproduce by copying themselves.", "description": "Looking closely at the leaves of kalanchoe plants, you can see tiny sprouts growing from the leaf edges. Each of these plantlets can grow into a clone —a genetic copy of the parent plant. ", "whats_going_on": "Many plants, including kalanchoe, can reproduce in two ways: asexually by sprouting plantlets, or sexually by making flowers and seeds. Making plantlets uses less energy, but sex creates diverse offspring, increasing the odds that some will survive hard times.", "going_further": "", "details": "", "phenomena": ["Reproduction"], "keywords": ["fragmentation"]},
{"id": "lariat-chain", "title": "Lariat Chain", "aliases": "Bicycle Chain", "location": "Gallery 2: Tinkering", "byline": "Artist-in-Residence Norman Tuck , 1987", "collection_id": ["artist-in-residence", "young-kids"], "related_id": ["bicycle-wheel-gyro", "echo-tube", "oscylinderscope", "turntable"], "tagline": "This moving loop of chain sets up strange, hovering wave patterns.", "description": "", "whats_going_on": "With a mere touch from your fingertip, you can create waves in the chain that move in decidedly strange ways, warping as they wander.  The apparent strangeness is a result of relative motion. Waves that travel with the motion of the moving chain quickly whip up and away. But waves that travel against the motion of the chain seem to hover and dance eerily in place.", "going_further": "", "details": "", "phenomena": ["Nonlinear Behavior", "Resonance", "Waves: Standing", "Wave Excitation", "Wave Guide", "Waves: Transverse"], "keywords": ["bicycle wheel"]},
{"id": "library-of-earth-anatomy", "title": "Library of Earth Anatomy", "aliases": "", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Ilana Halperin , 2017", "collection_id": ["artist-in-residence"], "related_id": ["observatory-library"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": " Library of Earth Anatomy ,​ a collection of remarkable geological artifacts that invite and inspire us to see rocks in new ways. Created by Halperin for the Exploratorium’s Fisher Bay Observatory Gallery, the Library employs unconventional classification methods to dissolve the usual boundaries between nature and culture, as well as between animal, vegetable, and mineral. Premised on the notion that “Earth’s geological record is like a book whose pages have been ripped apart and scattered about,” the Library reveals the unusual richness of Bay Area “geologic literature.” Its rock fragments tell many stories. A series of cards correlated to the rocks guides us in the apprehension that the solidity of rock is an illusion, and that the scale of geologic time is immense.", "phenomena": [], "keywords": []},
{"id": "liquid-litmus", "title": "Liquid Litmus", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Charles Carlson and Richard Gagnon , 1985", "collection_id": [], "related_id": ["bacteriopolis", "native-oyster-colony", "when-water-turns-red-it-means-is-salt-forming"], "tagline": "Ionized water swirls in pH-indicating dye.", "description": "Here you can see the chemical reactions taking place in an electrolytic cell, as electricity flowing through a tank of salt water and pH-indicating dye creates zones of acidic (yellow) and basic (blue) solutions. ", "whats_going_on": "Electricity flows between the two submerged wires of this exhibit, causing chemical changes in the liquid that you see as a change in color. The liquid in this tank is mostly water with a little salt and some special dyes. The dyes turn yellow where there are positive hydrogen ions and bluish-purple where there are negative hydroxide ions. The dyes are pH indicators —they show whether the liquid is acidic or alkaline. By definition, acidic things like lemon juice are substances that contain an overabundance of positive hydrogen ions. Alkaline substances contain an overabundance of negative hydroxide ions. So the yellow in the tank is acidic, while the bluish-purple is alkaline. At the positively charged wire, water breaks up into hydrogen ions (H + ) and oxygen gas (O 2 ), which you see as little bubbles rising from the wire. 2H 2 O --> O 2 + 4H + + 4e –  The hydrogen ions (H + ) that are left behind make the surrounding liquid acidic, so the dye turns yellow. At the negatively charged wire, water breaks up into hydroxide ions (OH - ) and hydrogen gas (H 2 ), which also rise as little bubbles from the wire. 2H 2 O + 2e – --> H 2 + 2OH –  The hydroxide ions (OH - ) that are left behind make the surrounding liquid basic (or alkaline), so the dye turns bluish-purple.   The dyes in this exhibit change color in response to changes in pH—also known as a litmus test .", "going_further": "At the positively charged wire, water breaks up into hydrogen ions (H + ) and oxygen gas (O 2 ), which you see as little bubbles rising from the wire. 2H 2 O --> O 2 + 4H + + 4e –  The hydrogen ions (H + ) that are left behind make the surrounding liquid acidic, so the dye turns yellow. At the negatively charged wire, water breaks up into hydroxide ions (OH - ) and hydrogen gas (H 2 ), which also rise as little bubbles from the wire. 2H 2 O + 2e – --> H 2 + 2OH –  The hydroxide ions (OH - ) that are left behind make the surrounding liquid basic (or alkaline), so the dye turns bluish-purple.   The dyes in this exhibit change color in response to changes in pH—also known as a litmus test .", "details": "", "phenomena": ["Atoms and Particles", "Electromagnetic Forces"], "keywords": ["electrolysis", "water"]},
{"id": "lab-illustrations", "title": "Lab Illustrations", "aliases": "Interpreting the Living Systems Lab", "location": "Gallery 4: Living Systems", "byline": "Artist Lucy Conklin, 2013", "collection_id": [], "related_id": ["still-life"], "tagline": "Hand-rendered “portraits” capture the process and practices of staff biologists.", "description": "", "whats_going_on": "", "going_further": "", "details": "Conklin spent several weeks observing the Exploratorium's life sciences laboratory and produced a number of original works that capture the inner workings of the facility. Beyond hand-rendered “portraits” of the many organisms cultured in the lab, Conklin successfully and beautifully captured the process and practices of staff biologists.", "phenomena": [], "keywords": []},
{"id": "is-it-genetic", "title": "Is It Genetic?", "aliases": "Genetic Inheritance", "location": "Gallery 4: Living Systems", "byline": "Eyal Shahar , 2019", "collection_id": ["cells-to-self"], "related_id": ["weird-wings", "within-15-minutes", "probably-chelsea"], "tagline": "How much does DNA affect your appearance?", "description": "Answer questions about seven of your physical characteristics. Then see how much they’re influenced by genetics (DNA), and see what other factors are involved. ", "whats_going_on": "", "going_further": "", "details": " Traits this exhibit asks about:  How attached are your earlobes? Clasp your hands, interlacing your fingers. Which thumb is on top? What color are your eyes? How many freckles do you have? Do you have a widow’s peak? Do you have dimples in your cheeks?  What’s going on?  In the past, all of these traits were given as examples of things controlled by genes alone. But in most cases, there are other factors involved. You become who you are through a complicated interplay of DNA and other factors, such as the conditions in your mother’s womb, what you eat, what you do, how you were raised, and much, much more.", "phenomena": [], "keywords": ["human traits genetics environment nature/nurture inheritance diversity"]},
{"id": "icy-bodies", "title": "Icy Bodies", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Shawn Lani , 2005", "collection_id": ["young-kids"], "related_id": ["fog-bridge-72494", "tornado", "vortex", "watch-water-freeze"], "tagline": "Small chunks of dry ice jet and swirl across a liquid surface.", "description": "Like comets, these chunks of dry ice slowly disintegrate as they move, leaving a visible trail of condensed water vapor. ", "whats_going_on": "Comets are massive chunks of ice, frozen gases, and dust that orbit the Sun. As they near the Sun, these lonely travelers begin to give off gas, gradually shrinking and forming glowing tails that can stretch for millions of miles. In this mesmerizing artwork meant to evoke the quiet beauty of comets, frozen carbon dioxide—better known as dry ice—slowly sublimates, transforming from a solid state to a gas as it slides and spins across a water surface. Real comets, often referred to by astronomers as “dirty snowballs,” contain a mixture of rock, dust, and water ice, along with frozen carbon dioxide, carbon monoxide, methane, and ammonia. Dry ice has a surface temperature far colder than ordinary ice: -109° Fahrenheit, or -78.5° Celsius. For this reason it’s preferred over water ice for shipping perishable goods, with the added advantage that it leaves behind carbon dioxide gas (instead of a soggy wet mess) once its cooling work is done.", "going_further": "Real comets, often referred to by astronomers as “dirty snowballs,” contain a mixture of rock, dust, and water ice, along with frozen carbon dioxide, carbon monoxide, methane, and ammonia. Dry ice has a surface temperature far colder than ordinary ice: -109° Fahrenheit, or -78.5° Celsius. For this reason it’s preferred over water ice for shipping perishable goods, with the added advantage that it leaves behind carbon dioxide gas (instead of a soggy wet mess) once its cooling work is done.", "details": "", "phenomena": ["Change of State", "Condensation", "Evaporation", "Fluid Mechanics", "Melting", "Turbulent Flow", "Sublimation"], "keywords": ["carbon dioxide", "comets", "complexity", "condensation", "evaporation", "spinning"]},
{"id": "illuminated-fog", "title": "Illuminated Fog", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Charles Sowers , 2010", "collection_id": [], "related_id": ["cloud-rings"], "tagline": "Swirling, drifting, billowing movements of air reveal themselves in the fog.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Reflection", "Turbulent Flow"], "keywords": ["fog", "turbulence", "air currents"]},
{"id": "human-phenomena-explainer-station", "title": "Human Phenomena Explainer Station", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "", "collection_id": ["explainer-demonstrations"], "related_id": ["living-systems-explainer-station", "seeing-and-listening-explainer-station"], "tagline": "", "description": "Explainers are stationed throughout the Exploratorium doing structured and open-ended demonstrations. Ask an orange-vested Explainer to help you explore. ", "whats_going_on": "", "going_further": "", "details": " Magic Everything is not as it seems—at first. Pick a card, any card, and watch the Explainers reveal some surprising aspects of human perception.  Philosophy (Where do you sit?) \"Should we always tell the truth?\" Have thoughtful discussions on philosophical questions that don't have right answers.", "phenomena": [], "keywords": []},
{"id": "harmonograms", "title": "Harmonograms", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Artist Ivan Moscovich, 1968", "collection_id": ["cybernetic-serendipity"], "related_id": ["drawing-board", "sand-graph", "chaotic-pendulum", "coupled-pendulums"], "tagline": "Colorful patterns record the swinging of twin pendulums.", "description": "", "whats_going_on": "", "going_further": "", "details": "Ivan Moscovich created these  harmonograms with a twin-pendulum Harmonograph. The spirals, ellipses, and figure eights are graphical records of the swinging pendulums. Patterns of this sort—depicting two simultaneous oscillations in two dimensions— are known as Lissajous figures. Each pattern captures a record of the pendulums’ motions: The bigger the swing, the larger the figure; the slower the oscillations, the closer together the lines. As the swinging dies away, the trace shrinks.", "phenomena": ["Motion: Pendular Motion", "Patterns", "Motion: Periodic Motion"], "keywords": []},
{"id": "golden-gate-bridge", "title": "Golden Gate Bridge", "aliases": "Golden Gate Bridge Motion", "location": "Gallery 5: Outdoor Exhibits", "byline": "Dave Fleming , 2013", "collection_id": [], "related_id": ["bay-bridge-model"], "tagline": "In San Francisco, bridges and buildings are made to move.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "last-ocean", "title": "The Last Ocean", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文  Filipino       The Last Ocean is a 1,200-square-foot landscape of interactive platforms illuminated by visitor activity. Made from reclaimed and recycled ocean plastics, its five-sided pieces form a beautiful geometric tessellation —a repeating pattern of flat shapes with no gaps. The independent “smart” platforms communicate with each other over a robust wireless network.  Through the use of recycled ocean plastic, Lewin aims to impact the recovery of our oceans and planet and to explore the crisis of polluted oceans, a warming planet, dwindling natural resources, and an urgent need for systemic change. She also asks us to consider how a global community can connect, address, and mitigate the issues our planet faces.  In 2021 the Brunt Ice Shelf in Antarctica experienced a significant calving event —the breaking away of a mass of ice. The detached piece of ice was named Iceberg A-74. The design of the installation at the Exploratorium was inspired by an overhead view of the calving event.  Jen Lewin’s works combine the beauty of the natural world with the transformative possibilities of interactivity and the power of technology.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.  Photo: The Last Ocean by artist Jen Lewin. Photo by Charles Aydlett. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "gray-step", "title": "Gray Step", "aliases": "The Edge Makes the Difference, Gray Step 1, Horse's Tail", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Exploratorium Founder Frank Oppenheimer , 1980", "collection_id": ["boundaries", "seeing-the-light"], "related_id": ["sophisticated-shadows", "bright-black", "bird-in-a-cage", "monochromatic-room"], "tagline": "Your visual system uses edges to detect differences.", "description": "With the rope hanging down, the left and right sides of the board appear identical. Lifting the rope shows the dramatic difference that your eyes missed—and continue to miss, as soon as you let the rope fall again. ", "whats_going_on": "When the rope is down, you see the board as a single, uniform surface. But when you lift the rope, you reveal a sharp edge, and the two sides of the board look quite different. In fact, both sides of the board are identical: Each side gets lighter from left to right, creating a central boundary. The areas just on each side of the boundary are similar enough that covering the edge—where the contrast is greatest—causes you to see the board as one uniform surface. Like our eyes, computer vision systems rely heavily on edge detection to locate distinct objects. Most often, computer vision systems find edges by detecting sudden changes in brightness or color; but these systems can be fooled when light is dappled or when the edges themselves are fuzzy or blocked. Human edge detection is more sophisticated—sophisticated enough to see edges where they don’t exist. Some illusions—including the Exploratorium’s former logo—create what are called illusory contours with collections of shapes that merely suggest the presence of an edge.", "going_further": "Like our eyes, computer vision systems rely heavily on edge detection to locate distinct objects. Most often, computer vision systems find edges by detecting sudden changes in brightness or color; but these systems can be fooled when light is dappled or when the edges themselves are fuzzy or blocked. Human edge detection is more sophisticated—sophisticated enough to see edges where they don’t exist. Some illusions—including the Exploratorium’s former logo—create what are called illusory contours with collections of shapes that merely suggest the presence of an edge.", "details": "", "phenomena": ["Lateral Inhibition", "Symmetry", "Visual Edge Effects"], "keywords": ["boundary", "cornsweet illusion", "eyes"]},
{"id": "disappearing-act", "title": "Disappearing Act", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Erik Thogersen , 2012", "collection_id": ["seeing"], "related_id": [], "tagline": "An animal that blends in with its environment is much easier to see when it's moving than when it's still.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Motion: Visual Motion Detection", "Visual Edge Effects", "Patterns"], "keywords": ["illusions"]},
{"id": "teardrop", "title": "Teardrop (after Robert Irwin)", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文  Filipino      In a spectacular interplay of light and shadow, “hidden” shapes and patterns emerge. Fragmented shadows are cast in all directions from reflected and refracted light.   Teardrop (after Robert Irwin) interweaves delicate, traditional Islamic decorative geometric patterns and architecture with modern materials. The work is inspired by jaalis , intricate carved screens, which cast moving shadows as the Sun rises and falls. The design is a laser-cut steel disk that is lacquered in seafoam green. Multiple, overlapping shadows of varying density are cast and appear to move as visitors move.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.  Photo: Courtesy of Anila Quayyum Agha. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "raylights", "title": "RayLights", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "", "collection_id": [], "related_id": [], "tagline": "", "description": ".btn-language{\n    position: absolute;\n    right: 0;\n    margin-right: 15px;\n    margin-left: 15px;\n}\n\n.dropdown-menu{\n    min-width: unset;\n}\n\n.dropdown-item{\n    text-decoration: none !important;\n}  Language   Español  繁體中文  Filipino      This dynamic artwork produces ever-changing, mandala-like light patterns that are synchronized to ambient sounds. The fluctuating, animated light rays range from intense spectral colors to subtle pastels. A sequence of patterns repeats, but when you make sound—talk, sing, clap—the preprogrammed patterns are interrupted as the lights respond with non-repeating, complex variations of the colors and patterns.  On view in Glow: Discover the Art of Light , November 17, 2022–January 29, 2023.  Photo: Courtesy of Craig Newswanger. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "disappearing-rings", "title": "Disappearing Rings", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Jesse Marsh and Steve Gennrich , 2013", "collection_id": [], "related_id": ["bay-windows", "research-buoy", "life-on-the-rocks", "pier-piling-pivot"], "tagline": "How far can you see into the water?", "description": "", "whats_going_on": "", "going_further": "", "details": "Lower these rings into the Bay and see just how far you can see into the water. One of the San Francisco Bay’s defining features, sediment flows from the delta change with the seasons. This exhibit is based on a scientific observational instrument called a “secchi disk,” which scientists use to determine water clarity.", "phenomena": [], "keywords": []},
{"id": "disappearing-glass-rods", "title": "Disappearing Glass Rods", "aliases": "", "location": "Crossroads: Getting Started", "byline": "", "collection_id": ["seeing", "seeing-the-light"], "related_id": ["disappearing-act"], "tagline": "You see transparent objects because they bend light.", "description": "When light passes from one clear medium into another, it (usually) bends—a phenomenon called refraction. Distortions caused by refraction are part of why you can see objects that are clear.  The oil in the tank is optically similar to glass, so light doesn’t bend when it passes from one to the other. Without the telltale distortions of light caused by refraction, the glass rods disappear when lowered into the oil. Meanwhile, since lenses magnify images by bending light, the lens doesn’t work anymore either.  One rod is made of a different type of glass (flint glass), which refracts light differently than oil, so it doesn’t disappear. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Reflection", "Refraction"], "keywords": []},
{"id": "disagreeing-about-color", "title": "Disagreeing About Color", "aliases": "Compare Yellow (LEDs), Disagreement About Color, Two Ways of Seeing Yellow", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown and Pete Stephens, 2002", "collection_id": ["colorfest", "seeing"], "related_id": ["bright-black", "color-of-water", "gray-step", "bird-in-a-cage"], "tagline": "Color is in the eye of the beholder.", "description": "Which of the outer dots best matches the center dot? Ask a few people and chances are you’ll get a few different answers. ", "whats_going_on": "The center dot at this exhibit is pure yellow light. It’s surrounded by a ring of 11 dots of varying colors, created by mixing different proportions of red and green light. (Surprise: Red and green light mixed together appear yellow to our eyes.) Exactly which of the red/green dots seems to best match the yellow dot varies from person to person. Thanks to variations in the pigments of our retinas, people perceive color differently. One person will see a match between colors that another person thinks are very different. Variations between people in their perception of color reach an extreme in color blindness . About 1 in every 12 men (and 1 in every 200 women) are colorblind, the common name for a condition more correctly called color deficiency . Unlike ordinary human trichomats , who have three types of color-sensitive cones, most color-deficient people are dichromats , having only two types of color-sensitive cones, one most sensitive to blue light, the other to yellow light. The upshot is that colorblind people see the world in shades of blue and yellow—with red and green being especially hard to tell apart.", "going_further": "Variations between people in their perception of color reach an extreme in color blindness . About 1 in every 12 men (and 1 in every 200 women) are colorblind, the common name for a condition more correctly called color deficiency . Unlike ordinary human trichomats , who have three types of color-sensitive cones, most color-deficient people are dichromats , having only two types of color-sensitive cones, one most sensitive to blue light, the other to yellow light. The upshot is that colorblind people see the world in shades of blue and yellow—with red and green being especially hard to tell apart.", "details": "", "phenomena": ["Color", "Color Mixing", "Judgment"], "keywords": ["eyes"]},
{"id": "dioximoirekinesis", "title": "Dioximoirekinesis", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Irving John Good and Martine Vite, 1969", "collection_id": ["cybernetic-serendipity"], "related_id": ["elastotron", "jacques-cousteau-seashells"], "tagline": "A kinetic pattern seems to move as a visitor's viewpoint shifts.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Patterns", "Interference", "Motion: Visual Motion Detection"], "keywords": []},
{"id": "diffraction-shadows", "title": "Diffraction Shadows", "aliases": "Long-Path Diffraction", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Tom Tompkins , 1973", "collection_id": ["seeing-the-light"], "related_id": ["soap-film-painting", "light-island", "distilled-light"], "tagline": "Shadows made with laser light have light and dark bands.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Diffraction", "Interference", "Superposition"], "keywords": ["eyes", "Huygens' principle"]},
{"id": "cubatron-core", "title": "Cubatron Core", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Mark Lottor, 2017", "collection_id": [], "related_id": ["buckyball"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "Bask in the cascading colors of this tremendous, torus-shaped sculpture by artist Mark Lottor. Twenty-six feet in diameter and eighteen feet high, Cubatron Core is made of 3,840 individually controllable RGB LEDs.", "phenomena": [], "keywords": []},
{"id": "digital-footprints", "title": "Digital Footprints", "aliases": "", "location": "Fisher Bay Observatory Gallery 6: Observing Landscapes", "byline": "Artist Eric Fischer and Sebastian Martin , 2013", "collection_id": [], "related_id": ["visualizing-the-bay-area"], "tagline": "Daily cycles of the city are projected onto a miniature topographic map of San Francisco.", "description": "", "whats_going_on": "", "going_further": "", "details": "Daily cycles of the city are projected onto a miniature topographic map of San Francisco: the movement of city buses and trains, local-area photos posted to Flickr and geographically located posts sent out via Twitter. This ever-changing data visualization \"reads\" the activity patterns reflected in social media and reveals how those are shaped by transportation, land use, and urban design.", "phenomena": ["Modeling Landscapes", "Patterns"], "keywords": []},
{"id": "countless-colors", "title": "Countless Colors", "aliases": "", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown and Ulrika Andersson , 2001", "collection_id": ["seeing"], "related_id": ["colored-shadows", "chromoscope", "colored-circles", "aurora"], "tagline": "How many colors can you make by mixing red, green, and blue light?", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Color", "Color Mixing"], "keywords": []},
{"id": "confused-sea", "title": "Confused Sea", "aliases": "Turbulent Sea", "location": "Gallery 4: Living Systems", "byline": "Artist-in-Residence Ned Kahn , 1994", "collection_id": ["artist-in-residence"], "related_id": ["geysers", "vortex", "water-waves-time-horizon", "turbulent-orb"], "tagline": "Use speed and air to build waves.", "description": "", "whats_going_on": "", "going_further": "", "details": "Air blowing over the surface of water inside a large Plexiglas hemisphere mimics the action of the wind over the ocean by generating waves. The waves slowly change and build until the entire volume of water is circulating as one wave. Viewers can adjust the speed of the air blower and influence the building of the waves.", "phenomena": ["Resonance", "Wind", "Wave Excitation"], "keywords": ["water", "weather"]},
{"id": "colored-shadows", "title": "Colored Shadows", "aliases": "Color Splitter, Wall Watching Bench", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Exploratorium Founder Frank Oppenheimer and Richard O. Brown , 1975", "collection_id": ["colorfest", "seeing-the-light", "young-kids"], "related_id": ["pixel-table", "sun-painting", "aurora", "sophisticated-shadows"], "tagline": "Not all shadows are black.", "description": "Step in front of this wall, and you’ll make shadows of various colors—yellow, magenta, cyan, red, green, blue, and yes, even black—that wiggle, jump, and dance along with you. ", "whats_going_on": "When lights of different colors shine on the same spot on a white surface, the light reflecting from that spot to your eyes is called an additive mixture because it is the sum of all the light. At this exhibit, a red light, a blue light, and a green light are all shining on the screen. The screen looks white because these three colored lights stimulate the three types of cones in your eyes approximately equally, creating the sensation of white. We call this set of three colors—red, green, and blue—the additive primaries of light. With these three lights you can make shadows of seven different colors—blue, red, green, black, cyan, magenta, and yellow—by blocking different combinations of lights: When you block two lights, you see a shadow of the third color—for example, block the red and green lights and you get a blue shadow. If you block only one of the lights, you get a shadow whose color is a mixture of the other two. Block the red light and the blue and green light mix to create cyan; block the green light and the red and blue light make magenta; block the blue light and red and green make yellow. If you block all three lights, you get a black shadow. It may seem strange that a red light and a green light mix to make yellow light on a white screen. It just so happens that a particular mixture of red and green light stimulates the cones in your eyes exactly as much as they’re stimulated by yellow light—that is, by light from the yellow portion of the rainbow—so your eye can't tell the difference.  As you move in front of the wall, your body can block one, two, or all three of the lights, resulting in shadows of various colors. (click diagram to enlarge) ", "going_further": "", "details": "", "phenomena": ["Color", "Color: Complimentary", "Color Mixing", "Shadows"], "keywords": ["CMY", "RGB"]},
{"id": "coupled-pendulums", "title": "Coupled Pendulums", "aliases": "Coupled Resonant Pendula, Coupled Resonant Pendulums, Stop and Start", "location": "Crossroads: Getting Started", "byline": "Exploratorium Founder Frank Oppenheimer , 1981", "collection_id": [], "related_id": ["sand-graph", "chaotic-pendulum", "pendulum-snake"], "tagline": "Linked pendulums can get one another going.", "description": "Start one of these two pendulums swinging and soon you’ll see the other pendulum start swinging, too. Keep watching and you’ll see the two pendulums take turns, alternately swinging energetically and coming to a near standstill. ", "whats_going_on": "Everything vibrates at its own unique rate, or frequency . Bridges, atoms, and playground swings—each wiggles, waves, or swings with a characteristic natural frequency . In this exhibit, two pendulums are joined together, and there are two natural frequencies. In any system consisting of similar parts joined together—like atoms in a molecule or girders in a bridge—there are as many natural frequencies as there are parts. Energy added to one pendulum moves back and forth between both pendulums. This happens three times a minute, which is the difference between the two natural frequencies, 47 and 50 swings per minute. The unfinished aesthetic of this exhibit reflects Exploratorium founder Frank Oppenheimer’s openness to tinkering with exhibit design. Made from hardware store parts and a staff member’s kitchen table, this exhibit went through many stages before it premiered on the museum’s exhibit floor in the early ’80s.  Since then, there’ve been more alterations and iterations, including removal of a motor and an anonymous addition of whimsical feet. The Exploratorium has generated a smaller do-it-yourself version of this exhibit and a full-sized swing-set of coupled pendulums. (click image to enlarge)", "going_further": "The unfinished aesthetic of this exhibit reflects Exploratorium founder Frank Oppenheimer’s openness to tinkering with exhibit design. Made from hardware store parts and a staff member’s kitchen table, this exhibit went through many stages before it premiered on the museum’s exhibit floor in the early ’80s.  Since then, there’ve been more alterations and iterations, including removal of a motor and an anonymous addition of whimsical feet. The Exploratorium has generated a smaller do-it-yourself version of this exhibit and a full-sized swing-set of coupled pendulums. (click image to enlarge)", "details": "", "phenomena": ["Energy: Conservation of Energy", "Energy: Kinetic", "Energy: Potential", "Motion: Composition of Perpendicular Motion", "Motion: Pendular Motion", "Motion: Periodic Motion", "Motion: Simple Harmonic Motion", "Natural Frequency", "Resonance", "Rhythm"], "keywords": ["pendulums"]},
{"id": "colored-circles", "title": "Colored Circles", "aliases": "Colored Lights, Colored Venn diagram, Venn Diagram", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown , 2013", "collection_id": ["colorfest"], "related_id": ["colored-shadows", "sun-painting", "pixel-table", "soap-film-painting"], "tagline": "Overlapping pools of red, blue, and green create a Venn diagram of additive color.", "description": "Overlapping pools of red, blue, and green projected onto the floor create a Venn diagram of additive color. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "cloud-rings", "title": "Cloud Rings", "aliases": "", "location": "This exhibit is not currently on view.", "byline": "Artist Ned Kahn , 1993", "collection_id": ["young-kids"], "related_id": ["fog-bridge-72494", "vortex", "tornado", "icy-bodies"], "tagline": "Launch a ring of fog.", "description": "", "whats_going_on": "", "going_further": "", "details": "Cloud Rings uses a mist generator and a large rubber membrane with a hole in the middle to launch a ring of vapor up to the ceiling. The ring is generated by the friction between the hole’s edge and the vapor flowing through the hole, which forms a swirling pattern known as a vortex. ", "phenomena": ["Friction", "Vortices"], "keywords": ["fog", "weather"]},
{"id": "color-conflicts", "title": "Color Conflicts", "aliases": "Colored Words", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Richard O. Brown and Diane Whitmore , 1998", "collection_id": ["mind", "seeing"], "related_id": [], "tagline": "When can reading get in the way of speaking?", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Attention", "Color", "Information Processing and Encoding", "Reaction Time", "Selective Awareness"], "keywords": ["Stroop effect"]},
{"id": "chromoscope", "title": "Chromoscope", "aliases": "Green Lips", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Chris Burda", "collection_id": [], "related_id": ["countless-colors", "colored-shadows", "monochromatic-room", "aurora"], "tagline": "A color photo is three pictures in one.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Color", "Color Mixing"], "keywords": []},
{"id": "circuit-workbench", "title": "Circuit Workbench", "aliases": "Bulbs and Batteries", "location": "Gallery 2: Tinkering", "byline": "Charles Glorioso and Erik Thogersen", "collection_id": ["active-prolonged-engagement"], "related_id": ["pedal-generator", "black-sand"], "tagline": "Try building these circuits found in everyday objects.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": ["circuit", "parallel", "series"]},
{"id": "cloud-chamber", "title": "Cloud Chamber", "aliases": "", "location": "Crossroads: Getting Started", "byline": "Donation from NASA Ames, 1969", "collection_id": [], "related_id": [], "tagline": "Wispy lines show the path of tiny, high-energy particles generated by cosmic rays.", "description": "Look down into the chamber and you’ll see an ongoing cascade of thin white trails appearing and disappearing. These are cosmic ray tracks, created by high-energy subatomic particles from space. ", "whats_going_on": "Invented in 1911, cloud chambers like this one were among the first devices used to study high-energy particles called cosmic rays , believed to come from exploding stars called supernovas . As cosmic rays travel through the air, they collide with air molecules and break them up into charged fragments called ions . Meanwhile, inside the cloud chamber, a tray of alcohol is heated to form alcohol vapor. The alcohol vapor in the cloud chamber condenses around the trail of ions created by a cosmic ray, a trail you see as a visible streak of tiny droplets. Most of the tracks you see—roughly 4 out of 5—are made by unstable elementary particles called muon s. Muons have a negative charge like electrons, but they are 207 times heavier. The rest of the tracks are electrons; these tracks are shorter and curlier than muon tracks. Occasional heavier tracks are made by protons or by natural radioactivity in the air or in the exhibit itself. Today, cloud chambers have been replaced by tracking chambers and scintillators , which track particle paths by producing an electric signal, rather than a visible trail. When cosmic rays from outer space reach the Earth’s atmosphere, they crash into air molecules and knock free many more particles. These particles go on to crash into more air molecules and create even more particles. Thus a single particle from outer space—called a primary —can create a shower of particles from the Earth’s atmosphere—called secondaries . Primaries (which are actually protons) rarely reach the Earth’s surface; almost all of the tracks in this exhibit are from secondaries (muons and electrons).", "going_further": "When cosmic rays from outer space reach the Earth’s atmosphere, they crash into air molecules and knock free many more particles. These particles go on to crash into more air molecules and create even more particles. Thus a single particle from outer space—called a primary —can create a shower of particles from the Earth’s atmosphere—called secondaries . Primaries (which are actually protons) rarely reach the Earth’s surface; almost all of the tracks in this exhibit are from secondaries (muons and electrons).", "details": "", "phenomena": ["Atoms and Particles", "Condensation", "Evaporation", "Ionization", "Scattering", "Techniques to Make the Invisible Visible"], "keywords": ["cosmic rays"]},
{"id": "circling-wave-umbrella", "title": "Circling Wave Umbrella", "aliases": "", "location": "Fisher Bay Observatory Gallery 6, Mezzanine", "byline": "Ned Kahn , 1995", "collection_id": ["turbulent-landscapes"], "related_id": ["fluttering"], "tagline": "Fluttering waves whirl around the edge, creating patterns of evenly spaced ripples.", "description": "", "whats_going_on": "", "going_further": "", "details": "The fluttering waves that whirl around the edge of the umbrella show how random motion can create a regular pattern. As the fabric spins it forms pockets of swirling air that set it flapping like a flag in the wind. But unlike a flag, this cloth is bound into the shape of a circle. The waves bump into each other as they spin, interacting to create patterns of evenly spaced ripples.", "phenomena": ["Resonance"], "keywords": []},
{"id": "circles-of-magnetism", "title": "Circles of Magnetism", "aliases": "", "location": "Gallery 2: Tinkering", "byline": "Erik Thogersen and Thomas Humphrey , 1999", "collection_id": [], "related_id": ["black-sand", "magnetic-fluid-patterns", "magnetic-clouds", "magnet-plus-electricity-equals-motor"], "tagline": "Electricity moving in a wire makes a circular magnetic field.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Electromagnetic Forces"], "keywords": ["magnet", "magnetic field", "navigation"]},
{"id": "albert", "title": "Albert", "aliases": "Albert's Watching", "location": "This exhibit is not currently on view.", "byline": "Artist John Billingsley, 1969", "collection_id": ["cybernetic-serendipity", "mind"], "related_id": ["dioximoirekinesis"], "tagline": "A mechanical object may seem alive if it responds to you.", "description": " Albert was part of Cybernetic Serendipity, a groundbreaking and much acclaimed exhibition. It was created in 1967 and the exhibition opened at the Exploratorium in 1969, the first year the museum was open. ", "whats_going_on": "", "going_further": "", "details": "", "phenomena": [], "keywords": []},
{"id": "aeolian-landscape", "title": "Aeolian Landscape", "aliases": "", "location": "Bechtel Gallery 3, Wattis Studio", "byline": "Artist Ned Kahn , 1988", "collection_id": ["turbulent-landscapes"], "related_id": ["turbulent-orb", "rift-zone", "avalanche"], "tagline": "Swirling sand evokes a desert landscape.", "description": "", "whats_going_on": "", "going_further": "", "details": " Aeolian Landscape presents a swirling storm of sand inside a large chamber covered by a plexiglass top. A knob on the top of the exhibit rotates a sturdy fan set in the base of the chamber. As you turn the fan, the sand inside begins to swirl and accumulate in patterns suggestive of a desert landscape as if seen from high above.", "phenomena": ["Energy: Transformation of Energy", "Patterns", "Wind"], "keywords": ["sand", "weather"]},
{"id": "aeolian-harp", "title": "Aeolian Harp", "aliases": "", "location": "Gallery 5: Outdoor Exhibits", "byline": "Artist in Residence Douglas Hollis , 1976", "collection_id": [], "related_id": ["chladni-singing", "oscylinderscope", "sound-bite", "catch-the-sound-waves"], "tagline": "Listen to a 27-foot-tall harp that's strummed by the wind.", "description": "", "whats_going_on": "", "going_further": "", "details": "An eerie orchestral chord floats on the breeze; it’s the shimmering sound of a 27-foot-tall harp being strummed by the wind. First built for the Exploratorium in 1976 by local artist Douglas Hollis, the harp’s seven stretched strings are amplified at one end by large metal dishes. “The artist specifically sited this piece to take advantage of the natural wind tunnel here between Piers 15 and 17. The wind picks up every day at around two or three o’clock and that’s when it really sings,” says curator Shawn Lani.", "phenomena": ["Energy: Transformation of Energy", "Laminar Flow", "Natural Frequency", "Oscillation", "Resonance", "Wave Excitation", "Wave Guide", "Waves: Transverse", "Wind"], "keywords": ["musical instruments", "weather"]},
{"id": "pendulum-clock", "title": "A Pendulum Clock", "aliases": "Giant Clock", "location": "This exhibit is not currently on view.", "byline": "Artist in Residence Norman Tuck , 1989", "collection_id": [], "related_id": ["lariat-chain", "your-turn-counts", "oscylinderscope", "uroborus"], "tagline": "", "description": "", "whats_going_on": "", "going_further": "", "details": "At first glance, the giant see-through-erector-set-like structure seems to be a realization of one of Leonardo da Vinci's mechanical inventions. Totally open and exposed, it is constructed of steel, ropes, bicycle chains and a bowling ball , and stands 24 feet tall. The clock has gear-like teeth protruding from it, marking off the sixty minutes of the hour, as well as a large and a small hand. It is powered by the weight of a large metal basket filled with artifacts which in turn acts on the crown wheel: the key to the clock's turning.", "phenomena": ["Motion: Pendular Motion"], "keywords": ["pendulums"]},
{"id": "all-eyes-on-me", "title": "All Eyes on Me", "aliases": "", "location": "Osher Gallery 1: Human Phenomenon", "byline": "Denise King , 2009", "collection_id": ["reflections"], "related_id": ["anti-gravity-mirror", "archimedes", "giant-mirror", "listening-vessels"], "tagline": "Make yourself the center of attention—and reflect.", "description": "Situate yourself at just the right place in space in front of this parabolic mirror array and you’ll see dozens of your own eyeballs peering back at you. ", "whats_going_on": "The parabolic shape of this array of mirrors focuses incoming light rays together, causing them to converge to a single point (called the focal point ) and then spread apart again. When you put your own eyeball at just the right place—roughly twice the focal length—you see your own eye reflected back at you from every mirror in the array.  This exhibit was inspired by a photo from a classic physics textbook. The Parabolic Mirror Has a Thousand Eyes was shot by the famous scientific photographer Berenice Abbott. (click image to enlarge) Parabolic mirrors having a single smooth surface—as opposed to the fragmented view you see here—are found in car headlights, solar ovens, and reflecting telescopes. Rogers, H. S. \" Making Science Visible: The Photography of Berenice Abbott .\" In Photomediations Machine.", "going_further": "Parabolic mirrors having a single smooth surface—as opposed to the fragmented view you see here—are found in car headlights, solar ovens, and reflecting telescopes. Rogers, H. S. \" Making Science Visible: The Photography of Berenice Abbott .\" In Photomediations Machine.", "details": "", "phenomena": ["Image Formation", "Parabolic Mirrors", "Reflection"], "keywords": ["eyes", "focal point", "mirrors", "parabolas"]},
{"id": "a-sip-of-conflict", "title": "A Sip of Conflict", "aliases": "Toilet Bowl Drinking Fountain, Toilet Drinking Fountain, Toilet Water Fountain", "location": "This exhibit is not currently on view.", "byline": "Erik Thogersen , 2006", "collection_id": ["mind"], "related_id": [], "tagline": "Do you dare drink from a toilet?", "description": "Would you, could you, will you drink from a water fountain fashioned from an actual—but unused—toilet? Porcelain is just porcelain . . . right? ", "whats_going_on": "A popular and eww -inspiring photo op, this simple psychology exhibit plumbs the depths of human irrationality as it flushes out the internal struggle between reason and gut-level reaction. And just in case you were wondering: The placement of this exhibit—next to an actual restroom—is no accident.  Rod-shaped coliform bacteria are abundant in mammalian fecal matter, but are not necessarily harmful. Irrational fear of contamination has an official name: mysophobia.  Photo courtesy of NIAID. (click image to enlarge)  Many have speculated that this popular exhibit is a coy reference to conceptual artist Marcel Duchamp’s 1917 artwork, Fountain , a porcelain urinal. When asked to confirm this rumor, our exhibit developer replied, “Duchamps? Who’s that?”  Abstract of Ma, J. 2012. “Listening for Self-Reflective Talk in Visitors’ Conversations: A Case Study of the Exploratorium's Mind Collection.” Visitor Studies 15 (2): 136–156. “ Taste Testing Without Smell .”", "going_further": "Many have speculated that this popular exhibit is a coy reference to conceptual artist Marcel Duchamp’s 1917 artwork, Fountain , a porcelain urinal. When asked to confirm this rumor, our exhibit developer replied, “Duchamps? Who’s that?”  Abstract of Ma, J. 2012. “Listening for Self-Reflective Talk in Visitors’ Conversations: A Case Study of the Exploratorium's Mind Collection.” Visitor Studies 15 (2): 136–156. “ Taste Testing Without Smell .”", "details": "", "phenomena": ["Emotion", "Judgment", "Mental Activity"], "keywords": []},
{"id": "adapting-to-color", "title": "Adapting to Color", "aliases": "Red-Green Goggles", "location": "Bechtel Gallery 3: Seeing & Reflections", "byline": "Richard O. Brown and Ulrika Andersson , 2001", "collection_id": ["colorfest", "seeing"], "related_id": ["disagreeing-about-color", "bird-in-a-cage", "monochromatic-room", "benhams-disk"], "tagline": "Change your perception of color by flooding your eyes with colored light.", "description": "", "whats_going_on": "", "going_further": "", "details": "", "phenomena": ["Color"], "keywords": ["eyes"]}
]