[
  " extraterrestrial intelligence , hypothetical extraterrestrial life that is capable of thinking, purposeful activity. Work in the new field of astrobiology has provided some evidence that evolution of other intelligent species in the Milky Way Galaxy is not utterly improbable. In particular, more than 4,000 extrasolar planets have been detected, and underground water is likely present on Mars and on some of the moons of the outer solar system . These efforts suggest that there could be many worlds on which life , and occasionally intelligent life, might arise. Searches for radio signals or optical flashes from other star systems that would indicate the presence of extraterrestrial intelligence have so far proved fruitless, but detection of such signals would have an enormous scientific and cultural impact.",
  "The argument for the existence of extraterrestrial intelligence is based on the so-called principle of mediocrity. Widely believed by astronomers since the work of Nicolaus Copernicus , this principle states that the properties and evolution of the solar system are not unusual in any important way. Consequently, the processes on Earth that led to life , and eventually to thinking beings, could have occurred throughout the cosmos.",
  "  The most important assumptions in this argument are that (1) planets capable of spawning life are common, (2) biota will spring up on such worlds, and (3) the workings of natural selection on planets with life will at least occasionally produce intelligent species. To date, only the first of these assumptions has been proven. However, astronomers have found several small rocky planets that, like Earth , are the right distance from their stars to have atmospheres and oceans able to support life. Unlike the efforts that have detected massive, Jupiter -size planets by measuring the wobble they induce in their parent stars, the search for smaller worlds involves looking for the slight dimming of a star that occurs if an Earth-size planet passes in front of it. The U.S. satellite  Kepler , launched in 2009, found thousands of planets, more than 20 of which are Earth-sized planets in the habitable zone where liquid water can survive on the surface, by observing such transits. Another approach is to construct space-based telescopes that can analyze the light reflected from the atmospheres of planets around other stars, in a search for gases such as oxygen or methane that are indicators of biological activity. In addition, space probes are trying to find evidence that the conditions for life might have emerged on Mars or other worlds in the solar system, thus addressing assumption 2. Proof of assumption 3, that thinking beings will evolve on some of the worlds with life, requires finding direct evidence. This evidence might be encounters, discovery of physical artifacts, or the detection of signals. Claims of encounters are problematic. Despite decades of reports involving unidentified flying objects , crashed spacecraft , crop circles , and abductions, most scientists remain unconvinced that any of these are adequate proof of visiting aliens.",
  "Extraterrestrial artifacts have not yet been found. At the beginning of the 20th century, American astronomer Percival Lowell claimed to see artificially constructed canals on Mars . These would have been convincing proof of intelligence, but the features seen by Lowell were in fact optical illusions. Since 1890, some limited telescopic searches for alien objects near Earth have been made. These investigated the so-called Lagrangian points , stable locations in the Earth - Moon system. No large objects—at least down to several tens of metres in size—were seen.",
  "The most promising scheme for finding extraterrestrial intelligence is to search for electromagnetic signals, more particularly radio or light , that may be beamed toward Earth from other worlds, either inadvertently (in the same way that Earth leaks television and radar signals into space) or as a deliberate beacon signal. Physical law implies that interstellar travel requires enormous amounts of energy or long travel times. Sending signals, on the other hand, requires only modest energy expenditure, and the messages travel at the speed of light .",
  "Projects to look for such signals are known as the search for extraterrestrial intelligence (SETI). The first modern SETI experiment was American astronomer Frank Drake’s Project Ozma , which took place in 1960. Drake used a radio telescope (essentially a large antenna) in an attempt to uncover signals from nearby Sun -like stars . In 1961 Drake proposed what is now known as the Drake equation , which estimates the number of signaling worlds in the Milky Way Galaxy . This number is the product of terms that define the frequency of habitable planets , the fraction of habitable planets upon which intelligent life will arise, and the length of time sophisticated societies will transmit signals. Because many of these terms are unknown, the Drake equation is more useful in defining the problems of detecting extraterrestrial intelligence than in predicting when, if ever, this will happen.",
  "  By the mid-1970s the technology used in SETI programs had advanced enough for the National Aeronautics and Space Administration to begin SETI projects, but concerns about wasteful government spending led Congress to end these programs in 1993. However, SETI projects funded by private donors (in the United States ) continued. One such search was Project Phoenix, which began in 1995 and ended in 2004. Phoenix scrutinized approximately 1,000 nearby star systems (within 150 light-years of Earth), most of which were similar in size and brightness to the Sun. The search was conducted on several radio telescopes, including the 305-metre (1,000-foot) radio telescope at the Arecibo Observatory in Puerto Rico , and was run by the SETI Institute of Mountain View, California .",
  "Other radio SETI experiments, such as Project SERENDIP V (begun in 2009 by the University of California at Berkeley) and Australia ’s Southern SERENDIP (begun in 1998 by the University of Western Sydney at Macarthur), scan large tracts of the sky and make no assumption about the directions from which signals might come. The former uses the Green Bank Telescope and, until its collapse in 2020, the Arecibo telescope, and the latter (which ended in 2005) was carried out with the 64-metre (210-foot) telescope near Parkes , New South Wales . Such sky surveys are generally less sensitive than targeted searches of individual stars, but they are able to “piggyback” onto telescopes that are already engaged in making conventional astronomical observations, thus securing a large amount of search time. In contrast, targeted searches such as Project Phoenix require exclusive telescope access.",
  "In 2007 a new instrument, jointly built by the SETI Institute and the University of California at Berkeley and designed for round-the-clock SETI observations, began operation in northeastern California. The Allen Telescope Array (ATA, named after its principal funder, American technologist Paul Allen ) has 42 small (6 metres [20 feet] in diameter) antennas . When complete, the ATA will have 350 antennas and be hundreds of times faster than previous experiments in the search for transmissions from other worlds.",
  "Beginning in 2016, the Breakthrough Listen project began a 10-year survey of the one million closest stars, the nearest 100 galaxies , the plane of the Milky Way Galaxy, and the galactic centre using the Parkes telescope and the 100-metre (328-foot) telescope at the National Radio Astronomy Observatory in Green Bank, West Virginia. That same year the largest single-dish radio telescope in the world, the Five-hundred-meter Aperture Spherical Radio Telescope in China, began operation and had searching for extraterrestrial intelligence as one of its objectives.",
  "Since 1999 some of the data collected by Project SERENDIP (and since 2016, Breakthrough Listen) has been distributed on the Web for use by volunteers who have downloaded a free screen saver, SETI@home. The screen saver searches the data for signals and sends its results back to Berkeley. Because the screen saver is used by several million people, enormous computational power is available to look for a variety of signal types. Results from the home processing are compared with subsequent observations to see if detected signals appear more than once, suggesting that they may warrant further confirmation study.",
  "Nearly all radio SETI searches have used receivers tuned to the microwave band near 1,420 megahertz. This is the frequency of natural emission from hydrogen and is a spot on the radio dial that would be known by any technically competent civilization. The experiments hunt for narrowband signals (typically 1 hertz wide or less) that would be distinct from the broadband radio emissions naturally produced by objects such as pulsars and interstellar gas. Receivers used for SETI contain sophisticated digital devices that can simultaneously measure radio energy in many millions of narrowband channels.",
  "SETI searches for light pulses are also under way at a number of institutions, including the University of California at Berkeley as well as Lick Observatory and Harvard University . The Berkeley and Lick experiments investigate nearby star systems, and the Harvard effort scans all the sky that is visible from Massachusetts . Sensitive photomultiplier tubes are affixed to conventional mirror telescopes and are configured to look for flashes of light lasting a nanosecond (a billionth of a second) or less. Such flashes could be produced by extraterrestrial societies using high-powered pulsed lasers in a deliberate effort to signal other worlds. By concentrating the energy of the laser into a brief pulse, the transmitting civilization could ensure that the signal momentarily outshines the natural light from its own sun.",
  "No confirmed extraterrestrial signals have yet been found by SETI experiments. Early searches, which were unable to quickly determine whether an emission was terrestrial or extraterrestrial in origin, would frequently find candidate signals. The most famous of these was the so-called “Wow” signal, measured by a SETI experiment at Ohio State University in 1977. Subsequent observations failed to find this signal again, and so the Wow signal, as well as other similar detections, is not considered a good candidate for being extraterrestrial.",
  "Most SETI experiments do not transmit signals into space. Because the distance even to nearby extraterrestrial intelligence could be hundreds or thousands of light-years, two-way communication would be tedious. For this reason, SETI experiments focus on finding signals that could have been deliberately transmitted or could be the result of inadvertent emission from extraterrestrial civilizations."
]