[
  " atomic clock , type of clock that uses certain resonance frequencies of atoms (usually cesium or rubidium ) to keep time with extreme accuracy. The electronic components of atomic clocks are regulated by the frequency of the microwave electromagnetic radiation. Only when this radiation is maintained at a highly specific frequency will it induce the quantum transition (energy change) of the cesium or rubidium atoms. In an atomic clock these quantum transitions are observed and maintained in a feedback loop that trims the frequency of the electromagnetic radiation; like the recurrent events in other types of clocks , these waves are then counted.",
  "In 1967 the 13th General Conference on Weights and Measures redefined the second , the unit of time in the International System of Units , in terms of the cesium standard so as to equal the second of Ephemeris Time . The conference defined the second as “the duration of 9,192,631,770 periods of the radiation corresponding to the transition between the two hyperfine levels of the ground state of the cesium-133 atom.”",
  "  Until the 1990s the cesium beam atomic clock was the most accurate standard of atomic time and frequency. The principle underlying the cesium clock is that all atoms of cesium-133 are identical and, when they absorb or release energy, produce radiation of exactly the same frequency, which makes the atoms perfect timepieces. Since that time, laboratories around the world have steadily improved the accuracy of cesium fountain atomic clocks. These clocks get their name from the fountainlike motion of the constituent cesium gas. The timing process begins by introducing cesium gas into a vacuum chamber and directing six infrared lasers (located at right angles to one another) to compact and cool (slow down) the cesium atoms to a temperature near absolute zero . Then two vertical lasers are used to nudge the atoms up about a metre (creating a “fountain”) through a microwave-filled cavity. The microwave frequency is tuned to maximize the observed fluorescence, which occurs at the natural resonance frequency (9,192,631,770 Hz) of the cesium atom. Because the round-trip through the microwave cavity takes about a second, control of the microwave frequency has resulted in greater timekeeping accuracy. The best cesium fountain atomic clocks are now predicted to be off by less than one second in more than 50 million years."
]