[
  " Wonderful to Be Young!  the Shadows , London-based instrumental rock group whose distinctive sound exerted a strong influence on other young British musicians in the 1960s and beyond. The original members were lead guitarist Hank B. Marvin (original name Brian Robson Rankin; b. October 28, 1941, Newcastle upon Tyne, Tyne and Wear, England), rhythm guitarist Bruce Welch (original name Bruce Cripps; b. November 2, 1941, Bognor Regis, Sussex), bassist Jet Harris (byname of Terence Harris; b. July 6, 1939, London—d. March 18, 2011, Winchester, Hampshire), and drummer Tony Meehan (byname of Daniel Meehan; b. March 2, 1943, London—d. November 28, 2005, London). Later members included drummer Brian Bennett (b. February 9, 1940, London) and bassist John Rostill (b. June 16, 1942, Birmingham, West Midlands—d. November 26, 1973, England).",
  "Formed in 1958 as the Drifters, the foursome became the backing group for Cliff Richard , the British answer to Elvis Presley . A name change to avoid conflict with the American vocal group the Drifters prefaced the release of the first of the Shadows’ singles. The group’s trademark was the smooth twangy sound produced by lead guitarist Marvin’s lavish use of the tremolo arm of his Fender Stratocaster, an effect that could be made to sound either lyrical or sinister. As the primitive charm of the skiffle era faded, the Shadows showed a generation of embryonic British rockers what to do. Thousands learned to play guitar by imitating the Shadows’ hits, which included “Apache,” “F.B.I.,” and “Wonderful Land”; many went on to buy their own Stratocasters as the British “beat boom” took off. The era of the Beatles and the Rolling Stones made the Shadows’ music obsolete, and the group officially disbanded in 1968.",
  "The Shadows reunited in 1973 and released the albums Rockin’ with Curly Leads (1974) and Specs Appeal (1975), both of which featured an updated sound that included, for the first time, vocals. The Shadows rode a wave of popularity that lasted well into the 1980s. The band faded from the scene once again, until 2004, when the Shadows embarked on what was billed as a farewell concert tour. Another final tour took place in 2009–10, and a 50th-anniversary album, Reunited , appeared in 2009. Bennett and Welch were named Members of the Order of the British Empire (OBE) in 2004; Marvin declined the honour."
]