[
  "  stringed instrument , any musical instrument that produces sound by the vibration of stretched strings, which may be made of vegetable fibre, metal, animal gut, silk, or artificial materials such as plastic or nylon. In nearly all stringed instruments the sound of the vibrating string is amplified by the use of a resonating chamber or soundboard . The string may be struck, plucked, rubbed (bowed), or, occasionally, blown (by the wind); in each case the effect is to displace the string from its normal position of rest and to cause it to vibrate in complex patterns.",
  "Because most stringed instruments are made from wood or other easily perishable materials, their history before written documentation is almost unknown, and contemporary knowledge of “early” instruments is limited to the ancient cultures of East Asia and South Asia, the Mediterranean, Egypt, and Mesopotamia; but even for these places historians must depend largely on iconographic (pictorial) sources rather than surviving specimens.",
  "Stringed instruments seem to have spread rapidly from one society to another across the length and breadth of Eurasia by means of great population shifts, invasions and counterinvasions, trade, and, presumably, sheer cultural curiosity. In the Middle Ages the Crusades (late 11th through the late 13th century) stimulated Europe to adopt a whole set of new instruments; similarly, the Chinese adopted many new instruments from their Central Asian neighbours as Buddhism spread eastward and as the Han Chinese expanded their influence across the region (roughly, the 3rd century bce to the 10th century ce ). Indeed, the only world area that did not echo to the sound of strings was the pre-Columbian Americas.",
  "No system of classification can adequately categorize the interactions of natural material, craftsmanship, and exuberant imagination that produced an endless variety of stringed instruments. In the West the most widely accepted system of classification is that developed by E.M. von Hornbostel and Curt Sachs , a method based on the type of material that is set into vibration to produce the original sound. Thus, stringed instruments are identified as chordophones —that is to say, instruments in which the sound is produced by the vibration of chords, or strings. This main category is then further divided into four subtypes— lutes , zithers , lyres , and harps —according to the manner in which the strings are positioned in relation to the body of the instrument. Within these categories, the descriptive nomenclature of an instrument is given in terms of parts of the body: for example, the belly (front; soundboard), back, sides, and neck. Instruments are not necessarily related only to others in the same classification. Transformations continually occur, and “hybrids,” according to the Sachs-Hornbostel system, may in fact represent altogether viable subtypes of their own.",
  "The ear, because of its own structure, adds to and subtracts from the outside sound. It is, for instance, relatively insensitive to low-frequency sound pressure but is extremely sensitive to fine degrees of pitch change. At the same time, it can accept a great number of pitch and tuning systems . On a worldwide basis, there are a large and varied number of tonal systems, the most ancient stemming from China. The oldest known of these in the West is the so-called Pythagorean system, articulated by the famed 7th-century Greek philosopher and mathematician Pythagoras ; others include meantone temperament , just intonation , and the equal-tempered system, methods of tuning calculation that vary slightly in the exact size they assign to the intervals within an octave. All of these systems represent theoretical mathematical concepts to some degree, and their origins must be sought in arcane numerological systems rather than in practical musicianship. Thus, “tuning” and “playing in tune” do not necessarily refer to the same thing; players and tuners make constant adjustments to any basic mathematically determined framework according to their judgment and experience. In other words, even though a given “scientific” tuning system outlines scales and modes , the instrumentalist who plays an instrument with great pitch flexibility (the violin , for instance) spends much time in the spaces between the notes assigned in the given scale. The Japanese zither ( koto ), for example, can be tuned according to a number of fixed systems; nevertheless, its player produces many microtonal (using intervals that differ from the equally spaced semitones of Western music) variations on these fixed pitches by manipulation of the strings. The person who plays the Vietnamese dan bau monochord creates all pitches and nuances on its metal string by pulling in the flexible bamboo stem to which it is attached. In Western musical tradition, moreover, piano tuners would not think of tuning altogether according to the dictates of a well-tempered system; rather, they use a so-called stretched tuning, in which they imperceptibly sharpen (raise) pitches as they ascend and thus make the highest notes relatively sharper than the lowest ones. Investigation has disclosed that string players tend to play in the Pythagorean rather than the well-tempered system.",
  "Inconsistencies, then, are inherent in all tuning systems; makers of fretted lutes—such as the guitar and the Greek laouto (a type of lute with moveable frets), for example—operate according to a combination of ear and rule of thumb when they insert or adjust frets (note-position markers—e.g., of gut or wire) in the fingerboard. Such instruments are fretted according to the “rule of the eighteenth,” in which the first fret is placed at one-eighteenth of the distance from the top to the bottom of the string, the second, one-eighteenth of the distance from the first fret to the bottom, and so on. Even if this method produced an acoustically perfect scale (which it does not), the player would not be able to reproduce this exactly, for as he presses the string to the fingerboard, the string is stretched and is thus slightly lengthened. That is why the act of stopping a string at its exact centre gives a note slightly sharper than the expected octave above the open string. Despite all of this, the search for an acoustically perfect tuning system goes on.",
  "Though constructional methods differ widely from one area and instrument to another, there are a limited number of basic problems to be overcome by the maker of stringed instruments. The very principle that makes it possible for chordophones to sound is string tension; at the same time, tension is destructive to the instrument, since it tends literally to pull it apart. So the body of an instrument must be made of strong material; it must be reinforced, and, at the same time, it must not be so rigid that it cannot easily resonate—i.e., produce a supplementary vibration intensifying that of the string. The challenge of reconciling these opposite needs is the central one for the chordophone maker. Climate too has a marked effect on musical instruments: humidity expands a wooden instrument, and dryness contracts it. Of these factors, dryness is the most harmful, since the contraction of the wood actually pulls the instrument apart. Much energy has been expended over the centuries in investigations of various varnishes, shellacs, glues, and sealers. Many makers prefer to make their instruments in dry conditions, for the expansion caused by humidity is unlikely to prove as harmful as the contraction caused by dryness.",
  "Aside from a family of Southeast Asian instruments known as boat lutes—which, by definition, are hewn from a single block of wood—and a few other chordophones, including the Japanese  biwa  (a lute), portions of the koto (a zither), and often the Puerto Rican cuatro (a lute)—the bodies of most wooden instruments are constructed from multiple pieces of wood. The instruments are built up of many pieces of wood glued together; the shaping of curved pieces is accomplished by gouging and planing (as in the belly of the violin) or by heating and pressing in a frame (the sides of the violin or guitar). Soundboards , the most important part of the resonance system of stringed instruments, are carefully planed to close tolerances. Mass-production methods are unsuitable for the production of high-quality chordophones because no two pieces of wood are precisely alike in their acoustical qualities; each piece of wood requires special judgment and treatment. Ideally, therefore, stringed instruments of the highest quality must be individually made. Piano manufacture is a partial exception to this rule, but even in a piano factory, individual treatment and craftsmanship are allowed full sway. The modern piano is a product of several different factories. The cast-iron frames are made by specialized foundries, and the steel strings, the keyboards, and the actions (mechanisms for striking the strings) are produced by specialized firms. Each of these processes requires an experienced artisan, and the work of assembly, polishing, tuning, and tone regulation calls for hours of individual attention to each instrument.",
  "The construction and maintenance of Western stringed instruments generally have been complicated over the centuries by a continual rise in standard pitch, requiring strings to be tightened. Older instruments (such as a Stradivari violin) have been subjected to additional physical strain and therefore needed heavier bass-bars (braces under the belly).",
  "As already stated, the methods of sound production on a stringed instrument include plucking, striking, bowing, and blowing. A string vibrates in a complex way: the entire string vibrates in one segment (producing the fundamental pitch), and various segments at the same time vibrate independently to produce overtones . The resulting sound is weak indeed unless the instrument is provided with a resonator to amplify the sound. The shape of the resonator varies greatly. It has been influenced by the materials, tools, and technology available in the society, the symbolic meaning of the shape, and the sound desired by the culture. The last factor seems to be governed by the first three; that is to say, the prescribed shape of the resonator affects the overtone structure of the instrument, producing a certain timbre (characteristic tone colour), which the society in question then defines as attractive-sounding.",
  "One of the clearest illustrations of the basic importance of the shape of the resonator to a musical instrument is the African mouth bow (a musical bow that the player partially inserts in his mouth). By varying the size and shape of the oral cavity while striking or plucking the single, unfingered string, the player produces a clearly perceptible, if quiet, melody that exists only because the changes in the mouth emphasize various overtones. On stringed instruments with permanently fixed resonators, the size, dimensions, shape of apertures, thickness, and bracing of the resonating surfaces largely determine which overtones will be emphasized and thus what the instrument will sound like. On a well-made violin, for example, the resonances of the body of air enclosed in the body of the instrument and of the belly should be close in pitch to the two strings A and D, thus amplifying and colouring these pitches and their overtones. The sound quality of a stringed instrument is also influenced by the thickness and material of the strings; primarily, however, it is the size and shape of the resonating body and especially the material, density, and thickness of the soundboard that determine the sound of an instrument. A well-known Spanish guitar maker, in a successful attempt to prove the importance of the belly of the guitar, once constructed an instrument—an excellent one—from papier-mâché (an acoustically dead material), except for a carefully chosen and wrought wooden soundboard. Makers, then, devote a large part of their skill and knowledge to the choice of material for the soundboard; the maker of wood-bellied instruments prefers old wood because it is dry and well seasoned. Thus, some guitar makers find the soundboards of discarded pianos unusually suitable for their purposes; makers of the classical Chinese zither, or  qin  , preferred old coffins or well-seasoned wood from old trees.",
  "  The timbre of a struck or plucked stringed instrument is also affected by the manner of setting the string into motion. A string plucked with a sharp point (the player’s fingernail or a plastic plectrum) emphasizes the higher overtones, thus creating a “bright” tone quality. By contrast, a soft pad, such as that on a piano hammer, emphasizes the fundamental pitch. The relative hardness of the hammer on the piano is thus of critical importance to the sound of the instrument and plays a central role in the final process in piano manufacture: voicing. To voice a piano, a skilled worker adjusts the timbre of the instrument by the simple expedient of pricking the felt hammers with needles until a unified quality has been achieved throughout the range of the instrument. The tone of an instrument is also markedly affected by the place where the string is struck. The permanently fixed striking place on keyboard instruments has to be chosen with concern for both the timbre and the mechanical requirements of the instrument. On nearly all other stringed instruments the player varies the tone quality by choosing to pluck, strike, or bow at various places along the length of the string. The exception here is the Aeolian harp , which has no player; its strings are set into vibration by the wind.",
  "  Another way in which musicians and musical instrument makers influence the sound of their instruments is by the use of sympathetically vibrating strings. On the piano, for example, when the so-called damper pedal is raised, thus leaving all the strings free to vibrate, the act of striking one note causes all closely related pitches to vibrate in sympathy, thus modifying the loudness and tone of the struck note. This effect (which is encountered also on the zither and harp) is not a central feature of these instruments, but there are numerous Eurasian chordophones on which the principle is of fundamental importance. The plucked instruments of Hindustani music , the sarod and the sitar , possess numerous sympathetic strings tuned according to the notes of the mode being played. The South Asian fiddle,  sarangi  , has some two to three dozen sympathetic strings; the Norwegian Hardanger fiddle ( Hardingfele ) has four or five sympathetic strings; and the viola d’amore typically has seven. Sympathetic strings are generally made of thin brass or steel, and their vibration reinforces the upper harmonics, thus producing a bright, silvery sound.",
  "Probably the most widely distributed type of stringed instrument in the world is the lute (the word is used here to designate the family and not solely the lute of Renaissance Europe). The characteristic structure consists of an enclosed sound chamber, or resonator, with strings passing over all or part of it, and a neck along which the strings are stretched. Players move their fingers up and down the neck, thus shortening the vibrating portion of the strings and producing various pitches .",
  "In the lute the part of the resonating chamber over which the strings pass is called the belly, and the other side of the resonator is called the back. The portion between the back and belly is the side, or rib. A lute may be plucked with the fingers or a plectrum or may be bowed, but the means of sound production do not affect the essential morphological identity of plucked, struck, and bowed lutes.",
  "Historically, lutes may be subdivided into those with skin and those with wood bellies; in most Eurasian cultures examples of both types exist side by side. In Iran, for instance, the wood-bellied lute is the  ʿūd  and the skin-bellied is the  tar  ; in the United States it is the guitar and the banjo , respectively. In Japan the wood-bellied lute is the  biwa  , and the samisen has a skin belly and back. Chinese fiddles (bowed lutes) tend to have a skin belly and, like the banjo, an open back. The two different varieties of lute are distinct in sound and structure, and methods of construction, timbre, history, and symbolic associations differ markedly. A second subdivision concerns the shape of the instrument; for instance, the lute proper has a round back, the guitar a flat one.",
  "The string vibrations of the lute are transferred to the resonating chamber by the bridge, which holds the strings above the lute’s belly; the resonator magnifies the vibrations and transmits them to the air. Makers lavish great attention on the choice and fashioning of material for the belly: if it is of wood, it must be selected and aged with much care and planed to a prescribed thickness; if it is of skin, it must be made from only certain materials. (The belly of the Japanese samisen is preferably made from the skin of a female cat; the wooden belly of the Puerto Rican cuatro is best constructed from wood from a female jagrumo tree that has been well seasoned and, if possible, taken from an old house.) Since the late 20th century, synthetic materials have largely replaced skin bellies.",
  "Most lute strings have traditionally been made of animal intestines (gut), metal, or silk, though nylon has become a common replacement for gut. Whatever the material, each string must be of equal thickness throughout its length. Some lutes have only a single string, but the great majority have three, four, or more. Very often there are sets, or courses, of two strings to a pitch, so that an instrument that produces four pitches with open strings actually has eight strings arranged in pairs.",
  "In the tunings of lutes, though fourths and fifths (intervals the size of four and five tones of a Western seven-note scale, as C to F and C to G) predominate in many places, any given instrument is likely to be tuned differently from one location, piece, or player to another. Functionally more important is the question of whether a lute is fretted or unfretted. It is clearly easy to change from one pitch to another on an unfretted instrument by sliding the finger along the string, but it is also possible to do this on an instrument with extremely high frets (Japanese biwa , Indian vina ) by pressing—hence stretching—the string into the cavity between two frets. Instruments with low frets (the guitar, the banjo, the European lute, and the viol ) are found mainly in the West, where a limited and clearly defined tonal system is in use and where significant microtonal changes in pitch are not necessary. Even here, however, players manage to produce microtonal inflections, slides, and vibrations on fretted instruments. Many Central Asian lutes, such as the dutār , use movable gut or nylon string frets, tied on so they can be adjusted to the mode of the music. The metal frets of the Indian sitar are tied on with strings for the same reason.",
  "The fiddle can be distinguished from other lutes only by the manner in which it is played—usually with a horsehair bow . The practice of rubbing the strings with this implement is of uncertain age and origin, but it seems to have appeared almost simultaneously (9th–10th century ce ) in China , Java , the Arab world, Byzantium, and Europe. As with the other lutes, there is a fundamental division between skin- and wood-bellied instruments. (The former are far more common on the fiddle than the latter, which occur mainly in Europe.) Musically more significant, however, is the division between the stick fiddle, in which the player’s finger does not actually press the string to a fingerboard (but rather slides up and down the string itself), and the fiddle with a fingerboard (for example, the violin ). The Mongolian morin huur (also spelled khuur ) is unique in that the two strings are far enough above the fingerboard that most of the pitches are fingered with the face of the nail rather than the end as is common elsewhere in the world. On fiddles without fingerboards (including the Chinese  erhu  , the Arab  rabāb  and its Asian relatives, various African fiddles, and the South Asian  sarangi  ), the player’s left hand is able to move with extreme flexibility up and down the string, thus making the subtlest kind of inflection possible.",
  "As with other lutes, fiddles may have only one string (the Tuareg  imzhad ) or nearly 40 (the sarangi ); on the latter, most of the strings are not directly touched or sounded by the player but vibrate sympathetically when other strings are set into motion, thus giving a fuller resonance. Examples, in addition to the sarangi , include the Norwegian Hardanger fiddle , the Swedish nyckelharpa , and the viola d’amore.",
  "The fiddle bow itself generally is constructed so that the player can tighten or loosen the hair at will; on most stringed instruments the player is able to make immediate changes by manipulating the bow hair with the hand while playing, thus producing various tone qualities. The bow of the violin, perfected in the early 19th century by Franƈois Tourte, has a screw mechanism that cannot be changed while playing. Most bows are actually bow-shaped, but the Tourte bow is made in a compound curve to which considerable tension can be applied, making it possible to apply much pressure to the strings. The bows of the two-stringed fiddles of China (such as the erhu and the  jinghu  ) and Korea (  haegŭm  ) pass between the strings so that both sides of the hair may be used.",
  " ajaeng ajaeng  The bowing principle has been applied to nonlutes from time to time: the ancient Icelandic fidla is a bowed zither, as is the Korean  ajaeng  ; the Scandinavian talharpa is a bowed lyre . The musical saw is classified as a bowed idiophone .",
  "Instruments of the zither family, in which the strings lie parallel to and are of the same length as the string bearer (often also the resonator), are especially widely distributed in Eurasia, the Americas, and Africa. The least-complex zither type of instrument is the musical bow, shaped very much like a hunter’s bow. (The musical bow is sometimes classified as a harp.) The bow’s single string is tapped or struck, and the pitch can be varied by varying the tension of the string or by using the player’s mouth as a resonator and varying its size and shape, thus emphasizing different harmonics. It is a favourite instrument in equatorial Africa and Brazil, and it is also common in New Guinea.",
  "Aside from the musical bows, there are two important subdivisions of this category. The so-called long-zither family is found only in East Asia; because its characteristic resonating chamber is slightly convex, instruments of this type are sometimes called half-tube zithers. Larger models may be nearly 1 foot (30 cm) wide and more than 6 feet (180 cm) long; there are a varying number of strings frequently provided with movable bridges. These instruments, of which the best-known example is the Japanese koto, seem to derive ultimately from tube zithers made directly from lengths of bamboo . The bamboo prototypes are said to be idiochordic because their strings, part of the bamboo itself, are worked loose from the tough surface of the tube, to which they remain attached at either end. The maker then inserts small bridges at the extremes of the strings. (Various modifications and transformations of this principle exist, such as the bamboo-tube valiha of Madagascar and the sasandu of Roti, Indonesia, in which wire strings replace the idiochordic ones.) All long-bodied, curved-surfaced Asian zithers of the koto type may owe something to this idiochordic principle. In East Asian tradition the most ancient zither is the seven-stringed  qin  , which seems to have originated in the Shang dynasty ( c. 1600–1046 bce ). The Japanese  wagon  and koto , the Korean  kayagŭm  , and the Chinese  zheng  fit into this general category.",
  "The other important subdivision of the zither family is the flat zither; in Africa it is usually made either from a hollowed plank over which strings are fastened (board zither) or from individual narrow canes lashed together, each having one idiochordic string (raft zither). The typical box zither is a rectangular or, more often, trapezoid-shaped hollow box, with strings that are either struck with light hammers or plucked. Examples of the former are the Persian sanṭūr and its Chinese derivative, the  yangqin  (“foreign zither”); the cimbalom of east-central Europe; and the piano (which is a sort of cimbalom with keyboard ). The most prominent plucked box zither is the Arab qānūn and its various derivatives, including the harpsichord (a plucked zither controlled by a keyboard). In Europe a variety of plucked zithers developed having a fretted fingerboard under one or a few of the strings. In the United States popular box zithers include the hammered dulcimer , notable for its prominence in folk music of the early 20th century, and the autoharp , which is equipped with damper bars that prevent unwanted strings from sounding, making it relatively easy to play chords.",
  "Struck zithers are occasionally termed dulcimers, and unfretted plucked ones psalteries, after European instruments using those names. The Aeolian harps of 18th- and 19th-century Europe, moreover, were not harps at all; rather, they were blown box zithers.",
  "The lyre family, though it was of great importance in the ancient centres of Babylonia, Egypt, and Greece, is now found only in a few areas of East Africa. A lyre is made from an oval, round, or rectangular sound chamber (usually skin-bellied); from this resonator two arms protrude; they are joined at the top by a crosspiece; the strings extend from this crosspiece over the belly, with which they are connected by a bridge. These strings are not normally stopped but are allowed to vibrate throughout their entire length when plucked by the performer.",
  "  In Ethiopia and Eritrea, where the lyre remains in extensive use, there are two distinctive types, as there were in ancient Greece. The 10-string beganna (which corresponds to the ancient Greek kithara ) is a large, heavy, rectangular instrument that is considered by the Christian Ethiopians to be a God-given instrument that came to them from King David ; it is used, of course, for sacred music. The smaller lyre, krar (the ancient Greek lyra ), has a bowl-shaped resonator and is emphatically secular in its use and connotations; indeed, Ethiopian and Eritrean tradition casts it as the instrument of Satan . The construction of this six-stringed instrument illustrates the sort of change that is of wide occurrence in contemporary instrument making everywhere, for though the traditional krar was made from wood, the resonator of the present-day instrument is made of an easily available metal pan. The krar can be played in two ways: in the first (called muting) the left hand mutes the unwanted strings while the right hand strums with a plectrum; in the second, the fingers of the left hand pluck while the right hand plucks a drone on tonic strings (i.e., tuned to the tonic, or focal note, of the melody ).",
  "The lyres of medieval western Europe (4th–12th century) had from five to seven strings and, to judge from iconographic evidence, were played in a way that closely resembled the muting technique of Ethiopia. Later northern European lyres were sometimes played with a bow; their shapes are considerably varied, but both the rectangular kithara-like shape and the rounded lyra shape apparently existed.",
  "With three fundamental components—a number of strings of uneven length, a resonator, and a neck—instruments of the harp family exhibit an extraordinary variety of constructions. The strings of a so-called open harp are attached at one end to the soundboard of the resonator; at the other end, they are attached to the instrument’s neck, which extends away from the resonator, either in an arch or at a sharp angle. If the instrument has an additional pillar that joins the distal end of the neck with the resonator, it is called a “frame harp.” Regardless of the shape of the resonator, the trajectory of the neck, or open or closed structure, the plane of the harp’s strings lies perpendicular—as opposed to parallel—to the plane of the soundboard. It is primarily this string-soundboard orientation that distinguishes harps from other chordophones.",
  "The arched, or bow-shaped, harp, was known in Egypt as early as 3000–4000 bce ; its player kneels or stands, supporting the harp on the shoulder. Harps of this type may be found in West and Central Africa , where they are often provided with elaborate anthropomorphic carvings and skin-covered resonators. The bow harp, then, is a traditional African form that has been in use in that continent for at least 5,000 years.",
  " bce  On an angle harp the bowlike support is replaced with two crosspieces at right angles to one another; the strings are stretched between these at an angle of 45°. This type seems to have originated in Assyria, though occasionally it is found in Egypt and Greece. One model spread through Central Asia and to East Asia as far as Japan.",
  "  The frame harp is characteristic of both medieval and modern Europe; the shape of its frame is more or less triangular, the frame being strengthened by the pillar that encloses the strings in a kind of tripartite structure. It is to this category that the modern orchestral harp of Europe and the old Irish and Scottish harps belong. In all of these instruments the crosspiece held nearest the player is a hollow resonating chamber. The so-called Brian Boru harp (14th century), now at Trinity College, Dublin , is about 32 inches (80 cm) high, with 36 brass strings; the sound box is carved from a single piece of willow, and the harp is plucked by the fingernails.",
  "  Music for a solo instrument is often, though not always, used to accompany dancing or is derived from dance music. In Europe and the Americas, the violin or comparable fiddle is widely used to play dance music; for instance, the Norwegian Hardanger fiddle player performs rhythmically complex polyphonic music (i.e., having multiple melodic lines) to accompany the  halling  , gangar , or springar dances. In Scotland , Ireland , and rural North America , the violin is favoured for accompanying country dances. It is known that a single fiddler played for dancing among the upper classes in medieval Europe and also probably among the common people, with whom the fiddle was popular. In all areas, the fiddler has an additional repertoire not for dancing, which shows off his compositional and improvisational ability as well as his virtuosity. A skillful medieval fiddler constantly improvised new pieces. It is no coincidence that the violin solo sonatas and partitas of Johann Sebastian Bach , like their country cousins, are polyphonic compositions having a liberal sprinkling of stylized dance movements.",
  "A second genre of solo piece is the descriptive composition. In such diverse places as Ireland, western Africa, and the United States are found fiddle pieces picturing the hunt, in which the player delights in the depiction of such realistic sounds as the baying of the hounds, the sound of hooves, and the groans of the exhausted animal. In China there is a genre of highly realistic descriptive compositions for  pipa  —including some that depict famous battles from start to finish. The long-necked lute ( dutār or dambura ) players of Central Asia often perform complete textless narratives. A famous legend tells of a Central Asian ruler who was so worried about his son’s survival in battle that he vowed to pour hot metal down the throat of anyone who brought him bad news. When his son died, a court musician informed him through lute music, so molten gold was poured into the instrument’s body instead of the performer’s. Among numerous descriptive pieces in Renaissance and Baroque Europe, a well-known example is a sonata for viola da gamba (a member of the viol family), by the French virtuoso gamba player Marin Marais , that graphically and in detail describes a gallstone operation in the days before anesthetics.",
  "In the European Middle Ages and Renaissance, an important type of composition for solo stringed instruments was the transcription of polyphonic songs; in the medieval period fiddle and hurdy-gurdy players frequently rendered elaborated versions of well-known strophic songs. In northern Europe, songs intended to accompany dance could also be played on the fiddle, and in Spain the vihuela de arco filled a similar function. In the Renaissance, a string player was expected to have the ability to perform highly elaborated versions of preexistent melodies on the viol, lute, or keyboard ; and many manuals provided the players with exercises designed to teach them to elaborate the basic melody in a stylistically correct manner. Similar techniques continued to be practiced during the Baroque period and even into the 19th century.",
  "All over the world, stringed instruments have as one of their central functions the accompaniment of bards, who sing tales of heroes and otherwise reflect the concerns of their societies. The example of Homer and his lyre is of course one of the best known, and the 19th-century European art song for solo voice and piano also belongs to this genre. Other examples include the harpers of Celtic Ireland and Scotland , who devoted their skills to the accompaniment of learned bards. The azmari of Ethiopia sings lengthy historical epics and strophic love songs to his own accompaniment on the fiddle or lyre. In Japan, blind  biwa  players chant a narrative style of music known as katarimono ; here the biwa is used only between verses for interludes and commentaries. A similar technique is in use among the minstrels of North Africa: the lute ( gimbrī ) is played only between verses of the story, as a descriptive comment.",
  "Musical ensembles everywhere have their own internal social structure, typically mirroring that of their society at large in their type of leadership, the amount of freedom available to the individual players, and so on. The audience for a given ensemble also tends to be socially stratified. Large centrally directed ensembles tend to be found in societies that have a complex bureaucratic and pyramidal social order. Such groups are most typically to be found clustered around the royal or princely courts of China , Japan , Korea, Java , Bali , and North Africa and in the court-derived music of Europe and the Americas. In all of these instances a more or less fixed and archaic repertoire remains in use. In Japan and Korea the court music has derived from an archaic (and no longer extant) court music of China. The two types of stringed instruments in use in Japanese court music are the zithers (the koto and the wagon ) and the lute (the biwa ). The koto has 13 strings and the biwa four or five.",
  "The gamelan orchestras of Java, Indonesia , employ but two chordophones in ensembles, which are otherwise dominated by struck metallophones (instruments with a series of metal bars), or other metal instruments, such as tuned gong sets. The bowed rebab probably entered the orchestra from the Middle East (where it was called  rabāb  ) sometime in the 15th or 16th century, when most of Java embraced Islam. It plays in sliding fashion around the fixed pitches of the orchestra; traditionally, its player has been perceived by Javanese as the “raja” of the gamelan, with the drummer as his “prime minister.” A zither called the celempung or siter , which has 20 to 26 metal strings in double courses, may also be heard in gamelans.",
  "In Muslim countries of the Middle East as well as in the West, stringed instruments predominate numerically in the orchestra; the classical ensembles of the Maghrib , which mainly perform the ancient Andalusian suites, typically consist of about one dozen musicians. The instrumentalists include a number of violin or viola players, a rabāb player, lute (  ʿūd  ) players, drummers , and sometimes flutists , cellists , and a pianist . All of the string players play the melody together but not in unison, for they are expected to vary it individually with ornaments and improvised passages. The ensemble is normally led by an ʿūd player who indicates the pitch , mode , mood, changes of tempo, and so on.",
  "The greater number of stringed instruments in use in Western and North African orchestras are bowed; Western orchestras , however, are distinctive in that these bowed chordophones exist and are played in families of graduated size (violin, viola, cello, bass), and this phenomenon derives from the extent to which Western musicians have valued harmony and multipart composition. In the development of the Western orchestra, two great—but gradual—changes have occurred over the centuries: first, stringed instruments have increased dramatically in number in the orchestra, and, second, higher and higher notes and hence more extreme finger positions have been demanded of string players. Socially and musically, the role of the player in an early 18th-century symphony (in which there would be no more than two or three players to each part) is very different from the anonymous function allowed the violinist, for instance, in a 19th-century symphony by Hector Berlioz or Gustav Mahler . The symphonic orchestra seems to represent the merger of two functionally and aesthetically different groups that medieval Europe probably derived from Arab civilization. One of these, used for outdoor ceremonial music, consisted originally of shawms (oboes), drums, and trumpets ; the other, for indoor (chamber) use, was made up of stringed instruments, quiet percussion instruments, and flutes. The modern orchestra preserves vestiges of these two ensembles in its seating arrangements, orchestration, and leadership.",
  "In Western art music, chamber music (performed by small ensembles, typically with one instrument per part) has been understood since the mid-18th century to be entirely distinct from orchestral music; in the 17th and early 18th centuries, however, the distinction would have been difficult to draw, since there was no clear difference in either the music, the size, or the sociological position of the two types of ensembles. The symphonic orchestra arose because of middle-class demand for public concerts and from the desire of composers after the French Revolution to provide democratic music for the masses; thus, mass audiences demanded large orchestras, and the striking multiplication of instrumentalists affected the strings above all others.",
  "Japan cherishes a number of traditional chamber-music ensembles; of these, the most common one is the sankyoku (“music for three”) ensemble, commonly used for jiuta music; it uses one or two kotos, the samisen (called, in jiuta , the sangen ), and the  shakuhachi  (end-blown flute). Before the shakuhachi became a standard part of the ensemble (by the early 20th century), the three-stringed bowed kokyū lute was used instead. The koto player may also sing. In jiuta the koto plays the principal melody, and the other instruments simultaneously produce variants of it. A traditional Japanese saying picturesquely describes the music of this ensemble by likening the koto to the bone, the samisen ( sangen ) to the flesh, and the shakuhachi to the skin.",
  "The basic ensemble in South Indian ( Karnatak ) music consists of a drone instrument (usually the long-necked lute  tambura  ), a rhythm instrument (often the tuned drum (  mridangam  ), and a vocalist or instrumentalist to carry the main melody. The group is often augmented to include additional instruments, but the basic elements must be present. A violinist is frequently added as an accompanist to the singer. In such a supporting role, the violinist must be able not only to play in unison with the singer in fixed pieces but also to follow immensely complicated improvisational sections, all the while adhering to the correct raga (melodic framework) and tala (rhythmic framework). An analogous group in the Hindustani tradition of North India (as well as Pakistan and Bangladesh) might include the lutelike sitar or sarod as the solo instrument, with the accompaniment of the tabla (a pair of drums), and a drone. Often the fiddle, or  sarangi  , accompanies a singer. Southeast Asian ensembles such as the mahori of Thailand may accompany singers with bowed lutes ( saw ), a plucked lute ( krajappi ), and a type of zither-lute played by a musician seated on the floor ( jakhe ). Flute and light percussion may also be part of the ensemble.",
  "Rather similar principles apply in classical Arab and Turkish music: a chamber-music ensemble called takht must include instruments—usually strings—to play the melody and to improvise in the introductory sections known as  taqsīm  and percussion instruments to deal with the rhythmic modes, known as  īqāʿāt  . In Greek music, the element of harmony was added to an essentially modal system so that a solo instrument (typically clarinet or violin) plays the highly ornamented melody and another instrument (a guitar, or laouto ) plays the chordal background and maintains the reiterated rhythmic pattern. Similar ensembles are found in the Americas and in Africa.",
  "  In Puerto Rican traditional music, a guitar plays the harmony, the 10-stringed lute with 5 double courses ( cuatro ) plays the melody with the singer, and the scraper (guiro) and drums ( timbales ) produce the rhythmic part. Among the Imazighen ( Berbers ) of North Africa, groups of itinerant professional musicians typically play one or two gimbrī (lutes), a one-stringed fiddle (rendering a highly adorned melody), and percussion. In Senegal , lutes similar to the gimbrī are played by the troubadour-historians known as griot , often in ensembles of three or four flutes, drums, and rattles . The North American bluegrass style of Appalachia largely conforms to this African pattern of instrumentation; the ensemble typically includes only bowed and plucked strings and singers.",
  " Rock groups represent a blend of African and European traditions. The typical rock ensembles use plucked electric stringed instruments, electric keyboard instruments, voice, and drums. The electric guitar plays the melody, and the electric bass renders the bass part. In various North and South American blends of African, European, and indigenous tradition, the African element includes the percussion instruments and the skin-bellied lute (banjo); the European element includes the wood-bellied guitar and cuatro as well as the bass parts; the scraper often comes from Native American music ; and the singing style may derive from any of the four traditions.",
  "Throughout the world, particular instruments are associated with particular functions, social levels, areas, ages, and genders. Certain instruments preserve a similar function all over the world: singer-poets recount tales of heroes, recite the genealogies of the great, and preserve and disseminate the precious traditions of a given society—often accompanying themselves on a stringed instrument. An early example would be the poet Homer , who, perhaps accompanied by his lyre , sang of gods and heroes. Similar traditions still survive in Greece and the Balkans , but the instrument of the modern “singer of tales” is the fiddle. In Ethiopia and Eritrea , where so many traditions are reminiscent of Greece, singers known as azmari accompany themselves with a lyre or fiddle. In North and West Africa griots sing and play skin-bellied lutes called gimbrī ; in Morocco they play and sing alone in the squares of the towns for coins; in Senegal (where they perform in groups) they are employed by the wealthy. The Japanese biwa (often played by blind bards) was used to accompany epic narratives, the texts of which usually concern the adventures and battles of the samurai , and to accompany Buddhist chanting. In medieval Europe, minstrels , self-accompanied on the vielle (fiddle), sang of the heroic deeds of individuals such as Charlemagne .",
  "Very often, stringed instruments are identified with a certain social class , either in the sense that the player occupies a particular caste position or in that the instrument is the prerogative of a particular rank in society. A well-known example is that of the Irish and Scottish harp of the periods during which the Celtic kingdoms flourished; harpers, who were highly respected members of society, were employed in the households of only the very wealthy and the high nobility. By the same token, harpers were regarded with great suspicion by English officials in Ireland, for they were suspected of spreading sedition. Joseph Stalin so mistrusted the Ukrainian dumy narrators (who were accompanied by the bandura  psaltery ) that he had large numbers of them shot or imprisoned in labour camps.",
  "In sharp contrast is the attitude of respectable members of medieval Arab society toward lute players; their status was low indeed (certain judges even held that the lute was an unlawful possession and could be destroyed at will). Paradoxically, the ʿūd player’s skill and imagination was highly valued by the courts. These attitudes are old indeed in the Mediterranean; Aristotle regarded professional kithara players as low-caste and of questionable morals. In his view (and this remained prevalent in the West) the highborn should learn to play as an accomplishment but not professionally. In the 17th century, members of the English upper class were swept with a craze for playing consort music for ensembles of various sizes of viola da gamba (“leg viols ,” held, cello-fashion, between the knees). It was a common—and much valued—accomplishment to be able to play a part in a viol consort, and, as British naval administrator Samuel Pepys recorded in his well-known diary, servants were often chosen because of their ability as violists.",
  "The violin family in Europe has had two very different social connotations. In the string quartet and orchestra the instrument has been associated with the entertainment of the upper class and the bourgeoisie, and this represents the continuity of the medieval tradition under which the fiddle was highly regarded by the upper class. Alfonso X (the Wise), king of León and Castile, was one of many rulers who supported a group of fiddlers at his court; King Louis XIV of France was another.",
  "In opposition to this, the violin has long had great popularity among the folk. In almost every country in Europe and the Americas, the rural fiddler has provided the music for dances and entertainments. Traditional country fiddlers are distinguished from their urban colleagues by their nonstandardized technique, playing position, and tunings and by their learning process, which is aural (as opposed to visual—or written). Their virtuosity may be of a high order. The pleasures of the common folk have long been associated with the fiddle, though the medieval fiddler usually played the bagpipes , sang, juggled, and told jokes as well.",
  "The role of musical instruments in religious and healing practice is complex: at one time or another Judaism , Islam , and Christianity have each been hostile to the use of instruments in places of worship. The Christian clergy made frequent allegorical and symbolic reference to instruments, yet ironically, it is common to find depictions of angels, cherubs, or King David playing on the very instruments that were not permitted to sound in Christian worship. The Hindu attitude toward stringed instruments is very different. Though Vedic chanting is the oldest known music of India, the Rigveda nevertheless mentions the use of chordophones, including a number of vinas . Some Muslim groups are altogether opposed to any form of musical expression.",
  "The ancient Chinese  qin  , or scholars’ zither , had definite caste and symbolic associations. No scholar would have been without one, for it restrained licentiousness and purified the heart; it compelled a man to return to his divine origin and restrain his passions. Thus, the qin could not be played when drunk or after sexual intercourse; it could not be played for a courtesan, a merchant, or a barbarian. The qin was often played by Buddhist monks; complex cosmological and symbolic meanings existed for every aspect of its shape, constructional material, tone, and playing technique. The  qin  , therefore, was involved with healing, religion, and philosophy; and of these three, its therapeutic function was perhaps the most pervasive. This instrument was said to harmonize the blood circulation and regulate breathing; it would lead to health and long life. It could cure melancholy and even, it was claimed, make a devoted player immortal.",
  "  The function of stringed instruments in the healing process is often an indirect one: a healing specialist may sing powerful songs to the accompaniment of a lute (the gimbrī of the Gnawa musician-healers of North Africa ) or a fiddle (in Central Asia). In the Malay main puteri healing ceremony and theatre form, the shaman —or lead actress, who doubles as the shaman—initiates communication with the spirit world to learn the source of a person’s illness, all to the accompaniment of a rebab (bowed lute). Stringed instruments also have symbolic meanings that transcend their technological, sound-producing function. The horsehead fiddle of the Mongols is a direct manifestation of the Mongol system of belief in the horse as a symbol of fecundity and rebirth; the winged horse that the shaman is believed to ride in the quest for enlightenment and healing power is equivalent symbolically to the fiddle.",
  "This close connection of stringed instruments with ideas of birth and rebirth explains why so often a particular instrument is typically played, or even listened to, by members of one gender only; in certain instances instrumentalists, whether Greek kitharodists or Arab ʿūd players, were slaves with a low moral reputation. The playing of many stringed instruments by women has been either a low-caste occupation or an accomplishment to be savoured in the confines of the home. In India during the Vedic period there seem to have been stringed instruments (such as the kanda-vina ) that were played only by women; and Chinese tradition has it that the long zither, or zheng , was invented by a woman. In the West, instrument makers seem usually to be men, perhaps since the manipulation of woodworking tools has historically been a male occupation in most societies. In medieval Europe, minstrels made their own instruments, as they do in Puerto Rico , for example, today. Since the making and playing of instruments have until relatively recently (the 20th century) been mainly in male hands, women have not had available to them this particular link to musical instruments through manufacture.",
  "There is no reason to suppose that the shape of an instrument is governed only by acoustic requirements; it seems often to be the other way around: the symbolically appropriate shape preferred by a given culture produces a particular tone quality, which then becomes the desirable one. Available materials, manufacturing techniques, and complex historical, symbolic, and artistic considerations guide the makers of musical instruments. Transformations occur as old meanings are lost: the scroll surmounting the pegbox of the violin may well be a faint visual echo of the carving of a horse’s head that surmounts the fiddle in its ancestral lands in Central Asia. Instrument makers are well aware that the soundboard of an instrument is responsible for the best part of its resonance; they are aware that other portions can be considerably altered without making much change in the sound quality. Indeed, these artisans have long delighted in producing modifications of existing designs and in experimenting with new materials. In all this they have been constrained only by the essential technological requirement of a chordophone—ability to withstand the constant strain imposed by the tension of the strings coupled with sufficient ability to resonate.",
  "A limited number of basic woodworking techniques are used almost the world over in the production of stringed instruments. In lute construction the entire sound box (and sometimes the neck as well) can be hewn from one block of wood, as is the case with the boat lutes of Southeast Asia . Other instruments that often are made in this fashion are the Japanese  biwa  , the North African gimbrī , and the Puerto Rican cuatro . Existing side by side with this technique is another, in which the lute is made out of a kind of composite box in which any angular or curved portions are fashioned by heating and bending the wood (common examples include the violin and the guitar ). The resonator can be made of preexistent natural materials, as in the case of the Malagasy valiha  zither (made of bamboo), the South Indian vina (made from a gourd), or the lyre (made from a turtle shell) that was said to have been invented by Hermes .",
  "Though occasionally (as in the case of many harpsichords and virginals ) instruments with pictures painted on them are encountered, this decorative technique is most unusual—probably because it requires a separate artist—and most instrument makers prefer to show their skill by the choice of woods, by complex inlays, and by carving.",
  " gusla gusla  Anthropomorphic and zoomorphic shapes surmount many ancient harps and lyres. The anthropomorphic harps of ancient Egypt and modern Africa represents an example of this visually symbolic approach to instrument making, which has been described as producing “sounding statues.” In Europe anthropomorphic and zoomorphic carving exists side by side. Notable examples are the Irish Brian Boru harp, which exhibits a profuse variety of animal shapes; the Norwegian Hardanger fiddle , surmounted with a dragon’s head; and the viola d’amore, which often is surmounted with the head of a blindfolded woman. The Balkan  gusla  (a fiddle), and the Mongolian horsehead fiddle (or morin huur ) are usually crowned with a carved horse’s head, and the South Indian vina features a carving of a dragon. These shapes are not mere decoration or fancy; they represent important symbols in the society from which the instruments come.",
  "In East Asia the instrument maker’s emphasis is on the beauty of wood, excellence of finishing, and apparent simplicity of construction. Occasionally, on instruments such as the  qin  , one finds pictures painted or calligraphy inscribed. The proper material is extremely important: a qin , for example, ideally should be made of wood taken from an old tree that had nestled next to a bubbling stream. The  fenghuang  , immortal birds of Chinese mythology, are abundant in the nomenclature of East Asian instruments, and this fact serves to point up a profoundly important truth about musical instruments everywhere: they are intimately connected in folktale, myth, and legend to local symbols of immortality and rebirth. Thus, legend relates that Hermes made the first lyre from a turtle carapace; similarly, the first Arab lute was modeled after the body of a beloved male child; the Finnish culture hero Väinämöinen made the first zither, kantele , from the body of a giant pike; the Celts made their first legendary harp from whalebones. In each case, the symbolically significant creature is “reborn” as an instrument that “sings” as well as appears in a shape reminiscent of the creature modeled.",
  "Little or no evidence is available concerning the chordophones of prehistoric times: the earliest iconographic evidence and the oldest surviving specimens come from Mesopotamia and Egypt , and evidence concerning instruments earlier than these can be gleaned only from myth and legend.",
  "Some scholars have suggested that the harp evolved from the musical bow (usually classified as a type of zither), which must have been in existence prior to the establishment of Mesopotamian and Egyptian civilizations. Although the musical bow is virtually identical in shape to the hunter’s bow, it is uncertain whether the musical instrument might be derived from the weapon; indeed, there is no way of knowing whether humans hunted with a bow-shaped implement before they made musical sound with a bow. Among the early harps found in the burial chambers at the ancient Mesopotamian city of Ur (founded in the 4th millennium bce ) were bow-shaped (arched) instruments (one with 13 strings); nearly identical instruments were played in Egypt at roughly the same time. Iconographic evidence suggests that in both Egypt and Mesopotamia the harp, often played by women, was used in secular entertainments, although it had sacred uses as well.",
  "Within Asia, the harp family is well known in Myanmar (Burma), and although it was once used in China and India , it is no longer common in these countries; it is, rather, musically important in equatorial regions of Africa, in Europe , and, since European incursions, in the Americas. In contemporary Africa it likely is related to the Egyptian harps, and again it is associated with women. An exception in design and gender is the western African  kora  , a harp-lute (or bridge harp), which is traditionally played by men.",
  "The harp has maintained its importance in Europe. It is omnipresent in folktales and legends; it is the national symbol of Ireland . The Celtic harp must have been in use as early as the 10th century, and fragments of one were found in the 7th-century Sutton Hoo burial ship unearthed at Suffolk, England. In Gaul, Ireland, Wales, and Scotland, the harp was an important and favoured symbol; it was said that there were but three things necessary to a comfortable household—a virtuous wife, a chair cushion, and a harp. By the end of the 18th century, the harp had almost gone out of use in the Celtic realms, but by then the large orchestral harp had made its appearance in other places in Europe.",
  "This basic instrument (with the addition of a set of pedals for instantaneously altering the pitch of a note) is found—usually played by a woman—in the present-day symphony orchestra , but the older European harp tradition flourishes in Mexico and South America, where the harp is a component of various folk ensembles and is often played by men.",
  "  Greek legend credits the invention of the lyre to Hermes , who had stolen Apollo ’s cows and, in order to atone for his transgression, presented the god with the lyre, which he had accidentally discovered when he brushed against a turtle carapace that lay on the ground and, as he did so, heard its sinews begin to vibrate. The tale is interesting for two reasons: first, the turtle shell was, in fact, frequently used as the resonator of the Greek lyra , and, second, the tale makes an explicit relationship between the lyre and cattle. Similarly, in Mesopotamia the lyre was surmounted with a carved bull’s head, and today in East Africa the lyre is most frequently encountered in cattle cultures.",
  "A famous lyre from Ur (now at the Penn Museum, Philadelphia) is one of nine dug up at the burial ground; these and similar instruments seem to have been used both to accompany bardic recitations and for religious purposes. In view of the importance of the bull in the worship ceremonies of Crete and Mycenae, it is not surprising to find lyres among the stringed instruments of these peoples. In Celtic society depictions of lyres are found on the coins of pre-Christian Gaul. These instruments, which were U-shaped, may have come to western Europe from southwestern Asia with groups of Indo-European peoples who spread across Europe. Other types of lyres were found in Europe too, and it is possible that these variously shaped but still related instruments might be analogous to the various Indo-European languages in that they are basically closely related but quite different in detail.",
  "In medieval Germany and Scandinavia long, narrow lyres with four to seven strings were played. Similar lyres (the Finnish jouhikantele , the Finnish and Swedish-Estonian stråkharpa , the Welsh crwth ) were played with a bow in parts of Europe until the early 20th century; revivals of these instruments and the creation of new types of lyres began in the late 20th century. The lyre has continued to flourish in Ethiopia, Eritrea, Sudan, and South Sudan, in parts of East Africa, and among the fishermen of the Persian Gulf.",
  " kŏmungo kŏmungo  Several different types of instruments are classified as zithers ; they are used today in all continents. The long zithers of China, Japan, and Korea, which have a curved surface and a long, narrow shape, display a possible link to the idiochordic bamboo zithers of the Pacific, Southeast Asia, and southeastern Africa. The importance of bamboo to music in Asia is literally legendary; in Java, music is thought to have been first produced by the accidental admission of air into a bamboo tube. In China musical instruments are classified according to their constructional material; one of the eight substances in the system is bamboo, which the Chinese relate to the direction East, the season Spring, and the phenomenon Mountain. The Chinese zheng , a zither, includes the radical meaning “bamboo” in its ideograph. The ideographs of the older zithers—the qin and the se —are more difficult to interpret, however. Zithers of this type are known to have existed in the Shang period ( c. 1600–1046 bce ); the zheng was first documented during the Qin period (221–207 bce ). By the 8th century, this instrument had been introduced to Japan, where, as the 13-string koto , it flourishes today. The koto, like the zheng , is played frequently by women, though the head of a koto guild is usually a man.",
  " yangqin yangqin  A relative newcomer to the spectrum of Chinese zithers is the yangqin (“foreign zither”), the prototype of which reached China from Persia sometime during the Ming dynasty (1368–1644); it is the only representative of the box zither in East Asia. Sundanese chamber music of Indonesia often uses a kacapi , a box zither, usually with 18–20 strings and movable bridges. The history of this type of chordophone is obscure indeed, but two instruments of this general shape that may be very old are the African raft and board zithers. The raft zither is constructed on the idiochordic principle, but it uses a number of canes about half an inch (1.5 cm) in diameter; each of these has one string raised out of its own surface, and all of the canes are then lashed together. The board zither is made from a hollowed-out board over which a number of strings are attached. This latter instrument is found most notably in certain areas of East Africa; it is possible that its principle of construction was carried to the Middle East by traders.",
  " cimbalom Cimbalom  Medieval Arab authors (including Ibn Khaldūn ) mention a plucked trapezoidal zither, the qānūn (derived from Greek kanōn , “rule”). The present-day instrument has a range of three octaves with three strings to each pitch, and a complex system of levers by which its many strings may be finely and quickly retuned to the various Arab scales. Closely related is the Persian-derived sanṭūr , another trapezoidal zither that is struck by two light hammers. Versions of this zither are found in China ( yangqin ), Greece ( santouri ), and eastern Europe ( cimbalom ). These trapezoidal zithers are the prototypes for the later keyboard instruments of western Europe: the qānūn , which is played with two plectra, became, with the addition of a keyboard, the harpsichord ; the cimbalom, with the addition of a keyboard, became the piano . In the Middle Ages the keyboard was attached to a number of instruments, including the lute, the hurdy-gurdy , and the various Scandinavian keyed fiddles, of which the Swedish nyckelharpa survives. The experiment was truly successful, however, only on the clavichord , harpsichord, and later the piano; on the fiddle it always remained of peripheral importance.",
  "The first surviving evidence of the existence of the plucked lute comes from Mesopotamia and Egypt. One of the earliest Babylonian delineations ( c. 2500 bce ) shows a shepherd with a long-necked, small-bodied lute; this instrument, which was likely skin-bellied, had a rounded back that might well have been made from a turtle carapace (as in modern North Africa) or a gourd (as in Puerto Rico ). A similar instrument is also found in Egypt, and from specimens surviving from ancient times it is known that the stick forming the neck passed through the body of the instrument, ending at the sound hole, where it served as a fastener for the ends of the strings. This instrument, like the harp, survives in West Africa and in North Africa (as the gimbrī ).",
  "The Greeks of old seem to have made rather sparing use of the lute, but it was commonly encountered in Rome . Though the skin-bellied plucked lute predominated in the ancient Mediterranean, wood-bellied instruments have been more typical of Europe; indeed (with the exception of the African-derived banjo ), most currently used European lutes have wood bellies. The model for the European lute was the classical Arab lute, or al-ʿūd (“the wood”), which has been the most important instrument of classical Arab music for some 1,000 years. The instrument, with its characteristic pear-shaped body and bent-back pegbox, probably entered Europe through a number of different gateways, including Sicily , Andalusia , and Palestine with the Crusaders. Though European and Arab lutes are very similar in general construction, the Arab lute is not fretted as is the European lute, and the European lute little by little acquired additional courses of strings during the Renaissance , when it became a standard instrument for solo playing and the accompaniment of singers. The many courses of strings caused numerous problems: “When a lute-player is 80 years old,” wrote the 18th-century German theorist Johann Mattheson sarcastically, “he has spent 60 years tuning his instruments.”",
  "The many lutelike instruments of modern India (  tambura  , vina , sitar , and sarod ) are, technically speaking, lute-zithers, since their fingerboards are hollow; in appearance and playing technique, however, they are indistinguishable from lutes. They seem to represent a special, and quite recent, subfamily of chordophones.",
  "In East Asia the plucked lute family exists only in a comparatively recent manifestation, but both in a wood-bellied form (as in the Chinese  pipa  , the Korean tang pip’a and hyang pip’a , and the Japanese  biwa  ) and a skin-bellied version (the Chinese  sanxian  and the Japanese samisen ). In Japan the Shōsō Repository at Nara preserves three biwa s used at a great concert held in 752. The biwa-pipa family can be traced ultimately to Persia , where, as the short-necked barbat , it influenced the music of Afghanistan and Turkistan on its way to China, Korea, and Japan. The skin-bellied lute, in China the sanxian , can be traced in China only to the 13th century; from there it was taken to the Ryukyu Islands and thence to Japan (mid-16th century), where it still plays an important musical role as the samisen.",
  "The principle of bowing is nearly always applied to stringed instruments of the lute class, though one occasionally finds it used with zithers or lyres. It is difficult, if not impossible, to make a clear-cut distinction between plucking with a plectrum and bowing, since plucking sometimes involves rubbing the string. But bowing, defined as the use of the almost universally encountered horsehair bow, can be traced as far back as the Muslim civilization of the 10th century. The stroked rabāb evidently possessed a long neck and up to four strings. There is no iconographic evidence of such instruments before the 13th century in Islam itself, though an illustration ( c. 930) from Christian Spain delineates a bowed instrument with three strings. In Byzantium too the bowed lira (lute) existed by this time, and it seems likely that the principle of bowing originated among the horse cultures of Central Asia , whence it spread quickly through the Muslim world and to the East, so that by 1000 it had almost simultaneously reached China, Java, North Africa , the Middle East and the Balkans , and other parts of Europe. Research has shown that a word meaning “horse” is given to the bridge of the fiddle throughout Eurasia, from Japan ( koma ) to western Norway ( hest ). In China the fiddle (  huqin  ) is acknowledged to have come from the “barbarians” of Central Asia; in those days it was in China an instrument of the people; later, at the time of Kublai Khan , it began to be used in court music. A similar Korean instrument, the  haegŭm  , is thought also to have come from Central Asia, but it was ultimately associated with the Korean court tradition called tang’ak (Tang and Song Chinese music). In Africa the fiddle seems to have entered the continent with Islam .",
  " Les Echecs amoureux  In Europe the bow appears first in Spain and shortly thereafter in Italy , and it is suspected that it entered through Muslim Spain and Sicily , though it is possible that other fiddles entered Europe through the Balkans, Hungary , and Scandinavia. Even in early illustrations, evidence is found of the uniquely European method of holding the fiddle against the shoulder. At the same time, other European fiddles were held vertically, the manner in which fiddles are held everywhere else in the world. Early European fiddles were made (by their players) in only two parts: the belly was a thin piece of spruce or fir wood, and the back was hollowed out of one piece of hardwood. These medieval fiddles divide into two types, one of which has a clearly discernible neck and the other of which possesses a neck that merges imperceptibly into the body; this second type, exemplified by the rebec , is equivalent to the North African rabāb and the Byzantine-Greek lira . As the centuries passed, Europe continued to have two distinct types of fiddles: one, relatively square-shaped, held in the arms, became known as the viola da braccio (“arm viol”) family and evolved into the violin ; the other, with sloping shoulders and held between the knees, was the viola da gamba (“leg viol ”) group. The gambas, which were important and elegant instruments during the Renaissance , eventually lost ground to the louder (and originally less aristocratic) braccio-violin family.",
  "Beginning in the second half of the 20th century, electronic technology made remarkable changes in the structure and function of many stringed instruments by making amplification and tonal change possible. The best known and most pervasive example is the electric guitar, which, strictly speaking, is a chordophone but is often classified as an electrophone . The electric guitar may be hollow-bodied like a traditional guitar or solid-bodied, but in either case amplification of the strings is provided by a “pickup” (or contact microphone) that creates artificial resonance through its connection to amplifiers and loudspeakers . Pickups are often attached to violins, lutes, and other instruments, as well as to guitars, making these instruments usable in noisy environments and vast amphitheatres . Musicians who use such instruments (especially electric guitars) have developed feedback and other techniques that can alter the timbre beyond recognition. The shapes of newly designed electronic violins and guitars also differ from their acoustic forebears.",
  "The violin family comprises the violin , the viola , the cello (violoncello), and the double bass ; it forms the backbone of the modern symphony orchestra . In addition, the violin and the viola are widely used in the music of South India and North Africa, in contemporary Greek and Arab music, in European and American folk music , and by Roma musicians. The term violin is a diminutive of viola (itself an abbreviation of viola da braccio ).",
  "Bowed chordophones seem to have originated in Central Asia and spread rapidly throughout Eurasia in perhaps the 10th century. Though many different applications of the bowing principle existed in medieval and Renaissance Europe, one direct ancestor of the violin may have been the polnische Geige (Polish fiddle), mentioned as early as 1545 by German composer and teacher Martin Agricola and later by German composer and theorist Michael Praetorius .",
  "An immediate precursor of the violin was the lira da braccio , an elaborate instrument of the Renaissance , whose form foreshadowed the physical essentials of the violin body: the arched modeling of the belly and back and the shallow ribs. This shallow arched form probably encouraged or suggested another important detail: the use of a short vertical stick to prop the front and back apart and prevent the collapse of the belly arch under pressure of the strings. This device, the sound post, is peculiar to the violin family, although it was later used on the viola da gamba family (known as the viols ). It is the acoustic effect of the sound post that imparts to the violin its lively response and generous singing tone, for it couples and coordinates the vibrations of the body as a whole, under the influence of the strings.",
  "Although the generic name for the family is the Italian viola (whence violino, “small viola”; violone, “large viola”; violoncello, “small violone”), the treble instrument very soon became its most important member, from which the others took their main characteristics. Unlike the treble viols, whose tone was reticent and impersonal, the violin was always recognized both for its superior cantabile and for its inherent sprightliness and smart attack, especially in Italy, its birthplace, where the earliest makers, Gasparo da Salò, Andrea Amati , and Giovanni Paolo Maggini, had settled its average proportions before the end of the 16th century. Thus, the violin arrived at exactly the right time to lend impetus and conviction to the innovations of the Florentine school of composers, whose preoccupation with the expressive qualities of the solo voice marked a breakaway from the older polyphony . To this movement the violin formed the perfect instrumental counterpart.",
  "Two other features contributed to the character of the violin, the first being the tuning of the strings in fifths and their numerical limitation to four. This wide regular tuning was ideal in furnishing a uniform diatonic fingering technique (i.e., stepwise, as in major and minor scales), reducing the amount of string-crossing the bow has to do, generally freeing the bridge from too many strings and permitting better clearance on each string for bowing. The second additional feature is the unfretted fingerboard, in which the violin followed the lira da braccio . No doubt frets, if they were ever used, were removed from the arm viols because they impeded the use of the hand in supporting the instrument and in fingering. It is also true that the direct stopping of the strings by the fleshy part of the fingertips produces a tone quality that, although slightly damped, is more assertive and flexible than the tone obtained from the use of frets, as on the viols.",
  "The violin family came to be used in a way that was entirely new in instrumental music—i.e., as a massed “choir” in which the several parts were doubled at unison by instruments of like kind. This string ensemble, so different in its effect from the chamber music of the preceding “golden age,” owes its first organization, if not its invention, to the French at the court of Louis XIV , whose vingt-quatre violons du Roi (“24 violins of the king”) was the model for Europe of the orchestra-to-be.",
  "  All members of the violin family are basically similar in structure, nomenclature, and playing method. The shape of members of this family represents an extremely efficient method for the production and amplification of tone, as well as flexibility and convenience for the player. Instruments of the violin family are, however, difficult to play, requiring many arduous years of practice before they are mastered. They are made, following builders’ experience and convention, of several different woods that have been dried and aged with the greatest care. The creator of a successful instrument in this family must be a true artisan, skilled in wood selection, carving, shaping, and assembly. The nomenclature of these instruments is basically anthropomorphic, with the playing surface being termed the belly, the opposite side the back, and the sides the ribs. Names of some parts, however, seem to hint at the origins of bowed instruments among the horse cultures of Central Asia—e.g., tailpiece, saddle, and tailpin.",
  "  All members of the violin family have a body that consists of a belly of spruce or pine and a back of sycamore, maple, or a similar hardwood, spaced apart by shallow ribs of the same material. The arching of the belly and back is both transverse and longitudinal, creating a central bulge, flattening off in all directions to the edges. In most cases the bulge changes from convexity to concavity as it approaches the edges, which are given a slight upward curl. The arching is worked from solid wood of suitable thickness, which is dug out on its undersurface to a curve that follows the general contour of the outward modeling but not exactly, for the finished thickness is graduated in all directions, being thinnest in the margins of the outline just inside the ribs. The adjustment of these thicknesses is one of the prime skills in the art of violin making. The wood used in both back and belly is usually, though not always, cut “on the quarter”—i.e., in wedge-shaped segmental planks from the centre to the outside of the log. To form a plate, two wedges are glued “back to back” with the thin edges outward. This not only provides the basis for the modeling but also ensures that the annular rings of the tree are evenly disposed about the centre line of the plate, the oldest growth being on the outside edges.",
  "The familiar outline of the violin body is visually satisfying, perhaps because its balance and proportion are largely functional. Its master makers have evolved a form based on an artistic unity of opposed curves that allows free play to individual nuance with scarcely any measurable deviation from the norm. The rounded, outward-curving sections of the body, called the upper and lower bouts, are separated by the indented waist, or middle bout, which provides clearance for the bow on the outer strings. The middle bout meets the upper and lower to form outturned corners, where the ribs are brought together and glued firmly to corner blocks within the instrument. Other blocks, called end blocks, are mounted top and bottom centre to provide firm bearings for the neck and the tailpin, which between them have to resist the tension of the strings. The ribs are slightly inset from the outline of the belly and back, so that the edge overhangs all around. The internal corners between the ribs and the plates are strengthened by a narrow fillet of pine, called the linings, which runs between the blocks. Despite the very considerable stresses to which it is subject, the violin body is held together by simple flush glued joints, which can in emergency be opened up, without damaging the instrument, for repairs.",
  "The arched belly (or soundboard ) of the violin and its relatives is supported in a curiously unorthodox and individual way, quite different from the regular barring of instruments with flat soundboards. The sound post is a loose stick of pine, carefully cut to size, that is wedged between the plates of the finished instrument under, but a little behind, the top-string side of the bridge. It is not fixed: its position is critical and must be adjusted with great care for the best tonal result. This adjustment is made through the sound holes in the belly. The other side of the bridge is supported by a bar glued under the belly and running lengthways along the grain of the wood. This bar, called the bass bar, is deepest under the bridge but tapers to nothing at either end, since it fits into the internal curvature of the belly. Externally, the plates are finished off at the edges with a narrow inlay of laminated woods, the purfling, which follows the outline close to the edges. This, the only decoration normally permitted, has the function of preventing incipient splits from running.",
  "The neck and head are cut from a solid block of sycamore wood. The lower end is formed into a shoulder that abuts against the ribs at the top of the body and, in fact, passes through them into a shallow mortise cut in the end block within. The back end of this shoulder is covered by a projection of the wood at the top of the back, known as the button. The pegbox carries the four tuning pegs, two on each side. It is slotted to the front to receive the strings. The pegs are tapered and pass through two holes in the cheeks of the head. At the top of the head is the scroll, again a typical embellishment of the violin, its austere purity of line and curve being both the challenge and the sign manual of the master instrument maker. The front face of the neck is flat, and to this is glued the curved fingerboard, which projects beyond the shoulder and over the belly toward the bridge. At the top of the neck is the nut, which is grooved to take the strings, keeping them correctly spaced apart and slightly raised over the fingerboard. The neck is raked back at an angle with the plane of the belly, so that the fingerboard rises with the strings toward the bridge. The bridge is high and arched because of the bowing technique. It is formed with two feet that are carefully cut to fit the transverse arch of the belly and is given a conventional perforated or fretted design, which is said to aid its free vibration. In section it is wedge-shaped, tapering to the thin, notched edge over which the strings pass. It is not a fixture but is kept in position only by the pressure of the strings. Its correct position is between the sound holes and just above the lower corners of the middle bout. The sound holes are of italic f form, sweeping outward and downward from the waist to the lower corners. A line joining the crosses of the f s marks the approximate position of the bridge. The lower ends of the strings are held by the long tailpiece below the bridge, whose function is to reduce the length of unused string behind the bridge and to keep the strings pulling radially inward on its top edge. The lower end of the tailpiece is anchored by a loop of gut to an ebony button (the tailpin) set in a hole in the lower end block. The saddle takes the pull of the tailgut off the edge of the belly.",
  "The violin itself is normally tuned in fifths (g, d′, a′, e″), although other tuning systems (called scordatura ) have been used for special musical purposes; the viola is tuned one-fifth lower than the violin (c, g, d′, a′); and the cello is tuned exactly one octave below the viola (C, G, d, a). The double bass, which has had many different tunings and various numbers of strings over the years, is now tuned in fourths (E{sub prime}, A{sub prime}, D, G).",
  "The violin and viola are played in the horizontal position—i.e., “under the chin.” The cello (customary abbreviation of violoncello ) and double bass both stand vertically on the floor, the first resting on a long steel rod called the end pin. Cello players hold the instrument between their knees while seated. For the double bass the player stands or rests on a high stool. As is done with every other necked stringed instrument, the player’s left hand fingers the instrument, the bow being held in the right. The highest string is to the right, when the instrument is viewed from the front, and the lowest to the left.",
  "In contemporary usage the violin and viola are held between the chin and the collarbone with the aid of a chin rest, which leaves both hands free for manipulation of the instrument and its bow. In earlier styles and in folk music, the violin was not held in a standard position; however, a common practice was to position the instrument so that it sloped downward, resting on the chest.",
  "During its history the violin has been subject to modifications that have progressively adapted it to its evolving musical functions. In general, the older types have been more deeply arched in the plates, and the more modern, following the innovations of Antonio Stradivari (1644?–1737), have been shallower, which has affected the overall tonal characteristics. The stresses to which the instrument is subjected under working conditions have increased not only because of the rise in standard tuning pitch from the 17th century onward but also because of certain changes in physical design from about the beginning of the 19th century. Before that time the height of the bridge and its arching were lower, the neck thicker and wider, and the bass bar shallower and shorter. These, with the type of bow then in use and the lower pitch, produced the small, delicate tone that served composers up to the time of Mozart (1756–91). With the advent of larger auditoriums and the development of the violin virtuoso, however, greater power was demanded, and this demand was met by raising the height of the bridge, lengthening and slimming the neck slightly and setting it back at a greater angle, and putting in a stronger bass bar. The sum effect of these alterations was to develop the optimum sonority of which the instrument was capable, and the long experience of makers and players has shown that the Stradivari type with its shallower arching has stood up best to this metamorphosis. All fine violins now in use have been thus modified to bring them into line with modern technique and playing conditions.",
  "The viola is similar to the violin in every essential, but, owing to its larger size, it has never been completely standardized in its main dimensions, since, whatever these are, they are bound to tax the human frame and fingers when the instrument is played. A compromise has to be effected between what is the ideal size for the best tonal results and what is practicable to the player in handling. Too large an instrument is simply unplayable; too small an instrument is weakest where it is most wanted—on the lower strings. The problem has never been solved to complete satisfaction, but a characteristic viola tone has been produced that is darker, more weighty, and more sombre than the violin. Most violas have been made at various times with a body length (the most convenient measure of their maneuverability) of 15–18 inches (38–46 cm); probably the majority of the most manageable and successful instruments are midway between these extremes.",
  "The true bass of the violin, and the member of the family most nearly approaching it in character, is the cello , or violoncello. In build it differs somewhat, the ribs being proportionately much deeper and the much higher bridge standing on legs rather than feet. The neck is raked back at a sharper angle to allow for the height of the bridge. The instrument is held between the knees while it rests on an end pin, which is telescoped through the tailpin and can be clamped in any position to adjust the height of the instrument above the floor. This playing position leaves both arms exceptionally free; in particular, the left-hand technique is more fluid and covers a wider range than in any other stringed instrument. This is strikingly shown by the ease with which a good cellist commands the brilliant solo register of the top (A) string, high above the normal tessitura (general playing range) of the instrument.",
  "The double bass has numerous features that set it apart from other members of the violin family. For example, it only rarely serves as a solo instrument. In the symphony orchestra it often serves simply to double the cello part one octave lower, and it is not even included in such standard musical ensembles as the string quartet. Furthermore, even though double basses have been in use for as long as the violin, they are not yet completely standardized in number of strings, tuning, shape, or body size.",
  "The bass is sometimes made with the blunt corners, sloping shoulders, and flat back associated with the viola da gamba family, and in fact the instrument is commonly known as the bass viol. But true double bass violins, with arched back and outturned corners, have existed since the early 17th century and are still in use. The unusual tuning in fourths, which is almost universal on the bass, was adopted because the great length of the strings, (42  1  2  inches (108 cm), makes the whole-tone interval in the fingering so large that it can be covered only by the span of the first and fourth fingers. The closer tuning therefore brings the technique of fingering more into line with what is possible on the smaller instruments—namely, a scalewise (diatonic) fingering that reduces hand movements to a minimum. The normal tuning—E{sub prime}, A{sub prime}, D{sub prime}, G—means that the bass cannot descend an octave below the cello’s bottom string, and it is for this reason that a low fifth string is sometimes added, tuned to B{sub prime} or C{sub prime}. The latter note occurs in symphonic works from the Classical period onward—for example, in Richard Strauss ’s Also sprach Zarathustra (1896; Thus Spoke Zarathustra )—and is being more specifically demanded by contemporary composers.",
  "Another method of attaining C{sub prime} is to fit an attachment mechanism that lengthens the existing E string (which is carried up to the top of the head on an extension bar) when these low notes are wanted. This method has the advantage of preserving the normal four strings and their normal tuning for all ordinary purposes and imposing no extra load on the bridge, as does the addition of a fifth string.",
  "On the double bass the pegs are replaced by a “machine head,” such as is commonly used on guitars and other plucked instruments, each tuning peg being fitted with a worm-and-wheel screw adjuster. The pegs themselves are made of solid brass. The “tailgut” of the smaller instruments is also replaced by metal, usually a thick copper wire but preferably a stranded steel cable. An extending end pin, similar to the pin used on the cello, is now in universal use. On most basses the ribs are not of equal depth all around but are cut away at the top so that the back slants toward the shoulder of the neck in its upper part. This enables the player to bring the neck and upper portion of the body closer to him and makes for ease of handling. The usual size of the bass, about 6 feet (1.8 metres) high, is about as large as the average person can manage for modern technical requirements. This size has been known since the early 17th century, but larger and smaller basses have been made at all times. In jazz ensembles the electric upright bass—a slender instrument that is easier to transport—is common. In most rock and some jazz bands, the place of the double bass is taken by the electric bass guitar.",
  " Johann Sebastian Bach , along with other composers, occasionally wrote for the small high-pitched instrument known as the violino piccolo ; now and then his works also require the viola d’amore (a fretless hybrid shaped like a viol but sized and played like a viola with sympathetic strings) or the elusive violoncello piccolo (a small cello). These instruments have been in disuse for many years, except for historical reconstructions of earlier music.",
  "The violin and cello are obtainable in several sizes suitable for young children, who, as they grow, move progressively from quarter- to half- to full-size instruments. This practice was encouraged particularly by adherents of the Japanese Suzuki method of string instruction, who have exported their philosophy, methods, and instruments to all quarters of the globe.",
  "The violin bow consists of a strong, light, flexible wooden stick, sprung so that a ribbon of horsehairs can be stretched between its ends. Before the bow is used, the horsehair is drawn across a solid cake of resin , rubbing off a small quantity in powder form; this supplies the frictional element that is necessary to make the string vibrate. Proper design is as important in a violin bow as in the violin itself, for it must give the player a feeling of complete control over the tone he is producing and must respond to every nuance of pressure and attack imposed upon it.",
  "Until the late 18th century, the bow stick was either straight or (as on a hunting bow) bent outward from the horsehair, which was under comparatively low tension. This type of bow, which was used during the Baroque and Classical periods, was short and had a light head and a narrow ribbon of horsehair.",
  "The modern bow, which is really the culmination of a long line of evolution, was perfected late in the 18th century by François Tourte of Paris . Its chief point of departure is that the curve of the bowstick is concave rather than convex, which thus puts the horsehair under considerable pressure (necessary for today’s bowing technique). The light tapering stick now is made of brazilwood (Pernambuco wood) with a hatchet-shaped head formed at the thinner end. At the other end is a movable frog, which has a threaded eye projecting into a mortise or groove cut in the stick and runs on a screw that can be turned at the lower end of the stick. The hank of hair is stretched between the head and frog, and its tension is adjusted by the screw. The hair is retained as a flat ribbon by passing through a specially shaped ferrule and a shallow channel in the frog before it is wedged into a socket farther along. The hair is usually concealed in the channel by a small sliding panel made of mother-of-pearl. The hair is similarly wedged in the head, the front of which is faced with ivory or silver to protect it from damage. When the screw is slackened off and the hair is loosened, the stick curves toward the hair. When the hair is tightened, the stick straightens out, or rather the curve flattens somewhat. It is the correct setting of this curve, which is put into the stick by bending under dry heat, and the exact shaping of the tapering section of the stick that give a good bow its desired qualities.",
  "The larger instruments have followed the violin in bow design, adapting it to their special purposes by adjustments of dimension and weight. For a long time the double bass lagged behind, and during the first half of the 19th century this instrument was still being played with a broad, heavy version of the earlier outcurved bow. This was supplanted in France , and in other countries under French influence, by the violin-type bow and in Austria and German-speaking countries generally, a little later, by the Simandl bow, named after Franz Simandl, a double-bass professor at the Vienna Conservatory from 1869 to 1910. This bow is really an adaptation of the older type but with an incurved stick, wide frog, and narrow head.",
  "Historical surveys, together with information on sound production in different types of instruments, are found in Martha Maas and Jane McIntosh Snyder , Stringed Instruments of Ancient Greece (1989); Hortense Panum , The Stringed Instruments of the Middle Ages, Their Evolution and Development (1939, reprinted 1971; originally published in Danish, 1915); Otto Andersson , The Bowed-Harp: A Study in the History of Early Musical Instruments (1930, reissued 1973; originally published in Swedish, 1923); Werner Bachmann , The Origins of Bowing and the Development of Bowed Instruments Up to the Thirteenth Century (1969; originally published in German, 2nd ed., 1966); and Mary Remnant , English Bowed Instruments from Anglo-Saxon to Tudor Times (1986). The most important family among Western stringed instruments is described and analyzed in David D. Boyden  et al.,  The New Grove Violin Family (1989; also published as Violin Family ); and Sheila M. Nelson , The Violin and Viola (1972). Henry Rasof , The Folk, Country, and Bluegrass Musician’s Catalogue (1982), provides good coverage of 11 stringed folk instruments. For separate instruments, see Roslyn Rensch , Harps and Harpists (1989), a history with analysis of the instrument design and schools of playing; Joan Rimmer , The Irish Harp , 3rd ed. (1984); Susan Palmer and Samuel Palmer , The Hurdy-Gurdy (1980), a useful account of this little-studied instrument; Pandora Hopkins , Aural Thinking in Norway: Performance and Communication with the Hardingfele (1986), a thorough, original study; R.H. van Gulik , The Lore of the Chinese Lute: An Essay in Ch’in Ideology , new rev. ed. (1969); John Henry Felix , Leslie Nunes , and Peter F. Senecal , The Ukulele: A Portuguese Gift to Hawaii (1980); James Tyler and Paul Sparks , The Early Mandolin (1989); William R. Cumpiano and Jonathan D. Natelson , Guitarmaking, Tradition and Technology: A Complete Reference for the Design and Construction of the Steel-String Folk Guitar and the Classical Guitar (1987); José Romanillos , Antonio de Torres, Guitar Maker: His Life and Work (1987); and David Russell Young , The Steel String Guitar: Construction & Repair , updated ed. (1987)."
]