[
  " Camellia sinensis  tea , beverage produced by steeping in freshly boiled water the young leaves and leaf buds of the tea plant, Camellia sinensis . Two principal varieties are used, the small-leaved China plant ( C. sinensis variety sinensis ) and the large-leaved Assam plant ( C. sinensis variety assamica ). Hybrids of these two varieties are also grown. The leaves may be fermented or left unfermented.",
  "According to legend, tea has been known in China since about 2700 bce . For millennia it was a medicinal beverage obtained by boiling fresh leaves in water, but around the 3rd century ce it became a daily drink, and tea cultivation and processing began. The first published account of methods of planting, processing, and drinking came in 350 ce . Around 800 the first seeds were brought to Japan, where cultivation became established by the 13th century. Chinese from Amoy brought tea cultivation to the island of Formosa (Taiwan) in 1810. Tea cultivation in Java began under the Dutch, who brought seeds from Japan in 1826 and seeds, workers, and implements from China in 1833.",
  "In 1824 tea plants were discovered in the hills along the frontier between Burma and the Indian state of Assam. The British introduced tea culture into India in 1836 and into Ceylon (Sri Lanka) in 1867. At first they used seeds from China, but later seeds from the Assam plant were used.",
  "The Dutch East India Company carried the first consignment of China tea to Europe in 1610. In 1669 the English East India Company brought China tea from ports in Java to the London market. Later, teas grown on British estates in India and Ceylon reached Mincing Lane, the centre of the tea trade in London. By the late 19th and early 20th centuries, tea growing had spread to Russian Georgia, Sumatra, and Iran and extended to non-Asian countries such as Natal, Malawi, Uganda, Kenya, Congo, Tanzania, and Mozambique in Africa, to Argentina, Brazil, and Peru in South America, and to Queensland in Australia.",
  "Teas are classified according to region of origin, as in China, Ceylon, Japanese, Indonesian, and African tea, or by smaller district, as in Darjeeling, Assam, and Nilgris from India, Uva and Dimbula from Sri Lanka, Keemun from Chi-men in China’s Anhwei Province, and Enshu from Japan.",
  "Teas are also classified by the size of the processed leaf. Traditional operations result in larger leafy grades and smaller broken grades. The leafy grades are flowery pekoe (FP), orange pekoe (OP), pekoe (P), pekoe souchong (PS), and souchong (S). The broken grades are: broken orange pekoe (BOP), broken pekoe (BP), BOP fanning, fannings, and dust. Broken grades usually have substantial contributions from the more tender shoots, while leafy grades come mainly from the tougher and maturer leaves. In modern commercial grading, 95 to 100 percent of production belongs to broken grades, whereas earlier a substantial quantity of leafy grades was produced. This shift has been caused by an increased demand for teas of smaller particle size, which produce a quick, strong brew.",
  "The most important classification is by the manufacturing process, resulting in the three categories of fermented (black), unfermented (green), and semifermented (oolong or pouchong). Green tea is usually produced from the China plant and is grown mostly in Japan, China, and to some extent Malaysia and Indonesia. The infused leaf is green, and the liquor is mild, pale green or lemon-yellow, and slightly bitter. Black tea, by far the most common type produced, is best made from Assam or hybrid plants. The infused leaf is bright red or copper coloured, and the liquor is bright red and slightly astringent but not bitter, bearing the characteristic aroma of tea. Oolong and pouchong teas are produced mostly in southern China and Taiwan from a special variety of the China plant. The liquor is pale or yellow in colour, as in green tea, and has a unique malty, or smoky, flavour.",
  "  In tea manufacture, the leaf goes through some or all of the stages of withering, rolling, fermentation, and drying. The process has a twofold purpose: (1) to dry the leaf and (2) to allow the chemical constituents of the leaf to produce the quality peculiar to each type of tea.",
  " Camellia sinensis Camellia sinensis  The best-known constituent of tea is caffeine, which gives the beverage its stimulating character but contributes only a little to colour, flavour, and aroma. About 4 percent of the solids in fresh leaf is caffeine, and one teacup of the beverage contains 60 to 90 milligrams of caffeine. The most important chemicals in tea are the tannins, or polyphenols, which are colourless, bitter-tasting substances that give the drink its astringency. When acted upon by an enzyme called polyphenol oxidase, polyphenols acquire a reddish colour and form the flavouring compounds of the beverage. Certain volatile oils contribute to the aroma of tea, and also contributing to beverage quality are various sugars and amino acids.",
  "Only black tea goes through all stages of the manufacturing process. Green tea and oolong acquire their qualities through variations in the crucial fermentation stage.",
  "  Plucking the leaf initiates the withering stage, in which the leaf becomes flaccid and loses water until, from a fresh moisture content of 70 to 80 percent by weight, it arrives at a withered content of 55 to 70 percent, depending upon the type of processing.",
  "In the traditional process, fresh leaf is spread by hand in thin layers onto trays or sections of coarse fabric called tats. It is then allowed to wither for 18 to 20 hours, depending upon several factors that include the temperature and humidity of the air and the size and moisture content of the leaf. Withering in the open air has been replaced by various mechanized systems. In trough withering, air is forced through a thick layer of leaf on a mesh in a trough. In drum withering, rotating, perforated drums are used instead of troughs, and in tunnel withering, leaf is spread on tats carried by mobile trolleys and is subjected to hot-air blasts in a tunnel. Continuous withering machines move the leaf on conveyor belts and subject it to hot air in an enclosed chamber, discharging withered leaf while fresh leaf is simultaneously loaded.",
  "Mechanized systems greatly reduce withering time, but they can also lower the quality of the final product by reducing the time for chemical withering, during which proteins and carbohydrates break down into simpler amino acids and sugars, and the concentration of caffeine and polyphenols increases.",
  "At this stage, the withered leaf is distorted, acquiring the distinctive twist of the finished tea leaf, and leaf cells are burst, resulting in the mixing of enzymes with polyphenols.",
  "The traditional method is to roll bunches of leaves between the hands, or by hand on a table, until the leaf is twisted, evenly coated with juices, and finally broken into pieces. Rolling machines consist of a circular table fitted in the centre with a cone and across the surface with slats called battens. A jacket, or bottomless circular box with a pressure cap, stands atop the table. Table and jacket rotate eccentrically in opposite directions, and the leaf placed in the jacket is twisted and rolled over the cone and battens in a fashion similar to hand rolling. Lumps of rolled leaf are then broken up and sifted. The smaller leaf passing through the sieve—called the fines—is transferred to the fermentation room, and the remaining coarse leaf is rolled again.",
  "In many countries, rolling the leaf has been abandoned in favour of distortion by a variety of machines. In the Legg cutter (actually a tobacco-cutting machine), the leaf is forced through an aperture and cut into strips. The crushing, tearing, and curling (CTC) machine consists of two serrated metal rollers, placed close together and revolving at unequal speeds, which cut, tear, and twist the leaf. The Rotorvane consists of a horizontal barrel with a feed hopper at one end and a perforated plate at the other. Forced through the barrel by a screw-type rotating shaft fitted with vanes at the centre, the leaf is distorted by resistor plates on the inner surface of the barrel and is cut at the end plate. The nontraditional distorting machines can burst leaf cells so thoroughly that in many cases they render the withering stage unnecessary. However, unlike traditional rolling, they do not produce the larger leafy grades of tea.",
  "Fermentation commences when leaf cells are broken during rolling and continues when the rolled leaf is spread on tables or perforated aluminum trays under controlled conditions of temperature, humidity, and aeration. The process actually is not fermentation at all but a series of chemical reactions. The most important is the oxidation by polyphenol oxidase of some polyphenols into compounds that combine with other polyphenols to form orange-red compounds called theaflavins. The theaflavins react with more units to form the thearubigins, which are responsible for the transformation of the leaf to a dark brown or coppery colour. The thearubigins also react with amino acids and sugars to form flavour compounds that may be partly lost if fermentation is prolonged. In general, theaflavin is associated with the brightness and brisk taste of brewed tea, while thearubigin is associated with strength and colour.",
  "In traditional processing, optimum fermentation is reached after two to four hours. This time can be halved in fermenting leaf broken by the Legg cutter, CTC machine, and Rotorvane. In skip fermentation, the leaf is spread in aluminum skips, or boxes, with screened bottoms. Larger boxes are used in trough fermentation, and in continuous fermentation the leaf is spread on trays on a conveyor system. In all of these fermentation systems the leaf is aerated by forced air (oxygen being necessary for the action of the enzymes), and it is brought by automated conveyor to the dryer.",
  "At this stage, heat inactivates the polyphenol enzymes and dries the leaf to a moisture content of about 3 percent. It also caramelizes sugars, thereby adding flavours to the finished product, and imparts the black colour associated with fermented tea.",
  "Traditionally, fermented leaf was dried on large pans or screens over fire, but since the late 19th century, heated forced air has been used. A mechanized drier consists of a large chamber into the bottom of which hot air is blown as the leaf is fed from the top on a series of descending conveyors. The dried leaf is then cooled quickly to prevent overdrying and loss of quality. Modern innovations on the drier are the hot-feed drier, where hot air is supplied separately to the feeder to arrest fermentation immediately as the leaf is fed, and the fluid-bed drier, where the leaf moves from one end of the chamber to the other over a perforated plate in a liquid fashion.",
  "In preparing unfermented tea, the oxidizing enzymes are killed by steamblasting the freshly plucked leaf in perforated drums or by roasting it in hot iron pans prior to rolling. The leaf is then subjected to further heating and rolling until it turns dark green and takes a bluish tint. The leaves are finally dried to a moisture content of 3 to 4 percent and are either crushed into small pieces or ground to a powder.",
  "With the inactivation of polyphenol oxidase, the polyphenols are not oxidized and therefore remain colourless, allowing the processed leaf to remain green. The absence of theaflavins and thearubigins in the finished leaf also gives the beverage a weaker flavour than black tea.",
  " chawan chasen   Matcha , a powdered green tea of Japanese origin by way of China that is popular among tea connoisseurs everywhere, is grown according to strict rules. Matcha must be taken from shade-grown tea plants, which have heightened levels of chlorophyll and have a bright green colour, and only the buds and top three layers of the young tea plant ( Camellia sinensis ) are harvested. The tea leaves are steamed to halt the oxidation process, then deveined and ground in stone mills. Because of such laborious and exacting production standards, matcha is among the most expensive kinds of teas on the market.",
  "After a brief withering stage, the leaf is lightly rolled by hand until it becomes red and fragrant. For oolong it is then fermented for about one-half, and for pouchong for one-quarter, of the time allowed for black tea. Fermentation is stopped by heating in iron pans, and the leaf is subjected to more rolling and heating until it is dried.",
  "The first step in packaging tea is grading it by particle size, shape, and cleanliness. This is carried out on mechanical sieves or sifters fitted with meshes of appropriate size. With small-sized teas in demand, some processed teas are broken or cut again at this stage to get a higher proportion of broken grades. Undesirable particles, such as pieces of tough stalk and fibre, are removed by hand or by mechanical extractor. Winnowing by air removes dust, fibres, and fluff.",
  "Teas are packed in airtight containers in order to prevent absorption of moisture, which is the principal cause of loss of flavour during storage. Packing chests are usually constructed of plywood, lined with aluminum foil and paper, and sealed with the same material. Also used are corrugated cardboard boxes lined with aluminum foil and paper or paper sacks lined with plastic.",
  "Blended teas are sold to consumers as loose tea, which is packed in corrugated paper cartons lined with aluminum foil, in metal tins, and in fancy packs such as metallized plastic sachets, or they are sold in tea bags made of special porous paper. Tea bags are mainly packed with broken-grade teas.",
  "Instant teas are produced from black tea by extracting the liquor from processed leaves, tea wastes, or undried fermented leaves, concentrating the extract under low pressure, and drying the concentrate to a powder by freeze-drying, spray-drying, or vacuum-drying. Low temperatures are used to minimize loss of flavour and aroma. Instant green teas are produced by similar methods, but hot water is used to extract liquor from powdered leaves. Because all instant teas absorb moisture, they are stored in airtight containers or bottles.",
  "  Tea sold to the consumer is a blend of as many as 20 to 40 teas of different characteristics, from a variety of estates, and from more than one country. Price is an important factor, with cheap teas (called fillers) used to round off a blend and balance cost. Blends are often designed to be of good average character without outstanding quality, but distinctive blends—for example, with a flavour of seasonal Ceylon tea or the pungency and strength of Assam tea—are also made.",
  "A tea infusion is best made by pouring water just brought to the boil over dry tea in a warm teapot and steeping it from three to five minutes. The liquor is separated from the spent leaves and may be flavoured with milk, sugar, or lemon.",
  "Professional tasters, sampling tea for the trade, taste but do not consume a light brew in which the liquor is separated from the leaf after five to six minutes. The appearance of both the dry and infused leaf is observed, and the aroma of vapour, colour of liquor, and creaming action (formation of solids when cooled) are assessed. Finally the liquor is taken into the mouth with a sucking noise, swirled around the tongue, brought into contact with the palate, cheek, and gums, and then drawn to the back of the mouth and up to the olfactory nerve in the nose before being expectorated. The liquor is thus felt, tasted, and smelled. Tasters have a large glossary of terms for the evaluation of tea, but the less-demanding consumer drinks it as a thirst quencher and stimulant and for its distinctive sour-harsh taste.",
  " William H. Ukers , All About Tea , 2 vol. (1935), deals with the historical, technological, scientific, commercial, social, and artistic aspects of tea production and includes extensive bibliographies. C.R. Harler , Tea Growing (1966), Tea Manufacture (1963, reprinted 1970), and The Culture and Marketing of Tea , 3rd ed. (1964), discuss methods and problems of the tea industry. Claud Bald,  Indian Tea: A Textbook on the Culture and Manufacture of Tea , 7th ed., rev. by C.J. Harrison (1965), deals with the development of tea production in India, where the modern tea industry originated. T. Eden , Tea , 3rd ed. (1976), discusses tea production in Sri Lanka and the newly developing African tea industry. Also helpful is J. Werkhoven (comp.) ,  Tea Processing (1974), which is a survey prepared for the Food and Agriculture Organization of the United Nations."
]