[
  " Phoeniconaias minor    bird , (class Aves),   any of the more than 10,400 living species unique in having feathers , the major characteristic that distinguishes them from all other animals. A more-elaborate definition would note that they are warm-blooded vertebrates more related to reptiles than to mammals and that they have a four-chambered heart (as do mammals), forelimbs modified into wings (a trait shared with bats), a hard-shelled egg, and keen vision , the major sense they rely on for information about the environment. Their sense of smell is not highly developed, and auditory range is limited. Most birds are diurnal in habit. More than 1,000 extinct species have been identified from fossil remains.",
  "Since earliest times birds have been not only a material but also a cultural resource. Bird figures were created by prehistoric humans in the Lascaux Grotto of France and have featured prominently in the mythology and literature of societies throughout the world. Long before ornithology was practiced as a science, interest in birds and the knowledge of them found expression in conversation and stories, which then crystallized into the records of general culture. Ancient Egyptian hieroglyphs and paintings, for example, include bird figures. The Bible refers to Noah’s use of the raven and dove to bring him information about the proverbial Flood.",
  "Various bird attributes, real or imagined, have led to their symbolic use in language as in art. Aesop’s fables abound in bird characters. The Physiologus and its descendants, the bestiaries of the Middle Ages, contain moralistic writings that use birds as symbols for conveying ideas but indicate little knowledge of the birds themselves. Supernatural beliefs about birds probably took hold as early as recognition of the fact that some birds were good to eat. Australian Aborigines, for example, drove the black-and-white flycatcher from camp, lest it overhear conversation and carry the tales to enemies. Peoples of the Pacific Islands saw frigate birds as symbols of the Sun and as carriers of omens and frequently portrayed them in their art. The raven —a common symbol of dark prophecy—was the most important creature to the Indians of the Pacific Northwest and was immortalized in Edgar Allan Poe’s poem “The Raven.” Eagles have long been symbols of power and prestige in many parts of the world, including Europe, where their representations are often seen in heraldry . Native Americans sprinkled eagle down before guests as a sign of peace and friendship, and eagle feathers were commonly used in rituals and headdresses. The resplendent quetzal —the national bird of Guatemala, which shares its name with the currency and is a popular motif in art, fabric, and jewelry—was worshipped and deified by the ancient Mayans and Aztecs. Highly symbolic birds include the phoenix , representing resurrection, and the owl , a common symbol of wisdom but also a reminder of death in Native American mythology. The bird in general has long been a common Christian symbol of the transcendent soul, and in medieval iconography a bird entangled in foliage symbolized the soul embroiled in the materialism of the secular world.",
  " Dendrocopos pubescens  In modern times the recreational pleasures of bird-watching have grown in tandem with the rise of environmentalism. Evolving from the American and European “shoot-and-stuff” mania of the 19th century, bird-watching became a sportlike activity based on rapid identification—the rarest being the most rewarding—with the aid of binoculars and spotting scopes. The change from shooting to sighting coincided with campaigns, beginning about 1900, to halt the slaughter of wild birds for food and millinery. Bird-watching was advanced by the publication of excellent field guides and improvements in photography and sound recording. By mid-century the watcher’s enjoyable but rather unsophisticated tallying of “year lists” and “life lists” of species personally observed was being augmented, if not replaced, by interest in careful studies of bird behaviour, migration, ecology, and the like. This trend was abetted by bird banding (called ringing in the United Kingdom) and by such organizations as the British Trust for Ornithology and the National Audubon Society, which coordinate professional and amateur observations and efforts with scientific studies.",
  "  Birds arose as warm-blooded, arboreal, flying creatures with forelimbs adapted for flight and hind limbs for perching. This basic plan has become so modified during the course of evolution that in some forms it is difficult to recognize.",
  "Among flying birds, the wandering albatross has the greatest wingspan, up to 3.5 metres (11.5 feet), and the trumpeter swan perhaps the greatest weight, 17 kg (37 pounds). In the largest flying birds, part of the bone is replaced by air cavities (pneumatic skeletons) because the maximum size attainable by flying birds is limited by the fact that wing area varies as the square of linear proportions, and weight or volume as the cube. During the Pleistocene Epoch (2.6 million to 11,700 years ago) lived a bird called Teratornis incredibilis . Though similar to the condors of today, it had a larger estimated wingspan of about 5 metres (16.5 feet) and was by far the largest known flying bird.",
  "The smallest living bird is generally acknowledged to be the bee hummingbird of Cuba, which is 6.3 cm (2.5 inches) long and weighs less than 3 grams (about 0.1 ounce). The minimum size is probably governed by another aspect of the surface-volume ratio: the relative increase, with decreasing size, in surface through which heat can be lost. The small size of some hummingbirds may be facilitated by a decrease in heat loss resulting from their becoming torpid at night.",
  "When birds lose the power of flight, the limit on their maximum size is increased, as can be seen in the ostrich and other ratites such as the emu , cassowary , and rhea . The ostrich is the largest living bird and may stand 2.75 metres (9 feet) tall and weigh 150 kg (330 pounds). Some recently extinct birds were even larger: the largest moas of New Zealand and the elephant birds of Madagascar may have reached over 3 metres (10 feet) in height.",
  "  The ability to fly has permitted an almost unlimited diversification of birds, so that they are now found virtually everywhere on Earth, from occasional stragglers over the polar ice caps to complex communities in tropical forests. In general the number of species found breeding in a given area is directly proportional to the size of the area and the diversity of habitats available. The total number of species is also related to such factors as the position of the area with respect to migration routes and to wintering grounds of species that nest outside the area. In the United States , Texas and California have the most—approximately 620 for each (the figure varies based on criteria used for inclusion on state lists, such as unconfirmed, accidental, hypothetical, extirpated, and extinct species). More than 920 species have been recorded from North America north of Mexico . The figure for Europe west of the Ural Mountains and including most of Turkey is 514. More than 700 species live in Russia . At least 4,400 species live in North and South America . Although several South American countries boast well over 1,000 species, Costa Rica , with an area of only about 51,000 square km (about 20,000 square miles) and a known avifauna of more than 800 species, probably has the most diversity for its size. Asia accounts for more than 25 percent of the world’s species, with 2,700 species, and Africa slightly less, with about 2,300.",
  " Gallus gallus  In addition to their importance in literature and legend, birds have been significant to human society in myriad ways. Birds and their eggs have been at least incidental sources of food for humans since their origin and still are in most societies. The eggs of some colonial seabirds, such as gulls, terns, and murres , or guillemots , and the young of some muttonbirds are even now harvested in large quantities. With the development of agrarian human cultures, several species of chickens , ducks , geese , and pigeons were taken in early and have been selectively bred into many varieties. These domestic birds are descended, respectively, from the red jungle fowl ( Gallus gallus ), mallard duck ( Anas platyrhynchos ), greylag goose ( Anser anser ), and rock dove ( Columba livia ). After the discovery of the New World, the turkey ( Meleagris gallopavo ), which had already been domesticated by the Indians, and the Muscovy duck ( Cairina moschata ) were brought to Europe and produced several varieties. Guinea fowl ( Numida meleagris ) from Africa were also widely exported and kept not only for food but also because they are noisy when alarmed, thus warning of the approach of intruders.",
  "Besides being a food source, pigeons have long been bred and trained for carrying messages, their wartime use dating to the Roman era, according to Pliny the Elder . Messenger pigeons were widely used by German, British, and American forces in World Wars I and II and by the United States in the Korean War. In the South Seas, the ability of frigate birds to “home” to their nesting colonies enabled island inhabitants to send messages by these birds.",
  " Callipepla californica  With the development of modern culture, hunting evolved from a foraging activity to a sport, in which the food value of the game became secondary. Large sums are now spent annually on hunting waterfowl , quail , grouse , pheasants , doves , and other game birds. Sets of rules and conventions have been set up for hunting, and in one elaborate form of hunting, falconry , there is not only a large body of specialized information on keeping and training falcons but also a complex terminology, much of it centuries old.",
  "Feathers have been used for decoration for many thousands of years. Their use in the headpieces of indigenous peoples throughout the world is well known. Feather robes were made by Polynesians and Eskimos; and down quilts, mattresses, and pillows are part of traditional European folk culture. Large feathers have often been used in fans, thereby providing an example of an object put to opposite uses—for cooling as well as for conserving heat. Whereas most feathers used in decorating are now saved as by-products of poultry raising or hunting, until early in the 20th century, egrets , grebes , and other birds were widely shot for their plumes alone. Ostrich farms have been established to produce plumes as well as meat, and some ostriches have been raised specifically for racing. Large quills were once widely used for writing, and feathers have long been used on arrows and fishing lures.",
  " Serinus canaria  Many birds are kept as pets. Small finches and parrots are especially popular and easy to keep. Of these, the canary ( Serinus canaria ) and the budgerigar of Australia ( Melopsittacus undulatus , often called a parakeet ) are widely kept and have been bred for a variety of colour types. On large parks and estates, ornamental species such as peacocks ( Pavo cristatus ), swans, and various exotic waterfowl and pheasants are often kept. Zoological parks in many cities import birds from many lands and are a source of recreation and enjoyment for millions of people each year.",
  " Sturnus vulgaris  Quelea quelea  Quelea quelea    With the rise of agriculture, man’s relationship with birds became more complex. Vast quantities of guano (bird excrement) were mined from island breeding colonies for use as fertilizer for crops. However, in regions where grain and fruit are grown, depredations by birds may be a serious problem. In North America various species of blackbirds (family Icteridae) are serious pests in grainfields; in Africa a grain-eating finch, the red-billed quelea ( Quelea quelea ), occurs like locusts, in plague proportions so numerous that alighting flocks may break the branches of trees. The use of city buildings for roosts by large flocks of starlings and blackbirds is also a problem, as is the nesting of albatrosses on airplane runways on Pacific islands. As a result of these problems, conferences on the control of avian pests are commonly held.",
  "Although birds are subject to a great range of diseases and parasites, only a few of these are known to be capable of infecting man. Notable exceptions are ornithosis psittacosis , or parrot fever, a serious and sometimes fatal disease resembling viral pneumonia. The microorganism responsible for the disease is transmitted directly to man from pigeons, parrots, and a variety of other birds via their excrement. Encephalitis , an inflammation of the brain, is also serious, but this infection is transmitted to man and to his domestic animals via biting arthropods, including mosquitoes. West Nile virus can likewise be transmitted. Wild birds may also act as reservoirs for diseases that adversely affect domesticated birds.",
  "  The study of birds has contributed much to both the theoretical and practical aspects of biology. Charles Darwin ’s studies of the Galapagos finches and other birds during the voyage of HMS Beagle were important in his formulation of the idea of the origin of species through natural selection . Collections of birds in research museums still provide the bases for important studies of geographic variation, speciation, and zoogeography, because birds are one of the best known of animal groups. Early work on the domestic fowl added to the development of both genetics and embryology . The study of animal behaviour ( ethology ) has been based to a large extent on studies of birds by Konrad Lorenz , Nikolaas Tinbergen , and their successors. Birds also have been the primary group in the study of migration and orientation and the effect of hormones on behaviour and physiology.",
  "  Man’s impact on bird populations is very strong. Since 1680 approximately 80 species of birds have become extinct, and a larger number are seriously endangered . While pollution and pesticides are important factors in the decline of certain large species, such as the peregrine falcon , osprey , and California condor , the destruction of natural areas and introduction of exotic animals and diseases have probably been the most devastating. Concerted efforts of research and conservation are required to ensure the survival of rare species.",
  "  Because of their body structure and their feathered covering, birds are the best fliers among animals, better than insects and bats. There are, however, considerable differences in ability among various birds. Penguins cannot fly, instead spending much of their time in the water swimming with their paddlelike wings. Birds such as ostriches and emus have rudimentary wings but are permanently afoot. At the other extreme, long-winged swifts and frigate birds move from their perches only to fly, never to walk. Most birds alternate some walking or swimming with their flying.",
  " Cepphus grylle  Birds usually fly when they have any considerable distance to travel; there are exceptions, however. The mountain quail of California make their annual migrations up and down the mountains on foot. The guillemots of the Greenland coast migrate southward by swimming; they begin their journey before the young have grown their flight feathers and before some of the adults at least have regrown their recently molted ones. The Adélie penguins may ride northward on drifting ice floes; at the approach of nesting time, they swim back to the Antarctic continent and then walk over the ice to their breeding grounds many miles inland.",
  "  Birds fly by flapping their wings, steering mainly with their tails. Compared to the parts of an airplane, a bird’s wing acts as both wing and propeller. The basal part of the wing supplies most of the supporting surface, the wing tip most of the propelling force. A bird’s wing has many adjustable features: it can be shortened or lengthened by flexion; the feathers of the tip can be spread or closed; the angle of the whole wing or its parts—on one side or both—can be altered. All of these adjustments make the aerodynamics of a bird’s wing much more complicated than those of the airplane; consequently, the flight of a bird is much more varied and adaptable.",
  "    The types of flight found in birds vary considerably, and different types of wings correlate with different types of flight. At least two major types of modifications for gliding or soaring are found. Albatrosses and some other seabirds have long, narrow wings and take advantage of winds over the oceans, whereas some vultures and hawks have broad wings with slotted tips that permit more use of updrafts and winds deflected by hills. Short, broad wings are characteristic of chickenlike birds, which fly up with a rush of rapid wing beats. Birds such as ducks, pigeons, and falcons, which fly rapidly with continuous wing beats, tend to have moderately long, pointed wings. Many songbirds use their short, rounded wings to move with quick wing beats from perch to perch or from ground to perch. Ducks have pointed wings that, beaten at high speed, provide rapid flight for long distances. Swallows , terns , and frigate birds have long, pointed wings that enable these birds to fly and maneuver gracefully for hours with leisurely wing beats. Large herons with long, broad wings travel far with slow, measured strokes, while buzzards soar high in the sky on their long, broad wings. Gulls and albatrosses, with their long, narrow wings flapping infrequently, sail along the beaches or over the waves. Swifts and hummingbirds, with their narrow, curved wings, fly rapidly and maneuver easily. A hummingbird can whir its tiny wings so rapidly that it can hover as it thrusts its long bill into a blossom; it can even fly backward as it leaves the bloom.",
  "The shape of a bird’s tail also appears to be related to flight. The forked tails of frigate birds and terns enable quick changes of direction, and the barn swallow uses its deeply forked tail in making the intricate patterns of its graceful flight. A goshawk pursuing its prey through the forest uses its long tail in making quick turns. There is, however, such great diversity in birds’ tails that the precise size and shape probably is not of critical importance. For example, ducks , with their short tails, have a swift but direct flight, but long, graduated tails are often found in rapid, direct fliers such as some parrots and doves. Woodpeckers and some other climbing birds have strong tail feathers with stout shafts, which they use as props while on the trunks of trees.",
  "The speed with which birds fly also varies greatly, and of course individual birds can vary their speed. Data on the speed of bird flight are difficult to evaluate. One of the complicating factors is that a bird’s speed in relation to the ground may depend on the force of the wind. Despite the variables involved in determining a bird’s speed of flight, the following generalized speeds, based on level flight in calm air, appear to be sound:",
  "The record long-range flight of a bird species in a single season is undoubtedly held by the Arctic terns that migrate from a summering ground in the Arctic to a wintering ground in the Antarctic, travelling more than 11,600 km (7,200 miles) each way. Some long-range flights are made very quickly: a blue-winged teal banded in Canada was recovered 6,100 km (3,800 miles) away in Venezuela only 30 days later; a Manx shearwater , trapped at its nest in Wales and transported 5,200 km (3,200 miles) to Massachusetts and released, returned home in 12  1  2  days. Some very small birds regularly make long water crossings in a single flight. Ruby-throated hummingbirds fly across the more than 800-km- (500-mile-) wide Gulf of Mexico, and many warblers fly from the American coast to Bermuda, a journey of about the same distance. For further information, see  migration .",
  " Phalacrocorax harrisi  Some birds have completely lost the power of flight during the course of evolution. The close similarity in the basic structure of flightless and flying birds, however, indicates that they all had a common flying ancestor. The rudimentary wings and the flightless condition of penguins and the ratites (ostriches and the like) is therefore a secondary, specialized condition. That flightlessness is a secondary condition is made still more apparent in other flightless birds that belong to families most of whose members are capable of flight. The extinct great auk of the North Atlantic is one of the best-known examples of such a flightless bird; the rail family also is noted for having many flightless species living on islands in the Pacific and the South Atlantic. Loss of flight seems to occur most often on isolated islands where there are no mammalian predators. In New Zealand, where there are no native land mammals of any kind, there were many species of extinct flightless moas , and there are still flightless kiwis , penguins, and rails as well as a duck, an owl, and several songbirds that are nearly flightless. The ratites of South America (rhea), Africa (ostrich), and Australia (cassowary) present an apparent contradiction to this correlation of mammal-free island habitats with bird flightlessness. Another adaptation, however—their great size—has enabled these birds to escape predation by mammals.",
  "    The bipedal gait of birds, dictated by modification of the forelimbs for flight, necessitates manipulation of food by the bill and feet. This poses problems in balance. The relative lengths of the segments of the legs must be such that, as the bird shifts from a standing to a sitting position, its centre of gravity remains over the feet. As some birds moved out of the trees and became terrestrial or aquatic, their legs were accordingly modified. In very large, slow-moving birds such as moas, the leg bones became very heavy. The toes became shorter, and the opposable first toe has been lost in rapidly running forms such as rheas and ostriches. The ostrich is the fastest runner, crossing stretches of savanna at a speed of 72.5 km/hr (45 mph). The toes became very long in birds that walk on aquatic vegetation or soft ground. Jacanas with their greatly elongated toes and claws walk over floating water weeds, and herons with long legs wade in shallow water. Wading birds developed long, thin legs, and climbing birds developed short legs with strongly curved, sharp claws. In swimming and diving birds, webs developed between the toes or lobes on the sides of the toes.",
  " Merops nubicus  Terrestrial birds such as pheasants tend to walk; arboreal songbirds tend to hop as they travel from branch to branch. Tree dwellers such as woodpeckers , toucans , and the other members of order Piciformes , as well as parrots, can travel easily up and down trees because both of their outer toes face backward; in almost all other birds, only one toe faces to the rear. Parrots often walk along branches, and house sparrows hop when they come to the ground, while palm warblers walk on the ground and some songbirds, such as American robins and European blackbirds, may both walk and hop. Some birds with small feet, such as swifts, hummingbirds, bee-eaters , and many hornbills , use their feet only for perching and rarely walk at all. Other birds with robust feet, such as guinea fowl and rails, do most of their moving about on foot.",
  "The usual position of a bird’s body in walking is more or less parallel to the ground. But the penguins, with their feet far to the rear of their bodies, stand upright as they waddle along. When the Adélie penguin makes its trek of many miles over the snow-covered ice to its breeding grounds, it may vary its awkward waddle with periods of tobogganing—i.e., sliding along on its breast and propelling itself with thrusts of its feet.",
  "Some birds ( auks , diving petrels , and certain ducks ) use the wings for propulsion underwater as well as in the air. The wings of penguins have become highly modified into paddles that allow them to “fly” underwater; they use their webbed feet only for steering. Auks, on the other hand, use both their wings and webbed feet in swimming underwater. Several other water birds have become so adapted to swimming that they are practically helpless on land. In this class are loons , which shuffle awkwardly the few feet from the water to their nests. Swimming in birds is usually correlated with webbed feet, but coots and grebes , with only lobes on their toes, also swim and dive, and gallinules , with neither webs nor lobes, commonly swim. On the other hand, frigate birds , with partly webbed feet, never swim.",
  " Anas platyrhynchos  Some birds, such as the mallard , usually swim at the surface, feeding only as far underwater as they can reach by dipping their heads. Other ducks, such as scoters and pochards , commonly dive to the bottom for their food, and cormorants , auks, and loons pursue fish underwater. Sometimes loons are taken at remarkable depths in fishermen’s nets and on set lines, indicating that they may dive as deep as 61 metres (200 feet). Emperor penguins, however, are the best divers, having been recorded at depths of 483 metres (1,584 feet).",
  "Pond ducks, such as mallards and teals, spring straight up from the water’s surface into the air in flight, but many swimming birds—for example, coots, grebes, cormorants, and diving ducks—take off with a long spattering run along the surface.",
  "Birds depend to a great extent on innate behaviour, responding automatically to specific visual or auditory stimuli. Even much of their feeding and reproductive behaviour is stereotyped. Feather care is vital to keep the wings and tail in flying condition and the rest of the feathers in place, where they can act as insulation. Consequently preening, oiling, shaking, and stretching movements are well developed and regularly used. Some movements, such as the simultaneous stretching of one wing, one leg, and half the tail (all on the same side) are widespread if not universal among birds. Stretching both wings upward, either folded or spread, is another common movement, as is a shaking of the whole body beginning at the posterior end. Other movements have evolved in connection with bathing, either in water or in dust. Such comfort movements have frequently become ritualized as components of displays.",
  "Many birds maintain a minimum distance between themselves and their neighbours, as can be seen in the spacing of a flock of swallows perched on a wire. In the breeding season most species maintain territories, defending areas ranging from the immediate vicinity of the nest to extensive areas in which a pair not only nests but also forages. The frequency of actual fighting is greatly reduced by ritualized threat and appeasement displays. Birds range from solitary (e.g., many birds of prey ) to highly gregarious, such as the guanay cormorants of the Peru Current off the west coast of South America, which nest in enormous colonies of hundreds of thousands and feed in large flocks with boobies and pelicans.",
  "Auditory signals, like visual ones, are almost universal among birds. The most familiar vocalization of birds is that usually referred to as “song” ( see  birdsong ). It is a conspicuous sound (not necessarily musical) that is used, especially early in the breeding season, to attract a mate, to warn off another bird of the same sex, or both. As such it is usually associated with establishing and maintaining territories. Individual variation in songs of many species is well known, and it is believed that some birds can recognize their mates and neighbours by this variation. Many other types of vocalizations are also known. Pairs or flocks may be kept together by series of soft location notes. Alarm notes alert other individuals to the presence of danger; in fact, the American robin (and probably many other species) uses one note when it sees a hawk overhead and another when it sees a predator on the ground. Begging calls are important in stimulating parents to feed their young. Other calls are associated with aggressive situations, courtship, and mating. Nonvocal sounds are not uncommon. Some snipe and hummingbirds have narrow tail feathers that produce loud sounds when the birds are in flight, as do the narrowed outer primaries of the American woodcock . The elaborate courtship displays of grouse include vocalizations as well as stamping of the feet and noises made with the wings. Bill clapping is a common part of courtship in storks , and bill snapping is a common threat of owls.",
  " Philetairus socius  Turdus migratorius  Aegithalos caudatus    Most birds build nests in which the eggs are laid. Nests vary widely: they may be a scrape in the sand, a deep burrow, a hole in a tree or rock, an open cup, a globular or retort-shaped mass with a side entrance tube, or an elaborately woven hanging structure. The materials with which nests are made also vary widely. Some nests are lined with small stones, and others are built of dirt or mud with or without plant material. Sticks, leaves, algae, rootlets, and other plant fibres are used alone or in combination. Some birds seek out animal materials such as feathers, horsehair, or snakeskin. The nest materials may be held together by weaving, sewing, or felting the materials themselves or with mud or spider webs. Swifts use saliva to glue nest materials together and to attach the nest to the supporting structure. In at least one species of swift, the entire nest is made of saliva and is the prized ingredient of birds’ nest soup in the Orient.",
  " Cuculus canorus Acrocephalus scirpaceus  Cuculus canorus Acrocephalus scirpaceus   All birds incubate their eggs, except megapodes (mound builders), which depend on the heat generated by decaying vegetation or other external sources, and brood parasites such as cuckoos and cowbirds , which lay their eggs in the nests of other species. Murres and the king and emperor penguins build no nest but incubate with the egg resting on top of the feet.",
  "In most birds a brood patch on the abdomen is developed. This bare area is fluid-filled (edematous) and highly vascularized; it directly contacts the eggs during incubation. Its development during the breeding season is under hormonal control. When the parent is off the nest, adjacent feathers are directed over the brood patch, and it is usually not apparent. A few birds (e.g., boobies) keep their webbed feet over the eggs during incubation.",
  "Incubation takes from 11 to 80 days, depending at least in part on the size of the bird and the degree of development at hatching. Most songbirds and members of some other groups are hatched nearly absent of feathers and helpless (altricial), and they are brooded until well able to regulate their body temperature. They are fed by the parents even after they are capable of flight. The young of numerous other birds, such as chickens, ducks, and shorebirds, are hatched with a heavy coat of down and are capable of foraging for themselves almost immediately (precocial). Still others, such as the petrels and the auks, are downy when hatched but remain in the nest and are fed by their parents.",
  "The length of time that parents care for young birds varies widely. Young megapodes can fly shortly after hatching and are entirely independent of their parents; young royal albatrosses may spend more than eight months at the nest and in the area immediately around it before they can fly. The length of time needed to attain independence is related to size and condition at hatching. Ground-nesting birds tend to take less and hole-nesting birds more time than the average.",
  "The number of eggs in a set (clutch) varies from 1 to about 20. Some species invariably lay the same number per clutch (determinate laying), whereas in the majority the number is variable (indeterminate laying). In species of the latter category, clutch size tends to be smaller in tropical regions than in cold ones. There is also a tendency for birds in warm regions to make more nesting attempts in a given season. In the Arctic, where the season is very short, the cycle of breeding and the molt that follows it are compressed into a minimum of time.",
  "  Dendrocopos villosus  Rynchops nigra    The earliest birds were probably insectivorous, as are many modern ones, and the latter have evolved many specializations for catching insects. Swifts, swallows, and nightjars have wide gapes for catching insects on the wing; some woodpeckers can reach wood-boring grubs, whereas others can catch ants by probing anthills with their long, sticky tongues; thrashers dig in the ground with their bills; tree creepers and woodhewers probe bark crevices; and warblers glean insects from many kinds of vegetation. Raptorial birds ( raptors and owls) have evolved talons and hooked bills for feeding on larger animals, and vultures have bare heads and tearing bills for feeding on carrion. Herons have spearlike bills and trigger mechanisms in the neck for catching fish, while kingfishers , terns, and boobies plunge into the water after similar prey. Long-billed waders probe for worms and other invertebrates. Of the many kinds of birds that feed on plant material, most use seeds, fruit, or nectar, which are high in food value; leaves and buds are eaten by fewer species. While some kinds of birds feed entirely on a single kind of food, others may take a wide range of foods, and many have seasonal changes in diet.",
  "  The structures associated with flight, even if they are vestigial or specialized for terrestrial or aquatic locomotion, easily distinguish birds from other animals. Whereas various skeletal and internal features are diagnostic of birds, feathers are unique to and present on all birds. Also unique to birds is their sound-producing organ, the syrinx . This avian analog to the voice box ( larynx ) is most highly developed in the songbirds. The syrinx is located where the trachea (windpipe) divides into the bronchial tubes. Sound is produced by airflow that vibrates membranes formed from part of the trachea, bronchi, or both.",
  "  Like the scales of reptiles, and those on the feet of birds, feathers are made of keratin , a fibrous protein also found in hair. Feathers vary considerably in structure and function. Contour feathers form most of the surface of the bird, streamlining it for flight and often waterproofing it. The basal portion may be downy and thus act as insulation. The major contour feathers of the wing (remiges) and tail (rectrices) and their coverts function in flight. Contour feathers grow in tracts (pterylae) separated by bare areas (apteria) and develop from follicles in the skin.",
  "  The typical contour feather consists of a tapered central shaft, the rachis, with paired branches (barbs) on each side. An unbranched basal section of the rachis is called the calamus, part of which lies beneath the skin. The barbs, in turn, have branches, the barbules. The barbules on the distal side of each barb have hooks (hamuli) that engage the barbules of the next barb. The barbs at the base of the vane are often plumaceous—i.e., lacking in hamuli and remaining free of each other. In many birds each contour feather on the body (but rarely on the wings) is provided with a complex branch, the aftershaft, or afterfeather, that arises at the base of the vane. The aftershaft has the appearance of a second, smaller feather, growing from the base of the first. Down feathers have loose-webbed barbs, all rising from the tip of a very short shaft. Their function is insulation, and they may be found in both pterylae and apteria in adult birds. They also constitute the first feather coat of most young birds. Filoplumes are hairlike feathers with a few soft barbs near the tip. They are associated with contour feathers and may be sensory or decorative in function. Bristlelike, vaneless feathers occur around the mouth, eyes, and nostrils of birds. They are especially conspicuous around the gape (corners of the mouth) of birds that catch insects in the air. Some bristles function as eyelashes on ground-dwelling birds, and the bristles over the nostrils may serve as filters.",
  "The contour feathers are shed and replaced (molted) at least once a year, usually just after the breeding season. In addition, many birds have at least a partial molt before the breeding season. A typical series of molts and plumages would be juvenal plumage, postjuvenal (also called first prebasic) molt, first winter (or first basic) plumage, first prenuptial (or pre-alternate) molt, first nuptial (or alternate) plumage, first postnuptial (first annual, or second prebasic) molt, second winter (or basic) plumage, etc. Molt of the remiges and rectrices usually occurs as part of the annual molt and can be serial, from the innermost feather out (centrifugal), from the outermost in (centripetal), or simultaneous. Normally the process is symmetrical between the right and left sides.",
  "Flight, so characteristic of birds, is maintained during the molt in most species by a gradual replacement of the flight feathers. However, ducks and geese, some rails and loons , and auks shed all of their flight feathers at one time, immediately after the nesting season. Not until these feathers are replaced are the birds able to fly again. Most of these are birds that find their food by walking or swimming, as would be expected. Some ducks living in the marshes become very shy and retiring at this season, skulking in the reeds, but geese nesting in the Arctic barrens continue to walk about over the tundra, feeding. In the hornbills of Africa and Asia, only females lose the flight and tail feathers at the same time. During this time they stay in the nest until the feathers grow out again, being fed by the males.",
  " Phoenicopterus ruber ruber  Eugenes fulgens   Colour in birds is caused by pigments and structure. Buffs, red browns, dark browns, and blacks are caused by melanins , pigments synthesized by the bird and laid down in granules. Yellows, oranges, and reds come from carotenoid or lipochrome pigments; these originate at least in part from the food and are diffused in the skin and feathers. Porphyrin feather pigments occur in birds but less frequently than melanins and carotenoids. Blue colours in feathers are structural, based on a thin, porous layer of keratin overlying melanin pigment. Most greens result from the addition of yellow pigment to the structural blue colour. Iridescent colours result from the thinly laminated structure of the barbules and are enhanced by underlying melanin deposits.",
  "Birds’ feet are covered with scales like those of reptiles. The scales are occasionally shed, but the timing of this molt is not known. The toes are tipped with claws, and vestigial claws are not infrequently found on the tips of the first two digits of the wing.",
  "The bill is covered with a sheet of keratin, the rhamphotheca, which in petrels and a few other birds is divided into plates. In birds that probe for food (kiwis, woodcocks, etc.), many sensory pores are found near the tip of the bill. Both melanins and carotenoids are found in the rhamphotheca and in the scales of the feet.",
  "The skin of a bird is almost without glands. The important exception is the preen gland , which lies on the rump at the base of the tail. The secretion of this gland contains approximately one-half lipids (fats and oils) and is probably important in dressing and waterproofing the plumage. In a few birds, the secretion has a strong, offensive odour. Some birds, in which the gland is small or absent, have a specialized type of feather (powder down) that grows continuously and breaks down into a fine powder, believed to be used in dressing the plumage.",
  "   The avian skeleton is notable for its strength and lightness, achieved by fusion of elements and by pneumatization (i.e., presence of air cavities). The skull represents an advance over that of reptiles in the relatively larger cranium with fusion of elements, made possible by the fact that birds have a fixed adult size. Birds differ from mammals in being able to move the upper mandible rather than the lower, relative to the cranium. When the mouth is opened, both the lower and upper jaws move: the former by a simple, hingelike articulation with the quadrate bone at the base of the jaw, the latter through flexibility provided by a hinge between the frontal and nasal bones. As the lower jaw moves downward, the quadrate rocks forward on its articulation with the cranium, transferring this motion through the bones of the palate and the bony bar below the eye to the maxilla, the main bone of the upper jaw.",
  "The number of vertebrae varies from 39 to 63, with remarkable variation (11 to 25) within the neck (cervical) series. The principal type of vertebral articulation is heterocoelous (saddle shaped). Each of the 3 to 10 (usually 5 to 8) chest (thoracic) vertebrae normally bears a pair of complete ribs consisting of a dorsal vertebral rib articulating with the vertebra and with the ventral sternal rib, which in turn articulates with the breastbone (sternum). Each vertebral rib bears a flat, backward-pointing spur, the uncinate process, characteristic of birds. The sternum, ribs, and their articulations form the structural basis for a bellows action, by which air is moved through the lungs. Posterior to the thoracic vertebrae is a series of 10 to 23 fused vertebrae, the synsacrum, to which the pelvic girdle is fused. Posterior to the synsacrum is a series of free tail (caudal) vertebrae and finally the pygostyle, which consists of several fused caudal vertebrae and supports the tail feathers.",
  " The sternum consists of a plate lying ventral to the thoracic cavity and a median keel extending ventrally from it. The plate and keel form the major area of attachment for the flight muscles. The bones of the pectoral girdle consist of the wishbone (furcula) and the paired coracoids and shoulder blades (scapulae). The sword-shaped scapula articulates with the coracoid and upper “armbone” ( humerus ) and lies just dorsal to the rib basket. The coracoid articulates with the forward edge of the sternum and with the scapula, humerus, and furcula. The furcula connects the shoulder joints with the anterior edge of the keel of the sternum. It consists of paired collarbones (clavicles) and, probably, the median, unpaired interclavicle.",
  "  The bones of the forelimb are modified for flight with feathers. Major modifications include restriction of the motion of the elbow and wrist joints to one plane, reduction of the number of digits, loss of functional claws, fusion of certain bones of the “hand” (the metacarpals and most of the carpals) into a carpometacarpus, and modification of the elements, especially those toward the tip of the limb (distal), for the attachment of feathers. The wing bones are hollow, and the cavity in the humerus is connected with the air-sac system. As a general rule, large flying birds have proportionally greater pneumaticity in the skeleton than small ones. The highly pneumatic bones of large flying birds are reinforced with bony struts at points of stress. The humerus, radius, and ulna are well developed. The secondary flight feathers are attached to the ulna, which thus directly transmits force from the flight muscles to these feathers and is therefore relatively heavier than the radius. Two small wrist bones are present: the radiale, or scapholunar, and the ulnare, or cuneiform. The former lies between the distal end of the radius and the proximal part (the part toward the body) of the carpometacarpus. When the elbow joint is flexed (bent), the radius slides forward on the ulna and pushes the radiale against the carpometacarpus, which in turn flexes the wrist. Thus the two joints operate simultaneously. The U-shaped ulnare articulates with the ulna and the carpometacarpus. Anatomists differ on which bones of the reptilian “hand” are represented in the bird’s wing. Embryological evidence suggests that the digits are II, III, and IV, but it is possible that they are actually I, II, and III. The carpometacarpus consists of fused carpals (bones of the wrist) and metacarpals (bones of the palm), metacarpals II and III (or III and IV) contributing the greater part of the bone. The bones of the “fingers” (phalanges) are reduced to one each on the outer and inner digits and two on the middle one. The primary flight feathers are attached to the carpometacarpus and digits, the number attached to each being characteristic of the various major groups of birds.",
  "The pelvic girdle consists of three paired elements, the ilia, ischia, and pubes, which are fused into a single piece with the synsacrum. The ilium is the most dorsal element and the only one extending forward of the socket of the leg (acetabulum). The ilium is fused with the synsacrum and the ischium, the latter of which is fused with the pubis. All three serve as attachments for leg muscles and contribute to the acetabulum, which forms the articulation for the femur. The leg skeleton consists of the thighbone (femur), main bone of the lower leg (tibiotarsus), fibula, fused bones of the ankle and middle foot (tarsometatarsus), and toes (phalanges). The fibula is largest at its upper end, where it forms part of the knee joint and tapers to a point distally, never forming part of the ankle joint. The latter joint is simplified, there being but two bones involved: the tibiotarsus, consisting of the tibia (the so-called shinbone in man) fused with the three upper ankle bones (proximal tarsals), and the tarsometatarsus, resulting from the fusion of metatarsals I through IV and the distal row of tarsals. Metatarsals II through IV contribute most to the tarsometatarsus. The basic number of phalanges (sections) on the toes is two, three, four, and five, respectively, one more than the number of the toe. Most birds have four toes, the fifth being always absent, but there are many variations in the number of digits, or phalanges, representing reductions of the basic arrangement.",
  "The basic avian foot is adapted for perching. The first, or hind, toe (hallux) opposes the other three, and the tendons for the muscles that bend the toes pass behind the ankle joint in such a way that when the ankle is bent the toes are also. The weight of a crouched bird thus keeps the toes clasped around the perch.",
  "The cardiac (heart) muscles and smooth muscles of the viscera of birds resemble those of reptiles and mammals. The smooth muscles in the skin include a series of minute feather muscles, usually a pair running from a feather follicle to each of the four surrounding follicles. Some of these muscles act to raise the feathers, others to depress them. The striated (striped) muscles that move the limbs are concentrated on the girdles and the proximal parts of the limbs. Two pairs of large muscles move the wings in flight: the pectoralis, which lowers the wing, and the supracoracoideus, which raises it. The latter lies in the angle between the keel and the plate of the sternum and along the coracoid. It achieves a pulleylike action by means of a tendon that passes through the canal at the junction of the coracoid, furcula, and scapula and attaches to the dorsal side of the head of the humerus. The pectoralis lies over the supracoracoideus and attaches directly to the head of the humerus. In most birds the supracoracoideus is much smaller than the pectoralis, weighing as little as one-twentieth as much; in the few groups that use a powered upstroke of the wings (penguins, auks, swifts, hummingbirds, and a few others), the supracoracoideus is relatively large.",
  "Avian striated muscles contain a respiratory pigment, myoglobin . There are relatively few myoglobin-containing cells in “white meat,” whereas “dark meat” derives its characteristic colour from their presence. The former type of muscle is used in short, rapid bursts of activity, whereas the latter is characteristic of muscles used continuously for long periods and especially in muscles used during diving.",
  "The circulatory system of birds is advanced over that of reptiles in several ways: (1) there is a complete separation between pulmonary circulation (lungs) and systemic (body) circulation, as in the mammals, (2) the left systemic arch (aortic artery) is lost, blood passing from the heart to the dorsal aorta via the right arch, (3) the postcaval vein is directly connected with the renal portal that connects the kidneys with the liver, and (4) the portal circulation through the kidneys is greatly reduced. Birds’ hearts are large—0.2 to over 2.4 percent of body weight, as opposed to 0.24 to 0.79 percent in most mammals.",
  "  The avian lung differs from the type found in other land vertebrates in that several pairs of nonvascular air sacs are connected with the lungs. These extend into the pneumatic parts of the skeleton. Muscles between the sternum and trachea or along the trachea and bronchi vary tension on the membranes.",
  "The avian digestive system shows adaptations for a high metabolic rate and flight. Enlargements of the esophagus, collectively called the crop, permit the temporary storage of food prior to digestion. The stomach is typically divided into a glandular proventriculus and a muscular gizzard , the latter lying near the centre of gravity of the bird and compensating for the lack of teeth and the generally weak jaw musculature. Otherwise, the digestive system does not vary markedly from the general vertebrate type.",
  "Like reptiles, birds possess a cloaca , a chamber that receives digestive and metabolic wastes and reproductive products. A dorsal outpocketing of the cloaca, the bursa of Fabricius, controls antibody-mediated immunity in young birds. The bursa regresses with age, and thus its presence or absence may be used to determine age.",
  "  The testes of the male bird are internal, like those of reptiles. Intromittent organs are found in only a few groups (waterfowl, curassows , tinamous , ratites). The distal part of the vas deferens (the seminal sac) becomes enlarged and convoluted in the breeding season and takes on both secretory and storage functions. In songbirds this enlargement and the adjacent part of the cloaca form a cloacal protuberance, a swelling visible on the outside of the bird. Usually only the left ovary and oviduct are functional. As the egg moves down the oviduct, the albumen, membranes, and shell are laid down. The gonads and accessory sexual organs of both sexes enlarge and regress seasonally. In the breeding season, the testes of finches may increase more than 300 times their winter size.",
  "Birds are homeothermic (warm-blooded) and maintain a body temperature of approximately 41 °C (106 °F). This temperature may be slightly less during periods of sleep and slightly higher during intense activity. Feathers, including down, provide effective insulation. In addition, layers of subcutaneous fat add further insulation in penguins and some other water birds. Heat loss through the feet in cold weather is minimized by reducing blood flow to the feet and by a heat-exchange network in the blood vessels of the upper leg, so that the temperature of blood flowing into the unfeathered part of the leg is very low.",
  "Birds do not possess sweat glands. Excess heat is dissipated by rapid panting, which reaches 300 respirations per minute in domestic hens. Some heat can also be lost by regulation of blood flow to the feet. In hot climates, overheating is often prevented or reduced via behavioral means by concentrating activities in the cooler parts of the day and seeking shade during the hot periods. Temporary hypothermia (lowered body temperature) and torpor are known for several species of nightjars, swifts, and hummingbirds. Torpor at night is believed to be widespread among hummingbirds. The heart rate of birds varies widely—from 60 to 70 beats per minute in the ostrich to more than 1,000 in some hummingbirds.",
  "The kidneys lie in depressions that are located on the underside of the pelvis. The malpighian bodies, which are the active tubules of the kidney, are very small in comparison with those of mammals, ranging from 90 to 400 per cubic mm. More than 60 percent of the waste nitrogen is excreted as uric acid or its salts. There is some reabsorption of water from the urine in the cloaca, with uric acid remaining. There is no urinary bladder, the urine being voided with the feces. In marine birds, salt is excreted in a solution from glands lying above the eyes through ducts leading to the nasal cavity.",
  "  The origin of birds, feathers, and avian flight have long been hotly debated. That birds evolved from reptilian ancestors is universally accepted, but did they evolve from thecodont reptiles or theropod dinosaurs? How and when did feathers evolve from the scaly reptilian integument? Did avian flight evolve from a terrestrial ancestor or an arboreal one? Such debates continue to be fueled by regular discoveries in China and Mongolia of remarkably preserved fossils from a critical period in avian evolution—the Early Cretaceous (145.5 million to 99.6 million years ago). The diversity of theropod dinosaurs, some with feathers, has greatly expanded our perspective of the evolution and early diversification of birds. Two major groups of early birds diversified dramatically in the Cretaceous Period: the Enantiornithines, an extinct subclass of birds; and Odontornithes, a primitive offshoot of the subclass Ornithurae that gave rise to modern birds at the end of the Cretaceous. Paleontologists now position Archaeopteryx , once thought to be a direct ancestor of birds, and several other fossil taxa at the base of the extinct enantiornithine lineage.",
  "The debate over the origin of birds centres on whether birds descended directly from thecodont reptiles about 230 million years ago (during the Triassic Period ) or from a later lineage, the carnivorous theropod dinosaurs. This debate has been long-standing and divisive. At the beginning of the 21st century, the pendulum has swung decisively toward the theropod ancestor hypothesis—that today’s birds are feathered dinosaurs . This hypothesis is supported by analyses of shared characteristics (synapomorphies) combined with improved samples of early bipedal theropods.",
  "  Feathers are complex and novel evolutionary structures. They did not evolve directly from reptilian scales, as once was thought. Current hypotheses propose that they evolved through an invagination of the epidermis around the base of a dermal papilla, followed by increasing complexity of form and function. They evolved before birds and even before avian flight. Thus, early feathers functioned in thermal insulation, communication, or water repellency, but not in aerodynamics and flight. Among extinct life-forms, feathers are no longer considered a unique and diagnostic characteristic of birds. Feathers with modern features were present in a variety of forms on a variety of theropod dinosaurs. At least nine Cretaceous dinosaurs had featherlike structures. The details of some are questionable, but some, such as those of Sinornithosaurus and other basal dromaeosaurs, bear a resemblance to modern pennaceous feathers. Feathered dinosaurs did not survive the end of the Cretaceous Period, but birds did, and then they flourished.",
  "Experts continue to debate whether flight evolved through gliding by an arboreal ancestral bird or through aerial launching by a running terrestrial ancestor. Historically these two hypotheses have been strongly linked to, respectively, the thecodont origin hypothesis and theropod origin hypothesis. The shift of opinion toward the theropod hypothesis, however, does not resolve this debate, since feathers on the forelimbs of early birds could have facilitated the early stages of flight through either mode. Precursors of an effective flight stroke of the forelimbs were present in terrestrial bipedal theropods. In either case, the evolution of avian flight required a decoupling of coordinated movements of the forelimbs and hind limbs. It also depended on new neural links between forelimb and tail movements as well as on other elaborations essential to controlled flight without major (initial) compromises of terrestrial locomotion. Once controlled flight had evolved, the avian body plan was transformed into a powerful flight engine. The transformation was then followed by the loss of other capabilities—or, in some cases, of flight itself.",
  " Archaeopteryx Archaeopteryx    Archaeopteryx lithographica  , which was first discovered in southern Germany in 1861, was once known as the world’s earliest fossil bird. A series of fossils, each dated to approximately 150 million years ago during the Jurassic Period, were about the size of a magpie . It resembled some reptiles and differed from modern birds in many ways, notably: (1) the jaw contained teeth set in sockets, (2) the sternum was short and not keeled, (3) the bones were not pneumatic, (4) the first two metacarpals were free, resulting in three movable digits of the “hand,” all with functional claws. Avian characteristics of Archaeopteryx included the possession of feathers and other skeletal features indicating that the creature represented an intermediate stage between reptiles and modern birds. The absence of a keel on the short sternum indicates that Archaeopteryx did not fly but glided. An opposable hallux, indicative of a perching type of foot, and clawed digits on the hand point to an arboreal existence.",
  "However, early in the 21st century, the discovery of Xiaotingia zhengi , a fossilized feathered dinosaur in China that shares several birdlike characteristics with Archaeopteryx , cast doubt on the notion that all birds descended from Archaeopteryx . X. zhengi appears in the fossil record some five million years before Archaeopteryx , and this fact suggests that the single ancestor from which all bird lineages originate has yet to be found. The earliest fossil bird known to be ancestral to the lineage of modern birds is Archaeornithura meemannae . The species was described in 2015 after having been found in rocks of the Huajiying Formation of northeastern China that date to 130.7 million years ago.",
  " Hesperornis Hesperornis  The other major group of toothed Cretaceous birds, the Odontornithes, included one of the best-known groups of fossil birds,  Hesperornis  and its relatives. These birds were highly specialized foot-propelled divers of the Late Cretaceous. Hesperornis was up to 1.8 metres (6 feet) long and had completely lost the power of flight. The sternum lacked a keel, the humerus was small and weak, and other elements of the wing were missing entirely. The pelvis and hind limb had a strong but superficial resemblance to those of modern loons and grebes . However, two major features and several less obvious ones indicate that the resemblance was the result of convergent evolution rather than common ancestry. Hesperornis was remarkable for three features. It had (1) teeth set in grooves, not sockets, (2) a stout fourth toe with a unique rotary ball-and-flange type of articulation, and (3) tail (caudal) vertebrae with limited vertical motion, making the tail somewhat beaverlike in its action. Baptornis , a contemporary relative of Hesperornis , was smaller and less strongly modified. Though flightless, its wings were less reduced than Hesperornis , and it lacked the peculiar modifications of the fourth toe and caudal vertebrae.",
  "In the Late Cretaceous also appeared the first modern birds, assigned to the infraclass Neornithes, or Carinata. Living alongside Hesperornis and other Odontornithes was a group of flying birds that included  Ichthyornis  and Apatornis . Although not related to gulls, these birds resembled them superficially and may well have been their ecological counterparts. It was long believed that Ichthyornis had teeth, like Hesperornis , but it is now thought that the toothed jaws formerly thought to belong to Ichthyornis were really those of a small mosasaur , a marine reptile.",
  "A genetic study of bird lineages estimated that birds began to lose the outer covering of enamel from their teeth, and possibly their teeth as well, some 116 million years ago during the Early Cretaceous. The study also showed that this change was accompanied by an increase in beak development that assisted in the diversification of living birds.",
  "In the evolution of modern birds from an Archaeopteryx -like form, the development of active flight must have occurred early. This meant an increase in size of the muscles moving the wing and the development of a keel on the sternum as an added area of attachment for these muscles. As the tail took on more of a steering function and less of a supportive one, it became shorter and more readily moved as a unit. Feathers became specialized for different functions, and at the same time the eyes, brain, and respiratory and circulatory systems continued to develop in a manner associated with the evolution of homeothermic, arboreal, gliding animals. By the time birds became strong fliers, they were ready to exploit many new environments, and by the Cretaceous Period they had begun to do so, producing the wide array of adaptive types known today.",
  "The major diversification of modern birds probably took place in the Cretaceous, and it must have started early in that period because fragmentary fossil evidence of foot-propelled divers ( Enaliornis ) and of an early relative of the flamingos ( Gallornis ) are known from Lower Cretaceous deposits in Europe. Upper Cretaceous deposits have yielded, besides Hesperornis and Ichthyornis and their relatives, diving birds similar to Enaliornis , other early flamingo-like birds, and species in the same suborders as gannets , ibises , rails , and shorebirds .",
  "Deposits from the Paleocene Epoch (65.5 million to 55.8 million years ago) have yielded the earliest known loons , cormorants , New World vultures , and gulls . In addition, large, flightless predatory birds culminating in  Diatryma  made their appearance during this period. From the far richer Eocene Epoch (55.8 million to 33.9 million years ago) have come the earliest known fossil representatives of most of today’s bird orders.",
  "Almost certainly all living orders and most living families of birds were in existence by the end of the Eocene. One of the most interesting finds from this period was fossils of Neocathartes, a long-legged bird allied to the New World vultures. There are several anatomical similarities between this group of vultures and the storks , and the existence of this fossil lends support to the idea that the storks and New World vultures are more closely related to each other than each family is to the birds with which it is usually grouped.",
  "By Pliocene times (5.3 million to 2.6 million years ago), most modern genera were probably in existence. After the extinction of the dinosaurs and before large carnivorous mammals evolved, two groups of large flightless birds evolved to fill a similar niche. From the late Paleocene to the middle Eocene, Diatryma and its relatives were major predators in the Northern Hemisphere. The largest species stood over 2.25 metres (7 feet) tall and had stout hooked beaks. They are of uncertain relationships but may have been distantly related to the cranes and rails (order Gruiformes ). The second group, that of Phororhacos and related genera, had a long history (from the lower Oligocene to the middle Pliocene) in South America, which was without large carnivores until relatively recent times. The Phororhacos line evidently evolved from seriema -like stock and radiated into numerous genera and species, the largest of them ( Onactornis ) standing 2.5 metres (8 feet) tall and having a skull 80 cm (31 inches) long and 40 cm (16 inches) high.",
  "Large grazing or browsing birds appear to have evolved several times. On continents where there are large predators, these birds have always been rapid runners ( ostriches , rheas , emus ), but on islands lacking such predators, they were slow-moving, heavy-bodied birds. Two such groups were the elephant birds of Madagascar and the moas of New Zealand, the largest in each group approaching 3 metres (10 feet) in height. Fragmentary fossil material from Eocene and Oligocene deposits in Egypt indicates that similarly adapted birds occurred there before the advent of large carnivores.",
  "In classifying birds, most systematists have historically relied upon structural characteristics to infer evolutionary relationships. Plumage characteristics include the number of various feather types; the presence or absence of down on the feather tracts and on the preen gland; and the presence or absence of an aftershaft. Characteristics of the bill and feet are also useful, as is the arrangement of bones in the palate and around the nostrils. The presence or absence of certain thigh muscles is considered, as are the arrangement of the carotid arteries, the syrinx , and the deep flexor tendons of the toes as well as the condition of the young when hatched. Advances in the study of DNA sequences and computerized construction of phylogenetic trees have provided new means of testing hypotheses of taxonomic relationships.",
  "It has frequently been stated that birds are one of the best known of animal groups. This is true in the sense that most of the living species and subspecies in the world have probably been described; but because of inadequacies in the fossil record and repeated cases of convergent evolution within the group, our knowledge of the phylogenetic relationships between orders, suborders, and families of birds is inferior to that of mammals and reptiles. Most, if not all, of the major lineages of modern birds arose rapidly in the Late Cretaceous and the Paleogene Period (about 100 million to 23 million years ago). DNA data continue to resolve the relationships among major groups of birds. The penguins (Sphenisciformes), tube-nosed seabirds (Procellariiformes), and pelicans (Pelecaniformes) form a triad of related lineages. Waterfowl (Anseriformes) and chickenlike birds (Galliformes) are linked and together may be the oldest assemblage of modern birds. Some caprimulgiforms (owlet frogmouths) seem clearly related to swifts (Apodiformes) through a link between owlet frogmouths and treeswifts.",
  "The taxonomic positions of several bird groups remain open to question. The hoatzin, included below in the Cuculiformes, is often given its own order, Opisthocomiformes. The sandgrouse are listed separately in order Pteroclidiformes. The turacos, sometimes included in the Cuculiformes, are considered by many authors to warrant separation and are listed here as Musophagiformes. Diatryma and several related genera of extinct flightless predators are often placed in a distinct order, Diatrymiformes, near Gruiformes. The flamingos, which constitute the order Phoenicopteriformes in some classifications, are placed in the Ciconiiformes in this classification, but their relationships are still unknown.",
  "One area particularly in need of study is the relationships among the various groups of ratites (ostriches, rheas, emus, moas, and others). Formerly, some authorities argued that these birds and the penguins arose independently from cursorial reptiles, but it is now generally agreed that all of them passed through a flying stage in the course of their evolution. The ratite groups differ greatly in morphology and yet show remarkable similarities in palate and bill characters. The principal unanswered questions are how many different flightless lines evolved from flying ancestors and from how many different groups the flying ancestors evolved. On zoogeographic grounds, it is likely that the isolated kiwi-moa, elephant bird, and emu-cassowary lines arose independently from each other and from ratites on the other continents. But the ostriches and rheas could be descended from a common flightless ancestor because of the known former land connections from Asia to North and South America. Kiwis, ostriches, rheas, emus, and cassowaries are contained within order Struthioniformes in this classification.",
  "The evolutionary sequence of the bird orders starts with ratites and marine seabirds and ends with songbirds. Beginning in the 1980s, Charles Sibley proposed radically different listings of the nonpasserine orders on the basis of his pioneering DNA analyses.",
  "This classification is a synthesis of current information compiled by American ornithologist Frank Gill (2002).",
  " David Attenborough , The Life of Birds (1998), published in conjunction with a five-part video documentary series of the same name, is one of the best overviews of avian biology available. BirdLife International , Threatened Birds of the World (2000), encyclopaedically summarizes conservation status, includes maps and drawings. Michael Hutchins (ed.), Grzimek’s Animal Life Encyclopedia, Vols. 8–11 (2003), includes sections on behaviour in the discussion of each species and group described. David Allen Sibley , The Sibley Guide to Bird Life & Behavior (2001), further describes the activities of birds. Josep del Hoyo , Andrew Elliott , and Jordi Sargatal (eds.), Handbook of Birds of the World (1992– ), still in progress, is a massive multivolume set with excellent paintings, maps, and photographs. Frank S. Todd , 10,001 Titillating Tidbits of Avian Trivia (1994), is a treasure trove of facts useful for conversations with fellow ornithophiles. Michael Graham Wells , World Bird Species Checklist: With Alternative English and Scientific Names (1998), gathers as a complete compendium the range of different names that have been used for each bird species. James F. Clements , Birds of the World: A Checklist (2000), lists all species and is intended for personal record keeping by birdwatchers.",
  "Primarily continental in scope, some of the following are not generally considered field guides. Alan Poole and Frank Gill , The Birds of North America: Life Histories for the 21st Century (1992–2002), summarizes the biology and distributions of 720 species that nest regularly in North America, including Hawaii; David Sibley , National Audubon Society Sibley Guide to Birds (2000), serves as an advanced field guide to birds of North America. Stanley Cramp (ed.), Handbook of the Birds of Europe, the Middle East, and North Africa: The Birds of the Western Palearctic , 8 vol. (1977–94), is also available in disc and compact book format; Leslie H. Brown et al., The Birds of Africa (1982– ), continues to grow as the definitive reference for the continent’s avifauna; Richard Grimmett , A Guide to the Birds of India (1999), functions as a fully illustrated, modern field guide; Stephen Marchant and Peter Higgins , Handbook of Australian, New Zealand, and Antarctic Birds (1990– ); Robert Ridgely and Guy Tudor , Birds of South America (1994), includes only the perching (passerine) birds, but many country-specific books are available that include all the bird orders. Craig Robson (preface), A Field Guide to the Birds of South-East Asia (2000), portrays mainland species; whereas John Ramsay MacKinnon , A Field Guide to the Birds of Borneo, Sumatra, Java, and Bali (1993), is complementary in that it covers the major islands of Indonesia. Peter Harrison , Seabirds: An Identification Guide (1985); and Lars Löfgren , Ocean Birds (1987), compile accounts of species not associated with land regions.",
  "Aspects of bird locomotion and behaviour are covered in the benchmark work Georg Rüppell , Bird Flight (1977; originally published in German, 1975). A comprehensive explanation of avian activity is Robert Burton , Bird Behavior (1985). A commanding synthesis of current knowledge of the development, function, and evolution of bird songs and calls is provided by Donald E. Kroodsma , Edward H. Miller , and Henri Ouellet (eds.), Acoustic Communication in Birds (2nd ed., 1997). Another specialized aspect of behaviour is addressed by Chris Mead , Bird Migration (1983); and an overview of the evolution and diversity of bird nests and nest building is put forth in Nicholas E. Collias and Elsie C. Collias , Nest Building and Bird Behavior (1984). An excellent treatment of our rapidly changing perspectives on the diversity and function of social systems of birds is elucidated in J. David Ligon , The Evolution of Avian Breeding Systems (1999). A classic summary of the parental behaviour of birds is presented in Alexander F. Skutch , Parent Birds and Their Young (1976).",
  "Works on the anatomy and physiology of birds include Frank B. Gill , Ornithology (1994); and Noble S. Proctor and Patrick J. Lynch , Manual of Ornithology: Avian Structure and Function (1993), the standard college reference for functional anatomy of birds, includes a compact disc. Classic studies of ornithological knowledge are Donald S. Farner , James R. King , and K.C. Parkes (eds.), Avian Biology , 8 vol. (1971–85); and A.S. King and J. McLelland , Form and Function in Birds , 4 vol. (1979–89). Theories of egg formation, embryo development within the egg, and post-hatching biology of birds are compared in J.M. Starck and Robert Ricklefs , Avian Growth and Development (1997).",
  "The evolutionary history of birds with emphasis on the fossil record of both birds and their reptile ancestors is constructed by Alan Feduccia , The Origin and Evolution of Birds (1996). Paleontological relevance to current ornithology is put into focus by R.O. Prum , “Why Ornithologists Should Care About the Theropod Origin of Birds,” Auk , 19:1–17 (2002). A pioneering summary of the full taxonomic history of birds based on DNA analyses is explained in Charles G. Sibley and Burt L. Monroe , Phylogeny and Classification of Birds (1990)."
]