[
  "  blood , fluid that transports oxygen and nutrients to the cells and carries away carbon dioxide and other waste products. Technically, blood is a transport liquid pumped by the heart (or an equivalent structure) to all parts of the body, after which it is returned to the heart to repeat the process. Blood is both a tissue and a fluid. It is a tissue because it is a collection of similar specialized cells that serve particular functions. These cells are suspended in a liquid matrix ( plasma ), which makes the blood a fluid. If blood flow ceases, death will occur within minutes because of the effects of an unfavourable environment on highly susceptible cells.",
  "  The constancy of the composition of the blood is made possible by the circulation , which conveys blood through the organs that regulate the concentrations of its components. In the lungs , blood acquires oxygen and releases carbon dioxide transported from the tissues. The kidneys remove excess water and dissolved waste products. Nutrient substances derived from food reach the bloodstream after absorption by the gastrointestinal tract . Glands of the endocrine system release their secretions into the blood, which transports these hormones to the tissues in which they exert their effects. Many substances are recycled through the blood; for example, iron released during the destruction of old red cells is conveyed by the plasma to sites of new red cell production where it is reused. Each of the numerous components of the blood is kept within appropriate concentration limits by an effective regulatory mechanism. In many instances, feedback control systems are operative; thus, a declining level of blood sugar ( glucose ) leads to accelerated release of glucose into the blood so that a potentially hazardous depletion of glucose does not occur.",
  "Unicellular organisms, primitive multicellular animals, and the early embryos of higher forms of life lack a circulatory system . Because of their small size, these organisms can absorb oxygen and nutrients and can discharge wastes directly into their surrounding medium by simple diffusion. Sponges and coelenterates (e.g., jellyfish and hydras ) also lack a blood system; the means to transport foodstuffs and oxygen to all the cells of these larger multicellular animals is provided by water, sea or fresh, pumped through spaces inside the organisms. In larger and more-complex animals, transport of adequate amounts of oxygen and other substances requires some type of blood circulation. In most such animals the blood passes through a respiratory exchange membrane, which lies in the gills , lungs, or even the skin. There the blood picks up oxygen and disposes of carbon dioxide.",
  "The cellular composition of blood varies from group to group in the animal kingdom. Most invertebrates have various large blood cells capable of amoeboid movement. Some of these aid in transporting substances; other are capable of surrounding and digesting foreign particles or debris ( phagocytosis ). Compared with vertebrate blood, however, that of the invertebrates has relatively few cells. Among the vertebrates, there are several classes of amoeboid cells (white blood cells, or leukocytes ) and cells that help stop bleeding ( platelets , or thrombocytes).",
  "Oxygen requirements have played a major role in determining both the composition of blood and the architecture of the circulatory system. In some simple animals, including small worms and mollusks , transported oxygen is merely dissolved in the plasma. Larger and more-complex animals, which have greater oxygen needs, have pigments capable of transporting relatively large amounts of oxygen. The red pigment hemoglobin , which contains iron, is found in all vertebrates and in some invertebrates. In almost all vertebrates, including humans, hemoglobin is contained exclusively within the red cells ( erythrocytes ). The red cells of the lower vertebrates (e.g., birds) have a nucleus , whereas mammalian red cells lack a nucleus. Red cells vary markedly in size among mammals; those of the goat are much smaller than those of humans, but the goat compensates by having many more red cells per unit volume of blood. The concentration of hemoglobin inside the red cell varies little between species. Hemocyanin, a copper -containing protein chemically unlike hemoglobin, is found in some crustaceans . Hemocyanin is blue in colour when oxygenated and colourless when oxygen is removed. Some annelids have the iron-containing green pigment chlorocruorin, others the iron-containing red pigment hemerythrin. In many invertebrates the respiratory pigments are carried in solution in the plasma, but in higher animals, including all vertebrates, the pigments are enclosed in cells; if the pigments were freely in solution, the pigment concentrations required would cause the blood to be so viscous as to impede circulation.",
  "This article focuses on the main components and functions of human blood. For full treatment of blood groups, see the article blood group . For information on the organ system that conveys blood to all organs of the body, see  cardiovascular system . For additional information on blood in general and comparison of the blood and lymph of diverse organisms, see  circulation .",
  "  In humans, blood is an opaque red fluid, freely flowing but denser and more viscous than water. The characteristic colour is imparted by hemoglobin , a unique iron-containing protein. Hemoglobin brightens in colour when saturated with oxygen (oxyhemoglobin) and darkens when oxygen is removed (deoxyhemoglobin). For this reason, the partially deoxygenated blood from a vein is darker than oxygenated blood from an artery . The red blood cells ( erythrocytes ) constitute about 45 percent of the volume of the blood, and the remaining cells (white blood cells, or leukocytes , and platelets , or thrombocytes) less than 1 percent. The fluid portion, plasma , is a clear, slightly sticky, yellowish liquid. After a fatty meal, plasma transiently appears turbid. Within the body the blood is permanently fluid, and turbulent flow assures that cells and plasma are fairly homogeneously mixed.",
  "The total amount of blood in humans varies with age, sex, weight, body type, and other factors, but a rough average figure for adults is about 60 millilitres per kilogram of body weight. An average young male has a plasma volume of about 35 millilitres and a red cell volume of about 30 millilitres per kilogram of body weight. There is little variation in the blood volume of a healthy person over long periods, although each component of the blood is in a continuous state of flux. In particular, water rapidly moves in and out of the bloodstream, achieving a balance with the extravascular fluids (those outside the blood vessels) within minutes. The normal volume of blood provides such an adequate reserve that appreciable blood loss is well tolerated. Withdrawal of 500 millilitres (about a pint) of blood from normal blood donors is a harmless procedure. Blood volume is rapidly replaced after blood loss; within hours, plasma volume is restored by movement of extravascular fluid into the circulation. Replacement of red cells is completed within several weeks. The vast area of capillary membrane, through which water passes freely, would permit instantaneous loss of the plasma from the circulation were it not for the plasma proteins—in particular, serum albumin . Capillary membranes are impermeable to serum albumin, the smallest in weight and highest in concentration of the plasma proteins. The osmotic effect of serum albumin retains fluid within the circulation, opposing the hydrostatic forces that tend to drive the fluid outward into the tissues.",
  "The liquid portion of the blood, the plasma, is a complex solution containing more than 90 percent water. The water of the plasma is freely exchangeable with that of body cells and other extracellular fluids and is available to maintain the normal state of hydration of all tissues. Water, the single largest constituent of the body, is essential to the existence of every living cell.",
  "The major solute of plasma is a heterogeneous group of proteins constituting about 7 percent of the plasma by weight. The principal difference between the plasma and the extracellular fluid of the tissues is the high protein content of the plasma. Plasma protein exerts an osmotic effect by which water tends to move from other extracellular fluid to the plasma. When dietary protein is digested in the gastrointestinal tract, individual amino acids are released from the polypeptide chains and are absorbed. The amino acids are transported through the plasma to all parts of the body, where they are taken up by cells and are assembled in specific ways to form proteins of many types. These plasma proteins are released into the blood from the cells in which they were synthesized. Much of the protein of plasma is produced in the liver.",
  "The major plasma protein is serum albumin , a relatively small molecule, the principal function of which is to retain water in the bloodstream by its osmotic effect. The amount of serum albumin in the blood is a determinant of the total volume of plasma. Depletion of serum albumin permits fluid to leave the circulation and to accumulate and cause swelling of soft tissues ( edema ). Serum albumin binds certain other substances that are transported in plasma and thus serves as a nonspecific carrier protein. Bilirubin , for example, is bound to serum albumin during its passage through the blood. Serum albumin has physical properties that permit its separation from other plasma proteins, which as a group are called globulins. In fact, the globulins are a heterogeneous array of proteins of widely varying structure and function, only a few of which will be mentioned here. The immunoglobulins, or antibodies , are produced in response to a specific foreign substance, or antigen . For example, administration of polio vaccine, which is made from killed or attenuated (weakened) poliovirus, is followed by the appearance in the plasma of antibodies that react with poliovirus and effectively prevent the onset of disease. Antibodies may be induced by many foreign substances in addition to microorganisms; immunoglobulins are involved in some hypersensitivity and allergic reactions. Other plasma proteins are concerned with the coagulation of the blood.",
  "Many proteins are involved in highly specific ways with the transport function of the blood. Blood lipids are incorporated into protein molecules as lipoproteins , substances important in lipid transport. Iron and copper are transported in plasma by unique metal-binding proteins (transferrin and ceruloplasmin, respectively). Vitamin B 12  , an essential nutrient, is bound to a specific carrier protein. Although hemoglobin is not normally released into the plasma, a hemoglobin-binding protein (haptoglobin) is available to transport hemoglobin to the reticuloendothelial system should hemolysis (breakdown) of red cells occur. The serum haptoglobin level is raised during inflammation and certain other conditions; it is lowered in hemolytic disease and some types of liver disease.",
  "Lipids are present in plasma in suspension and in solution. The concentration of lipids in plasma varies, particularly in relation to meals, but ordinarily does not exceed 1 gram per 100 millilitres. The largest fraction consists of phospholipids , complex molecules containing phosphoric acid and a nitrogen base in addition to fatty acids and glycerol . Triglycerides , or simple fats, are molecules composed only of fatty acids and glycerol. Free fatty acids, lower in concentration than triglycerides, are responsible for a much larger transport of fat. Other lipids include cholesterol , a major fraction of the total plasma lipids. These substances exist in plasma combined with proteins of several types as lipoproteins. The largest lipid particles in the blood are known as chylomicrons and consist largely of triglycerides; after absorption from the intestine, they pass through lymphatic channels and enter the bloodstream through the thoracic lymph duct. The other plasma lipids are derived from food or enter the plasma from tissue sites.",
  "Some plasma constituents occur in plasma in low concentration but have a high turnover rate and great physiological importance. Among these is glucose , or blood sugar. Glucose is absorbed from the gastrointestinal tract or may be released into the circulation from the liver. It provides a source of energy for tissue cells and is the only source for some, including the red cells. Glucose is conserved and used and is not excreted. Amino acids also are so rapidly transported that the plasma level remains low, although they are required for all protein synthesis throughout the body. Urea , an end product of protein metabolism, is rapidly excreted by the kidneys. Other nitrogenous waste products— uric acid and creatinine—are similarly removed.",
  "Several inorganic materials are essential constituents of plasma, and each has special functional attributes. The predominant cation (positively charged ion) of the plasma is sodium, an ion that occurs within cells at a much lower concentration. Because of the effect of sodium on osmotic pressure and fluid movements, the amount of sodium in the body is an influential determinant of the total volume of extracellular fluid. The amount of sodium in plasma is controlled by the kidneys under the influence of the hormone aldosterone, which is secreted by the adrenal gland. If dietary sodium exceeds requirements, the excess is excreted by the kidneys. Potassium, the principal intracellular cation, occurs in plasma at a much lower concentration than sodium. The renal excretion of potassium is influenced by aldosterone, which causes retention of sodium and loss of potassium. Calcium in plasma is in part bound to protein and in part ionized. Its concentration is under the control of two hormones: parathyroid hormone, which causes the level to rise, and calcitonin, which causes it to fall. Magnesium, like potassium, is a predominantly intracellular cation and occurs in plasma in low concentration. Variations in the concentrations of these cations may have profound effects on the nervous system, the muscles, and the heart, effects normally prevented by precise regulatory mechanisms. Iron, copper, and zinc are required in trace amounts for synthesis of essential enzymes; much more iron is needed in addition for production of hemoglobin and myoglobin , the oxygen-binding pigment of muscles. These metals occur in plasma in low concentrations. The principal anion (negatively charged ion) of plasma is chloride; sodium chloride is its major salt. Bicarbonate participates in the transport of carbon dioxide and in the regulation of pH. Phosphate also has a buffering effect on the pH of the blood and is vital for chemical reactions of cells and for the metabolism of calcium. Iodide is transported through plasma in trace amounts; it is avidly taken up by the thyroid gland, which incorporates it into thyroid hormone.",
  "The hormones of all the endocrine glands are secreted into the plasma and transported to their target organs, the organs on which they exert their effects. The plasma levels of these agents often reflect the functional activity of the glands that secrete them; in some instances, measurements are possible though concentrations are extremely low. Among the many other constituents of plasma are numerous enzymes . Some of these appear simply to have escaped from tissue cells and have no functional significance in the blood.",
  "  There are four major types of blood cells: red blood cells ( erythrocytes ), platelets (thrombocytes), lymphocytes , and phagocytic cells. Collectively, the lymphocytes and phagocytic cells constitute the white blood cells ( leukocytes ). Each type of blood cell has a specialized function: red cells take up oxygen from the lungs and deliver it to the tissues; platelets participate in forming blood clots; lymphocytes are involved with immunity; and phagocytic cells occur in two varieties—granulocytes and monocytes—and ingest and break down microorganisms and foreign particles. The circulating blood functions as a conduit, bringing the various kinds of cells to the regions of the body in which they are needed: red cells to tissues requiring oxygen, platelets to sites of injury, lymphocytes to areas of infection, and phagocytic cells to sites of microbial invasion and inflammation. Each type of blood cell is described in detail below.",
  "  The continuous process of blood cell formation (hematopoiesis) takes place in hematopoietic tissue. In the developing embryo, the first site of blood formation is the yolk sac. Later in embryonic life, the liver becomes the most important red blood cell-forming organ, but it is soon succeeded by the bone marrow , which in adult life is the only source of both red cells and the granulocytes. In young children, hematopoietic bone marrow fills most of the skeleton, whereas in adults the marrow is located mainly in the central bones (ribs, sternum, vertebrae, and pelvic bones). Bone marrow is a rich mixture of developing and mature blood cells, as well as fat cells and other cells that provide nutrition and an architectural framework upon which the blood-forming elements arrange themselves. The weight of the marrow of a normal adult is 1,600 to 3,700 grams and contains over 1,000,000,000,000 hematopoietic cells (18 × 10 9 cells per kilogram). Nourishment of this large mass of cells comes from the blood itself. Arteries pierce the outer walls of the bones, enter the marrow, and divide into fine branches, which ultimately coalesce into large venous sacs ( sinusoids ) through which blood flows sluggishly. In the surrounding hematopoietic tissue, newly formed blood cells enter the general circulation by penetrating the walls of the sinusoids.",
  "In the adult the bone marrow produces all of the red cells, 60 to 70 percent of the white cells (i.e., the granulocytes), and all of the platelets. The lymphatic tissues, particularly the thymus , the spleen , and the lymph nodes , produce the lymphocytes (comprising 20 to 30 percent of the white cells). The reticuloendothelial tissues of the spleen, liver, lymph nodes, and other organs produce the monocytes (4 to 8 percent of the white cells). The platelets are formed from bits of the cytoplasm of the giant cells (megakaryocytes) of the bone marrow.",
  "Both the red and white cells arise through a series of complex transformations from primitive stem cells , which have the ability to form any of the precursors of a blood cell. Precursor cells are stem cells that have developed to the stage where they are committed to forming a particular type of new blood cell. By dividing and differentiating, precursor cells give rise to the four major blood cell lineages: red cells, phagocytic cells, megakaryocytes, and lymphocytes. The cells of the marrow are under complex controls that regulate their formation and adjust their production to the changing demands of the body. When marrow stem cells are cultured outside the body, they form tiny clusters of cells (colonies), which correspond to red cells, phagocytic cells, and megakaryocytes. The formation of these individual colonies depends on hormonal sugar-containing proteins (glycoproteins), referred to collectively as colony-stimulating factors (CSFs). These factors are produced throughout the body. Even in minute amounts, CSFs can stimulate the division and differentiation of precursor cells into mature blood cells and thus exert powerful regulatory influences over the production of blood cells. A master colony-stimulating factor (multi-CSF), also called interleukin-3, stimulates the most ancestral hematopoietic stem cell. Further differentiation of this stem cell into specialized descendants requires particular kinds of CSFs; for example, the CSF erythropoietin is needed for the maturation of red cells, and granulocyte CSF controls the production of granulocytes. These glycoproteins, as well as other CSFs, serve as signals from the tissues to the marrow. For instance, a decrease in the oxygen content of the blood stimulates the kidney to increase its production of erythropoietin, thus ultimately raising the number of oxygen-carrying red cells. Certain bacterial components accelerate the formation of granulocyte CSF, thereby leading to an increased production of phagocytic granulocytes by the bone marrow during infection.",
  "In the normal adult the rate of blood cell formation varies depending on the individual, but a typical production might average 200 billion red cells per day, 10 billion white cells per day, and 400 billion platelets per day.",
  "The red blood cells are highly specialized, well adapted for their primary function of transporting oxygen from the lungs to all of the body tissues. Red cells are approximately 7.8 μm (1 μm = 0.000039 inch) in diameter and have the form of biconcave disks, a shape that provides a large surface-to-volume ratio. When fresh blood is examined with the microscope, red cells appear to be yellow-green disks with pale centres containing no visible internal structures. When blood is centrifuged to cause the cells to settle, the volume of packed red cells ( hematocrit value) ranges between 42 and 54 percent of total volume in men and between 37 and 47 percent in women; values are somewhat lower in children. Normal red blood cells are fairly uniform in volume, so that the hematocrit value is determined largely by the number of red cells per unit of blood. The normal red cell count ranges between four million and six million per cubic millimetre.",
  "The red blood cell is enclosed in a thin membrane that is composed of chemically complex lipids, proteins, and carbohydrates in a highly organized structure. Extraordinary distortion of the red cell occurs in its passage through minute blood vessels, many of which have a diameter less than that of the red cell. When the deforming stress is removed, the cell springs back to its original shape. The red cell readily tolerates bending and folding, but, if appreciable stretching of the membrane occurs, the cell is damaged or destroyed. The membrane is freely permeable to water, oxygen, carbon dioxide, glucose, urea, and certain other substances, but it is impermeable to hemoglobin . Within the cell the major cation is potassium; in contrast, in plasma and extracellular fluids the major cation is sodium. A pumping mechanism, driven by enzymes within the red cell, maintains its sodium and potassium concentrations. Red cells are subject to osmotic effects. When they are suspended in very dilute (hypotonic) solutions of sodium chloride, red cells take in water, which causes them to increase in volume and to become more spheroid; in concentrated salt solutions they lose water and shrink.",
  "When red cell membranes are damaged, hemoglobin and other dissolved contents may escape from the cells, leaving the membranous structures as “ghosts.” This process, called hemolysis , is produced not only by the osmotic effects of water but also by numerous other mechanisms. These include physical damage to red cells, as when blood is heated, is forced under great pressure through a small needle, or is subjected to freezing and thawing; chemical damage to red cells by agents such as bile salts, detergents, and certain snake venoms; and damage caused by immunologic reactions that may occur when antibodies attach to red cells in the presence of complement . When such destruction proceeds at a greater than normal rate, hemolytic anemia results.",
  "The membrane of the red cell has on its surface a group of molecules that confer blood group specificity (i.e., that differentiate blood cells into groups). Most blood group substances are composed of carbohydrate linked to protein, and it is usually the chemical structure of the carbohydrate portion that determines the specific blood type. Blood group substances are antigens capable of inducing the production of antibodies when injected into persons lacking the antigen. Detection and recognition of the blood group antigens are accomplished by the use of blood serum containing these antibodies. The large number of different red cell antigens makes it extremely unlikely that persons other than identical twins will have the same array of blood group substances.",
  " 1 2 1 2  About 95 percent of the dry weight of the red blood cell consists of hemoglobin , the substance necessary for oxygen transport. Hemoglobin is a protein; a molecule contains four polypeptide chains (a tetramer), each chain consisting of more than 140 amino acids. To each chain is attached a chemical structure known as a heme group. Heme is composed of a ringlike organic compound known as a porphyrin , to which an iron atom is attached. It is the iron atom that reversibly binds oxygen as the blood travels between the lungs and the tissues. There are four iron atoms in each molecule of hemoglobin, which, accordingly, can bind four atoms of oxygen. The complex porphyrin and protein structure provides the proper environment for the iron atom so that it binds and releases oxygen appropriately under physiological conditions. The affinity of hemoglobin for oxygen is so great that at the oxygen pressure in the lungs about 95 percent of the hemoglobin is saturated with oxygen. As the oxygen tension falls, as it does in the tissues, oxygen dissociates from hemoglobin and is available to move by diffusion through the red cell membrane and the plasma to sites where it is used. The proportion of hemoglobin saturated with oxygen is not directly proportional to the oxygen pressure. As the oxygen pressure declines, hemoglobin gives up its oxygen with disproportionate rapidity, so that the major fraction of the oxygen can be released with a relatively small drop in oxygen tension. The affinity of hemoglobin for oxygen is primarily determined by the structure of hemoglobin, but it is also influenced by other conditions within the red cell, in particular the pH and certain organic phosphate compounds produced during the chemical breakdown of glucose, especially 2,3-diphosphoglycerate ( see below  Respiration ).",
  "Hemoglobin has a much higher affinity for carbon monoxide than for oxygen. Carbon monoxide produces its lethal effects by binding to hemoglobin and preventing oxygen transport. The oxygen-carrying function of hemoglobin can be disturbed in other ways. The iron of hemoglobin is normally in the reduced or ferrous state, in both oxyhemoglobin and deoxyhemoglobin. If the iron itself becomes oxidized to the ferric state, hemoglobin is changed to methemoglobin, a brown pigment incapable of transporting oxygen. The red cells contain enzymes capable of maintaining the iron in its normal state, but under abnormal conditions large amounts of methemoglobin may appear in the blood.",
  " Sickle cell anemia is a serious and often fatal disease characterized by an inherited abnormality of hemoglobin. Persons who have sickle cell anemia are predominantly of African descent. The disease is caused by the mutation of a single gene that determines the structure of the hemoglobin molecule. Sickle hemoglobin differs from normal hemoglobin in that a single amino acid ( glutamic acid ) in one pair of the polypeptide chains has been replaced by another ( valine ). This single intramolecular change so alters the properties of the hemoglobin molecule that anemia and other effects are produced. Many other genetically determined abnormalities of hemoglobin have been identified. Some of these also produce diseases of several types. Study of the effects of altered structure of hemoglobin on its properties has greatly broadened knowledge of the structure-function relationships of the hemoglobin molecule.",
  "Red cells are produced continuously in the marrow of certain bones. As stated above, in adults the principal sites of red cell production, called erythropoiesis, are the marrow spaces of the vertebrae, ribs, breastbone, and pelvis. Within the bone marrow the red cell is derived from a primitive precursor, or erythroblast, a nucleated cell in which there is no hemoglobin. Proliferation occurs as a result of several successive cell divisions. During maturation, hemoglobin appears in the cell, and the nucleus becomes progressively smaller. After a few days the cell loses its nucleus and is then introduced into the bloodstream in the vascular channels of the marrow. Almost 1 percent of the red cells are generated each day, and the balance between red cell production and the removal of aging red cells from the circulation is precisely maintained. When blood is lost from the circulation, the erythropoietic activity of marrow increases until the normal number of circulating cells has been restored.",
  "In a normal adult the red cells of about half a litre (almost one pint) of blood are produced by the bone marrow every week. A number of nutrient substances are required for this process. Some nutrients are the building blocks of which the red cells are composed. For example, amino acids are needed in abundance for the construction of the proteins of the red cell, in particular of hemoglobin. Iron also is a necessary component of hemoglobin. Approximately one-quarter of a gram of iron is needed for the production of a pint of blood. Other substances, required in trace amounts, are needed to catalyze the chemical reactions by which red cells are produced. Important among these are several vitamins such as riboflavin , vitamin B 12  , and folic acid , necessary for the maturation of the developing red cell; and vitamin B 6  (pyridoxine), required for the synthesis of hemoglobin. The secretions of several endocrine glands influence red cell production. If there is an inadequate supply of thyroid hormone, erythropoiesis is retarded and anemia appears. The male sex hormone, testosterone , stimulates red cell production; for this reason, red cell counts of men are higher than those of women.",
  "The capacity of the bone marrow to produce red cells is enormous. When stimulated to peak activity and when provided adequately with nutrient substances, the marrow can compensate for the loss of several pints of blood per week. Hemorrhage or accelerated destruction of red cells leads to enhanced marrow activity. The marrow can increase its production of red cells up to eight times the usual rate. After that, if blood loss continues, anemia develops. The rate of erythropoiesis is sensitive to the oxygen tension of the arterial blood. When oxygen tension falls, more red cells are produced and the red cell count rises. For this reason, persons who live at high altitude have higher red cell counts than those who live at sea level. For example, there is a small but significant difference between average red cell counts of persons living in New York City, at sea level pressure, and persons living in Denver, Colo., more than 1.5 km (1 mile) above sea level, where the atmospheric pressure is lower. Natives of the Andes, living nearly 5 km (3 miles) above sea level, have extremely high red cell counts.",
  "The rate of production of erythrocytes is controlled by the hormone erythropoietin, which is produced largely in the kidneys. When the number of circulating red cells decreases or when the oxygen transported by the blood diminishes, an unidentified sensor detects the change and the production of erythropoietin is increased. This substance is then transported through the plasma to the bone marrow, where it accelerates the production of red cells. The erythropoietin mechanism operates like a thermostat, increasing or decreasing the rate of red cell production in accordance with need. When a person who has lived at high altitude moves to a sea level environment, production of erythropoietin is suppressed, the rate of red cell production declines, and the red cell count falls until the normal sea level value is achieved. With the loss of one pint of blood, the erythropoietin mechanism is activated, red cell production is enhanced, and within a few weeks the number of circulating red cells has been restored to the normal value. The precision of control is extraordinary so that the number of new red cells produced accurately compensates for the number of cells lost or destroyed. Erythropoietin has been produced in vitro (outside the body) by the technique of genetic engineering (recombinant DNA). The purified, recombinant hormone has promise for persons with chronic renal failure, who develop anemia because of a lack of erythropoietin.",
  "Survival of the red blood cell in the circulation depends upon the continuous utilization of glucose for the production of energy. Two chemical pathways are employed, and both are essential for the normal life of the red cell. An extraordinary number of enzyme systems participate in these reactions and direct the energy evolved into appropriate uses. Red cells contain neither a nucleus nor RNA (ribonucleic acid, necessary for protein synthesis), so that cell division ( mitosis ) and production of new protein are impossible. Energy is not necessary for oxygen and carbon dioxide transport, which depends principally on the properties of hemoglobin. Energy, however, is needed for another reason. Because of the tendency for extracellular sodium to leak into the red cell and for potassium to leak out, energy is required to operate a pumping mechanism in the red cell membrane to maintain the normal gradients (differences in concentrations) of these ions. Energy is also required to convert methemoglobin to oxyhemoglobin and to prevent the oxidation of other constituents of the red cell.",
  "  Red cells have an average life span of 120 days. Because red cells cannot synthesize protein, reparative processes are not possible. As red cells age, wear and tear leads to loss of some of their protein, and the activity of some of their essential enzymes decreases. Chemical reactions necessary for the survival of the cell are consequently impaired. As a result, water passes into the aging red cell, transforming its usual discoid shape into a sphere. These spherocytes are inelastic, and, as they sluggishly move through the circulation, they are engulfed by phagocytes. Phagocytic cells form a part of the lining of blood vessels, particularly in the spleen, liver, and bone marrow. These cells, called macrophages, are constituents of the reticuloendothelial system and are found in the lymph nodes, in the intestinal tract, and as free-wandering and fixed cells. As a group they have the ability to ingest not only other cells but also many other microscopic particles, including certain dyes and colloids . Within the reticuloendothelial cells, erythrocytes are rapidly destroyed. Protein, including that of the hemoglobin, is broken down, and the component amino acids are transported through the plasma to be used in the synthesis of new proteins. The iron removed from hemoglobin passes back into the plasma and is transported to the bone marrow, where it may be used in the synthesis of hemoglobin in newly forming red cells. Iron not necessary for this purpose is stored within the reticuloendothelial cells but is available for release and reuse whenever it is required. In the breakdown of red cells, there is no loss to the body of either protein or iron, virtually all of which is conserved and reused. In contrast, the porphyrin ring structure of hemoglobin, to which iron was attached, undergoes a chemical change that enables its excretion from the body. This reaction converts porphyrin , a red pigment, into bilirubin , a yellow pigment. Bilirubin released from reticuloendothelial cells after the destruction of erythrocytes is conveyed through the plasma to the liver, where it undergoes further changes that prepare it for secretion into the bile. The amount of bilirubin produced and secreted into the bile is determined by the amount of hemoglobin destroyed. When the rate of red cell destruction exceeds the capacity of the liver to handle bilirubin, the yellow pigment accumulates in the blood, causing jaundice . Jaundice can also occur if the liver is diseased (e.g., hepatitis ) or if the egress of bile is blocked (e.g., by a gallstone ).",
  " Staphylococcus aureus   White blood cells (leukocytes), unlike red cells, are nucleated and independently motile. Highly differentiated for their specialized functions, they do not undergo cell division ( mitosis ) in the bloodstream, but some retain the capability of mitosis. As a group they are involved in the body’s defense mechanisms and reparative activity. The number of white cells in normal blood ranges between 4,500 and 11,000 per cubic millimetre. Fluctuations occur during the day; lower values are obtained during rest and higher values during exercise. Intense physical exertion may cause the count to exceed 20,000 per cubic millimetre. Most of the white cells are outside the circulation, and the few in the bloodstream are in transit from one site to another. As living cells, their survival depends on their continuous production of energy. The chemical pathways utilized are more complex than those of the red cells and are similar to those of other tissue cells. White cells, containing a nucleus and able to produce ribonucleic acid (RNA), can synthesize protein. They comprise three classes of cells, each unique as to structure and function, that are designated granulocytes, monocytes, and lymphocytes.",
  "Granulocytes, the most numerous of the white cells, are larger than red cells (approximately 12–15 μm in diameter). They have a multilobed nucleus and contain large numbers of cytoplasmic granules (i.e., granules in the cell substance outside the nucleus). Granulocytes are important mediators of the inflammatory response. There are three types of granulocytes: neutrophils, eosinophils, and basophils. Each type of granulocyte is identified by the colour of the granules when the cells are stained with a compound dye. The granules of the neutrophil are pink, those of the eosinophil are red, and those of the basophil are blue-black. About 50 to 80 percent of the white cells are neutrophils, while the eosinophils and basophils together constitute no more than 3 percent.",
  "The neutrophils are fairly uniform in size with a diameter between 12 and 15 μm. The nucleus consists of two to five lobes joined together by hairlike filaments. Neutrophils move with amoeboid motion. They extend long projections called pseudopodium into which their granules flow; this action is followed by contraction of filaments based in the cytoplasm, which draws the nucleus and rear of the cell forward. In this way neutrophils rapidly advance along a surface. The bone marrow of a normal adult produces about 100 billion neutrophils daily. It takes about one week to form a mature neutrophil from a precursor cell in the marrow; yet, once in the blood, the mature cells live only a few hours or perhaps a little longer after migrating to the tissues. To guard against rapid depletion of the short-lived neutrophils (for example, during infection), the bone marrow holds a large number of them in reserve to be mobilized in response to inflammation or infection. Within the body, the neutrophils migrate to areas of infection or tissue injury. The force of attraction that determines the direction in which neutrophils will move is known as chemotaxis and is attributed to substances liberated at sites of tissue damage. Of the 100 billion neutrophils circulating outside the bone marrow, half are in the tissues and half are in the blood vessels. Of those in the blood vessels, half are within the mainstream of rapidly circulating blood, and the other half move slowly along the inner walls of the blood vessels (marginal pool), ready to enter tissues on receiving a chemotactic signal from them.",
  "Neutrophils are actively phagocytic; they engulf bacteria and other microorganisms and microscopic particles. The granules of the neutrophil are microscopic packets of potent enzymes capable of digesting many types of cellular materials. When a bacterium is engulfed by a neutrophil, it is encased in a vacuole lined by the invaginated membrane. The granules discharge their contents into the vacuole containing the organism. As this occurs, the granules of the neutrophil are depleted (degranulation). A metabolic process within the granules produces hydrogen peroxide and a highly active form of oxygen (superoxide), which destroy the ingested bacteria. Final digestion of the invading organism is accomplished by enzymes.",
  "Eosinophils, like other granulocytes, are produced in the bone marrow until they are released into the circulation. Although about the same size as neutrophils, the eosinophil contains larger granules, and the chromatin is generally concentrated in only two nonsegmented lobes. Eosinophils leave the circulation within hours of release from the marrow and migrate into the tissues (usually those of the skin, lung, and respiratory tract) through the lymphatic channels. Like neutrophils, eosinophils respond to chemotactic signals released at the site of cell destruction. They are actively motile and phagocytic. Eosinophils are involved in defense against parasites, and they participate in hypersensitivity and inflammatory reactions, primarily by dampening their destructive effects.",
  "Basophils are the least numerous of the granulocytes, and their large granules almost completely obscure the underlying double-lobed nucleus. Within hours of their release from the bone marrow, basophils migrate from the circulation to the barrier tissues (e.g., the skin and mucosa), where they synthesize and store histamine , a natural modulator of the inflammatory response. When aggravated, basophils release, along with histamine and other substances, leukotrienes, which cause bronchoconstriction during anaphylaxis (a hypersensitivity reaction). Basophils incite immediate hypersensitivity reactions in association with platelets, macrophages, and neutrophils.",
  "Monocytes are the largest cells of the blood (averaging 15–18 μm in diameter), and they make up about 7 percent of the leukocytes. The nucleus is relatively big and tends to be indented or folded rather than multilobed. The cytoplasm contains large numbers of fine granules, which often appear to be more numerous near the cell membrane. Monocytes are actively motile and phagocytic. They are capable of ingesting infectious agents as well as red cells and other large particles, but they cannot replace the function of the neutrophils in the removal and destruction of bacteria. Monocytes usually enter areas of inflamed tissue later than the granulocytes. Often they are found at sites of chronic infections.",
  "  In the bone marrow, granulocytes and monocytes arise from a common precursor under the influence of the granulocyte-macrophage colony-stimulating factor. Monocytes leave the bone marrow and circulate in the blood. After a period of hours, the monocytes enter the tissues, where they develop into macrophages, the tissue phagocytes that constitute the reticuloendothelial system (or macrophage system). Macrophages occur in almost all tissues of the body. Those in the liver are called Kupffer cells , those in the skin Langerhans cells. Apart from their role as scavengers, macrophages play a key role in immunity by ingesting antigens and processing them so that they can be recognized as foreign substances by lymphocytes.",
  "   Lymphocytes constitute about 28–42 percent of the white cells of the blood, and they are part of the immune response to foreign substances in the body. Most lymphocytes are small, only slightly larger than erythrocytes, with a nucleus that occupies most of the cell. Some are larger and have more abundant cytoplasm that contains a few granules. Lymphocytes are sluggishly motile, and their paths of migration outside of the bloodstream are different from those of granulocytes and monocytes. Lymphocytes are found in large numbers in the lymph nodes, spleen, thymus, tonsils, and lymphoid tissue of the gastrointestinal tract. They enter the circulation through lymphatic channels that drain principally into the thoracic lymph duct, which has a connection with the venous system. Unlike other blood cells, some lymphocytes may leave and reenter the circulation, surviving for about one year or more. The principal paths of recirculating lymphocytes are through the spleen or lymph nodes. Lymphocytes freely leave the blood to enter lymphoid tissue, passing barriers that prevent the passage of other blood cells. When stimulated by antigen and certain other agents, some lymphocytes are activated and become capable of cell division (mitosis).",
  "  The lymphocytes regulate or participate in the acquired immunity to foreign cells and antigens. They are responsible for immunologic reactions to invading organisms, foreign cells such as those of a transplanted organ, and foreign proteins and other antigens not necessarily derived from living cells. The two classes of lymphocytes are not distinguished by the usual microscopic examination but rather by the type of immune response they elicit. The B lymphocytes (or B cells ) are involved in what is called humoral immunity. Upon encountering a foreign substance (or antigen), the B lymphocyte differentiates into a plasma cell, which secretes immunoglobulin (antibodies). The second class of lymphocytes, the T lymphocytes (or T cells ), are involved in regulating the antibody-forming function of B lymphocytes as well as in directly attacking foreign antigens. T lymphocytes participate in what is called the cell-mediated immune response. T lymphocytes also participate in the rejection of transplanted tissues and in certain types of allergic reactions.",
  "All lymphocytes begin their development in the bone marrow. The B lymphocytes mature partly in the bone marrow until they are released into the circulation. Further differentiation of B lymphocytes occurs in lymphoid tissues (spleen or lymph nodes), most notably on stimulation by a foreign antigen. The precursors of the T lymphocytes migrate from the marrow to the thymus , where they differentiate under the influence of a hormonelike substance. (The thymus is a small organ lying just behind the breastbone in the upper portion of the chest. It is relatively large at birth, begins to regress after puberty, and may be represented only by a fibrous cord in the elderly. The thymus begins to exert its effects on the differentiation of lymphocytes before birth. The removal of the thymus from certain animals at birth prevents the normal development of immunologic responses.) Once they have matured, the T lymphocytes leave the thymus and circulate through the blood to the lymph nodes and the spleen. The two classes of lymphocytes originally derived their names from investigations in birds, in which it was found that differentiation of one class of lymphocyte was influenced by the bursa of Fabricius (an outpouching of the gastrointestinal tract) and thus was called the B lymphocytes, and the other was influenced by the thymus and was called the T lymphocytes.",
  "A primary function of lymphocytes is to protect the body from foreign microbes. This essential task is carried out by both T lymphocytes and B lymphocytes, which often act in concert. The T lymphocytes can recognize and respond only to antigens that appear on cell membranes in association with other molecules called major histocompatibility complex (MHC) antigens. The latter are glycoproteins that present the antigen in a form that can be recognized by T lymphocytes. In effect, T lymphocytes are responsible for continuous surveillance of cell surfaces for the presence of foreign antigens. By contrast, the antibodies produced by B lymphocytes are not confined to recognizing antigens on cell membranes; they can bind to soluble antigens in the blood or in extravascular fluids. T lymphocytes typically recognize antigens of infectious organisms that must penetrate cells in order to multiply, such as viruses . During their intracellular life cycle, viruses produce antigens that appear on the cell membrane. Two classes of T lymphocytes can be involved in the response to those cell-associated viral antigens: cytotoxic T lymphocytes, which destroy the cells by a lytic mechanism, and helper T lymphocytes, which assist B cells to produce antibodies against the microbial antigens. Helper T lymphocytes exert their influence on B lymphocytes through several hormonelike peptides termed interleukins (IL). Five different T lymphocyte interleukins (IL-2, IL-3, IL-4, IL-5, and IL-6) have been discovered, each with different (and sometimes overlapping) effects on B lymphocytes and other blood cells. Interleukin-1, produced by macrophages, is a peptide that stimulates T lymphocytes and that also acts on the hypothalamus in the brain to produce fever. The ability to develop an immune response (i.e., the T cell-mediated and humoral immune responses) to foreign substances is called immunologic competence (immunocompetence). Immunologic competence, which begins to develop during embryonic life, is incomplete at the time of birth but is fully established soon after birth. If an antigen is introduced into a person’s body before immunologic competence has been established, an immune response will not result upon reinfection, and that person is said to be tolerant to that antigen.",
  "Study of immunologic competence and immune tolerance has been accelerated by interest in organ transplantation . The success rates of organ transplantations have been improved by better knowledge about donor selection and improved techniques for suppressing the immune responses of the recipient. An important element in donor selection is tissue typing: the matching of the donor’s histocompatibility antigens (human leukocyte antigens) with those of the prospective recipient. The closer the match, the greater the probability that the graft will be accepted.",
  "  The blood platelets are the smallest cells of the blood, averaging about 2 to 4 μm in diameter. Although much more numerous (150,000 to 400,000 per cubic millimetre) than the white cells, they occupy a much smaller fraction of the volume of the blood because of their relatively minute size. Like the red cells, they lack a nucleus and are incapable of cell division (mitosis), but they have a more complex metabolism and internal structure than have the red cells. When seen in fresh blood they appear spheroid, but they have a tendency to extrude hairlike filaments from their membranes. They adhere to each other but not to red cells and white cells. Tiny granules within platelets contain substances important for the clot-promoting activity of platelets.",
  "The function of the platelets is related to hemostasis, the prevention and control of bleeding. When the endothelial surface (lining) of a blood vessel is injured, platelets in large numbers immediately attach to the injured surface and to each other, forming a tenaciously adherent mass of platelets. The effect of the platelet response is to stop the bleeding and to form the site of the developing blood clot, or thrombus. If platelets are absent, this important defense reaction cannot occur, and protracted bleeding from small wounds (prolonged bleeding time) results. The normal resistance of capillary membranes to leakage of red cells is dependent upon platelets. Severe deficiency of platelets reduces the resistance of the capillary walls, and abnormal bleeding from the capillaries occurs, either spontaneously or as the result of minor injury. Platelets also contribute substances essential for the normal coagulation of the blood, and they cause the shrinking, or retraction, of a clot after it has been formed.",
  "Platelets are formed in the bone marrow by segmentation of the cytoplasm (the cell substance other than the nucleus) of cells known as megakaryocytes, the largest cells of the marrow. Within the marrow the abundant granular cytoplasm of the megakaryocyte divides into many small segments that break off and are released as platelets into the circulating blood. After about 10 days in the circulation, platelets are removed and destroyed. There are no reserve stores of platelets except in the spleen, in which platelets occur in higher concentration than in the peripheral blood. Some platelets are consumed in exerting their hemostatic effects, and others, reaching the end of their life span, are removed by reticuloendothelial cells (any of the tissue phagocytes). The rate of platelet production is controlled but not so precisely as the control of red cell production. A hormonelike substance called thrombopoietin is believed to be the chemical mediator that regulates the number of platelets in the blood by stimulating an increase in the number and growth of megakaryocytes, thus controlling the rate of platelet production.",
  "Broadly conceived, the function of the blood is to maintain the constancy of the internal environment. The circulating blood makes possible adaptability to changing conditions of life—the endurance of wide variations of climate and atmospheric pressure; the capacity to alter the amount of physical activity; the tolerance of changing diet and fluid intake; the resistance to physical injury, chemical poisons, and infectious agents. The blood has an exceedingly complex structure, and many components participate in its functional activities. Some of the regulatory mechanisms with which the blood is involved include sensors that detect alterations in temperature, in pH, in oxygen tension, and in concentrations of the constituents of the blood. Effects of these stimuli are in some instances mediated via the nervous system or by the release of hormones (chemical mediators). Some of the major functions of the blood are outlined in the paragraphs that follow.",
  "In terms of immediate urgency, the respiratory function of the blood is vital. A continuous supply of oxygen is required by living cells—in particular those of the brain , since deprivation is followed in minutes by unconsciousness and death. A normal male at rest uses about 250 millilitres of oxygen per minute, a requirement increased manyfold during vigorous exertion. All of this oxygen is transported by the blood, most of it bound to the hemoglobin of the red cells. The minute blood vessels of the lungs bring the blood into close apposition with the pulmonary air spaces (alveoli), where the pressure of oxygen is relatively high. Oxygen diffuses through the plasma and into the red cell, combining with hemoglobin, which is about 95 percent saturated with oxygen on leaving the lungs. One gram of hemoglobin can bind 1.35 millilitres of oxygen, and about 50 times as much oxygen is combined with hemoglobin as is dissolved in the plasma. In tissues where the oxygen tension is relatively low, hemoglobin releases the bound oxygen.",
  "The two main regulators of oxygen uptake and delivery are the pH (a measure of the acidity or basicity) of tissues and the content of 2,3-diphosphoglycerate (2,3-DPG) in red cells. The pH of blood is kept relatively constant at the slightly alkaline level of about 7.4 (pH less than 7 indicates acidity, more than 7 alkalinity). The effect of pH on the ability of hemoglobin to bind oxygen is called the Bohr effect: when pH is low, hemoglobin binds oxygen less strongly, and when pH is high (as in the lungs), hemoglobin binds more tightly to oxygen. The Bohr effect is due to changes in the shape of the hemoglobin molecule as the pH of its environment changes. The oxygen affinity of hemoglobin is also regulated by 2,3-DPG, a simple molecule produced by the red cell when it metabolizes glucose . The effect of 2,3-DPG is to reduce the oxygen affinity of hemoglobin. When the availability of oxygen to tissues is reduced, the red cell responds by synthesizing more 2,3-DPG, a process that occurs over a period of hours to days. By contrast, tissue pH mediates minute-to-minute changes in oxygen handling.",
  " Carbon dioxide , a waste product of cellular metabolism, is found in relatively high concentration in the tissues. It diffuses into the blood and is carried to the lungs to be eliminated with the expired air. Carbon dioxide is much more soluble than oxygen and readily diffuses into red cells. It reacts with water to form carbonic acid, a weak acid that at the alkaline pH of the blood appears principally as bicarbonate.",
  "The tension of carbon dioxide in the arterial blood is regulated with extraordinary precision through a sensing mechanism in the brain that controls the respiratory movements. Carbon dioxide is an acidic substance, and an increase in its concentration tends to lower the pH of the blood (i.e., becoming more acidic). This may be averted by the stimulus that causes increased depth and rate of breathing, a response that accelerates the loss of carbon dioxide. It is the tension of carbon dioxide, and not of oxygen, in the arterial blood that normally controls breathing. Inability to hold one’s breath for more than a minute or so is the result of the rising tension of carbon dioxide, which produces the irresistible stimulus to breathe. Respiratory movements that ventilate the lungs sufficiently to maintain a normal tension of carbon dioxide are, under normal conditions, adequate to keep the blood fully oxygenated. Control of respiration is effective, therefore, in regulating the uptake of oxygen and disposal of carbon dioxide and in maintaining the constancy of blood pH.",
  "Each substance required for the nutrition of every cell in the body is transported by the blood: the precursors of carbohydrates , proteins , and fats ; minerals and salts; vitamins and other accessory food factors. These substances must all pass through the plasma on the way to the tissues in which they are used. The materials may enter the bloodstream from the gastrointestinal tract , or they may be released from stores within the body or become available from the breakdown of tissue.",
  "The concentrations of many plasma constituents, including blood sugar ( glucose ) and calcium , are carefully regulated, and deviations from the normal may have adverse effects. One of the regulators of glucose is insulin , a hormone released into the blood from glandular cells in the pancreas . Ingestion of carbohydrates is followed by increased production of insulin, which tends to keep the blood glucose level from rising excessively as the carbohydrates are broken down into their constituent sugar molecules. But an excess of insulin may severely reduce the level of glucose in the blood, causing a reaction that, if sufficiently severe, may include coma and even death. Glucose is transported in simple solution, but some substances require specific binding proteins (with which the substances form temporary unions) to convey them through the plasma. Iron and copper , essential minerals, have special and necessary transport proteins. Nutrient substances may be taken up selectively by the tissues that require them. Growing bones use large amounts of calcium, and bone marrow removes iron from plasma for hemoglobin synthesis.",
  "The blood carries the waste products of cellular metabolism to the excretory organs. The removal of carbon dioxide via the lungs has been described above. Water produced by the oxidation of foods or available from other sources in excess of needs is excreted by the kidneys as the solvent of the urine . Water derived from the blood also is lost from the body by evaporation from the skin and lungs and in small amounts from the gastrointestinal tract. The water content of the blood and of the body as a whole remains within a narrow range because of effective regulatory mechanisms, hormonal and other, that determine the urinary volume. The concentrations of physiologically important ions of the plasma, notably sodium , potassium , and chloride, are precisely controlled by their retention or selective removal as blood flows through the kidneys. Of special significance is the renal (kidney) control of acidity of the urine, a major factor in the maintenance of the normal pH of the blood. Urea , creatinine, and uric acid are nitrogen-containing products of metabolism that are transported by the blood and rapidly eliminated by the kidneys. The kidneys clear the blood of many other substances, including numerous drugs and chemicals that are taken into the body. In performing their excretory function, the kidneys have a major responsibility for maintaining the constancy of the composition of the blood. ( See also  renal system .) The liver is in part an excretory organ. Bilirubin ( bile pigment) produced by the destruction of hemoglobin is conveyed by the plasma to the liver and is excreted through the biliary ducts into the gastrointestinal tract. Other substances, including certain drugs, also are removed from the plasma by the liver.",
  "Cells of the blood and constituents of the plasma interact in complex ways to confer immunity to infectious agents, to resist or destroy invading organisms, to produce the inflammatory response, and to destroy and remove foreign materials and dead cells. The white blood cells ( leukocytes ) have a primary role in these reactions. Granulocytes and monocytes phagocytize (ingest) bacteria and other organisms, migrate to sites of infection or inflammation and to areas containing dead tissue, and participate in the enzymatic breakdown and removal of cellular debris. Lymphocytes are concerned with the development of immunity. Acquired resistance to specific microorganisms is in part attributable to antibodies , proteins that are formed in response to the entry into the body of a foreign substance ( antigen ). Antibodies that have been induced by microorganisms not only participate in eliminating the microbes but also prevent reinfection by the same organisms. Cells and antibodies may cooperate in the destruction of invading bacteria; the antibodies may attach to the organisms, thereby rendering them susceptible to phagocytosis . Involved in some of these reactions is complement , a group of protein components of plasma that participates in certain immunologic reactions. When certain classes of antibodies bind to microorganisms and other cells, they trigger the attachment of components of the complement system to the outer membrane of the target cell. As they assemble on the cell membrane, the complement components acquire enzymatic properties. The activated complement system is thus able to injure the cell by digesting (lysing) portions of the cell’s protective membrane.",
  "Heat is produced in large amounts by physiological oxidative reactions, and the blood is essential for its distributing and disposing of this heat. The circulation assures relative uniformity of temperature throughout the body and also carries the warm blood to the surface, where heat is lost to the external environment. A heat-regulating centre in the hypothalamus of the brain functions much like a thermostat. It is sensitive to changes in temperature of the blood flowing through it and, in response to the changes, gives off nerve impulses that control the diameter of the blood vessels in the skin and thus determine blood flow and skin temperature. A rise in skin temperature increases heat loss from the body surface. Heat is continuously lost by evaporation of water from the lungs and skin, but this loss can be greatly increased when more water is made available from the sweat glands . The activity of the sweat glands is controlled by the nervous system under direction of the temperature-regulating centre. Constancy of body temperature is achieved by control of the rate of heat loss by these mechanisms.",
  "The blood is contained under pressure in a vascular system that includes vast areas of thin and delicate capillary membranes. Even the bumps and knocks of everyday life are sufficient to disrupt some of these fragile vessels, and serious injury can be much more damaging. Loss of blood would be a constant threat to survival if it were not for protective mechanisms to prevent and control bleeding. The platelets contribute to the resistance of capillaries, possibly because they actually fill chinks in vessel walls. In the absence of platelets, capillaries become more fragile, permitting spontaneous loss of blood and increasing the tendency to form bruises after minor injury. Platelets immediately aggregate at the site of injury of a blood vessel, tending to seal the aperture. A blood clot, forming in the vessel around the clump of adherent platelets, further occludes the bleeding point. The coagulation mechanism involves a series of chemical reactions in which specific proteins and other constituents of the blood, including the platelets, play a part. Plasma also is provided with a mechanism for dissolving clots after they have been formed. Plasmin is a proteolytic enzyme—a substance that causes breakdown of proteins—derived from an inert plasma precursor known as plasminogen. When clots are formed within blood vessels, activation of plasminogen to plasmin may lead to their removal. (For additional information about the mechanics and significance of hemostasis, see  bleeding and blood clotting .)",
  "Physicians rely upon laboratory analysis to obtain measurements of many constituents of the blood, information useful or necessary for the detection and recognition of disease.",
  " Hemoglobin contains a highly coloured pigment that interferes with the passage of a beam of light. To measure hemoglobin concentration, blood is diluted and the red blood cells ( erythrocytes ) broken down to yield a clear red solution. A photoelectric instrument is used to measure the absorbance of transmitted light, from which hemoglobin concentration can be calculated. Changes in the hemoglobin concentration of the blood are not necessarily directly paralleled by changes in the red cell count and the hematocrit value, because the size and hemoglobin concentration of red cells may change in disease. Therefore, measurements of the red cell count and the hematocrit value may provide useful information as well. Electronic particle counters for determining red cell, white cell ( leukocyte ), and platelet counts are widely used. Only a drop of blood is needed for the analyses, which are completed within a minute.",
  "Adequate examination of the blood cells requires that a thin film of blood be spread on a glass slide, stained with a special blood stain (Wright stain), and examined under the microscope. Individual red cells, white cells, and platelets are examined, and the relative proportions of the several classes of white cells are tabulated. The results may have important diagnostic implications. In iron-deficiency anemia , for example, the red cells look paler than normal because they lack the normal amount of hemoglobin; in malaria the diagnosis is established by observing the malarial parasites within the red cells. In pneumonia and many infections, the proportion of neutrophilic leukocytes is usually increased, while in others, such as pertussis ( whooping cough ) and measles , there is an increase in the proportion of lymphocytes .",
  "Chemical analyses measure many of the constituents of plasma . Often serum rather than plasma is used, however, since serum can be obtained from clotted blood without the addition of an anticoagulant . Changes in the concentrations of chemical constituents of the blood can indicate the presence of disease. For example, quantitative determination of the amount of sugar ( glucose ) in the blood is essential for the diagnosis of diabetes , a disease in which the blood sugar tends to be elevated. Nitrogenous waste products, in particular urea , tend to accumulate in persons with diseased kidneys that are unable to excrete these substances at a normal rate. An increase in the concentration of bilirubin in the serum often reflects a disorder of the liver and bile ducts or an increased rate of destruction of hemoglobin.",
  "Tests can be performed manually using an individual procedure for each analysis; however, the autoanalyzer, a completely automated machine, increases the number of chemical analyses that can be performed in laboratories. A dozen analyses may be made simultaneously by a single machine employing a small amount of serum. The serum is automatically drawn from a test tube and is propelled through plastic tubing of small diameter. As the serum specimen advances, it is divided; appropriate reagents are added; chemical reactions occur with formation of a product that can be measured with a photoelectric instrument; and the result appears as a written tracing from which serum concentration of various substances can be read directly. The data acquired by the machine may be fed automatically into a computer and the numerical results printed on a form that is submitted to a physician. Many of the available analyses are not performed routinely but are invaluable in special circumstances. In cases of suspected lead poisoning , for example, detection of an elevated level of lead in the blood may be diagnostic. Some analytical procedures have specific diagnostic usefulness. These include assays for certain hormones, including measurement of the thyroid hormone in the serum of patients suspected of having thyroid disease.",
  "  Other important laboratory procedures are concerned with immunologic reactions of the blood. Careful determinations of the blood groups of the patient and the blood donor, and cross matching of the cells of one with the serum of the other to ensure compatibility, are essential for the safe transfusion of blood. The Rh type of a pregnant woman is regularly determined and is necessary for the early detection of fetal-maternal incompatibility and for proper prevention or treatment of erythroblastosis fetalis (hemolytic disease of the newborn). The diagnosis of certain infectious diseases depends upon the demonstration of antibodies in the patient’s serum.",
  "Many other kinds of blood examination yield useful results. Enzymes normally present in the muscle of the heart may be released into the blood when the heart is damaged by a coronary occlusion (obstruction of the coronary artery ) with consequent tissue death. Measurement of these enzymes in the serum is regularly performed to assist in diagnosis of this type of heart disease . Damage to the liver releases other enzymes, measurement of which aids in evaluation of the nature and severity of liver disease. Inherited abnormalities of proteins are increasingly recognized and identified by use of sophisticated methods. Accurate diagnosis of hemophilia and other bleeding disorders is made possible by investigations of the coagulation mechanism. Measurements of the concentration of folic acid and vitamin B 12  in the blood provide the basis for diagnosis of deficiencies of these vitamins.",
  "Further information on human blood is found in the textbooks Marshall A. Lichtman et al. (eds.), Williams Hematology , 9th ed. (2016); and Ronald Hoffman et al. (eds.), Hematology: Basic Principles and Practice, 6th ed. (2013). Shauna C. Anderson and Keila Poulsen (eds.), Anderson’s Atlas of Hematology (2013), offers a complete set of colour photomicrographs of blood cells. The biochemical mechanisms involved in bleeding and blood clotting are covered in Victor J. Marder et al. (eds.), Hemostasis and Thrombosis: Basic Principles and Clinical Practice , 6th ed. (2013)."
]