[
  " emotion , a complex experience of consciousness , bodily sensation , and behaviour that reflects the personal significance of a thing, an event, or a state of affairs.",
  " Aristotle Contemplating the Bust of Homer Aristotle Contemplating the Bust of Homer  “Emotions,” wrote Aristotle (384–322 bce ), “are all those feelings that so change men as to affect their judgements, and that are also attended by pain or pleasure. Such are anger, pity, fear and the like, with their opposites.” Emotion is indeed a heterogeneous category that encompasses a wide variety of important psychological phenomena. Some emotions are very specific, insofar as they concern a particular person, object, or situation. Others, such as distress, joy, or depression , are very general. Some emotions are very brief and barely conscious, such as a sudden flush of embarrassment or a burst of anger. Others, such as long-lasting love or simmering resentment, are protracted, lasting hours, months, or even years (in which case they can become a durable feature of an individual’s personality ). An emotion may have pronounced physical accompaniments, such as a facial expression, or it may be invisible to observers. An emotion may involve conscious experience and reflection, as when one “wallows” in it, or it may pass virtually unnoticed and unacknowledged by the subject. An emotion may be profound, in the sense that it is essential to one’s physical survival or mental health, or it may be trivial or dysfunctional. An emotion may be socially appropriate or inappropriate. It may even be socially obligatory—e.g., feeling remorse after committing a crime or feeling grief at a funeral.",
  "Accordingly, there is an enormous range of emotions, and even within the same “emotion families” there is considerable variation. Panic and fear, for example, are often thought to be kindred emotions, but there is a significant difference between the panic that is manifested in an irrational fear or a phobia and an intelligent fear—such as the fear of nuclear war—which requires a good deal of information and analysis. Terror and horror, two other kindred emotions, are nevertheless distinct from fear. Or consider the huge family of hostile emotions akin to anger: rage, fury, hatred, resentment, contempt, loathing, and scorn, to name just a few. All of those emotions are interestingly different in their structure and in their appropriate contexts, as are members of the “self-critical family,” which includes shame, embarrassment, guilt, remorse, and regret. The great variety and abundance of emotions suggest that the category of emotion may not be a single class of psychological phenomena but a large family of loosely related mental states and processes.",
  "For the sake of simplicity, researchers and laypeople alike often divide the emotions into those that are “positive” and those that are “negative.” (Scientific researchers call those qualities of an emotion its “affective valence.”) But the complexity of emotions renders such oppositions suspect. Although love and hate, for example, are often conceived of as polar opposites, it is worth noting (as the plots of so many novels and dramas have made clear) that they frequently coexist not as opposites but as complements. Moreover, love is often painful and destructive, and hatred, sometimes, can be positive. (As the American psychologist Shula Sommers asked, “Is hatred of evil a negative emotion?”) But an emotion like anger, another so-called negative emotion, shows the futility of such a classification. Anger is indeed a negative feeling (if not a hostile one) directed toward another person, but it can be edifying for the person who is angry, and, in the appropriate context—a context in which one ought to be angry—it can have beneficial effects on a situation or a relationship. Thus, the feminist movement took a major step forward when women realized that they had a right to be angry and much to be angry about. It may be, as Aristotle noted, that emotions are accompanied by pleasure or pain (often both), but they are too complex and often too subtle to be classified on that basis alone.",
  " The Triumph of St. Thomas Aquinas The Triumph of St. Thomas Aquinas  The study of emotions was long the province of ethics . Emotions were central to Aristotle’s ethics of virtue and part and parcel of the medieval Scholastics ’ concern with vices, virtues, and sin . For Aristotle, having the right amount of the right emotion in the right circumstances is the key to virtuous behaviour. St. Thomas Aquinas ( c. 1224–74) distinguished between “higher” and “lower” emotions, the former exemplified by faith and love, the latter by anger and envy. Although moral thinking about emotions has always been concerned with emotional extremes and malformations, as in psychopathology and madness, those phenomena have never been the primary reason for interest in the emotions. As Aristotle and the medieval moralists understood quite well, emotions are essential to a healthy human existence, and it is for that reason that their malfunction is so serious.",
  "The proper development and functioning of emotions allow people to live well and to be happy. Love, respect, and compassion, for example, are the essential emotional ingredients of interpersonal relations and concerns. Emotions motivate moral (as well as immoral) behaviour, and they play an essential role in creativity and in scientific curiosity . For many people, emotions are stimulated and provoked by beauty in the arts and nature, and there is no aesthetic sensibility without emotion. Emotions as well as the physical senses shape the basic processes of perception and memory and influence the ways in which people conceive and interpret the world around them (psychologists have long known that what one notices and remembers depends to a great extent on what one cares about). While some emotions can get out of control and damage one’s personal well-being and social relationships, most emotions are functional and adaptive. Nevertheless, the fact that so many people suffer from “emotional problems” during their lives makes understanding the pathology of emotions an abiding social concern.",
  "Emotions have been studied in several scientific disciplines—e.g., biology , psychology , neuroscience , psychiatry , anthropology , and sociology —as well as in business management, advertising , and communications . As a result, distinctive perspectives on emotion have emerged, appropriate to the complexity and variety of the emotions themselves. It is important, however, to take those different perspectives not as competitive but as complementary, each potentially yielding insight into what may be called the different “structures” of emotions. To say that emotions have structures (or a structure) is to reject the view that they are merely amorphous “ feelings ” or that they have no order, logic, or rationality. On the contrary, emotions are structured in several ways: by their underlying neurology, by the judgments and evaluations that enter into them, by the behaviour that expresses or manifests them, and by the larger social contexts in which they occur. Thus, one might say that an emotion is an “integrated neuro-physiological-behavioral-evaluative-experiential-social phenomenon.” Different emotions will manifest such structures to different extents and in different ways, depending on the specific emotion, its type, and the circumstances.",
  "In the remainder of this article the structures of the different emotions will be considered under three headings (though it should be borne in mind that the structures of any emotion are always integrated into an organic whole): (1) physical structures, including overt behaviour, neurology, and physiology; (2) experiential structures, or how an emotion is experienced by the subject; and (3) social structures, including cultural causes and circumstances, the social meaning and function of emotional expressions, the social effects of emotional behaviour, the political causes and effects of emotional behaviour, and the ethical considerations that determine the nature and appropriateness of emotions.",
  "During the first half of the 20th century, members of the psychological school of behaviourism attempted to study mental phenomena strictly in terms of their publicly observable causes and effects. According to behaviourists, any genuinely scientific account of emotions must be limited to a description of the observable circumstances that evoke emotions (the “stimulus”) and the observable physical changes and behaviour that result from them (the “response”), including especially verbal behaviour. Although behaviourism is no longer considered a viable approach, it should be noted just how much the dimension of the publicly observable encompasses. The stimulus and response situations include not only the physical surroundings of the people experiencing the emotion and any movement, gesture, or sound they make but also their neurological, neurochemical, and physiological states—including, for example, hormone levels and variations in the activity of the autonomic nervous system , which controls and regulates internal organs.",
  "  Before the advent of behaviourism, when the science of neurology was still in its infancy, the American philosopher and psychologist William James (1842–1910) brought some of the factors together in his theory of emotion, which he set out in his foundational study The Principles of Psychology (1890). In the space of a few dozen pages, James cited a wide variety of physiological changes involved in some emotions: autonomic nervous system activity (racing heart , dilation of the blood vessels , constriction of the bladder and bowels, involuntary changes in breathing, and “something in the pharynx that compels either a swallow, a clearing of the throat, or a slight cough”), characteristic “emotional” brain processes, “nervous anticipations,” and overt physical expressions and actions—trembling, weeping, running, and striking. For James, such emotions are physical sensations that accompany certain physiological changes that themselves are brought about by some “upsetting” perception . Accordingly, in a famous piece of advice, he urged those who wished to improve their emotional state to “smooth the brow, brighten the eye , contract the dorsal rather than the ventral aspect of the frame, and speak in a major key, and pass the genial compliment.”",
  "  Research has since distinguished between the bodily changes considered by James. Autonomic nervous system activity, which is sometimes taken to be the core of James’s theory, is of course distinct from voluntary muscle activity. Contemporary neurology has come to focus much more on brain activity as such and to treat all other bodily changes as strictly secondary. Neuroscientific research has shown not only that emotions have their origins in neural activity in the brain but that different emotions display very different patterns of neural activity. The core of emotional brain activity seems to be the limbic forebrain : the thalamus , the hypothalamus , the reticular formation, and the amygdala, all of which are subcortical (below the cerebral cortex). The hypothalamus has important links to pleasure and misery, while the reticular formation may have an important link to depression . The American neuroscientist Joseph E. LeDoux has shown that auditory stimulation of fear involves the transmission of sound signals through the auditory pathway to the thalamus (which relays information) and then to the dorsal amygdala (which evaluates information). Such research suggests that emotion that is activated by way of the thalamo-amygdala pathway results from evaluative processing that is rapid, minimal, and automatic. But emotion may also be activated through a relay of information from the thalamus to the neocortex (the outer part of the cerebral cortex), and this circuit is the neural basis for cognitive appraisal and evaluation of events. Thus, there are two neural pathways involved in the activation of emotions: cortical and subcortical. The activation of emotion via the thalamo-amygdala pathway explains how infants and very young children respond emotionally to pain and why adults express strong preferences and make emotional judgments before they have any conscious recognition of doing so. People often experience emotion before they form reasons for having the emotions they do.",
  "The two hemispheres of the brain are related differently to emotional processes. The right hemisphere may be more adept than the left at discriminating between emotional expressions. Moreover, it has been argued that the right hemisphere may be more involved in processing negative emotions and the left hemisphere more involved in processing positive emotions. People who are anxious, angry, or depressed show increased activity in the amygdala and the right prefrontal cortex. People in positive moods show increased activity in the left prefrontal cortex, while the amygdala and the right prefrontal cortex remain quiet. Most people, of course, experience both sorts of moods and emotions, though individuals also seem to have a more or less fixed biological predisposition to be happy or to be anxious. Even after good fortune or bad fortune, people eventually tend to return to their typical daily moods. (There is some evidence, however, that exercises like meditation can shift a typical mood toward the positive.) Over the years there have been various hypotheses about exactly where the neural bases of emotion lie. But the most plausible theories insist that brain functions in general involve complex interactions between different parts; thus, the quest for the “centre” of emotion may be misguided.",
  "  The emphasis on the role of the brain in emotion raises the thesis of the innateness of emotional reactions, which was defended by Charles Darwin (1809–82) as well as by James. Some contemporary theories argue that emotions, or at least the “basic” emotions, are rooted in an individual’s biological makeup and that genes are significant determinants of the threshold and characteristic intensity level of each basic emotion. Other theories claim that genetic factors are inconsequential and that emotions are cognitively constructed or derived from experience, especially from socialization and learning ( see below  Social structures of emotion ). But it is evident that emotional life is a function of the interaction of genetic tendencies and the evaluative beliefs acquired through experience. This includes even the basic emotions, which may well have an inborn neurological core but nevertheless manifest themselves only within the social constraints provided by cultural experience.",
  "In early human development, most emotions and their expressions derive from automatic, subcortical processing, with minimal cortical involvement. As cognitive capacities increase with maturation and learning, the neocortex and the cortico-amygdala pathway become increasingly more involved. By the time children acquire language and the capacity for long-term memory , they may process events in either or both pathways, with the subcortical pathway specializing in events requiring rapid response and the cortico-amygdala pathway providing evaluative information necessary for cognitive judgment and more complex coping strategies.",
  "There has been a great deal of research on emotional expression, particularly on those expressions that are most immediate, most evident, and typically most spontaneous or automatic and thus often unknown to the subject who displays them. Darwin observed the striking similarity between the emotional expressions of many mammals and humans; he thus postulated both an evolutionary explanation of the similarity and an anthropological thesis that facial expressions of emotion, such as those of anger, surprise, and fear, are universal in human beings . In the 1960s the American psychologist Paul Ekman set out to disprove Darwin’s anthropological thesis but found, to his initial consternation, that it was confirmed by mounting cross-cultural evidence . Since then, studies of the characteristic facial expressions of various emotions and their recognition have been a dominant topic of psychological research. Not all emotions have characteristic facial expressions, of course, and so studies tend to concentrate upon a small set of basic emotions—e.g., anger, disgust, fear, joy, sadness, and surprise. Each of these emotions, according to many theorists, consists of an “affect program”—a complex set of facial expressions, vocalizations, and autonomic and skeletal responses. It is still a matter of debate whether emotions that are supposedly basic can be captured in terms of affect programs; thus, it is also controversial whether the recognition and production of typical facial expressions are indeed universal and “hardwired.”",
  "One of the fascinating features of spontaneous facial expressions is how difficult it is for most people to “fake” a sincere expression. This is perhaps most evident in the case of smiling (as an expression of delight or being pleased). Psychologists have long recognized the Duchenne smile (named for the French neurologist Guillaume-Benjamin-Amand Duchenne [1806–75]), a sincere and spontaneous smile that is characterized not only by the stretching of the mouth but also by the elevation of the cheeks and the distinctive contraction of the muscles around the eye. In a false or non-Duchenne smile, these other elements are lacking and, for that reason, it is easy to recognize a false smile even if one has no idea what it is that gives it away.",
  "The behavioral expression of emotion also includes conscious and unconscious gestures, postures and mannerisms, and overt behaviour that can be either spontaneous or deliberate. One might hesitate to call deliberate behaviour an “expression” because of the intervening conscious activity it involves. One might speak instead of such behaviour as being “out of” the emotion (as in, “he acted out of anger”). Yet the difference between the two cases is often very slight. Acting out of anger may be immediate, as in the case of a spontaneous insult, or it may be protracted or delayed. It may be expressed in a series of punitive actions that go on for months or years or in vengeful acts that follow the provoking occurrence and the anger by an equally lengthy period of time. But even the immediate expression of emotion in overt action may be (and usually is) protracted in time and not merely momentary. Running from danger in fear may go on for as long as it needs to (as long as the threat is evident). The expression of profound love, many people would say, goes on for a lifetime, though it may also consist of any number of both spontaneous and deliberate acts and gestures.",
  "Verbal expressions are of particular interest. They can be spontaneous and immediate, as are the hoots and cheers of sports fans, but they can obviously be more eloquent, articulate, and deliberate. A funeral oration may be heartfelt and expressive of the emotion of grief; an apology can also be heartfelt and expressive of the emotions of shame and remorse. And of course the recitation of a love poem can serve as an expansive “I love you.”",
  " James introduced his theory of emotions with an important qualification: “I should say first of all that the only emotions I propose expressly to consider here are those that have a distinct bodily expression.” Although there are emotions that do not have any such expression, James insisted that all emotions have a mental or conscious dimension.",
  "The initiating cause of emotion, according to James, is a perception . James did not take perception to be a constituent of emotion, but he clearly recognized its importance. To put the matter in a way that he did not, James recognized that an emotion must be “about” something. It is not just a feeling based on a physiological disturbance. Thus, James alluded to intentionality, the feature of some mental processes in virtue of which they are essentially about or directed toward an object. Many theorists following James have revised his analysis by including perception, and with it intentionality, as an essential part of emotion. Indeed, some theorists have claimed that an emotion is just a special kind of perception. The concept of emotional experience, accordingly, has been considerably enriched to include not only physical sensations of what is going on in one’s body but also perceptual experiences of what is going on the world. In the study of emotion, of course, that perspective is an emotional perspective, “coloured” by the various emotions as well as by the unique perspective of the subject. But the common metaphor of colour does not do justice to emotional experience. Emotion is not something that is distinct from and somehow overlays an experience; the experience is part of the structure of the emotion itself.",
  "The experiential structures of emotion include, first and foremost, intentionality and what the emotion is about—a person, an act, an event, or a state of affairs. But intentionality is structured in turn by the subject’s beliefs and evaluative judgments about the person, act, event, or state of affairs in question. The importance of belief in emotion has prompted many theorists to formulate “cognitive” theories of emotion, while an emphasis on evaluation has led others to formulate “appraisal” theories. Such theories are often very similar, varying mainly in their emphasis on the primary importance of belief as opposed to evaluative judgment. They do not challenge the importance of what is generally referred to as “ feeling ” in emotion, but they do make the nature of those feelings much more complex and intriguing than in the Jamesian view. Emotions involve knowledge, beliefs, opinions, and desires about the world. Thus, feeling must include not only bodily feelings but the cognitively rich experiences of knowing, engaging, and caring.",
  "The experiential dimension of an emotion includes not only physical sensations but the experience of an object and its environment through the unique perspective provided by that emotion. The experience of being angry at Smith, for example, consists to a large extent in the experience of Smith from a certain perspective—e.g., as being offensive, hateful, or deserving of punishment. The experience of being in love with Jones consists to a large extent in the experience of Jones from another perspective—e.g., as being lovable, special, or uniquely deserving of care. The experiences of anger and love also include various thoughts and memories and intentions to act in certain ways.",
  "Emotional experience also includes pleasure and pain, as Aristotle insisted, but rarely as isolated feelings. More often, different aspects of an emotion are pleasurable or painful, as thoughts or memories may be pleasurable or painful. The emotion as such may be pleasurable or painful (e.g., pride or remorse), and so may one’s acknowledgement of the fact that one has a certain emotion (delighted to be in love again, upset with oneself for getting angry or envious). But, again, emotional matters are not always so straightforward. It is common to have “mixed emotions,” when the countercurrents of pleasure and pain make it difficult to settle on a single state of mind.",
  "Although Darwin thought that some emotional expressions are due to “the constitution of the nervous system” and play a role in adaptation and survival, he believed that others serve a different purpose: the communication of emotion to others. Indeed, the ubiquity and uniformity of facial expressions of emotion would be hard to fathom if it were not for the fact that they communicate an individual’s emotions to other members of his group or species. By smiling one indicates friendliness and perhaps lack of intent to cause harm; by frowning one conveys the opposite. The emotional expressions that are so evident in the face and body serve as the first means of communication between a mother and her infant. As Darwin noted, “We readily perceive sympathy in others by their expression; our sufferings are thus mitigated. We laugh together and our mutual good humour increases and strengthens our pleasure.” The social aspect of emotion, accordingly, is most obvious in public displays of emotion, which directly affect the behaviour of other people. But this aspect includes much more than communication. It also includes the social constitution, or social construction, of emotions with and through other people. The social structures of emotion consist of the ways in which the larger social context determines an emotion’s causes, content, modes of expression, and meaning. Even the basic emotions, which are generally assumed to have a neurological core, are shaped to a large extent by social factors.",
  "Social context determines the causes of emotions in an obvious sense: different circumstances provoke different emotions in different cultures. A Vodou (Voodoo) curse, for example, produces terror in one society but only bemusement in another. A husband who sees his wife in the company of another man becomes jealous in one society but may be indifferent in another. All emotions involve cognition, and all are influenced by moral values and evaluative concepts, many (if not all) of which are learned. The concepts of right and wrong, appropriate and inappropriate and their proper application are learned in the specific circumstances of each group or society.",
  "Emotions are subject to social shaping in their modes of expression in the sense that most expressions, perhaps even those that are more or less hardwired, are subject to local “display rules,” which govern which emotions and which expressions are appropriate in which circumstances. An expression of anger is utterly inappropriate in most public circumstances in Japan, but it is quite to be expected at an urban intersection in the United States. The cultural meaning of an emotion is also (and obviously) socially determined. In Tahiti anger is considered extremely dangerous and is even demonized; in the Mediterranean it is often a sign of virility, suggesting righteousness. This is not to say that the social influences on emotion are limited to their cultural interpretations. The emotions themselves are constituted, at least in part, by such interpretations. The socially constituted part of an emotion may be smaller in basic emotions than in cognitively rich emotions such as moral indignation and romantic love, but culture as well as biology, social differences as well as individual differences, determine what emotions there are and whether, where, and when it is appropriate to have them.",
  " bce  The fact that emotions involve behaviour, thoughts, and culture raises the question of whether or to what extent emotions are rational. For philosophers such as Plato ( c. 428– c. 348 bce ) and David Hume (1711–76), who conceived of emotion and rationality as conflicting opposites, such a question was inappropriate from the start. But behaviour and thoughts can be rational or irrational, and culture imposes its own standards of rationality. To that extent, at least, overt emotional expressions and thoughts can be judged according to such standards. In anger, people often act and think irrationally. But what is less often emphasized is that anger can result in behaviour and thoughts that are quite rational, in the sense that they are strategically successful in articulating or channeling the emotion into constructive action. The thoughts that one has in anger may also be accurate and insightful—e.g., remembering previous slights and a pattern of offensive behaviour. And culture, of course, imposes its own criteria for deciding which expressions and thoughts are rational, as well as which emotions it is rational to have in which circumstances. To be jealous in certain cultures and in certain circumstances may be perfectly appropriate and therefore rational. But in other cultures or other circumstances jealousy is inappropriate and therefore irrational.",
  "An emotion can also be rational or irrational in two more specific senses: (1) it can be more or less accurate in the perception or understanding of the situation it involves; and (2) it can be more or less warranted in its evaluation of the situation. An example of (1) is: Smith is angry at Jones for saying something offensive, when in fact Jones said no such thing and there is no good reason to think that he did. An example of (2) is: Smith is angry at Jones for saying something offensive, but in fact what Jones said was not offensive because it was not intentional or because it was an accurate and constructive criticism of Smith, for which Smith should not be offended or angry. In the first example the anger is irrational because it is based on a false belief about the situation; in the second it is irrational because it involves an unjust or unfair evaluation.",
  "In yet another sense, emotions can be rational insofar as they are functional. It has become something of a platitude in contemporary psychology that emotions have evolved along with human beings and are therefore the product of natural selection . It does not follow, however, that any particular emotion was individually selected for, or that emotions still serve, the functions that may have made them valuable in the past. Anger may have been a useful stimulus of aggression in prehistoric times, but it can be deleterious or generally dysfunctional in a modern urban environment. Moreover, emotions (or particular emotions) may well be byproducts of other evolved traits. Nevertheless, as a general rule, emotions do play an important role in people’s personal and social lives. Indeed, Hume insisted that reason by itself provides no motivation to moral behaviour; only the emotions can do that. Modern neuroscience has come to much the same conclusion.",
  "Finally, emotions can be rational in the sense that they can be used to achieve certain basic human goals and aspirations. Getting angry may be an important step in motivating oneself to face obstacles and overcome them. Falling in love may be an important step in developing the capacity to form and maintain intimate relationships. By the same token, getting angry at one’s boss may be thoroughly warranted but still irrational insofar as it frustrates one’s career goals. A Buddhist monk may be fully justified in being jealous of a fellow monk, but his jealousy is nevertheless irrational insofar as it is incompatible with his conception of himself as a Buddhist. In this sense, emotions provide both the substance of a good life and its ends. In a similar vein, the French existentialist philosopher Jean-Paul Sartre (1905–80) argued that emotions are strategies. People use them to manipulate others and, more important, to maneuver themselves into ways of thinking and acting that suit their goals and their self-image.",
  "Because emotions are the product not only of culture but also of one’s behaviour and attitudes over time, one is to a certain extent responsible for them. Emotions can be consciously developed or discouraged by training oneself to react more or less emotionally—or with more of one kind of emotion and less of another—in certain circumstances. For Aristotle, this kind of training is part of the process of cultivating a good moral character in oneself. Having the right emotions in the right amounts and in the right circumstances, as he argued, is the essence of virtue and the key to human flourishing.",
  "A collection of classic philosophical and scientific writings on emotion is Robert C. Solomon (ed.), What Is an Emotion? (2003). Michael Lewis and Jeannette M. Haviland-Jones (eds.), Handbook of Emotions , 2nd ed. (2000), is an excellent compendium of work in the psychology of emotions. Other thematic approaches are Paul Ekman and Richard Davidson (eds.), The Nature of Emotion (1994); and Keith Oatley and Jennifer Jenkins , Understanding Emotion (1996). Stephen Leighton (ed.), Philosophy and the Emotions (2003); and Robert C. Solomon (ed.), Thinking About Feeling (2003), are collections of philosophical essays on the nature and meaning of emotions. The social structures of emotion are treated in George Mandler , Mind and Body: Psychology of Emotion and Stress (1984); and Rom Harré (ed.), The Social Construction of Emotions (1986). Nathan A. Fox and Richard J. Davidson (eds.), The Psychobiology of Affective Development (1984); and Carolyn Saarni , The Development of Emotional Competence (1999), discuss developmental theories of emotion.",
  "Cognitive and appraisal theories are treated in Andrew Ortony , G. Clore , and A. Collins , The Cognitive Structure of Emotions (1988); and Richard S. Lazarus , Emotion and Adaptation (1994). Alan J. Fridlund , Human Facial Expression: An Evolutionary View (1994); and Paul W. Griffiths , What Emotions Really Are (1997), present evolutionary perspectives on the emotions.",
  "Neuroscientific studies include Joseph LeDoux , The Emotional Brain: The Mysterious Underpinnings of Emotional Life (1996); Antonio Damasio , Descartes’ Error: Emotion, Reason, and the Human Brain (1994), and The Feeling of What Happens: Body and Emotion in the Making of Consciousness (1999); Jaak Panksepp , Affective Neuroscience (1999); Richard Lane , The Cognitive Neuroscience of Emotion (1999); and John Cacioppo et al., The Psychophysiology of Emotion (2000).",
  "The relation between emotions and moral values is discussed in Ronald De Sousa , The Rationality of Emotion (1987); Michael Stocker and Elizabeth Hegeman , Valuing Emotions (1999); Simon Blackburn , Ruling Passions (2000); and Martha Nussbaum , Upheavals of Thought: The Intelligence of the Emotions (2001). Other philosophical studies are Jerome Neu , A Tear Is an Intellectual Thing (1999); Richard Wollheim , On the Emotions (1999); Aaron Ben-Zeev , The Subtlety of Emotions (2000); Jon Elster , Alchemies of the Mind (2000); and Robert C. Solomon , Not Passion’s Slave (2003). Jean-Paul Sartre , The Emotions: Sketch of a Theory (1948), is a classic analysis of emotions as strategies."
]