[
  " electricity , phenomenon associated with stationary or moving electric charges . Electric charge is a fundamental property of matter and is borne by elementary particles. In electricity the particle involved is the electron , which carries a charge designated, by convention, as negative. Thus, the various manifestations of electricity are the result of the accumulation or motion of numbers of electrons.",
  "Electrostatics is the study of electromagnetic phenomena that occur when there are no moving charges—i.e., after a static equilibrium has been established. Charges reach their equilibrium positions rapidly because the electric force is extremely strong. The mathematical methods of electrostatics make it possible to calculate the distributions of the electric field and of the electric potential from a known configuration of charges, conductors , and insulators . Conversely, given a set of conductors with known potentials, it is possible to calculate electric fields in regions between the conductors and to determine the charge distribution on the surface of the conductors. The electric energy of a set of charges at rest can be viewed from the standpoint of the work required to assemble the charges; alternatively, the energy also can be considered to reside in the electric field produced by this assembly of charges. Finally, energy can be stored in a capacitor ; the energy required to charge such a device is stored in it as electrostatic energy of the electric field.",
  "  Static electricity is a familiar electric phenomenon in which charged particles are transferred from one body to another. For example, if two objects are rubbed together, especially if the objects are insulators and the surrounding air is dry, the objects acquire equal and opposite charges and an attractive force develops between them. The object that loses electrons becomes positively charged, and the other becomes negatively charged. The force is simply the attraction between charges of opposite sign. The properties of this force were described above; they are incorporated in the mathematical relationship known as Coulomb’s law . The electric force on a charge Q  1 under these conditions, due to a charge Q  2 at a distance r , is given by Coulomb’s law,   ",
  " The bold characters in the equation indicate the vector nature of the force, and the unit vector r̂ is a vector that has a size of one and that points from charge Q  2 to charge Q  1 . The proportionality constant k equals 10 −7  c  2 , where c is the speed of light in a vacuum; k has the numerical value of 8.99 × 10 9  newtons -square metre per coulomb squared (Nm 2 /C 2 ). Figure 1 shows the force on Q  1 due to Q  2 . A numerical example will help to illustrate this force. Both Q  1 and Q  2 are chosen arbitrarily to be positive charges, each with a magnitude of 10 −6 coulomb. The charge Q  1 is located at coordinates x , y , z with values of 0.03, 0, 0, respectively, while Q  2 has coordinates 0, 0.04, 0. All coordinates are given in metres. Thus, the distance between Q  1 and Q  2 is 0.05 metre.",
  " x y F The magnitude of the force F on charge Q  1 as calculated using equation ( 1 ) is 3.6 newtons; its direction is shown in Figure 1 . The force on Q  2 due to Q  1 is − F , which also has a magnitude of 3.6 newtons; its direction, however, is opposite to that of F . The force F can be expressed in terms of its components along the x and y axes, since the force vector lies in the x  y plane. This is done with elementary trigonometry from the geometry of Figure 1 , and the results are shown in Figure 2 . Thus,   in newtons. Coulomb’s law describes mathematically the properties of the electric force between charges at rest. If the charges have opposite signs, the force would be attractive; the attraction would be indicated in equation ( 1 ) by the negative coefficient of the unit vector r̂. Thus, the electric force on Q  1 would have a direction opposite to the unit vector r̂ and would point from Q  1 to Q  2 . In Cartesian coordinates, this would result in a change of the signs of both the x and y components of the force in equation ( 2 ).",
  "How can this electric force on Q  1 be understood? Fundamentally, the force is due to the presence of an electric field at the position of Q  1 . The field is caused by the second charge Q  2 and has a magnitude proportional to the size of Q  2 . In interacting with this field, the first charge some distance away is either attracted to or repelled from the second charge, depending on the sign of the first charge.",
  "In the example, the charge Q  1 is in the electric field produced by the charge Q  2 . This field has the value   in newtons per coulomb (N/C). (Electric field can also be expressed in volts per metre [V/m], which is the equivalent of newtons per coulomb.) The electric force on Q  1 is given by   in newtons. This equation can be used to define the electric field of a point charge. The electric field E produced by charge Q  2 is a vector. The magnitude of the field varies inversely as the square of the distance from Q  2 ; its direction is away from Q  2 when Q  2 is a positive charge and toward Q  2 when Q  2 is a negative charge. Using equations ( 2 ) and   , the field produced by Q  2 at the position of Q  1 is   in newtons per coulomb.",
  " Q 1 When there are several charges present, the force on a given charge Q  1 may be simply calculated as the sum of the individual forces due to the other charges Q  2 , Q  3 ,…, etc., until all the charges are included. This sum requires that special attention be given to the direction of the individual forces since forces are vectors. The force on Q  1 can be obtained with the same amount of effort by first calculating the electric field at the position of Q  1 due to Q  2 , Q  3 ,…, etc. To illustrate this, a third charge is added to the example above. There are now three charges, Q  1 = +10 −6 C, Q  2 = +10 −6 C, and Q  3 = −10 −6 C. The locations of the charges, using Cartesian coordinates [ x , y , z ] are, respectively, [0.03, 0, 0], [0, 0.04, 0], and [−0.02, 0, 0] metre, as shown in Figure 3 . The goal is to find the force on Q  1 . From the sign of the charges, it can be seen that Q  1 is repelled by Q  2 and attracted by Q  3 . It is also clear that these two forces act along different directions. The electric field at the position of Q  1 due to charge Q  2 is, just as in the example above, in newtons per coulomb. The electric field at the location of Q  1 due to charge Q  3 is in newtons per coulomb. Thus, the total electric field at position 1 (i.e., at [0.03, 0, 0]) is the sum of these two fields E  1,2 + E  1,3 and is given by ",
  "The fields E  1,2 and E  1,3 , as well as their sum, the total electric field at the location of Q  1 , E  1 ( total ), are shown in Figure 3 . The total force on Q  1 is then obtained from equation () by multiplying the electric field E  1 ( total ) by Q  1 . In Cartesian coordinates, this force, expressed in newtons, is given by its components along the x and y axes by ",
  "The resulting force on Q  1 is in the direction of the total electric field at Q  1 , shown in Figure 3 . The magnitude of the force, which is obtained as the square root of the sum of the squares of the components of the force given in the above equation, equals 3.22 newtons.",
  "This calculation demonstrates an important property of the electromagnetic field known as the superposition principle. According to this principle, a field arising from a number of sources is determined by adding the individual fields from each source. The principle is illustrated by Figure 3 , in which an electric field arising from several sources is determined by the superposition of the fields from each of the sources. In this case, the electric field at the location of Q  1 is the sum of the fields due to Q  2 and Q  3 . Studies of electric fields over an extremely wide range of magnitudes have established the validity of the superposition principle.",
  "The vector nature of an electric field produced by a set of charges introduces a significant complexity. Specifying the field at each point in space requires giving both the magnitude and the direction at each location. In the Cartesian coordinate system, this necessitates knowing the magnitude of the x , y , and z components of the electric field at each point in space. It would be much simpler if the value of the electric field vector at any point in space could be derived from a scalar function with magnitude and sign.",
  "The electric potential is just such a scalar function. Electric potential is related to the work done by an external force when it transports a charge slowly from one position to another in an environment containing other charges at rest. The difference between the potential at point A and the potential at point B is defined by the equation   ",
  "As noted above, electric potential is measured in volts . Since work is measured in joules in the Système Internationale d’Unités (SI) , one volt is equivalent to one joule per coulomb . The charge q is taken as a small test charge; it is assumed that the test charge does not disturb the distribution of the remaining charges during its transport from point B to point A.",
  " Q q To illustrate the work in equation ( 5 ), Figure 4 shows a positive charge + Q . Consider the work involved in moving a second charge q from B to A. Along path 1, work is done to offset the electric repulsion between the two charges. If path 2 is chosen instead, no work is done in moving q from B to C, since the motion is perpendicular to the electric force ; moving q from C to D, the work is, by symmetry, identical as from B to A, and no work is required from D to A. Thus, the total work done in moving q from B to A is the same for either path. It can be shown easily that the same is true for any path going from B to A. When the initial and final positions of the charge q are located on a sphere centred on the location of the + Q charge, no work is done; the electric potential at the initial position has the same value as at the final position. The sphere in this example is called an equipotential surface. When equation ( 5 ), which defines the potential difference between two points, is combined with Coulomb’s law, it yields the following expression for the potential difference V   A  − V   B  between points A and B:   where r   a  and r   b  are the distances of points A and B from Q . Choosing B far away from the charge Q and arbitrarily setting the electric potential to be zero far from the charge results in a simple equation for the potential at A:   ",
  "The contribution of a charge to the electric potential at some point in space is thus a scalar quantity directly proportional to the magnitude of the charge and inversely proportional to the distance between the point and the charge. For more than one charge, one simply adds the contributions of the various charges. The result is a topological map that gives a value of the electric potential for every point in space.",
  "  Figure 5 provides three-dimensional views illustrating the effect of the positive charge + Q located at the origin on either a second positive charge q ( Figure 5A ) or on a negative charge − q ( Figure 5B ); the potential energy “landscape” is illustrated in each case. The potential energy of a charge q is the product q  V of the charge and of the electric potential at the position of the charge. In Figure 5A , the positive charge q would have to be pushed by some external agent in order to get close to the location of + Q because, as q approaches, it is subjected to an increasingly repulsive electric force. For the negative charge − q , the potential energy in Figure 5B shows, instead of a steep hill, a deep funnel. The electric potential due to + Q is still positive, but the potential energy is negative, and the negative charge − q , in a manner quite analogous to a particle under the influence of gravity , is attracted toward the origin where charge + Q is located.",
  "The electric field is related to the variation of the electric potential in space. The potential provides a convenient tool for solving a wide variety of problems in electrostatics. In a region of space where the potential varies, a charge is subjected to an electric force. For a positive charge the direction of this force is opposite the gradient of the potential—that is to say, in the direction in which the potential decreases the most rapidly. A negative charge would be subjected to a force in the direction of the most rapid increase of the potential. In both instances, the magnitude of the force is proportional to the rate of change of the potential in the indicated directions. If the potential in a region of space is constant, there is no force on either positive or negative charge. In a 12-volt car battery , positive charges would tend to move away from the positive terminal and toward the negative terminal, while negative charges would tend to move in the opposite direction—i.e., from the negative to the positive terminal. The latter occurs when a copper wire, in which there are electrons that are free to move, is connected between the two terminals of the battery.",
  "The electric field has already been described in terms of the force on a charge. If the electric potential is known at every point in a region of space, the electric field can be derived from the potential. In vector calculus notation, the electric field is given by the negative of the gradient of the electric potential, E = − grad  V . This expression specifies how the electric field is calculated at a given point. Since the field is a vector , it has both a direction and magnitude. The direction is that in which the potential decreases most rapidly, moving away from the point. The magnitude of the field is the change in potential across a small distance in the indicated direction divided by that distance.",
  " To become more familiar with the electric potential, a numerically determined solution is presented for a two-dimensional configuration of electrodes . A long, circular conducting rod is maintained at an electric potential of −20 volts. Next to the rod, a long L-shaped bracket, also made of conducting material, is maintained at a potential of +20 volts. Both the rod and bracket are placed inside a long, hollow metal tube with a square cross section; this enclosure is at a potential of zero (i.e., it is at “ground” potential). Figure 6 shows the geometry of the problem. Because the situation is static, there is no electric field inside the material of the conductors . If there were such a field, the charges that are free to move in a conducting material would do so until equilibrium was reached. The charges are arranged so that their individual contributions to the electric field at points inside the conducting material add up to zero. In a situation of static equilibrium, excess charges are located on the surface of conductors. Because there are no electric fields inside the conducting material, all parts of a given conductor are at the same potential; hence, a conductor is an equipotential in a static situation.",
  " In Figure 7 , the numerical solution of the problem gives the potential at a large number of points inside the cavity. The locations of the +20-volt and −20-volt electrodes can be recognized easily. In carrying out the numerical solution of the electrostatic problem in the figure, the electrostatic potential was determined directly by means of one of its important properties: in a region where there is no charge (in this case, between the conductors), the value of the potential at a given point is the average of the values of the potential in the neighbourhood of the point. This follows from the fact that the electrostatic potential in a charge-free region obeys Laplace’s equation , which in vector calculus notation is div  grad  V = 0. This equation is a special case of Poisson’s equation div  grad  V = ρ, which is applicable to electrostatic problems in regions where the volume charge density is ρ. Laplace’s equation states that the divergence of the gradient of the potential is zero in regions of space with no charge. In the example of Figure 7 , the potential on the conductors remains constant. Arbitrary values of potential are initially assigned elsewhere inside the cavity. To obtain a solution, a computer replaces the potential at each coordinate point that is not on a conductor by the average of the values of the potential around that point; it scans the entire set of points many times until the values of the potentials differ by an amount small enough to indicate a satisfactory solution. Clearly, the larger the number of points, the more accurate the solution will be. The computation time as well as the computer memory size requirement increase rapidly, however, especially in three-dimensional problems with complex geometry. This method of solution is called the “relaxation” method.",
  " In Figure 8 , points with the same value of electric potential have been connected to reveal a number of important properties associated with conductors in static situations. The lines in the figure represent equipotential surfaces. The distance between two equipotential surfaces tells how rapidly the potential changes, with the smallest distances corresponding to the location of the greatest rate of change and thus to the largest values of the electric field. Looking at the +20-volt and +15-volt equipotential surfaces, one observes immediately that they are closest to each other at the sharp external corners of the right-angle conductor. This shows that the strongest electric fields on the surface of a charged conductor are found on the sharpest external parts of the conductor; electrical breakdowns are most likely to occur there. It also should be noted that the electric field is weakest in the inside corners, both on the inside corner of the right-angle piece and on the inside corners of the square enclosure.",
  " In Figure 9 , dashed lines indicate the direction of the electric field. The strength of the field is reflected by the density of these dashed lines. Again, it can be seen that the field is strongest on outside corners of the charged L-shaped conductor; the largest surface charge density must occur at those locations. The field is weakest in the inside corners. The signs of the charges on the conducting surfaces can be deduced from the fact that electric fields point away from positive charges and toward negative charges. The magnitude of the surface charge density σ on the conductors is measured in coulombs per metre squared and is given by   where ε 0 is called the permittivity of free space and has the value of 8.854 × 10 −12 coulomb squared per newton -square metre. In addition, ε 0 is related to the constant k in Coulomb’s law by   ",
  "  Figure 9 also illustrates an important property of an electric field in static situations: field lines are always perpendicular to equipotential surfaces. The field lines meet the surfaces of the conductors at right angles, since these surfaces also are equipotentials. Figure 10 completes this example by showing the potential energy landscape of a small positive charge q in the region. From the variation in potential energy, it is easy to picture how electric forces tend to drive the positive charge q from higher to lower potential—i.e., from the L-shaped bracket at +20 volts toward the square-shaped enclosure at ground (0 volts) or toward the cylindrical rod maintained at a potential of −20 volts. It also graphically displays the strength of force near the sharp corners of conducting electrodes.",
  " A d A useful device for storing electrical energy consists of two conductors in close proximity and insulated from each other. A simple example of such a storage device is the parallel-plate capacitor . If positive charges with total charge + Q are deposited on one of the conductors and an equal amount of negative charge − Q is deposited on the second conductor, the capacitor is said to have a charge Q . As shown in Figure 11 , it consists of two flat conducting plates, each of area A , parallel to each other and separated by a distance d .",
  "To understand how a charged capacitor stores energy, consider the following charging process. With both plates of the capacitor initially uncharged, a small amount of negative charge is removed from the lower plate and placed on the upper plate. Thus, little work is required to make the lower plate slightly positive and the upper plate slightly negative. As the process is repeated, however, it becomes increasingly difficult to transport the same amount of negative charge, since the charge is being moved toward a plate that is already negatively charged and away from a plate that is positively charged. The negative charge on the upper plate repels the negative charge moving toward it, and the positive charge on the lower plate exerts an attractive force on the negative charge being moved away. Therefore, work has to be done to charge the capacitor.",
  "Where and how is this energy stored? The negative charges on the upper plate are attracted toward the positive charges on the lower plate and could do work if they could leave the plate. Because they cannot leave the plate, however, the energy is stored. A mechanical analogy is the potential energy of a stretched spring. Another way to understand the energy stored in a capacitor is to compare an uncharged capacitor with a charged capacitor. In the uncharged capacitor, there is no electric field between the plates; in the charged capacitor, because of the positive and negative charges on the inside surfaces of the plates, there is an electric field between the plates with the field lines pointing from the positively charged plate to the negatively charged one. The energy stored is the energy that was required to establish the field. In the simple geometry of Figure 11 , it is apparent that there is a nearly uniform electric field between the plates; the field becomes more uniform as the distance between the plates decreases and the area of the plates increases. It was explained above how the magnitude of the electric field can be obtained from the electric potential. In summary, the electric field is the change in the potential across a small distance in a direction perpendicular to an equipotential surface divided by that small distance. In Figure 11 , the upper plate is assumed to be at a potential of V   a   volts , and the lower plate at a potential of V   b  volts. The size of the electric field is   in volts per metre, where d is the separation of the plates. If the charged capacitor has a total charge of + Q on the inside surface of the lower plate (it is on the inside surface because it is attracted to the negative charges on the upper plate), the positive charge will be uniformly distributed on the surface with the value   in coulombs per metre squared. Equation ( 8 ) gives the electric field when the surface charge density is known as E = σ/ε 0 . This, in turn, relates the potential difference to the charge on the capacitor and the geometry of the plates. The result is   ",
  "The quantity C is termed capacity; for the parallel-plate capacitor, C is equal to ε 0  A / d . The unit used for capacity is the farad (F); one farad equals one coulomb per volt. In equation ( 12 ), only the potential difference is involved. The potential of either plate can be set arbitrarily without altering the electric field between the plates. Often one of the plates is grounded—i.e., its potential is set at the Earth potential, which is referred to as zero volts. The potential difference is then denoted as Δ V , or simply as V .",
  "Three equivalent formulas for the total energy W of a capacitor with charge Q and potential difference V are   ",
  "All are expressed in joules . The stored energy in the parallel-plate capacitor also can be expressed in terms of the electric field; it is, in joules,   ",
  "The quantity A  d , the area of each plate times the separation of the two plates, is the volume between the plates. Thus, the energy per unit volume (i.e., the energy density of the electric field) is given by  1  2  ε 0  E  2 in units of joules per metre cubed.",
  "The amount of charge stored in a capacitor is the product of the voltage and the capacity. What limits the amount of charge that can be stored on a capacitor? The voltage can be increased, but electric breakdown will occur if the electric field inside the capacitor becomes too large. The capacity can be increased by expanding the electrode areas and by reducing the gap between the electrodes. In general, capacitors that can withstand high voltages have a relatively small capacity. If only low voltages are needed, however, compact capacitors with rather large capacities can be manufactured. One method for increasing capacity is to insert between the conductors an insulating material that reduces the voltage because of its effect on the electric field. Such materials are called dielectrics (substances with no free charges). When the molecules of a dielectric are placed in the electric field, their negatively charged electrons separate slightly from their positively charged cores. With this separation, referred to as polarization, the molecules acquire an electric dipole moment. A cluster of charges with an electric dipole moment is often called an electric dipole .",
  "Is there an electric force between a charged object and uncharged matter, such as a piece of wood? Surprisingly, the answer is yes, and the force is attractive. The reason is that under the influence of the electric field of a charged object, the negatively charged electrons and positively charged nuclei within the atoms and molecules are subjected to forces in opposite directions. As a result, the negative and positive charges separate slightly. Such atoms and molecules are said to be polarized and to have an electric dipole moment. The molecules in the wood acquire an electric dipole moment in the direction of the external electric field. The polarized molecules are attracted toward the charged object because the field increases in the direction of the charged object.",
  "The electric dipole moment p of two charges + q and − q separated by a distance l is a vector of magnitude p = q  l with a direction from the negative to the positive charge. An electric dipole in an external electric field is subjected to a torque τ = p  E sin θ, where θ is the angle between p and E . The torque tends to align the dipole moment p in the direction of E . The potential energy of the dipole is given by U   e  = − p  E cos θ, or in vector notation U   e  = − p · E . In a nonuniform electric field, the potential energy of an electric dipole also varies with position, and the dipole can be subjected to a force. The force on the dipole is in the direction of increasing field when p is aligned with E , since the potential energy U   e  decreases in that direction.",
  "The polarization of a medium P gives the electric dipole moment per unit volume of the material; it is expressed in units of coulombs per metre squared. When a dielectric is placed in an electric field, it acquires a polarization that depends on the field. The electric susceptibility χ  e  relates the polarization to the electric field as P = χ  e   E . In general, χ  e  varies slightly depending on the strength of the electric field, but for some materials, called linear dielectrics, it is a constant. The dielectric constant κ of a substance is related to its susceptibility as κ = 1 + χ  e  /ε 0 ; it is a dimensionless quantity. lists the dielectric constants of a few substances.",
  "The presence of a dielectric affects many electric quantities. A dielectric reduces by a factor K the value of the electric field and consequently also the value of the electric potential from a charge within the medium. As seen in, a dielectric can have a large effect. The insertion of a dielectric between the electrodes of a capacitor with a given charge reduces the potential difference between the electrodes and thus increases the capacitance of the capacitor by the factor K . For a parallel-plate capacitor filled with a dielectric, the capacity becomes C = Κε 0  A / d . A third and important effect of a dielectric is to reduce the speed of electromagnetic waves in a medium by the factor  K  .",
  "Capacitors come in a wide variety of shapes and sizes. Not all have parallel plates; some are cylinders, for example. If two plates, each one square centimetre in area, are separated by a dielectric with Κ = 2 of one millimetre thickness, the capacity is 1.76 × 10 −12 F, about two picofarads. Charged to 20 volts, this capacitor would store about 40 picocoulombs of charge; the electric energy stored would be 400 picojoules. Even small-sized capacitors can store enormous amounts of charge. Modern techniques and dielectric materials permit the manufacture of capacitors that occupy less than one cubic centimetre and yet store 10 10 times more charge and electric energy than in the above example.",
  "Capacitors have many important applications. They are used, for example, in digital circuits so that information stored in large computer memories is not lost during a momentary electric power failure; the electric energy stored in such capacitors maintains the information during the temporary loss of power. Capacitors play an even more important role as filters to divert spurious electric signals and thereby prevent damage to sensitive components and circuits caused by electric surges. How capacitors provide such protection is discussed below in the section Transient response .",
  "Many electric phenomena occur under what is termed steady-state conditions. This means that such electric quantities as current , voltage, and charge distributions are not affected by the passage of time. For instance, because the current through a filament inside a car headlight does not change with time, the brightness of the headlight remains constant. An example of a nonsteady-state situation is the flow of charge between two conductors that are connected by a thin conducting wire and that initially have an equal but opposite charge. As current flows from the positively charged conductor to the negatively charged one, the charges on both conductors decrease with time, as does the potential difference between the conductors. The current therefore also decreases with time and eventually ceases when the conductors are discharged.",
  "In an electric circuit under steady-state conditions, the flow of charge does not change with time and the charge distribution stays the same. Since charge flows from one location to another, there must be some mechanism to keep the charge distribution constant. In turn, the values of the electric potentials remain unaltered with time. Any device capable of keeping the potentials of electrodes unchanged as charge flows from one electrode to another is called a source of electromotive force , or simply an emf.",
  " i  Figure 12 shows a wire made of a conducting material such as copper . By some external means, an electric field is established inside the wire in a direction along its length. The electrons that are free to move will gain some speed. Since they have a negative charge, they move in the direction opposite that of the electric field. The current i is defined to have a positive value in the direction of flow of positive charges. If the moving charges that constitute the current i in a wire are electrons , the current is a positive number when it is in a direction opposite to the motion of the negatively charged electrons. (If the direction of motion of the electrons were also chosen to be the direction of a current, the current would have a negative value.) The current is the amount of charge crossing a plane transverse to the wire per unit time—i.e., in a period of one second. If there are n free particles of charge q per unit volume with average velocity v and the cross-sectional area of the wire is A , the current i , in elementary calculus notation, is   where d  Q is the amount of charge that crosses the plane in a time interval d  t . The unit of current is the ampere (A); one ampere equals one coulomb per second . A useful quantity related to the flow of charge is current density, the flow of current per unit area. Symbolized by J , it has a magnitude of i / A and is measured in amperes per square metre.",
  "Wires of different materials have different current densities for a given value of the electric field E ; for many materials, the current density is directly proportional to the electric field. This behaviour is represented by Ohm’s law :   ",
  "The proportionality constant σ  J  is the conductivity of the material. In a metallic conductor, the charge carriers are electrons and, under the influence of an external electric field, they acquire some average drift velocity in the direction opposite the field. In conductors of this variety, the drift velocity is limited by collisions, which heat the conductor.",
  "If the wire in Figure 12 has a length l and area A and if an electric potential difference of V is maintained between the ends of the wire, a current i will flow in the wire. The electric field E in the wire has a magnitude V / l . The equation for the current, using Ohm’s law, is   or   ",
  "  The quantity l /σ  J   A , which depends on both the shape and material of the wire, is called the resistance  R of the wire. Resistance is measured in ohms (Ω). The equation for resistance,   is often written as   where ρ is the resistivity of the material and is simply 1/σ  J  . The geometric aspects of resistance in equation ( 20 ) are easy to appreciate: the longer the wire, the greater the resistance to the flow of charge. A greater cross-sectional area results in a smaller resistance to the flow.",
  "The resistive strain gauge is an important application of equation ( 20 ). Strain , δ l / l , is the fractional change in the length of a body under stress, where δ l is the change of length and l is the length. The strain gauge consists of a thin wire or narrow strip of a metallic conductor such as constantan, an alloy of nickel and copper . A strain changes the resistance because the length, area, and resistivity of the conductor change. In constantan, the fractional change in resistance δ R / R is directly proportional to the strain with a proportionality constant of approximately 2.",
  "A common form of Ohm’s law is   where V is the potential difference in volts between the two ends of an element with an electric resistance of R ohms and where i is the current through that element.",
  "lists the resistivities of certain materials at room temperature. These values depend to some extent on temperature; therefore, in applications where the temperature is very different from room temperature, the proper values of resistivities must be used to calculate the resistance. As an example, equation ( 20 ) shows that a copper wire 59 metres long and with a cross-sectional area of one square millimetre has an electric resistance of one ohm at room temperature.",
  "Materials are classified as conductors , insulators , or semiconductors according to their electric conductivity. The classifications can be understood in atomic terms. Electrons in an atom can have only certain well-defined energies, and, depending on their energies, the electrons are said to occupy particular energy levels. In a typical atom with many electrons, the lower energy levels are filled, each with the number of electrons allowed by a quantum mechanical rule known as the Pauli exclusion principle . Depending on the element, the highest energy level to have electrons may or may not be completely full. If two atoms of some element are brought close enough together so that they interact, the two-atom system has two closely spaced levels for each level of the single atom. If 10 atoms interact, the 10-atom system will have a cluster of 10 levels corresponding to each single level of an individual atom. In a solid , the number of atoms and hence the number of levels is extremely large; most of the higher energy levels overlap in a continuous fashion except for certain energies in which there are no levels at all. Energy regions with levels are called energy bands, and regions that have no levels are referred to as band gaps .",
  "The highest energy band occupied by electrons is the valence band. In a conductor, the valence band is partially filled, and since there are numerous empty levels, the electrons are free to move under the influence of an electric field ; thus, in a metal the valence band is also the conduction band. In an insulator, electrons completely fill the valence band; and the gap between it and the next band, which is the conduction band, is large. The electrons cannot move under the influence of an electric field unless they are given enough energy to cross the large energy gap to the conduction band. In a semiconductor, the gap to the conduction band is smaller than in an insulator. At room temperature, the valence band is almost completely filled. A few electrons are missing from the valence band because they have acquired enough thermal energy to cross the band gap to the conduction band; as a result, they can move under the influence of an external electric field. The “holes” left behind in the valence band are mobile charge carriers but behave like positive charge carriers.",
  "For many materials, including metals, resistance to the flow of charge tends to increase with temperature . For example, an increase of 5° C (9° F) increases the resistivity of copper by 2 percent. In contrast, the resistivity of insulators and especially of semiconductors such as silicon and germanium decreases rapidly with temperature; the increased thermal energy causes some of the electrons to populate levels in the conduction band where, influenced by an external electric field, they are free to move. The energy difference between the valence levels and the conduction band has a strong influence on the conductivity of these materials, with a smaller gap resulting in higher conduction at lower temperatures.",
  "The values of electric resistivities listed in show an extremely large variation in the capability of different materials to conduct electricity. The principal reason for the large variation is the wide range in the availability and mobility of charge carriers within the materials. The copper wire in Figure 12 , for example, has many extremely mobile carriers; each copper atom has approximately one free electron, which is highly mobile because of its small mass. An electrolyte , such as a saltwater solution , is not as good a conductor as copper. The sodium and chlorine  ions in the solution provide the charge carriers. The large mass of each sodium and chlorine ion increases as other attracted ions cluster around them. As a result, the sodium and chlorine ions are far more difficult to move than the free electrons in copper. Pure water also is a conductor, although it is a poor one because only a very small fraction of the water molecules are dissociated into ions. The oxygen , nitrogen , and argon  gases that make up the atmosphere are somewhat conductive because a few charge carriers form when the gases are ionized by radiation from radioactive  elements on Earth as well as from extraterrestrial cosmic rays (i.e., high-speed atomic nuclei and electrons). Electrophoresis is an interesting application based on the mobility of particles suspended in an electrolytic solution. Different particles ( proteins , for example) move in the same electric field at different speeds; the difference in speed can be used to separate the contents of the suspension.",
  "A current flowing through a wire heats it. This familiar phenomenon occurs in the heating coils of an electric range or in the hot tungsten filament of an electric light bulb. This ohmic heating is the basis for the fuses used to protect electric circuits and prevent fires; if the current exceeds a certain value, a fuse, which is made of an alloy with a low melting point , melts and interrupts the flow of current. The power P dissipated in a resistance R through which current i flows is given by   where P is in watts (one watt equals one joule per second), i is in amperes, and R is in ohms. According to Ohm’s law, the potential difference V between the two ends of the resistor is given by V = i  R , and so the power P can be expressed equivalently as   ",
  "In certain materials, however, the power dissipation that manifests itself as heat suddenly disappears if the conductor is cooled to a very low temperature. The disappearance of all resistance is a phenomenon known as superconductivity . As mentioned earlier, electrons acquire some average drift velocity v under the influence of an electric field in a wire. Normally the electrons, subjected to a force because of an electric field, accelerate and progressively acquire greater speed. Their velocity is, however, limited in a wire because they lose some of their acquired energy to the wire in collisions with other electrons and in collisions with atoms in the wire. The lost energy is either transferred to other electrons, which later radiate, or the wire becomes excited with tiny mechanical vibrations referred to as phonons . Both processes heat the material. The term phonon emphasizes the relationship of these vibrations to another mechanical vibration—namely, sound . In a superconductor, a complex quantum mechanical effect prevents these small losses of energy to the medium. The effect involves interactions between electrons and also those between electrons and the rest of the material. It can be visualized by considering the coupling of the electrons in pairs with opposite momenta; the motion of the paired electrons is such that no energy is given up to the medium in inelastic collisions or phonon excitations. One can imagine that an electron about to “collide” with and lose energy to the medium could end up instead colliding with its partner so that they exchange momentum without imparting any to the medium.",
  "A superconducting material widely used in the construction of electromagnets is an alloy of niobium and titanium . This material must be cooled to a few degrees above absolute zero temperature, −263.66° C (or 9.5 K), in order to exhibit the superconducting property. Such cooling requires the use of liquefied helium , which is rather costly. During the late 1980s, materials that exhibit superconducting properties at much higher temperatures were discovered. These temperatures are higher than the −196° C of liquid nitrogen , making it possible to use the latter instead of liquid helium. Since liquid nitrogen is plentiful and cheap, such materials may provide great benefits in a wide variety of applications, ranging from electric power transmission to high-speed computing .",
  " A 12- volt automobile battery can deliver current to a circuit such as that of a car radio for a considerable length of time, during which the potential difference between the terminals of the battery remains close to 12 volts. The battery must have a means of continuously replenishing the excess positive and negative charges that are located on the respective terminals and that are responsible for the 12-volt potential difference between the terminals. The charges must be transported from one terminal to the other in a direction opposite to the electric force on the charges between the terminals. Any device that accomplishes this transport of charge constitutes a source of electromotive force. A car battery, for example, uses chemical reactions to generate electromotive force . The Van de Graaff generator shown in Figure 13 is a mechanical device that produces an electromotive force. Invented by the American physicist Robert J. Van de Graaff in the 1930s, this type of particle accelerator has been widely used to study subatomic particles . Because it is conceptually simpler than a chemical source of electromotive force, the Van de Graaff generator will be discussed first.",
  "An insulating conveyor belt carries positive charge from the base of the Van de Graaff machine to the inside of a large conducting dome. The charge is removed from the belt by the proximity of sharp metal electrodes called charge remover points. The charge then moves rapidly to the outside of the conducting dome. The positively charged dome creates an electric field, which points away from the dome and provides a repelling action on additional positive charges transported on the belt toward the dome. Thus, work is done to keep the conveyor belt turning. If a current is allowed to flow from the dome to ground and if an equal current is provided by the transport of charge on the insulating belt, equilibrium is established and the potential of the dome remains at a constant positive value. In this example, the current from the dome to ground consists of a stream of positive ions inside the accelerating tube, moving in the direction of the electric field. The motion of the charge on the belt is in a direction opposite to the force that the electric field of the dome exerts on the charge. This motion of charge in a direction opposite the electric field is a feature common to all sources of electromotive force.",
  "In the case of a chemically generated electromotive force, chemical reactions release energy. If these reactions take place with chemicals in close proximity to each other (e.g., if they mix), the energy released heats the mixture. To produce a voltaic cell, these reactions must occur in separate locations. A copper wire and a zinc wire poked into a lemon make up a simple voltaic cell. The potential difference between the copper and the zinc wires can be measured easily and is found to be 1.1 volts; the copper wire acts as the positive terminal. Such a “lemon battery” is a rather poor voltaic cell capable of supplying only small amounts of electric power. Another kind of 1.1-volt battery constructed with essentially the same materials can provide much more electricity. In this case, a copper wire is placed in a solution of copper sulfate and a zinc wire in a solution of zinc sulfate; the two solutions are connected electrically by a potassium chloride salt bridge. (A salt bridge is a conductor with ions as charge carriers.) In both kinds of batteries, the energy comes from the difference in the degree of binding between the electrons in copper and those in zinc. Energy is gained when copper ions from the copper sulfate solution are deposited on the copper electrode as neutral copper ions, thus removing free electrons from the copper wire. At the same time, zinc atoms from the zinc wire go into solution as positively charged zinc ions, leaving the zinc wire with excess free electrons. The result is a positively charged copper wire and a negatively charged zinc wire. The two reactions are separated physically, with the salt bridge completing the internal circuit.",
  "  Figure 14 illustrates a 12-volt lead-acid battery, using standard symbols for depicting batteries in a circuit. The battery consists of six voltaic cells, each with an electromotive force of approximately two volts; the cells are connected in series, so that the six individual voltages add up to about 12 volts ( Figure 14A ). As shown in Figure 14B , each two-volt cell consists of a number of positive and negative electrodes connected electrically in parallel. The parallel connection is made to provide a large surface area of electrodes, on which chemical reactions can take place. The higher rate at which the materials of the electrodes are able to undergo chemical transformations allows the battery to deliver a larger current.",
  "In the lead-acid battery, each voltaic cell consists of a negative electrode of pure, spongy lead (Pb) and a positive electrode of lead oxide (PbO 2 ). Both the lead and lead oxide are in a solution of sulfuric acid (H 2 SO 4 ) and water (H 2 O). At the positive electrode, the chemical reaction is PbO 2 + SO  −  4   − + 4H + + 2e − → PbSO 4 + 2H 2 O + (1.68 V). At the negative terminal, the reaction is Pb + SO  −  4   − → PbSO 4 + 2e − + (0.36 V). The cell potential is 1.68 + 0.36 = 2.04 volts. The 1.68 and 0.36 volts in the above equations are, respectively, the reduction and oxidation potentials; they are related to the binding of the electrons in the chemicals. When the battery is recharged, either by a car generator or by an external power source, the two chemical reactions are reversed.",
  " The simplest direct-current (DC) circuit consists of a resistor connected across a source of electromotive force. The symbol for a resistor is shown in Figure 15 ; here the value of R , 60Ω, is given by the numerical value adjacent to the symbol. The symbol for a source of electromotive force, E , is shown with the associated value of the voltage. Convention gives the terminal with the long line a higher (i.e., more positive) potential than the terminal with the short line. Straight lines connecting various elements in a circuit are assumed to have negligible resistance, so that there is no change in potential across these connections. The circuit shows a 12-volt electromotive force connected to a 60Ω resistor. The letters a , b , c , and d on the diagram are reference points.",
  "The function of the source of electromotive force is to maintain point a at a potential 12 volts more positive than point d . Thus, the potential difference V   a  − V   d  is 12 volts. The potential difference across the resistance is V   b  − V   c  . From Ohm’s law , the current i flowing through the resistor is   ",
  "Since points a and b are connected by a conductor of negligible resistance, they are at the same potential. For the same reason, c and d are at the same potential. Therefore, V   b  − V   c  = V   a  − V   d  = 12 volts. The current in the circuit is given by equation ( 24 ). Thus, i = 12/60 = 0.2 ampere . The power dissipated in the resistor as heat is easily calculated using equation ( 22 ):   ",
  "Where does the energy that is dissipated as heat in the resistor come from? It is provided by a source of electromotive force (e.g., a lead-acid battery). Within such a source, for each amount of charge d  Q moved from the lower potential at d to the higher potential at a , an amount of work is done equal to d  W = d  Q ( V   a  − V   d  ). If this work is done in a time interval d  t , the power delivered by the battery is obtained by dividing d  W by d  t . Thus, the power delivered by the battery (in watts) is   ",
  "Using the values i = 0.2 ampere and V   a  − V   d  = 12 volts makes d  W / d  t = 2.4 watts. As expected, the power delivered by the battery is equal to the power dissipated as heat in the resistor.",
  " Resistors. If two resistors are connected in Figure 16A so that all of the electric charge must traverse both resistors in succession, the equivalent resistance to the flow of current is the sum of the resistances.",
  "Using R  1 and R  2 for the individual resistances, the resistance between a and b is given by   ",
  "This result can be appreciated by thinking of the two resistors as two pieces of the same type of thin wire. Connecting the wires in series as shown simply increases their length to equal the sum of their two lengths. As equation ( 20 ) indicates, the resistance is the same as that given by equation ( 25a ). The resistances R  1 and R  2 can be replaced in a circuit by the equivalent resistance R   a  b  . If R  1 = 5Ω and R  2 = 2Ω, then R   a  b  = 7Ω. If two resistors are connected as shown in Figure 16B , the electric charges have alternate paths for flowing from c to d . The resistance to the flow of charge from c to d is clearly less than if either R  1 or R  2 were missing. Anyone who has ever had to find a way out of a crowded theatre can appreciate how much easier it is to leave a building with several exits than one with a single exit. The value of the equivalent resistance for two resistors in parallel is given by the equation   ",
  "This relationship follows directly from the definition of resistance in equation ( 20 ), where 1/ R is proportional to the area. If the resistors R  1 and R  2 are imagined to be wires of the same length and material, they would be wires with different cross-sectional areas. Connecting them in parallel is equivalent to placing them side by side, increasing the total area available for the flow of charge. Clearly, the equivalent resistance is smaller than the resistance of either resistor individually. As a numerical example, for R  1 = 5Ω and R  2 = 2Ω, 1/ R   c  d  = 1/5 + 1/2 = 0.7. Therefore, R   c  d  = 1/0.7 = 1.43Ω. As expected, the equivalent resistance of 1.43 ohms is smaller than either 2 ohms or 5 ohms. It should be noted that both equations ( 25a ) and ( 25b ) are given in a form in which they can be extended easily to any number of resistances.",
  " Two simple relationships can be used to determine the value of currents in circuits . They are useful even in rather complex situations such as circuits with multiple loops. The first relationship deals with currents at a junction of conductors . Figure 17 shows three such junctions, with the currents assumed to flow in the directions indicated.",
  "Simply stated, the sum of currents entering a junction equals the sum of currents leaving that junction. This statement is commonly called Kirchhoff’s first law (after the German physicist Gustav Robert Kirchhoff , who formulated it). For Figure 17A , the sum is i  1 + i  2 = i  3 . For Figure 17B , i  1 = i  2 + i  3 + i  4 . For Figure 17C , i  1 + i  2 + i  3 = 0. If this last equation seems puzzling because all the currents appear to flow in and none flows out, it is because of the choice of directions for the individual currents. In solving a problem, the direction chosen for the currents is arbitrary. Once the problem has been solved, some currents have a positive value, and the direction arbitrarily chosen is the one of the actual current. In the solution some currents may have a negative value, in which case the actual current flows in a direction opposite that of the arbitrary initial choice.",
  " Kirchhoff’s second law is as follows: the sum of electromotive forces in a loop equals the sum of potential drops in the loop. When electromotive forces in a circuit are symbolized as circuit components as in Figure 15 , this law can be stated quite simply: the sum of the potential differences across all the components in a closed loop equals zero. To illustrate and clarify this relation, one can consider a single circuit with two sources of electromotive forces E  1 and E  2 , and two resistances R  1 and R  2 , as shown in Figure 18 . The direction chosen for the current i also is indicated. The letters a , b , c , and d are used to indicate certain locations around the circuit. Applying Kirchhoff’s second law to the circuit,   ",
  "Referring to the circuit in Figure 18 , the potential differences maintained by the electromotive forces indicated are V   b  − V   a  = E  1 , and V   c  − V   d  = − E  2 . From Ohm’s law, V   b  − V   c  = i  R  1 , and V   d  − V   a  = i  R  2 . Using these four relationships in equation ( 26 ), the so-called loop equation becomes E  1 − E  2 − i  R  1 − i  R  2 = 0.",
  "Given the values of the resistances R  1 and R  2 in ohms and of the electromotive forces E  1 and E  2 in volts, the value of the current i in the circuit is obtained. If E  2 in the circuit had a greater value than E  1 , the solution for the current i would be a negative value for i . This negative sign indicates that the current in the circuit would flow in a direction opposite the one indicated in Figure 18 .",
  "Kirchhoff’s laws can be applied to circuits with several connected loops. The same rules apply, though the algebra required becomes rather tedious as the circuits increase in complexity.",
  "Many applications of electricity and magnetism involve voltages that vary in time. Electric power transmitted over large distances from generating plants to users involves voltages that vary sinusoidally in time, at a frequency of 60 hertz (Hz) in the United States and Canada and 50 hertz in Europe. (One hertz equals one cycle per second.) This means that in the United States, for example, the current alternates its direction in the electric conducting wires so that each second it flows 60 times in one direction and 60 times in the opposite direction. Alternating currents (AC) are also used in radio and television transmissions. In an AM (amplitude-modulation) radio broadcast, electromagnetic waves with a frequency of around one million hertz are generated by currents of the same frequency flowing back and forth in the antenna of the station. The information transported by these waves is encoded in the rapid variation of the wave amplitude. When voices and music are broadcast, these variations correspond to the mechanical oscillations of the sound and have frequencies from 50 to 5,000 hertz. In an FM (frequency-modulation) system, which is used by both television and FM radio stations, audio information is contained in the rapid fluctuation of the frequency in a narrow range around the frequency of the carrier wave.",
  "Circuits that can generate such oscillating currents are called oscillators; they include, in addition to transistors , such basic electrical components as resistors , capacitors , and inductors. As was mentioned above, resistors dissipate heat while carrying a current. Capacitors store energy in the form of an electric field in the volume between oppositely charged electrodes . Inductors are essentially coils of conducting wire; they store magnetic energy in the form of a magnetic field generated by the current in the coil. All three components provide some impedance to the flow of alternating currents. In the case of capacitors and inductors, the impedance depends on the frequency of the current. With resistors, impedance is independent of frequency and is simply the resistance. This is easily seen from Ohm’s law , equation ( 21 ), when it is written as i = V / R . For a given voltage difference V between the ends of a resistor, the current varies inversely with the value of R . The greater the value R , the greater is the impedance to the flow of electric current. Before proceeding to circuits with resistors, capacitors, inductors, and sinusoidally varying electromotive forces , the behaviour of a circuit with a resistor and a capacitor will be discussed to clarify transient behaviour and the impedance properties of the capacitor.",
  "  Consider a circuit consisting of a capacitor and a resistor that are connected as shown in Figure 19 . What will be the voltage at point b if the voltage at a is increased suddenly from V   a  = 0 to V   a  = +50 volts? Closing the switch produces such a voltage because it connects the positive terminal of a 50-volt battery to point a while the negative terminal is at ground (point c ). Figure 20 (left) graphs this voltage V   a  as a function of the time.",
  "Initially, the capacitor has no charge and does not affect the flow of charge. The initial current is obtained from Ohm’s law, V = i  R , where V = V   a  − V   b  , V   a  is 50 volts and V   b  is zero. Using 2,000 ohms for the value of the resistance in Figure 19 , there is an initial current of 25 milliamperes in the circuit. This current begins to charge the capacitor, so that a positive charge accumulates on the plate of the capacitor connected to point b and a negative charge accumulates on the other plate. As a result, the potential at point b increases from zero to a positive value. As more charge accumulates on the capacitor, this positive potential continues to increase. As it does so, the value of the potential across the resistor is reduced; consequently, the current decreases with time, approaching the value of zero as the capacitor potential reaches 50 volts. The behaviour of the potential at b in Figure 20 (right) is described by the equation V   b  = V   a  (1 − e  − t / R  C  ) in volts. For R = 2,000Ω and capacitance C = 2.5 microfarads, V   b  = 50(1 − e  − t /0.005 ) in volts. The potential V   b  at b in Figure 20 (right) increases from zero when the capacitor is uncharged and reaches the ultimate value of V   a  when equilibrium is reached.",
  " How would the potential at point b vary if the potential at point a , instead of being maintained at +50 volts, were to remain at +50 volts for only a short time, say, one millisecond, and then return to zero? The superposition principle (see above) is used to solve the problem. The voltage at a starts at zero, goes to +50 volts at t = 0, then returns to zero at t = +0.001 second. This voltage can be viewed as the sum of two voltages, V  1 a  + V  2 a  , where V  1 a  becomes +50 volts at t = 0 and remains there indefinitely, and V  2 a  becomes −50 volts at t = 0.001 second and remains there indefinitely. This superposition is shown graphically on the left side of Figure 21 . Since the solutions for V  1 b  and V  2 b  corresponding to V  1 a  and V  2 a  are known from the previous example, their sum V   b  is the answer to the problem. The individual solutions and their sum are given graphically on the right side of Figure 21 .",
  "The voltage at b reaches a maximum of only 9 volts . The superposition illustrated in Figure 21 also shows that the shorter the duration of the positive “pulse” at a , the smaller is the value of the voltage generated at b . Increasing the size of the capacitor also decreases the maximum voltage at b . This decrease in the potential of a transient explains the “guardian role” that capacitors play in protecting delicate and complex electronic circuits from damage by large transient voltages. These transients, which generally occur at high frequency, produce effects similar to those produced by pulses of short duration. They can damage equipment when they induce circuit components to break down electrically. Transient voltages are often introduced into electronic circuits through power supplies. A concise way to describe the role of the capacitor in the above example is to say that its impedance to an electric signal decreases with increasing frequency. In the example, much of the signal is shunted to ground instead of appearing at point b .",
  " Certain circuits include sources of alternating electromotive forces of the sinusoidal form V = V  0 cos(ω t ) or V = V  0 sin(ω t ). The sine and cosine functions have values that vary between +1 and −1; either of the equations for the voltage represents a potential that varies with respect to time and has values from + V  0 to − V  0 . The voltage varies with time at a rate given by the numerical value of ω; ω, which is called the angular frequency, is expressed in radians per second. Figure 22 shows an example with V  0 = 170 volts and ω = 377 radians per second, so that V = 170 cos(377 t ). The time interval required for the pattern to be repeated is called the period T , given by T = 2π/ω. In Figure 22 , the pattern is repeated every 16.7 milliseconds, which is the period. The frequency of the voltage is symbolized by f and given by f = 1/ T . In terms of ω, f = ω/2π, in hertz.",
  "The root-mean-square (rms) voltage of a sinusoidal source of electromotive force ( V   rms  ) is used to characterize the source. It is the square root of the time average of the voltage squared. The value of V   rms  is V  0 / 2 , or, equivalently, 0.707 V  0 . Thus, the 60-hertz, 120-volt alternating current, which is available from most electric outlets in U.S. homes and which is illustrated in Figure 22 , has V  0 = 120/0.707 = 170 volts. The potential difference at the outlet varies from +170 volts to −170 volts and back to +170 volts 60 times each second. The rms values of voltage and current are especially useful in calculating average power in AC circuits.",
  "A sinusoidal electromotive force can be generated using the principles described in Faraday’s law of electromagnetic induction ( see \\ electromagnetism: Faraday’s law of induction ). Briefly, an alternating electromotive force can be induced in a loop of conducting wire by rotating the loop of wire in a uniform magnetic field.",
  "In AC circuits, it is often necessary to find the currents as a function of time in the various parts of the circuit for a given source of sinusoidal electromotive force. While the problems can become quite complex, the solutions are based on Kirchhoff’s two laws discussed above ( see  Kirchhoff’s laws of electric circuits ). The solution for the current in a given loop takes the form i = i  0 cos(ω t − ϕ). The current has the same frequency as the applied voltage but is not necessarily “in phase” with that voltage. When the phase angle ϕ does not equal zero, the maximum of the current does not occur when the driving voltage is at its maximum.",
  " The way an AC circuit functions can be better understood by examining one that includes a source of sinusoidally varying electromotive force, a resistor, a capacitor, and an inductor, all connected in series. For this single-loop problem, only the second of Kirchhoff’s laws is needed since there is only one current. The circuit is shown in Figure 23 with the points a , b , c , and d at various positions in the circuit located between the various elements. The letters R , L , and C represent, respectively, the values of the resistance in ohms, the inductance in henrys , and the capacitance in farads . The source of the AC electromotive force is located between a and b . The wavy symbol is a reminder of the sinusoidal nature of the voltage that is responsible for making the current flow in the loop. For the potential between b and a ,   ",
  "Equation ( 27a ) represents a potential difference that has its maximum positive value at t = 0.",
  "The direction chosen for the current i in the circuit in Figure 23 represents the direction of that current at some particular time, since AC circuits feature continuous reversals of the direction of the flow of charge. The direction chosen for the current is important, however, because the loop equation must consider all the elements at the same instant in time. The potential difference across the resistor is given by Ohm’s law as   ",
  "For equation ( 27b ), the direction of the current is important. The potential difference across the capacitor, V   c  − V   d  , depends on the charge on the capacitor. When the charge on the upper plate of the capacitor in Figure 23 has a value Q , the potential difference across the capacitor is   which is a variant of equation ( 12 ). One must be careful labeling the charge and the direction of the current, since the charge on the other plate is − Q . For the choices shown in the figure, the current in the circuit is given by the rate of change of the charge Q —that is, i = d  Q / d  t . Finally, the value of the potential difference V   d  − V   a  across the inductor depends on the rate of change of the current through the inductor, d  i / d  t . For the direction chosen for i , the value is   ",
  "The result of combining equations ( 27a , b , c , d ) in accordance with Kirchhoff’s second law for the loop in Figure 23 is   ",
  "Both the current i and the rate of change of the current d  i / d  t can be eliminated from equation ( 28 ), since i = d  Q / d  t , and d  i / d  t = d  2  Q / d  t  2 . The result is a linear, inhomogeneous, second-order differential equation with well-known solutions for the charge Q as a function of time. The most important solution describes the current and voltages after transient effects have been dampened; the transient effects last only a short time after the circuit is completed. Once the charge is known, the current in the circuit can be obtained by taking the first derivative of the charge. The expression for the current in the circuit is   ",
  "In equation ( 29 ), Z is the impedance of the circuit; impedance, like resistance, is measured in units of ohms. Z is a function of the frequency of the source of applied electromotive force. The equation for Z is   ",
  "If the resistor were the only element in the circuit, the impedance would be Z = R , the resistance of the resistor. For a capacitor alone, Z = 1/ω C , showing that the impedance of a capacitor decreases as the frequency increases. For an inductor alone, Z = ω L ; the reason why the impedance of the inductor increases with frequency will become clear once Faraday’s law of magnetic induction is discussed in detail below. Here it is sufficient to say that an induced electromotive force in the inductor opposes the change in current, and it is directly proportional to the frequency.",
  "The phase angle ϕ in equation ( 29 ) gives the time relationship between the current in the circuit and the driving electromotive force, V  0 cos(ω t ). The tangent of the angle ϕ is   ",
  "Depending on the values of ω, L , and C , the angle ϕ can be positive, negative, or zero. If ϕ is positive, the current “lags” the voltage, while for negative values of ϕ, the current “leads” the voltage.",
  "The power dissipated in the circuit is the same as the power delivered by the source of electromotive force, and both are measured in watts . Using equation ( 23 ), the power is given by   ",
  "An expression for the average power dissipated in the circuit can be written either in terms of the peak values i  0 and V  0 or in terms of the rms values i   rms  and V   rms  . The average power is   ",
  "The cos ϕ in equation ( 33 ) is called the power factor. It is evident that the only element that can dissipate energy is the resistance.",
  " ω A most interesting condition known as resonance occurs when the phase angle is zero in equation ( 31 ), or equivalently, when the angular frequency ω has the value ω = ω  r  = 1/ L  C  . The impedance in equation ( 30 ) then has its minimum value and equals the resistance R . The amplitude of the current in the circuit, i  0 , is at its maximum value (see equation [ 29 ]). Figure 24 shows the dependence of i  0 on the angular frequency ω of the source of alternating electromotive force. The values of the electric parameters for the figure are V  0 = 50 volts, R = 25 ohms, L = 4.5 millihenrys, and C = 0.2 microfarad. With these values, the resonant angular frequency ω  r  of the circuit in Figure 23 is 3.33 × 10 4 radians per second.",
  " ω The peaking in the current shown in Figure 24 constitutes a resonance. At the resonant frequency, in this case when ω  r  equals 3.33 × 10 4 radians per second, the impedance Z of the circuit is at a minimum and the power dissipated is at a maximum. The phase angle ϕ is zero so that the current is in phase with the driving voltage, and the power factor, cos ϕ, is 1. Figure 25 illustrates the variation of the average power with the angular frequency of the sinusoidal electromotive force. The resonance is seen to be even more pronounced. The quality factor Q for the circuit is the electric energy stored in the circuit divided by the energy dissipated in one period. The Q of a circuit is an important quantity in certain applications, as in the case of electromagnetic waveguides and radio-frequency cavities where Q has values around 10,000 and where high voltages and electric fields are desired. For the present circuit, Q = ω  r   L / R . Q also can be obtained from the average power graph as the ratio ω  r  /(ω 2 − ω 1 ), where ω 1 and ω 2 are the angular frequencies at which the average power dissipated in the circuit is one-half its maximum value. For the circuit here, Q = 6.",
  " L ω What is the maximum value of the potential difference across the inductor? Since it is given by L  d  i / d  t , it will occur when the current has the maximum rate of change. Figure 26 shows the amplitude of the potential difference as a function of ω.",
  "The maximum amplitude of the voltage across the inductor, 300 volts, is much greater than the 50-volt amplitude of the driving sinusoidal electromotive force. This result is typical of resonance phenomena. In a familiar mechanical system, children on swings time their kicks to attain very large swings (much larger than they could attain with a single kick). In a more spectacular, albeit costly, example, the collapse of the Tacoma Narrows Bridge (a suspension bridge across the Narrows of Puget Sound, Washington) on November 7, 1940, was the result of the large amplitudes of oscillations that the span attained as it was driven in resonance by high winds. A ubiquitous example of electric resonance occurs when a radio dial is turned to receive a broadcast. Turning the dial changes the value of the tuning capacitor of the radio. When the circuit attains a resonance frequency corresponding to the frequency of the radio wave, the voltage induced is enhanced and processed to produce sound.",
  "Some solids , notably certain crystals , have permanent electric polarization. Other crystals become electrically polarized when subjected to stress. In electric polarization, the centre of positive charge within an atom , molecule , or crystal lattice element is separated slightly from the centre of negative charge. Piezoelectricity (literally “pressure electricity”) is observed if a stress is applied to a solid, for example, by bending, twisting, or squeezing it. If a thin slice of quartz is compressed between two electrodes , a potential difference occurs; conversely, if the quartz crystal is inserted into an electric field , the resulting stress changes its dimensions. Piezoelectricity is responsible for the great precision of clocks and watches equipped with quartz oscillators. It also is used in electric guitars and various other musical instruments to transform mechanical vibrations into corresponding electric signals, which are then amplified and converted to sound by acoustical speakers.",
  "A crystal under stress exhibits the direct piezoelectric effect; a polarization P , proportional to the stress, is produced. In the converse effect, an applied electric field produces a distortion of the crystal, represented by a strain proportional to the applied field. The basic equations of piezoelectricity are P = d × stress and E = strain / d . The piezoelectric coefficient d (in metres per volt ) is approximately 3 × 10 −12 for quartz, 5 × −10 −11 for ammonium dihydrogen phosphate, and 3 × 10 −10 for lead zirconate titanate.",
  "For an elastic body, the stress is proportional to the strain—i.e., stress = Y   e  × strain . The proportionality constant is the coefficient of elasticity Y   e  , also called Young’s modulus for the English physicist Thomas Young . Using that relation, the induced polarization can be written as P = d  Y   e  × strain , while the stress required to keep the strain constant when the crystal is in an electric field is stress = − d  Y   e   E . The strain in a deformed elastic body is the fractional change in the dimensions of the body in various directions; the stress is the internal pressure along the various directions. Both are second-rank tensors , and, since electric field and polarization are vectors , the detailed treatment of piezoelectricity is complex. The equations above are oversimplified but can be used for crystals in certain orientations.",
  "The polarization effects responsible for piezoelectricity arise from small displacements of ions in the crystal lattice. Such an effect is not found in crystals with a centre of symmetry. The direct effect can be quite strong; a potential V = Y   e   d δ/ε 0  K is generated in a crystal compressed by an amount δ, where K is the dielectric constant . If lead zirconate titanate is placed between two electrodes and a pressure causing a reduction of only 1/20th of one millimetre is applied, a 100,000-volt potential is produced. The direct effect is used, for example, to generate an electric spark with which to ignite natural gas in a heating unit or an outdoor cooking grill.",
  "In practice, the converse piezoelectric effect, which occurs when an external electric field changes the dimensions of a crystal, is small because the electric fields that can be generated in a laboratory are minuscule compared to those existing naturally in matter. A static electric field of 10 6 volts per metre produces a change of only about 0.001 millimetre in the length of a one-centimetre quartz crystal. The effect can be enhanced by the application of an alternating electric field of the same frequency as the natural mechanical vibration frequency of the crystal. Many of the crystals have a quality factor Q of several hundred, and, in the case of quartz, the value can be 10 6 . The result is a piezoelectric coefficient a factor Q higher than for a static electric field. The very large Q of quartz is exploited in electronic oscillator circuits to make remarkably accurate timepieces. The mechanical vibrations that can be induced in a crystal by the converse piezoelectric effect are also used to generate ultrasound , which is sound with a frequency far higher than frequencies audible to the human ear —above 20 kilohertz. The reflected sound is detectable by the direct effect. Such effects form the basis of ultrasound systems used to fathom the depths of lakes and waterways and to locate fish . Ultrasound has found application in medical imaging (e.g., fetal monitoring and the detection of abnormalities such as prostate tumours ). The use of ultrasound makes it possible to produce detailed pictures of organs and other internal structures because of the variation in the reflection of sound from various body tissues. Thin films of polymeric plastic with a piezoelectric coefficient of about 10 −11 metres per volt have been developed and have numerous applications as pressure transducers.",
  "The index of refraction n of a transparent substance is related to its electric polarizability and is given by n  2 = 1 + χ  e  /ε 0 . As discussed earlier, χ  e  is the electric susceptibility of a medium, and the equation P = χ  e   E relates the polarization of the medium to the applied electric field. For most matter, χ  e  is not a constant independent of the value of the electric field , but rather depends to a small degree on the value of the field. Thus, the index of refraction can be changed by applying an external electric field to a medium. In liquids, glasses , and crystals that have a centre of symmetry, the change is usually very small. Called the Kerr effect (for its discoverer, the Scottish physicist John Kerr), it is proportional to the square of the applied electric field. In noncentrosymmetric crystals, the change in the index of refraction n is generally much greater; it depends linearly on the applied electric field and is known as the Pockels effect (after the German physicist F. R. Pockels).",
  "A varying electric field applied to a medium will modulate its index of refraction. This change in the index of refraction can be used to modulate light and make it carry information. A crystal widely used for its Pockels effect is potassium dihydrogen phosphate, which has good optical properties and low dielectric losses even at microwave frequencies.",
  "An unusually large Kerr effect is found in nitrobenzene , a liquid with highly “acentric” molecules that have large electric dipole moments. Applying an external electric field partially aligns the otherwise randomly oriented dipole moments and greatly enhances the influence of the field on the index of refraction. The length of the path of light through nitrobenzene can be adjusted easily because it is a liquid.",
  "When two metals are placed in electric contact, electrons flow out of the one in which the electrons are less bound and into the other. The binding is measured by the location of the so-called Fermi level of electrons in the metal; the higher the level, the lower is the binding. The Fermi level represents the demarcation in energy within the conduction band of a metal between the energy levels occupied by electrons and those that are unoccupied. The energy of an electron at the Fermi level is − W relative to a free electron outside the metal. The flow of electrons between the two conductors in contact continues until the change in electrostatic potential brings the Fermi levels of the two metals ( W  1 and W  2 ) to the same value. This electrostatic potential is called the contact potential ϕ 12 and is given by e ϕ 12 = W  1 − W  2 , where e is 1.6 × 10 −19  coulomb .",
  "If a closed circuit is made of two different metals, there will be no net electromotive force in the circuit because the two contact potentials oppose each other and no current will flow. There will be a current if the temperature of one of the junctions is raised with respect to that of the second. There is a net electromotive force generated in the circuit, as it is unlikely that the two metals will have Fermi levels with identical temperature dependence. To maintain the temperature difference, heat must enter the hot junction and leave the cold junction; this is consistent with the fact that the current can be used to do mechanical work . The generation of a thermal electromotive force at a junction is called the Seebeck effect (after the Estonian-born German physicist Thomas Johann Seebeck ). The electromotive force is approximately linear with the temperature difference between two junctions of dissimilar metals, which are called a thermocouple . For a thermocouple made of iron and constantan (an alloy of 60 percent copper and 40 percent nickel ), the electromotive force is about five millivolts when the cold junction is at 0° C and the hot junction at 100° C. One of the principal applications of the Seebeck effect is the measurement of temperature. The chemical properties of the medium, the temperature of which is measured, and the sensitivity required dictate the choice of components of a thermocouple.",
  "The absorption or release of heat at a junction in which there is an electric current is called the Peltier effect (after the French physicist Jean-Charles Peltier). Both the Seebeck and Peltier effects also occur at the junction between a metal and a semiconductor and at the junction between two semiconductors. The development of semiconductor thermocouples (e.g., those consisting of n -type and p -type bismuth telluride) has made the use of the Peltier effect practical for refrigeration . Sets of such thermocouples are connected electrically in series and thermally in parallel. When an electric current is made to flow, a temperature difference, which depends on the current, develops between the two junctions. If the temperature of the hotter junction is kept low by removing heat, the second junction can be tens of degrees colder and act as a refrigerator. Peltier refrigerators are used to cool small bodies; they are compact, have no moving mechanical parts, and can be regulated to maintain precise and stable temperatures. They are employed in numerous applications, as, for example, to keep the temperature of a sample constant while it is on a microscope stage.",
  "A metal contains mobile electrons in a partially filled band of energy levels—i.e., the conduction band. These electrons, though mobile within the metal, are rather tightly bound to it. The energy that is required to release a mobile electron from the metal varies from about 1.5 to 6 electron volts , depending on the metal. In thermionic emission , some of the electrons acquire enough energy from thermal collisions to escape from the metal. The number of electrons emitted and therefore the thermionic emission current depend critically on temperature.",
  "In a metal the conduction-band levels are filled up to the Fermi level, which lies at an energy − W relative to a free electron outside the metal. The work function of the metal, which is the energy required to remove an electron from the metal, is therefore equal to W . At a temperature of 1,000 K only a small fraction of the mobile electrons have sufficient energy to escape. The electrons that can escape are moving so fast in the metal and have such high kinetic energies that they are unaffected by the periodic potential caused by atoms of the metallic lattice. They behave like electrons trapped in a region of constant potential. Because of this, when the rate at which electrons escape from the metal is calculated, the detailed structure of the metal has little influence on the final result. A formula known as Richardson’s law (first proposed by the English physicist Owen W. Richardson) is roughly valid for all metals. It is usually expressed in terms of the emission current density ( J ) as   in amperes per square metre. The Boltzmann constant  k has the value 8.62 × 10 −5 electron volts per kelvin , and temperature T is in kelvins. The constant A is 1.2 × 10 6 ampere degree squared per square metre, and varies slightly for different metals. For tungsten , which has a work function W of 4.5 electron volts, the value of A is 7 × 10 5 amperes per square metre kelvin squared and the current density at T equaling 2,400 K is 0.14 ampere per square centimetre. J rises rapidly with temperature. If T is increased to 2,600 K, J rises to 0.9 ampere per square centimetre. Tungsten does not emit appreciably at 2,000 K or below (less than 0.05 milliampere per square centimetre) because its work function of 4.5 electron volts is large compared to the thermal energy k  T , which is only 0.16 electron volt. At 1,000 K, a mixture of barium and strontium oxides has a work function of approximately 1.3 electron volts and is a reasonably good conductor. Currents of several amperes per square centimetre can be drawn from such oxide cathodes, but in practice the current density is generally less than 0.2 ampere per square centimetre. The oxide layer deteriorates rapidly when higher current densities are drawn.",
  "If electrons with energies of 10 to 1,000 electron volts strike a metal surface in a vacuum, their energy is lost in collisions in a region near the surface, and most of it is transferred to other electrons in the metal. Because this occurs near the surface, some of these electrons may be ejected from the metal and form a secondary emission current. The ratio of secondary electrons to incident electrons is known as the secondary emission coefficient. For low-incident energies (below about one electron volt), the primary electrons tend to be reflected and the secondary emission coefficient is near unity. With increasing energy, the coefficient at first falls and then at about 10 electron volts begins to rise again, usually reaching a peak of value between 2 and 4 at energies of a few hundred electron volts. At higher energies, the primary electrons penetrate so far below the surface before losing energy that the excited electrons have little chance of reaching the surface and escaping. The secondary emission coefficients fall and, when the electrons have energies exceeding 20 kiloelectron volts, are usually well below unity. Secondary emission also can occur in insulators . Because many insulators have rather high secondary emission coefficients, it is often useful when high secondary emission yields are required to coat a metal electrode with a thin insulator layer a few atoms thick.",
  "If light with a photon energy h ν that exceeds the work function W falls on a metal surface, some of the incident photons will transfer their energy to electrons, which then will be ejected from the metal. Since h ν is greater than W , the excess energy h ν − W transferred to the electrons will be observed as their kinetic energy outside the metal. The relation between electron kinetic energy E and the frequency ν (that is, E = h ν − W ) is known as the Einstein relation, and its experimental verification helped to establish the validity of quantum theory . The energy of the electrons depends on the frequency of the light, while the intensity of the light determines the rate of photoelectric emission.",
  "In a semiconductor the valence band of energy levels is almost completely full while the conduction band is almost empty. The conductivity of the material derives from the few holes present in the valence band and the few electrons in the conduction band. Electrons can be excited from the valence to the conduction band by light photons having an energy h ν that is larger than energy gap E   g  between the bands. The process is an internal photoelectric effect . The value of E   g  varies from semiconductor to semiconductor. For lead sulfide, the threshold frequency occurs in the infrared , whereas for zinc oxide it is in the ultraviolet . For silicon , E   g  equals 1.1 electron volts, and the threshold wavelength is in the infrared, about 1,100 nanometres. Visible radiation produces electron transitions with almost unity quantum efficiency in silicon. Each transition yields a hole–electron pair (i.e., two carriers) that contributes to electric conductivity. For example, if one milliwatt of light strikes a sample of pure silicon in the form of a thin plate one square centimetre in area and 0.03 centimetre thick (which is thick enough to absorb all incident light), the resistance of the plate will be decreased by a factor of about 1,000. In practice, photoconductive effects are not usually as large as this, but this example indicates that appreciable changes in conductivity can occur even with low illumination. Photoconductive devices are simple to construct and are used to detect visible, infrared, and ultraviolet radiation.",
  "Conduction electrons moving in a solid under the influence of an electric field usually lose kinetic energy in low-energy collisions as fast as they acquire it from the field. Under certain circumstances in semiconductors, however, they can acquire enough energy between collisions to excite atoms in the next collision and produce radiation as the atoms de-excite. A voltage applied across a thin layer of zinc sulfide powder causes just such an electroluminescent effect. Electroluminescent panels are of more interest as signal indicators and display devices than as a source of general illumination.",
  "A somewhat similar effect occurs at the junction in a reverse-biased semiconductor p – n junction diode—i.e., a p – n junction diode in which the applied potential is in the direction of small current flow. Electrons in the intense field at the depleted junction easily acquire enough energy to excite atoms. Little of this energy finally emerges as light, though the effect is readily visible under a microscope.",
  "When a junction between a heavily doped n -type material and a less doped p -type material is forward-biased so that a current will flow easily, the current consists mainly of electrons injected from the n -type material into the conduction band of the p -type material. These electrons ultimately drop into holes in the valence band and release energy equal to the energy gap of the material. In most cases, this energy E   g  is dissipated as heat, but in gallium phosphide and especially in gallium arsenide, an appreciable fraction appears as radiation, the frequency ν of which satisfies the relation h ν = E   g  . In gallium arsenide, though up to 30 percent of the input electric energy is available as radiation, the characteristic wavelength of 900 nanometres is in the infrared. Gallium phosphide gives off visible green light but is inefficient; other related III-V compound semiconductors emit light of different colours. Electroluminescent injection diodes of such materials, commonly known as light-emitting diodes (LEDs) , are employed mainly as indicator lamps and numeric displays. Semiconductor lasers built with layers of indium phosphide and of gallium indium arsenide phosphide have proved more useful. Unlike gas or optically pumped lasers, these semiconductor lasers can be modulated directly at high frequencies. They are used not only in devices such as compact disc players but also as light sources for long-distance optical fibre communications systems.",
  "Bioelectricity refers to the generation or action of electric currents or voltages in biological processes. Bioelectric phenomena include fast signaling in nerves and the triggering of physical processes in muscles or glands . There is some similarity among the nerves, muscles, and glands of all organisms, possibly because fairly efficient electrochemical systems evolved early. Scientific studies tend to focus on the following: nerve or muscle tissue; such organs as the heart , brain , eye , ear , stomach , and certain glands; electric organs in some fish ; and potentials associated with damaged tissue.",
  "Electric activity in living tissue is a cellular phenomenon, dependent on the cell membrane. The membrane acts like a capacitor , storing energy as electrically charged ions on opposite sides of the membrane. The stored energy is available for rapid utilization and stabilizes the membrane system so that it is not activated by small disturbances.",
  " Cells capable of electric activity show a resting potential in which their interiors are negative by about 0.1 volt or less compared with the outside of the cell. When the cell is activated, the resting potential may reverse suddenly in sign; as a result, the outside of the cell becomes negative and the inside positive. This condition lasts for a short time, after which the cell returns to its original resting state. This sequence, called depolarization and repolarization, is accompanied by a flow of substantial current through the active cell membrane, so that a “dipole-current source” exists for a short period. Small currents flow from this source through the aqueous medium containing the cell and are detectable at considerable distances from it. These currents, originating in active membrane, are functionally significant very close to their site of origin but must be considered incidental at any distance from it. In electric fish , however, adaptations have occurred, and this otherwise incidental electric current is actually utilized. In some species the external current is apparently used for sensing purposes, while in others it is used to stun or kill prey. In both cases, voltages from many cells add up in series, thus assuring that the specialized functions can be performed. Bioelectric potentials detected at some distance from the cells generating them may be as small as the 20 or 30 microvolts associated with certain components of the human electroencephalogram or the millivolt of the human electrocardiogram . On the other hand, electric eels can deliver electric shocks with voltages as large as 1,000 volts.",
  "In addition to the potentials originating in nerve or muscle cells, relatively steady or slowly varying potentials (often designated dc) are known. These dc potentials occur in the following cases: in areas where cells have been damaged and where ionized potassium is leaking (as much as 50 millivolts); when one part of the brain is compared with another part (up to one millivolt); when different areas of the skin are compared (up to 10 millivolts); within pockets in active glands, e.g., follicles in the thyroid (as high as 60 millivolts); and in special structures in the inner ear (about 80 millivolts).",
  "A small electric shock caused by static electricity during cold, dry weather is a familiar experience. While the sudden muscular reaction it engenders is sometimes unpleasant, it is usually harmless. Even though static potentials of several thousand volts are involved, a current exists for only a brief time and the total charge is very small. A steady current of two milliamperes through the body is barely noticeable. Severe electrical shock can occur above 10 milliamperes, however. Lethal current levels range from 100 to 200 milliamperes. Larger currents, which produce burns and unconsciousness, are not fatal if the victim is given prompt medical care. (Above 200 milliamperes, the heart is clamped during the shock and does not undergo ventricular fibrillation.) Prevention clearly includes avoiding contact with live electric wiring; risk of injury increases considerably if the skin is wet, as the electric resistance of wet skin may be hundreds of times smaller than that of dry skin.",
  " P.C.W. Davies , The Forces of Nature , 2nd ed. (1986), is an interesting, readable account. Edward M. Purcell , Electricity and Magnetism , 2nd ed. (1985), is superbly illustrated and treats key principles and phenomena with remarkable insight. Many examples and problems on electricity, as well as elementary discussions of vectors and other aspects of physics, are found in David Halliday , Robert Resnick , and Jearl Walker , Fundamentals of Physics , 7th ed., extended (2005). Useful physics textbooks with illustrations, examples, and problems include Richard Wolfson and Jay M. Pasachoff , Physics , 3rd ed., 2 vol. (1999); and Hugh D. Young , University Physics , 8th ed. (1992)."
]