[
  " electromagnetic radiation , in classical physics, the flow of energy at the universal speed of light through free space or through a material medium in the form of the electric and magnetic fields that make up electromagnetic waves such as radio waves , visible light , and gamma rays . In such a wave, time-varying electric and magnetic fields are mutually linked with each other at right angles and perpendicular to the direction of motion. An electromagnetic wave is characterized by its intensity and the frequency ν of the time variation of the electric and magnetic fields.",
  "In terms of the modern quantum theory , electromagnetic radiation is the flow of photons (also called light quanta) through space. Photons are packets of energy h ν that always move with the universal speed of light. The symbol h is Planck’s constant , while the value of ν is the same as that of the frequency of the electromagnetic wave of classical theory. Photons having the same energy h ν are all alike, and their number density corresponds to the intensity of the radiation. Electromagnetic radiation exhibits a multitude of phenomena as it interacts with charged particles in atoms , molecules , and larger objects of matter. These phenomena as well as the ways in which electromagnetic radiation is created and observed, the manner in which such radiation occurs in nature, and its technological uses depend on its frequency ν. The spectrum of frequencies of electromagnetic radiation extends from very low values over the range of radio waves, television waves, and microwaves to visible light and beyond to the substantially higher values of ultraviolet light , X-rays , and gamma rays.",
  "The basic properties and behaviour of electromagnetic radiation are discussed in this article, as are its various forms, including their sources, distinguishing characteristics, and practical applications. The article also traces the development of both the classical and quantum theories of radiation.",
  "  Close to 0.01 percent of the mass/energy of the entire universe occurs in the form of electromagnetic radiation. All human life is immersed in it, and modern communications technology and medical services are particularly dependent on one or another of its forms. In fact, all living things on Earth depend on the electromagnetic radiation received from the Sun and on the transformation of solar energy by photosynthesis into plant life or by biosynthesis into zooplankton , the basic step in the food chain in oceans . The eyes of many animals, including those of humans, are adapted to be sensitive to and hence to see the most abundant part of the Sun’s electromagnetic radiation—namely, light , which comprises the visible portion of its wide range of frequencies. Green plants also have high sensitivity to the maximum intensity of solar electromagnetic radiation, which is absorbed by a substance called chlorophyll that is essential for plant growth via photosynthesis.",
  "Practically all the fuels that modern society uses— gas , oil , and coal —are stored forms of energy received from the Sun as electromagnetic radiation millions of years ago. Only the energy from nuclear reactors does not originate from the Sun.",
  "Everyday life is pervaded by artificially made electromagnetic radiation: food is heated in microwave ovens , airplanes are guided by radar waves, television sets receive electromagnetic waves transmitted by broadcasting stations, and infrared waves from heaters provide warmth. Infrared waves also are given off and received by automatic self-focusing cameras that electronically measure and set the correct distance to the object to be photographed. As soon as the Sun sets, incandescent or fluorescent lights are turned on to provide artificial illumination, and cities glow brightly with the colourful fluorescent and neon lamps of advertisement signs. Familiar too is ultraviolet radiation , which the eyes cannot see but whose effect is felt as pain from sunburn . Ultraviolet light represents a kind of electromagnetic radiation that can be harmful to life . Such is also true of X-rays , which are important in medicine as they allow physicians to observe the inner parts of the body but exposure to which should be kept to a minimum. Less familiar are gamma rays , which come from nuclear reactions and radioactive decay and are part of the harmful high-energy radiation of radioactive materials and nuclear weapons .",
  " The brief account of familiar phenomena given above surveyed electromagnetic radiation from low frequencies of ν ( radio waves ) to exceedingly high values of ν ( gamma rays ). Going from the ν values of radio waves to those of visible light is like comparing the thickness of this page with the distance of Earth from the Sun , which represents an increase by a factor of a million billion. Similarly, going from the ν values of visible light to the very much larger ones of gamma rays represents another increase in frequency by a factor of a million billion. This extremely large range of ν values, called the electromagnetic spectrum, is shown in Figure 1 , together with the common names used for its various parts, or regions.",
  "The number ν is shared by both the classical and the modern interpretation of electromagnetic radiation. In classical language, ν is the frequency of the temporal changes in an electromagnetic wave. The frequency of a wave is related to its speed c and wavelength λ in the following way. If 10 complete waves pass by in one second, one observes 10 wriggles, and one says that the frequency of such a wave is ν = 10 cycles per second (10 hertz [Hz]). If the wavelength of the wave is, say, λ = 3 cm, then it is clear that a wave train 30 cm long has passed in that one second to produce the 10 wriggles that were observed. Thus, the speed of the wave is 30 cm per second, and one notes that in general the speed is c = λν. The speed of electromagnetic radiation of all kinds is the same universal constant that is defined to be exactly c = 299,792,458 metres per second (186,282 miles per second). The wavelengths of the classical electromagnetic waves in free space calculated from c = λν are also shown on the spectrum in Figure 1 , as is the energy h ν of modern-day photons . Commonly used as the unit of energy is the electron volt (eV), which is the energy that can be given to an electron by a one- volt  battery . It is clear that the range of wavelengths λ and of photon energies h ν are equally as large as the spectrum of ν values.",
  "Because the wavelengths and energy quanta h ν of electromagnetic radiation of the various parts of the spectrum are so different in magnitude, the sources of the radiations, the interactions with matter, and the detectors employed are correspondingly different. This is why the same electromagnetic radiation is called by different names in various regions of the spectrum.",
  " In spite of these obvious differences of scale, all forms of electromagnetic radiation obey certain general rules that are well understood and that allow one to calculate with very high precision their properties and interactions with charged particles in atoms , molecules , and large objects. Electromagnetic radiation is, classically speaking, a wave of electric and magnetic fields propagating at the speed of light c through empty space. In this wave the electric and magnetic fields change their magnitude and direction each second. This rate of change is the frequency ν measured in cycles per second—namely, in hertz. The electric and magnetic fields are always perpendicular to each other and at right angles to the direction of propagation, as shown in Figure 2 . There is as much energy carried by the electric component of the wave as by the magnetic component, and the energy is proportional to the square of the field strength.",
  "Electromagnetic radiation is produced whenever a charged particle, such as an electron, changes its velocity—i.e., whenever it is accelerated or decelerated. The energy of the electromagnetic radiation thus produced comes from the charged particle and is therefore lost by it. A common example of this phenomenon is the oscillating charge or current in a radio antenna . The antenna of a radio transmitter is part of an electric resonance circuit in which the charge is made to oscillate at a desired frequency. An electromagnetic wave so generated can be received by a similar antenna connected to an oscillating electric circuit in the tuner that is tuned to that same frequency. The electromagnetic wave in turn produces an oscillating motion of charge in the receiving antenna. In general, one can say that any system which emits electromagnetic radiation of a given frequency can absorb radiation of the same frequency.",
  "Such human-made transmitters and receivers become smaller with decreasing wavelength of the electromagnetic wave and prove impractical in the millimetre range. At even shorter wavelengths down to the wavelengths of X-rays , which are one million times smaller, the oscillating charges arise from moving charges in molecules and atoms.",
  "One may classify the generation of electromagnetic radiation into two categories: (1) systems or processes that produce radiation covering a broad continuous spectrum of frequencies and (2) those that emit (and absorb) radiation of discrete frequencies that are characteristic of particular systems. The Sun with its continuous spectrum is an example of the first, while a radio transmitter tuned to one frequency exemplifies the second category.",
  "Such spectra are emitted by any warm substance. Heat is the irregular motion of electrons, atoms, and molecules; the higher the temperature , the more rapid the motion. Since electrons are much lighter than atoms, irregular thermal motion produces irregular oscillatory charge motion, which reflects a continuous spectrum of frequencies. Each oscillation at a particular frequency can be considered a tiny “antenna” that emits and receives electromagnetic radiation. As a piece of iron is heated to increasingly high temperatures, it first glows red, then yellow, and finally white. In short, all the colours of the visible spectrum are represented. Even before the iron begins to glow red, one can feel the emission of infrared waves by the heat sensation on the skin. A white-hot piece of iron also emits ultraviolet radiation , which can be detected by a photographic film.",
  "Not all materials heated to the same temperature emit the same amount and spectral distribution of electromagnetic waves. For example, a piece of glass heated next to iron looks nearly colourless, but it feels hotter to the skin (it emits more infrared rays) than does the iron. This observation illustrates the rule of reciprocity: a body radiates strongly at those frequencies that it is able to absorb, because for both processes it needs the tiny antennas of that range of frequencies. Glass is transparent in the visible range of light because it lacks possible electronic absorption at these particular frequencies. As a consequence, glass cannot glow red because it cannot absorb red. On the other hand, glass is a better emitter/absorber in the infrared than iron or any other metal that strongly reflects such lower-frequency electromagnetic waves. This selective emissivity and absorptivity is important for understanding the greenhouse effect ( see below  The greenhouse effect of the atmosphere ) and many other phenomena in nature. The tungsten filament of a lightbulb has a temperature of 2,500 K (4,040 °F) and emits large amounts of visible light but relatively little infrared because metals , as mentioned above, have small emissivities in the infrared range. This is of course fortunate, since one wants light from a lightbulb but not much heat. The light emitted by a candle originates from very hot carbon soot particles in the flame, which strongly absorb and thus emit visible light. By contrast, the gas flame of a kitchen range is pale, even though it is hotter than a candle flame, because of the absence of soot. Light from the stars originates from the high temperature of the gases at their surface. A wide spectrum of radiation is emitted from the Sun’s surface, the temperature of which is about 5,800 K. The radiation output is 60 million watts for every square metre of solar surface, which is equivalent to the amount produced by an average-size commercial power-generating station that can supply electric power for about 30,000 households.",
  "The spectral composition of a heated body depends on the materials of which the body consists. That is not the case for an ideal radiator or absorber. Such an ideal object absorbs and thus emits radiation of all frequencies equally and fully. A radiator/absorber of this kind is called a blackbody , and its radiation spectrum is referred to as blackbody radiation , which depends on only one parameter, its temperature. Scientists devise and study such ideal objects because their properties can be known exactly. This information can then be used to determine and understand why real objects, such as a piece of iron or glass, a cloud, or a star, behave differently.",
  "A good approximation of a blackbody is a piece of coal or, better yet, a cavity in a piece of coal that is visible through a small opening. There is one property of blackbody radiation which is familiar to everyone but which is actually quite mysterious. As the piece of coal is heated to higher and higher temperatures, one first observes a dull red glow, followed by a change in colour to bright red; as the temperature is increased further, the colour changes to yellow and finally to white. White is not itself a colour but rather the visual effect of the combination of all primary colours. The fact that white glow is observed at high temperatures means that the colour blue has been added to the ones observed at lower temperatures. This colour change with temperature is mysterious because one would expect, as the energy (or temperature) is increased, just more of the same and not something entirely different. For example, as one increases the power of a radio amplifier, one hears the music louder but not at a higher pitch.",
  "The change in colour or frequency distribution of the electromagnetic radiation coming from heated bodies at different temperatures remained an enigma for centuries. The solution of this mystery by the German physicist Max Planck initiated the era of modern physics at the beginning of the 20th century. He explained the phenomenon by proposing that the tiny antennas in the heated body are quantized, meaning that they can emit electromagnetic radiation only in finite energy quanta of size h ν. The universal constant h is called Planck’s constant in his honour. For blue light h ν = 3 eV, whereas h ν = 1.8 eV for red light. Since high-frequency antennas of vibrating charges in solids have to emit larger energy quanta h ν than lower-frequency antennas, they can only do so when the temperature, or the thermal atomic motion, becomes high enough. Hence, the average pitch, or peak frequency, of blackbody electromagnetic radiation increases with temperature.",
  "  The many tiny antennas in a heated chunk of material are, as noted above, to be identified with the accelerating and decelerating charges in the heat motion of the atoms of the material. There are other sources of continuous spectra of electromagnetic radiation that are not associated with heat but still come from accelerated or decelerated charges. X-rays are, for example, produced by abruptly stopping rapidly moving electrons. This deceleration of the charges produces bremsstrahlung (“braking radiation”). In an X-ray tube, electrons moving with an energy of E  max = 10,000 to 50,000 eV (10–50 keV) are made to strike a piece of metal. The electromagnetic radiation produced by this sudden deceleration of electrons is a continuous spectrum extending up to the maximum photon energy h ν = E  max .",
  "By far the brightest continuum spectra of electromagnetic radiation come from synchrotron radiation sources. These are not well known because they are predominantly used for research and sometimes for commercial and medical applications. Because any change in motion is an acceleration, circulating currents of electrons produce electromagnetic radiation. When these circulating electrons move at relativistic speeds (i.e., those approaching the speed of light), the brightness of the radiation increases enormously. This radiation was first observed at the General Electric Company in 1947 in an electron synchrotron (hence the name of this radiation), which is a type of particle accelerator that forces relativistic electrons into circular orbits by using powerful magnetic fields. The intensity of synchrotron radiation is further increased more than a thousandfold by wigglers and undulators that move the beam of relativistic electrons to and fro by means of other magnetic fields.",
  "The conditions for generating bremsstrahlung as well as synchrotron radiation exist in nature in various forms. Acceleration and capture of charged particles by the gravitational field of a star, black hole , or galaxy is a source of energetic cosmic X-rays. Gamma rays are produced in other kinds of cosmic objects—namely, supernovae , neutron stars , and quasars .",
  "These are commonly encountered in everyday life. Familiar examples of discrete-frequency electromagnetic radiation include the distinct colours of lamps filled with different fluorescent gases that are characteristic of advertisement signs, the colours of dyes and pigments, the bright yellow of sodium lamps , the blue-green hue of mercury lamps , and the specific colours of lasers .",
  " n n R H  n 2 R H  n  Sources of electromagnetic radiation of specific frequency are typically atoms or molecules. Every atom or molecule can have certain discrete internal energies, which are called quantum states. An atom or molecule can therefore change its internal energy only by discrete amounts. By going from a higher to a lower energy state, a quantum h ν of electromagnetic radiation is emitted of a magnitude that is precisely the energy difference between the higher and lower state. Absorption of a quantum h ν takes the atom from a lower to a higher state if h ν matches the energy difference. All like atoms are identical, but each chemical element of the periodic table has its own specific set of possible internal energies. Therefore, by measuring the characteristic and discrete electromagnetic radiation that is either emitted or absorbed by atoms or molecules , one can identify which kind of atom or molecule is giving off or absorbing the radiation. This provides a means of determining the chemical composition of substances. Since one cannot subject a piece of a distant star to conventional chemical analysis, studying the emission or absorption of starlight is the only way to determine the composition of stars or of interstellar gases and dust.",
  "The Sun, for example, not only emits the continuous spectrum of radiation that originates from its hot surface but also emits discrete radiation quanta h ν that are characteristic of its atomic composition. Many of the elements can be detected at the solar surface, but the most abundant is helium . This is so because helium is the end product of the nuclear fusion reaction that is the fundamental energy source of the Sun. This particular element was named helium (from the Greek word helios, meaning “Sun”) because its existence was first discovered by its characteristic absorption energies in the Sun’s spectrum. The helium of the cooler outer parts of the solar atmosphere absorbs the characteristic light frequencies from the lower and hotter regions of the Sun.",
  "The characteristic and discrete energies h ν found as emission and absorption of electromagnetic radiation by atoms and molecules extend to X-ray energies. As high-energy electrons strike the piece of metal in an X-ray tube, electrons are knocked out of the inner energy shell of the atoms. These vacancies are then filled by electrons from the second or third shell; emitted in the process are X-rays having h ν values that correspond to the energy differences of the shells. One therefore observes not only the continuous spectrum of the bremsstrahlung discussed above but also X-ray emissions of discrete energies h ν that are characteristic of the specific elemental composition of the metal struck by the energetic electrons in the X-ray tube.",
  "The discrete electromagnetic radiation energies h ν emitted or absorbed by all substances reflect the discreteness of the internal energies of all material things. This means that window glass and water are transparent to visible light; they cannot absorb these visible light quanta because their internal energies are such that no energy difference between a higher and a lower internal state matches the energy h ν of visible light. shows as an example the coefficient of absorption of water as a function of frequency ν of electromagnetic radiation. Above the scale of frequencies, the corresponding scales of photon energy h ν and wavelength λ are given. An absorption coefficient α = 10 −4 cm −1 means that the intensity of electromagnetic radiation is only one-third its original value after passing through 100 metres of water. When α = 1 cm −1 , only a layer 1 cm thick is needed to decrease the intensity to one-third its original value, and, for α = 10 3 cm, a layer of water having the thickness of a thin sheet of paper is sufficient to attenuate electromagnetic radiation by that much. The transparency of water to visible light, marked by the vertical dashed lines, is a remarkable feature that is significant for life on Earth .",
  "All things look so different and have different colours because of their different sets of internal discrete energies, which determine their interaction with electromagnetic radiation. The words looking and colours are associated with the human detectors of electromagnetic radiation, the eyes . Since there are instruments available for detecting electromagnetic radiation of any frequency, one can imagine that things “look” different at different energies of the spectrum because different materials have their own characteristic sets of discrete internal energies. Even the nuclei of atoms are composites of other elementary particles and thus can be excited to many discrete internal energy states. Since nuclear energies are much larger than atomic energies, the energy differences between internal energy states are substantially larger, and the corresponding electromagnetic radiation quanta h ν emitted or absorbed when nuclei change their energies are even bigger than those of X-rays. Such quanta given off or absorbed by atomic nuclei are called gamma rays ( see above  The electromagnetic spectrum ).",
  "If a charged particle interacts with an electromagnetic wave, it experiences a force proportional to the strength of the electric field and thus is forced to change its motion in accordance with the frequency of the electric field wave. In doing so, it becomes a source of electromagnetic radiation of the same frequency, as described in the previous section. The energy for the work done in accelerating the charged particle and emitting this secondary radiation comes from and is lost by the primary wave. This process is called scattering .",
  "Since the energy density of the electromagnetic radiation is proportional to the square of the electric field strength and the field strength is caused by acceleration of a charge, the energy radiated by such a charge oscillator increases with the square of the acceleration. On the other hand, the acceleration of an oscillator depends on the frequency of the back-and-forth oscillation. The acceleration increases with the square of the frequency. This leads to the important result that the electromagnetic energy radiated by an oscillator increases very rapidly—namely, with the square of the square or, as one says, with the fourth power of the frequency. Doubling the frequency thus produces an increase in radiated energy by a factor of 16.",
  "  This rapid increase in scattering with the frequency of electromagnetic radiation can be seen on any sunny day: it is the reason the sky is blue and the setting Sun is red. The higher-frequency blue light from the Sun is scattered much more by the atoms and molecules of Earth’s atmosphere than is the lower-frequency red light. Hence, the light of the setting Sun, which passes through a thick layer of atmosphere, has much more red than yellow or blue light, while light scattered from the sky contains much more blue than yellow or red light.",
  "The process of scattering, or reradiating part of the electromagnetic wave by a charge oscillator, is fundamental to understanding the interaction of electromagnetic radiation with solids , liquids , or any matter that contains a very large number of charges and thus an enormous number of charge oscillators. This also explains why a substance that has charge oscillators of certain frequencies absorbs and emits radiation of those frequencies.",
  "  When electromagnetic radiation falls on a large collection of individual small charge oscillators, as in a piece of glass or metal or a brick wall, all of these oscillators perform oscillations in unison, following the beat of the electric wave. As a result, all the oscillators emit secondary radiation in unison (or coherently), and the total secondary radiation coming from the solid consists of the sum of all these secondary coherent electromagnetic waves. This sum total yields radiation that is reflected from the surface of the solid and radiation that goes into the solid at a certain angle with respect to the normal of (i.e., a line perpendicular to) the surface. The latter is the refracted radiation that may be attenuated (absorbed) on its way through the solid.",
  "When two electromagnetic waves of the same frequency superpose in space, the resultant electric and magnetic field strength of any point of space and time is the sum of the respective fields of the two waves. When one forms the sum, both the magnitude and the direction of the fields need be considered, which means that they sum like vectors . In the special case when two equally strong waves have their fields in the same direction in space and time (i.e., when they are in phase), the resultant field is twice that of each individual wave. The resultant intensity, being proportional to the square of the field strength, is therefore not two but four times the intensity of each of the two superposing waves.",
  "By contrast, the superposition of a wave that has an electric field in one direction (positive) in space and time with a wave of the same frequency having an electric field in the opposite direction (negative) in space and time leads to cancellation and no resultant wave at all (zero intensity). Two waves of this sort are termed out of phase. The first example, that of in-phase superposition yielding four times the individual intensity, constitutes what is called constructive interference. The second example, that of out-of-phase superposition yielding zero intensity, is destructive interference. Since the resultant field at any point and time is the sum of all individual fields at that point and time, these arguments are easily extended to any number of superposing waves. One finds constructive, destructive, or partial interference for waves having the same frequency and given phase relationships.",
  "Once generated, an electromagnetic wave is self-propagating because a time-varying electric field produces a time-varying magnetic field and vice versa. When an oscillating current in an antenna is switched on for, say, eight minutes, then the beginning of the electromagnetic train reaches the Sun just when the antenna is switched off because it takes a few seconds more than eight minutes for electromagnetic radiation to reach the Sun . This eight-minute wave train, which is as long as the Sun–Earth distance, then continues to travel with the speed of light past the Sun into the space beyond.",
  "Except for radio waves transmitted by antennas that are switched on for many hours, most electromagnetic waves comes in many small pieces. The length and duration of a wave train are called coherence length and coherence time, respectively. Light from the Sun or from a lightbulb comes in many tiny bursts lasting about a millionth of a millionth of a second and having a coherence length of about one centimetre. The discrete radiant energy emitted by an atom as it changes its internal energy can have a coherence length several hundred times longer (one to 10 metres) unless the radiating atom is disturbed by a collision.",
  " The time and space at which the electric and magnetic fields have a maximum value or are zero between the reversal of their directions are different for different wave trains. It is therefore clear that the phenomenon of interference can arise only from the superposition of part of a wave train with itself. This can be accomplished, for instance, with a half-transparent mirror that reflects half the intensity and transmits the other half of each of the billion billion wave trains of a given light source, say, a yellow sodium discharge lamp . One can allow one of these half beams to travel in direction A and the other in direction B, as shown in Figure 4 . By reflecting each half beam back, one can then superpose the two half beams and observe the resultant total. If one half beam has to travel a path  1  2  wavelength or  3  2  or  5  2  wavelength longer than the other, then the superposition yields no light at all because the electric and magnetic fields of every half wave train in the two half beams point in opposite directions and their sum is therefore zero. The important point is that cancellation occurs between each half wave train and its mate. This is an example of destructive interference. By adjusting the path lengths A and B such that they are equal or differ by λ, 2λ, 3λ…, the electric and magnetic fields of each half wave train and its mate add when they are superposed. This is constructive interference, and, as a result, one sees strong light.",
  "The interferometer discussed above and represented in Figure 4 was designed by the American physicist Albert A. Michelson in 1880 (while he was studying with Hermann von Helmholtz in Berlin) for the purpose of measuring the effect on the speed of light of the motion of the ether through which light was believed to travel ( see below  The electromagnetic wave and field concept ).",
  "Electromagnetic radiation—or, in modern terminology, the photons  h ν—always travels in free space with the universal speed c —i.e., the speed of light. This is actually a very puzzling situation which was first experimentally verified by Michelson and Edward Williams Morley, another American scientist, in 1887. It is the basic axiom of Albert Einstein’s theory of relativity . Although there is no doubt that it is true, the situation is puzzling because it is so different from the behaviour of normal particles—that is to say, for little or not so little pieces of matter. When one chases behind a normal particle (e.g., an airplane) or moves from the opposite direction toward it, one certainly will measure very different speeds of the airplane relative to oneself. One would detect a very low relative speed in the first case and a very high one in the second. Moreover, a bullet shot forward from the airplane and another toward the back would appear to be moving with different speeds relative to oneself. This is not at all the case when one measures the speed of electromagnetic radiation: irrespective of one’s motion or that of the source of the electromagnetic radiation, any measurement by a moving observer will result in the universal speed of light. This must be accepted as a fact of nature.",
  "  What happens to pitch or frequency when the source is moving toward the observers or away from them? It has been established from sound waves that the frequency is higher when a sound source is moving toward the observers and lower when it is moving away from them. This is the Doppler effect , named after the Austrian physicist Christian Doppler , who first described the phenomenon in 1842. Doppler predicted that the effect also occurs with electromagnetic radiation and suggested that it be used for measuring the relative speeds of stars . This explains why a characteristic blue light emitted, for example, by an excited helium atom as it changes from a higher to a lower internal energy state no longer appears blue when one looks at this light coming from helium atoms that move very rapidly away from Earth with, say, a galaxy . When the speed of such a galaxy away from Earth is high, the light may appear yellow; if the speed is still higher, it may appear red or even infrared . Hence, the speed of galaxies as well as of stars relative to Earth is measured from the Doppler shift of characteristic atomic radiation energies h ν.",
  "  As one measures the relative speeds of galaxies by using the Doppler shift of characteristic radiation emissions, one finds that all galaxies are moving away from one another. Those that are moving the fastest are systems that are the farthest away ( Hubble’s law). The speeds and distances give the appearance of an explosion. This explosion, dubbed the big bang , is calculated to have occurred 13.8 billion years ago, which is considered to be the age of the universe . From this early stage onward, the universe expanded and cooled. The American scientists Robert W. Wilson and Arno Penzias determined in 1965 that the whole universe can be conceived of as an expanding blackbody filled with electromagnetic radiation which now corresponds to a temperature of 2.735 K, only a few degrees above absolute zero . Because of this low temperature, most of the radiation energy is in the microwave region of the electromagnetic spectrum. The intensity of this radiation corresponds, on average, to about 400 photons in every cubic centimetre of the universe. It has been estimated that there are about one billion times more photons in the universe than electrons, nuclei, and all other things taken together. The presence of this microwave cosmic background radiation supports the predictions of big-bang cosmology.",
  "The energy of the quanta of electromagnetic radiation is subject to gravitational forces just like a mass of magnitude m = h ν/ c  2 . This is so because the relationship of energy E and mass m is  E = m  c  2  . As a consequence, light traveling toward Earth gains energy and its frequency is shifted toward the blue (shorter wavelengths), whereas light traveling “up” loses energy and its frequency is shifted toward the red (longer wavelengths). These shifts are very small but have been detected by the American physicists Robert V. Pound and Glen A. Rebka.",
  "The effect of gravitation on light increases with the strength of the gravitational attraction. Thus, a light beam from a distant star does not travel along a straight line when passing a star like the Sun but is deflected toward it. This deflection can be strong around very heavy cosmic objects, which then distort the light path acting as a gravitational lens .",
  "Under extreme conditions the gravitational force of a cosmic object can be so strong that no electromagnetic radiation can escape the gravitational pull. Such an object, called a black hole , is therefore not visible, and its presence can be detected only by its gravitational effect on other, visible objects in its vicinity. (For additional information, see  astronomy .)",
  "The temperature of the terrestrial surface environment is controlled not only by the Sun’s electromagnetic radiation but also in a sensitive way by Earth’s atmosphere . As noted earlier, each substance absorbs and emits electromagnetic radiation of some energies h ν and does not do so in other ranges of energy. These regions of transparency and opaqueness are governed by the particular distribution of internal energies of the substance.",
  "  Earth’s atmosphere acts much like the glass panes of a greenhouse: it allows sunlight, particularly its visible range, to reach and warm Earth, but it largely inhibits the infrared radiation emitted by the heated terrestrial surface from escaping into space. Since the atmosphere becomes thinner and thinner with increasing altitude above Earth, there is less atmospheric absorption in the higher regions of the atmosphere. At an altitude of 100 km (62 miles), the fraction of atmosphere is one 10-millionth of that on the ground. Below 10 million hertz (10 7 Hz), the absorption is caused by the ionosphere , a layer in which atoms and molecules in the atmosphere are ionized by the Sun’s ultraviolet radiation . In the infrared region, the absorption is caused by molecular vibrations and rotations. In the ultraviolet and X-ray regions, the absorption is due to electronic excitations in atoms and molecules.",
  "Without water vapour and carbon dioxide (CO 2 ), which are, together with certain industrial pollutants, the main infrared-absorbing species in the atmosphere, Earth would experience the extreme temperature variations between night and day that occur on the Moon . Earth would then be a frozen planet, like Mars , with an average temperature of 200 K (−73 °C, or −100 °F), and not be able to support life. Scientists believe that Earth’s temperature and climate in general will be affected as the composition of the atmosphere is altered by an increased release and accumulation of carbon dioxide and other gaseous pollutants (for a detailed discussion, see  climate ; hydrosphere ; and global warming ).",
  "Electromagnetic radiation appears in a wide variety of forms and manifestations. Yet, these diverse phenomena are understood to comprise a single aspect of nature, following simple physical principles. Common to all forms is the fact that electromagnetic radiation interacts with and is generated by electric charges . The apparent differences in the phenomena arise from the question in which environment and under what circumstances can charges respond on the time scale of the frequency ν of the radiation.",
  "At smaller frequencies ν (smaller than 10 12 hertz), electric charges typically are the freely moving electrons in the metal components of antennas or the free electrons and ions in space that give rise to phenomena related to radio waves , radar waves, and microwaves . At higher frequencies (10 12 to 5 × 10 14 hertz), in the infrared region of the spectrum, the moving charges are primarily associated with the rotations and vibrations of molecules and the motions of atoms bonded together in materials. Electromagnetic radiation in the visible range to X-rays have frequencies that correspond to charges within atoms, whereas gamma rays are associated with frequencies of charges within atomic nuclei . The characteristics of electromagnetic radiation occurring in the different regions of the spectrum are described in this section.",
  "  Radio waves are used for wireless transmission of sound messages, or information, for communication, as well as for maritime and aircraft navigation. The information is imposed on the electromagnetic carrier wave as amplitude modulation (AM) or as frequency modulation (FM) or in digital form (pulse modulation). Transmission therefore involves not a single-frequency electromagnetic wave but rather a frequency band whose width is proportional to the information density. The width is about 10,000 Hz for telephone, 20,000 Hz for high-fidelity sound, and five megahertz (MHz = one million hertz) for high-definition television . This width and the decrease in efficiency of generating electromagnetic waves with decreasing frequency sets a lower frequency limit for radio waves near 10,000 Hz.",
  "Because electromagnetic radiation travels in free space in straight lines, late 19th-century scientists questioned the efforts of the Italian physicist and inventor Guglielmo Marconi to develop long-range radio. Earth’s curvature limits the line-of-sight distance from the top of a 100-metre (330-foot) tower to about 30 km (19 miles). Marconi’s unexpected success in transmitting messages over more than 2,000 km (1,200 miles) led to the discovery of the Kennelly-Heaviside layer, more commonly known as the ionosphere . This region is an approximately 300-km- (190-mile-) thick layer starting about 100 km (60 miles) above Earth’s surface in which the atmosphere is partially ionized by ultraviolet light from the Sun, giving rise to enough electrons and ions to affect radio waves. Because of the Sun’s involvement, the height, width, and degree of ionization of the stratified ionosphere vary from day to night and from summer to winter.",
  " Radio waves transmitted by antennas in certain directions are bent or even reflected back to Earth by the ionosphere, as illustrated in Figure 5 . They may bounce off Earth and be reflected by the ionosphere repeatedly, making radio transmission around the globe possible. Long-distance communication is further facilitated by the so-called ground wave. This form of electromagnetic wave closely follows Earth’s surface, particularly over water, as a result of the wave’s interaction with the terrestrial surface. The range of the ground wave (up to 1,600 km [1,000 miles]) and the bending and reflection of the sky wave by the ionosphere depend on the frequency of the waves. Under normal ionospheric conditions 40 MHz is the highest-frequency radio wave that can be reflected from the ionosphere. In order to accommodate the large band width of transmitted signals, television frequencies are necessarily higher than 40 MHz. Television transmitters must therefore be placed on high towers or on hilltops.",
  "As a radio wave travels from the transmitting to the receiving antenna, it may be disturbed by reflections from buildings and other large obstacles. Disturbances arise when several such reflected parts of the wave reach the receiving antenna and interfere with the reception of the wave. Radio waves can penetrate nonconducting materials, such as wood , bricks , and concrete , fairly well. They cannot pass through electrical conductors, such as water or metals. Above ν = 40 MHz, radio waves from deep space can penetrate Earth’s atmosphere. This makes radio-astronomy observations with ground-based telescopes possible.",
  "Whenever transmission of electromagnetic energy from one location to another is required with minimal energy loss and disturbance, the waves are confined to a limited region by means of wires, coaxial cables, and, in the microwave region, waveguides . Unguided or wireless transmission is naturally preferred when the locations of receivers are unspecified or too numerous, as in the case of radio and television communications. Cable television , as the name implies, is an exception. In this case electromagnetic radiation is transmitted by a coaxial cable system to users either from a community antenna or directly from broadcasting stations. The shielding of this guided transmission from disturbances provides high-quality signals.",
  " E B  Figure 6 shows the electric field  E (solid lines) and the magnetic field  B (dashed lines) of an electromagnetic wave guided by a coaxial cable. There is a potential difference between the inner and outer conductors and so electric field lines E extend from one conductor to the other, represented here in cross section. The conductors carry opposite currents that produce the magnetic field lines B. The electric and magnetic fields are perpendicular to each other and perpendicular to the direction of propagation, as is characteristic of the electromagnetic waves illustrated in Figure 2 . At any cross section viewed, the directions of the E and B field lines change to their opposite with the frequency ν of the radiation. This direction reversal of the fields does not change the direction of propagation along the conductors. The speed of propagation is again the universal speed of light if the region between the conductors consists of air or free space.",
  "A combination of radio waves and strong magnetic fields is used by magnetic resonance imaging (MRI) to produce diagnostic pictures of parts of the human body and brain without apparent harmful effects. This imaging technique has thus found increasingly wider application in medicine ( see also  radiation ).",
  "Extremely low-frequency (ELF) waves are of interest for communications systems for submarines . The relatively weak absorption by seawater of electromagnetic radiation at low frequencies and the existence of prominent resonances of the natural cavity formed by Earth and the ionosphere make the range between 5 and 100 Hz attractive for this application.",
  "The microwave region extends from 1,000 to 300,000 MHz (or 30 cm to 1 mm wavelength). Although microwaves were first produced and studied in 1886 by Hertz , their practical application had to await the invention of suitable generators, such as the klystron and magnetron .",
  "Microwaves are the principal carriers of high-speed data transmissions between stations on Earth and also between ground-based stations and satellites and space probes. A system of synchronous satellites about 36,000 km above Earth is used for international broadband of all kinds of communications—e.g., television and telephone .",
  "Microwave transmitters and receivers are parabolic dish antennas. They produce microwave beams whose spreading angle is proportional to the ratio of the wavelength of the constituent waves to the diameter of the dish. The beams can thus be directed like a searchlight. Radar beams consist of short pulses of microwaves. One can determine the distance of an airplane or ship by measuring the time it takes such a pulse to travel to the object and, after reflection, back to the radar dish antenna. Moreover, by making use of the change in frequency of the reflected wave pulse caused by the Doppler effect ( see above  Speed of electromagnetic radiation and the Doppler effect ), one can measure the speed of objects. Microwave radar is therefore widely used for guiding airplanes and vessels and for detecting speeding motorists. Microwaves can penetrate clouds of smoke but are scattered by water droplets, so they are used for mapping meteorologic disturbances and in weather forecasting .",
  "Microwaves play an increasingly wide role in heating and cooking food . They are absorbed by water and fat in foodstuffs (e.g., in the tissue of meats) and produce heat from the inside. In most cases, this reduces the cooking time a hundredfold. Such dry objects as glass and ceramics , on the other hand, are not heated in the process, and metal foils are not penetrated at all.",
  "The heating effect of microwaves destroys living tissue when the temperature of the tissue exceeds 43° C (109° F). Accordingly, exposure to intense microwaves in excess of 20 milliwatts of power per square centimetre of body surface is harmful. The lens of the human eye is particularly affected by waves with a frequency of 3000 MHz, and repeated and extended exposure can result in cataracts . Radio waves and microwaves of far less power (microwatts per square centimetre) than the 10–20 milliwatts per square centimetre needed to produce heating in living tissue can have adverse effects on the electrochemical balance of the brain and the development of a fetus if these waves are modulated or pulsed at low frequencies between 5 and 100 hertz, which are of the same magnitude as brain wave frequencies.",
  "Various types of microwave generators and amplifiers have been developed. Vacuum-tube devices, the klystron and the magnetron , continue to be used on a wide scale, especially for higher-power applications. Klystrons are primarily employed as amplifiers in radio relay systems and for dielectric heating, while magnetrons have been adopted for radar systems and microwave ovens. (For a detailed discussion of these devices, see  electron tube .) Solid-state technology has yielded several devices capable of producing, amplifying, detecting, and controlling microwaves. Notable among these are the Gunn diode and the tunnel (or Esaki) diode. Another type of device, the maser (acronym for “ m icrowave a mplification by s timulated e mission of r adiation”) has proved useful in such areas as radio astronomy, microwave radiometry, and long-distance communications.",
  "Astronomers have discovered what appears to be natural masers in some interstellar clouds . Observations of radio radiation from interstellar hydrogen (H 2 ) and certain other molecules indicate amplification by the maser process. Also, as was mentioned above, microwave cosmic background radiation has been detected and is considered by many to be the remnant of the primeval fireball postulated by the big-bang cosmological model .",
  "Beyond the red end of the visible range but at frequencies higher than those of radar waves and microwaves is the infrared region of the electromagnetic spectrum, between frequencies of 10 12 and 5 × 10 14 Hz (or wavelengths from 0.1 to 7.5 × 10 −5 cm). William Herschel , a German-born British musician and self-taught astronomer, discovered this form of radiation in 1800 by exploring, with the aid of a thermometer , sunlight dispersed into its colours by a glass prism. Infrared radiation is absorbed and emitted by the rotations and vibrations of chemically bonded atoms or groups of atoms and thus by many kinds of materials. For instance, window glass that is transparent to visible light absorbs infrared radiation by the vibration of its constituent atoms. Infrared radiation is strongly absorbed by water , as shown in, and by the atmosphere . Although invisible to the eye , infrared radiation can be detected as warmth by the skin. Nearly 50 percent of the Sun’s radiant energy is emitted in the infrared region of the electromagnetic spectrum, with the rest primarily in the visible region.",
  "  Atmospheric haze and certain pollutants that scatter visible light are nearly transparent to parts of the infrared spectrum because the scattering efficiency increases with the fourth power of the frequency. Infrared photography of distant objects from the air takes advantage of this phenomenon. For the same reason, infrared astronomy enables researchers to observe cosmic objects through large clouds of interstellar dust that scatter infrared radiation substantially less than visible light. However, since water vapour, ozone , and carbon dioxide in the atmosphere absorb large parts of the infrared spectrum, many infrared astronomical observations are carried out at high altitude by balloons , rockets , aircraft, or spacecraft.",
  "An infrared photograph of a landscape enhances objects according to their heat emission: blue sky and water appear nearly black, whereas green foliage and unexposed skin show up brightly. Infrared photography can reveal pathological tissue growths (thermography) and defects in electronic systems and circuits due to their increased emission of heat.",
  "The infrared absorption and emission characteristics of molecules and materials yield important information about the size, shape, and chemical bonding of molecules and of atoms and ions in solids. The energies of rotation and vibration are quantized in all systems. The infrared radiation energy h ν emitted or absorbed by a given molecule or substance is therefore a measure of the difference of some of the internal energy states. These in turn are determined by the atomic weight and molecular bonding forces. For this reason, infrared spectroscopy is a powerful tool for determining the internal structure of molecules and substances or, when such information is already known and tabulated, for identifying the amounts of those species in a given sample. Infrared spectroscopic techniques are often used to determine the composition and hence the origin and age of archaeological specimens and for detecting forgeries of art and other objects, which, when inspected under visible light, resemble the originals.",
  "Infrared radiation plays an important role in heat transfer and is integral to the so-called greenhouse effect ( see above  The greenhouse effect of the atmosphere ), influencing the thermal radiation budget of Earth on a global scale and affecting nearly all biospheric activity. Virtually every object at Earth’s surface emits electromagnetic radiation primarily in the infrared region of the spectrum.",
  "Artificial sources of infrared radiation include, besides hot objects, infrared light-emitting diodes (LEDs) and lasers . LEDs are small inexpensive optoelectronic devices made of such semiconducting materials as gallium arsenide. Infrared LEDs are employed as optoisolators and as light sources in some fibre-optics -based communications systems. Powerful optically pumped infrared lasers have been developed by using carbon dioxide and carbon monoxide . Carbon dioxide infrared lasers are used to induce and alter chemical reactions and in isotope separation. They also are employed in lidar systems. Other applications of infrared light include its use in the range finders of automatic self-focusing cameras, security alarm systems, and night-vision optical instruments.",
  "Instruments for detecting infrared radiation include heat-sensitive devices such as thermocouple detectors, bolometers (some of these are cooled to temperatures close to absolute zero so that the thermal radiation of the detector system itself is greatly reduced), photovoltaic cells, and photoconductors. The latter are made of semiconductor materials (e.g., silicon and lead sulfide) whose electrical conductance increases when exposed to infrared radiation.",
  "Visible light is the most familiar form of electromagnetic radiation and makes up that portion of the spectrum to which the eye is sensitive. This span is very narrow; the frequencies of violet light are only about twice those of red. The corresponding wavelengths extend from 7 × 10 −5 cm (red) to 4 × 10 −5 cm (violet). The energy of a photon from the centre of the visible spectrum (yellow) is h ν = 2.2 eV. This is one million times larger than the energy of a photon of a television wave and one billion times larger than that of radio waves in general ( see  Figure 1 ).",
  " Life on Earth could not exist without visible light, which represents the peak of the Sun’s spectrum and close to one-half of all of its radiant energy. Visible light is essential for photosynthesis , which enables plants to produce the carbohydrates and proteins that are the food sources for animals . Coal and oil are sources of energy accumulated from sunlight in plants and microorganisms millions of years ago, and hydroelectric power is extracted from one step of the hydrologic cycle kept in motion by sunlight at the present time.",
  "Considering the importance of visible sunlight for all aspects of terrestrial life, one cannot help being awed by the absorption spectrum of water in . The remarkable transparency of water centred in the narrow regime of visible light, indicated by vertical dashed lines in, is the result of the characteristic distribution of internal energy states of water. Absorption is strong toward the infrared on account of molecular vibrations and intermolecular oscillations. In the ultraviolet region, absorption of radiation is caused by electronic excitations. Light of frequencies having absorption coefficients larger than α = 10 cm −1 cannot even reach the retina of the human eye , because its constituent liquid consists mainly of water that absorbs such frequencies of light.",
  "Since the 1970s an increasing number of devices have been developed for converting sunlight into electricity. Unlike various conventional energy sources, solar energy does not become depleted by use and does not pollute the environment. Two branches of development may be noted—namely, photothermal and photovoltaic technologies. In photothermal devices, sunlight is used to heat a substance, as, for example, water, to produce steam with which to drive a generator. Photovoltaic devices, on the other hand, convert the energy in sunlight directly to electricity by use of the photovoltaic effect in a semiconductor junction. Solar panels consisting of photovoltaic devices made of gallium arsenide have conversion efficiencies of more than 20 percent and are used to provide electric power in many satellites and space probes. Solar cells have replaced dry-cell batteries in some portable electronic instruments, and solar energy power stations of more than 500 megawatts capacity have been built.",
  "The intensity and spectral composition of visible light can be measured and recorded by essentially any process or property that is affected by light. Detectors make use of a photographic process based on silver halide, the photoemission of electrons from metal surfaces, the generation of electric current in a photovoltaic cell, and the increase in electrical conduction in semiconductors.",
  "Glass fibres constitute an effective means of guiding and transmitting light. A beam of light is confined by total internal reflection to travel inside such an optical fibre, whose thickness may be anywhere between one hundredth of a millimetre and a few millimetres. Many thin optical fibres can be combined into bundles to achieve image reproduction. The flexibility of these fibres or fibre bundles permits their use in medicine for optical exploration of internal organs. Optical fibres connecting the continents provide the capability to transmit substantially larger amounts of information than other systems of international telecommunications . Another advantage of optical fibre communication systems is that transmissions cannot easily be intercepted and are not disturbed by lower atmospheric and stratospheric disturbances.",
  "Optical fibres integrated with miniature semiconductor lasers and light-emitting diodes, as well as with light detector arrays and photoelectronic imaging and recording materials, form the building blocks of a new optoelectronics industry. Some familiar commercial products are optoelectronic copying machines, laser printers, compact disc players, optical recording media, and optical disc mass-storage systems of exceedingly high bit density.",
  "The German physicist Johann Wilhelm Ritter , having learned of Herschel’s discovery of infrared waves , looked beyond the violet end of the visible spectrum of the Sun and found (in 1801) that there exist invisible rays that darken silver chloride even more efficiently than visible light. This spectral region extending between visible light and X-rays is designated ultraviolet. Sources of this form of electromagnetic radiation are hot objects like the Sun, synchrotron radiation sources, mercury or xenon arc lamps, and gaseous discharge tubes filled with gas  atoms (e.g., mercury, deuterium , or hydrogen ) that have internal electron energy levels which correspond to the photons of ultraviolet light.",
  "When ultraviolet light strikes certain materials, it causes them to fluoresce —i.e., they emit electromagnetic radiation of lower energy, such as visible light. The spectrum of fluorescent light is characteristic of a material’s composition and thus can be used for screening minerals , detecting bacteria in spoiled food, identifying pigments , or detecting forgeries of artworks and other objects (the aged surfaces of ancient marble sculptures, for instance, fluoresce yellow-green, whereas a freshly cut marble surface fluoresces bright violet).",
  "Optical instruments for the ultraviolet region are made of special materials, such as quartz , certain silicates , and metal fluorides, which are transparent at least in the near ultraviolet. Far-ultraviolet radiation is absorbed by nearly all gases and materials and thus requires reflection optics in vacuum chambers.",
  "Ultraviolet radiation is detected by photographic plates and by means of the photoelectric effect in photomultiplier tubes . Also, ultraviolet radiation can be converted to visible light by fluorescence before detection.",
  "The relatively high energy of ultraviolet light gives rise to certain photochemical reactions . This characteristic is exploited to produce cyanotype impressions on fabrics and for blueprinting design drawings. Here, the fabric or paper is treated with a mixture of chemicals that react upon exposure to ultraviolet light to form an insoluble blue compound. Electronic excitations caused by ultraviolet radiation also produce changes in the colour and transparency of photosensitive and photochromic glasses. Photochemical and photostructural changes in certain polymers constitute the basis for photolithography and the processing of the microelectronic circuits.",
  "Although invisible to the eyes of humans and most vertebrates , near-ultraviolet light can be seen by many insects . Butterflies and many flowers that appear to have identical colour patterns under visible light are distinctly different when viewed under the ultraviolet rays perceptible to insects.",
  "An important difference between ultraviolet light and electromagnetic radiation of lower frequencies is the ability of the former to ionize, meaning that it can knock an electron out from atoms and molecules. All high-frequency electromagnetic radiation beyond the visible—i.e., ultraviolet light, X-rays, and gamma rays—is ionizing and therefore harmful to body tissues , living cells , and DNA (deoxyribonucleic acid). The harmful effects of ultraviolet light to humans and larger animals are mitigated by the fact that this form of radiation does not penetrate much further than the skin .",
  "The body of a sunbather is struck by 10 21 photons every second, and 1 percent of these, or more than a billion billion per second, are photons of ultraviolet radiation. Tanning and natural body pigments help to protect the skin to some degree, preventing the destruction of skin cells by ultraviolet light. Nevertheless, overexposure to the ultraviolet component of sunlight can cause skin cancer , cataracts of the eyes, and damage to the body’s immune system . Fortunately, a layer of ozone (O 3 ) in the stratosphere absorbs the most-damaging ultraviolet rays, which have wavelengths of 2000 and 2900 angstroms (one angstrom [Å] = 10 −10 metre), and attenuates those with wavelengths between 2900 and 3150 Å. Without this protective layer of ozone, life on Earth would not be possible. The ozone layer is produced at an altitude of about 10 to 50 km (6 to 30 miles) above Earth’s surface by a reaction between upward-diffusing molecular oxygen (O 2 ) and downward-diffusing ionized atomic oxygen (O + ). In the late 20th century this life-protecting stratospheric ozone layer was reduced by chlorine atoms in chlorofluorocarbon (or Freon ) gases released into the atmosphere by aerosol propellants, air-conditioner coolants, solvents used in the manufacture of electronic components, and other sources. Limits were placed on the sale of ozone-depleting chemicals, and the ozone layer was expected to recover eventually.",
  "Ionized atomic oxygen, nitrogen , and nitric oxide are produced in the upper atmosphere by absorption of solar ultraviolet radiation. This ionized region is the ionosphere , which affects radio communications and reflects and absorbs radio waves of frequencies below 40 MHz.",
  "  The German physicist Wilhelm Conrad Röntgen discovered X-rays in 1895 by accident while studying cathode rays in a low-pressure gas discharge tube. (A few years later J.J. Thomson of England showed that cathode rays were electrons emitted from the negative electrode [cathode] of the discharge tube.) Röntgen noticed the fluorescence of a barium platinocyanide screen that happened to lie near the discharge tube. He traced the source of the hitherto undetected form of radiation to the point where the cathode rays hit the wall of the discharge tube, and he mistakenly concluded from his inability to observe reflection or refraction that his new rays were unrelated to light. Because of his uncertainty about their nature, he called them X-radiation. This early failure can be attributed to the very short wavelengths of X-rays (10 −8 to 10 −11 cm), which correspond to photon energies from 200 to 100,000 eV. In 1912 another German physicist, Max von Laue , realized that the regular arrangement of atoms in crystals should provide a natural grating of the right spacing (about 10 −8 cm) to produce an interference pattern on a photographic plate when X-rays pass through such a crystal. The success of this experiment, carried out by Walter Friedrich and Paul Knipping, not only identified X-rays with electromagnetic radiation but also initiated the use of X-rays for studying the detailed atomic structure of crystals. The interference of X-rays diffracted in certain directions from crystals in so-called X-ray diffractometers, in turn, permits the dissection of X-rays into their different frequencies, just as a prism diffracts and spreads the various colours of light. The spectral composition and characteristic frequencies of X-rays emitted by a given X-ray source can thus be measured. As in optical spectroscopy , the X-ray photons emitted correspond to the differences of the internal electronic energies in atoms and molecules. Because of their much higher energies, however, X-ray photons are associated with the inner-shell electrons close to the atomic nuclei , whereas optical absorption and emission are related to the outermost electrons in atoms or in materials in general. Since the outer electrons are used for chemical bonding while the energies of inner-shell electrons remain essentially unaffected by atomic bonding, the identity and quantity of elements that make up a material are more accurately determined by the emission, absorption, or fluorescence of X-rays than of photons of visible or ultraviolet light.",
  "The contrast between body parts in medical X-ray photographs (radiographs) is produced by the different scattering and absorption of X-rays by bones and tissues . Within months of Röntgen’s discovery of X-rays and his first X-ray photograph of his wife’s hand, this form of electromagnetic radiation became indispensable in orthopedic and dental medicine. The use of X-rays for obtaining images of the body’s interior has undergone considerable development over the years and has culminated in the highly sophisticated procedure known as computed tomography (CAT; see  radiation ).",
  "Notwithstanding their usefulness in medical diagnosis, the ability of X-rays to ionize atoms and molecules and their penetrating power make them a potential health hazard. Exposure of body cells and tissue to large doses of such ionizing radiation can result in abnormalities in DNA that may lead to cancer and birth defects . (For a detailed treatment of the effects of X-rays and other forms of ionizing radiation on human health and the levels of such radiation encountered in daily life, see  radiation: Biological effects of ionizing radiation. )",
  "X-rays are produced in X-ray tubes by the deceleration of energetic electrons ( bremsstrahlung ) as they hit a metal target or by accelerating electrons moving at relativistic velocities in circular orbits ( synchrotron radiation ; see above  Continuous spectra of electromagnetic radiation ). They are detected by their photochemical action in photographic emulsions or by their ability to ionize gas atoms. Every X-ray photon produces a burst of electrons and ions , resulting in a current pulse. By counting the rate of such current pulses per second, the intensity of a flux of X-rays can be measured. Instruments used for this purpose are called Geiger counters .",
  " X-ray astronomy has revealed very strong sources of X-rays in deep space. In the Milky Way Galaxy , of which the solar system is a part, the most-intense sources are certain double-star systems in which one of the two stars is thought to be either a compact neutron star or a black hole . The ionized gas of the circling companion star falls by gravitation into the compact star, generating X-rays that may be more than 1,000 times as intense as the total amount of light emitted by the Sun . At the moment of their explosion, supernovae emit a good fraction of their energy in a burst of X-rays.",
  "Six years after the discovery of radioactivity (1896) by Henri Becquerel of France, the New Zealand-born British physicist Ernest Rutherford found that three different kinds of radiation are emitted in the decay of radioactive substances; these he called alpha , beta , and gamma rays in sequence of their ability to penetrate matter. The alpha particles were found to be identical with the nuclei of helium  atoms , and the beta rays were identified as electrons . In 1912 it was shown that the much more penetrating gamma rays have all the properties of very energetic electromagnetic radiation, or photons. Gamma-ray photons are between 10,000 and 10,000,000 times more energetic than the photons of visible light when they originate from radioactive atomic nuclei. Gamma rays with a million million times higher energy make up a very small part of the cosmic rays that reach Earth from supernovae or from other galaxies . The origin of the most-energetic gamma rays is not yet known.",
  " 24 24 During radioactive decay, an unstable nucleus usually emits alpha particles, electrons, gamma rays, and neutrinos spontaneously. In nuclear fission , the unstable nucleus breaks into fragments, which are themselves complex nuclei, along with such particles as neutrons and protons . The resultant stable nuclei or nuclear fragments are usually in a highly excited state and then reach their low-energy ground state by emitting one or more gamma rays. Such a decay scheme is shown schematically in Figure 7 for the unstable nucleus sodium -24 ( 24 Na). Much of what is known about the internal structure and energies of nuclei has been obtained from the emission or resonant absorption of gamma rays by nuclei. Absorption of gamma rays by nuclei can cause them to eject neutrons or alpha particles or it can even split a nucleus like a bursting bubble in what is called photodisintegration. A gamma particle hitting a hydrogen nucleus (that is, a proton), for example, produces a positive pi-meson and a neutron or a neutral pi-meson and a proton. Neutral pi-mesons, in turn, have a very brief mean life of 1.8 × 10 −16 second and decay into two gamma rays of energy h ν ≈ 70 MeV. When an energetic gamma ray h ν > 1.02 MeV passes a nucleus, it may disappear while creating an electron– positron pair. Gamma photons interact with matter by discrete elementary processes that include resonant absorption, photodisintegration, ionization, scattering ( Compton scattering ), or pair production.",
  "Gamma rays are detected by their ability to ionize gas atoms or to create electron–hole pairs in semiconductors or insulators . By counting the rate of charge pulses or voltage pulses or by measuring the scintillation of the light emitted by the subsequently recombining electron–hole pairs, one can determine the number and energy of gamma rays striking an ionization detector or scintillation counter .",
  "Both the specific energy of the gamma-ray photon emitted as well as the half-life of the specific radioactive decay process that yields the photon identify the type of nuclei at hand and their concentrations. By bombarding stable nuclei with neutrons, one can artificially convert more than 70 different stable nuclei into radioactive nuclei and use their characteristic gamma emission for purposes of identification, for impurity analysis of metallurgical specimens (neutron-activation analysis), or as radioactive tracers with which to determine the functions or malfunctions of human organs, to follow the life cycles of organisms, or to determine the effects of chemicals on biological systems and plants .",
  "The great penetrating power of gamma rays stems from the fact that they have no electric charge and thus do not interact with matter as strongly as do charged particles. Because of their penetrating power gamma rays can be used for radiographing holes and defects in metal castings and other structural parts. At the same time, this property makes gamma rays extremely hazardous. The lethal effect of this form of ionizing radiation makes it useful for sterilizing medical supplies that cannot be sanitized by boiling or for killing organisms that cause food spoilage. More than 50 percent of the ionizing radiation to which humans are exposed comes from natural radon gas, which is an end product of the radioactive decay chain of natural radioactive substances in minerals. Radon escapes from the ground and enters the environment in varying amounts.",
  "The classical electromagnetic radiation theory “remains for all time one of the greatest triumphs of human intellectual endeavor.” So said Max Planck in 1931, commemorating the 100th anniversary of the birth of the Scottish physicist James Clerk Maxwell , the prime originator of this theory. The theory was indeed of great significance, for it not only united the phenomena of electricity , magnetism , and light in a unified framework but also was a fundamental revision of the then-accepted Newtonian way of thinking about the forces in the physical universe. The development of the classical radiation theory constituted a conceptual revolution that lasted for nearly half a century. It began with the seminal work of the British physicist and chemist Michael Faraday , who published his article “Thoughts on Ray Vibrations” in Philosophical Magazine in May 1846, and came to fruition in 1888 when Hertz succeeded in generating electromagnetic waves at radio and microwave frequencies and measuring their properties.",
  "The Newtonian view of the universe may be described as a mechanistic interpretation. All components of the universe, small or large, obey the laws of mechanics , and all phenomena are in the last analysis based on matter in motion. A conceptual difficulty in Newtonian mechanics, however, is the way in which the gravitational force between two massive objects acts over a distance across empty space. Newton did not address this question, but many of his contemporaries hypothesized that the gravitational force was mediated through an invisible and frictionless medium which Aristotle had called the ether (or aether). The problem is that everyday experience of natural phenomena shows mechanical things to be moved by forces which make contact. Any cause and effect without a discernible contact, or “action at a distance,” contradicts common sense and has been an unacceptable notion since antiquity. Whenever the nature of the transmission of certain actions and effects over a distance was not yet understood, the ether was resorted to as a conceptual solution of the transmitting medium. By necessity, any description of how the ether functioned remained vague, but its existence was required by common sense and thus not questioned.",
  "In Newton’s day, light was one phenomenon, besides gravitation, whose effects were apparent at large distances from its source. Newton contributed greatly to the scientific knowledge of light. His experiments revealed that white light is a composite of many colours, which can be dispersed by a prism and reunited to again yield white light. The propagation of light along straight lines convinced him that it consists of tiny particles which emanate at high or infinite speed from the light source. The first observation from which a finite speed of light was deduced was made soon thereafter, in 1676, by the Danish astronomer Ole Rømer ( see below  Speed of light ).",
  "Observations of two phenomena strongly suggested that light propagates as waves. One of these involved interference by thin films, which was discovered in England independently by Robert Boyle and Robert Hooke . The other had to do with the diffraction of light in the geometric shadow of an opaque screen. The latter was also discovered by Hooke, who published a wave theory of light in 1665 to explain it.",
  "The Dutch scientist Christiaan Huygens greatly improved the wave theory and explained reflection and refraction in terms of what is now called Huygens’ principle. According to this principle (published in 1690), each point on a wave front in the hypothetical ether or in an optical medium is a source of a new spherical light wave and the wave front is the envelope of all the individual wavelets that originate from the old wave front.",
  "In 1669 another Danish scientist, Erasmus Bartholin , discovered the polarization of light by double refraction in Iceland spar ( calcite ). This finding had a profound effect on the conception of the nature of light. At that time, the only waves known were those of sound , which are longitudinal. It was inconceivable to both Newton and Huygens that light could consist of transverse waves in which vibrations are perpendicular to the direction of propagation. Huygens gave a satisfactory account of double refraction by proposing that the asymmetry of the structure of Iceland spar causes the secondary wavelets to be ellipsoidal instead of spherical in his wave front construction. Since Huygens believed in longitudinal waves, he failed, however, to understand the phenomena associated with polarized light. Newton, on the other hand, used these phenomena as the bases for an additional argument for his corpuscular theory of light. Particles, he argued in 1717, have “sides” and can thus exhibit properties that depend on the directions perpendicular to the direction of motion.",
  "It may be surprising that Huygens did not make use of the phenomenon of interference to support his wave theory; but for him waves were actually pulses instead of periodic waves with a certain wavelength. One should bear in mind that the word wave may have a very different conceptual meaning and convey different images at various times to different people.",
  "It took nearly a century before a new wave theory was formulated by the physicists Thomas Young of England and Augustin-Jean Fresnel of France. Based on his experiments on interference , Young realized for the first time that light is a transverse wave. Fresnel then succeeded in explaining all optical phenomena known at the beginning of the 19th century with a new wave theory. No proponents of the corpuscular light theory remained. Nonetheless, it is always satisfying when a competing theory is discarded on grounds that one of its principal predictions is contradicted by experiment. The corpuscular theory explained the refraction of light passing from a medium of given density to a denser one in terms of the attraction of light particles into the latter. This means the light velocity should be larger in the denser medium. Huygens’ construction of wave fronts waving across the boundary between two optical media predicted the opposite—that is to say, a smaller light velocity in the denser medium. The measurement of the light velocity in air and water by Armand-Hippolyte-Louis Fizeau and independently by Léon Foucault during the mid-19th century decided the case in favour of the wave theory ( see below  Speed of light ).",
  "The transverse wave nature of light implied that the ether must be a solid elastic medium. The larger velocity of light suggested, moreover, a great elastic stiffness of this medium. Yet, it was recognized that all celestial bodies move through the ether without encountering such difficulties as friction. These conceptual problems remained unsolved until the beginning of the 20th century.",
  "As early as 1760 the Swiss-born mathematician Leonhard Euler suggested that the same ether that propagates light is responsible for electrical phenomena. In comparison with both mechanics and optics , however, the science of electricity was slow to develop. Magnetism was the one science that made progress in the Middle Ages , following the introduction from China into the West of the magnetic compass , but electromagnetism played little part in the scientific revolution of the 17th century. It was, however, the only part of physics in which very significant progress was made during the 18th century. By the end of that century the laws of electrostatics—the behaviour of charged particles at rest—were well known, and the stage was set for the development of the elaborate mathematical description first made by the French mathematician Siméon-Denis Poisson . There was no apparent connection of electricity with magnetism, except that magnetic poles, like electric charges , attract and repel with an inverse-square law force.",
  "Following the discoveries in electrochemistry (the chemical effects of electrical current ) by the Italian investigators Luigi Galvani , a physiologist, and Alessandro Volta , a physicist, interest turned to current electricity. A search was made by the Danish physicist Hans Christian Ørsted for some connection between electric currents and magnetism , and during the winter of 1819–20 he observed the effect of a current on a magnetic needle. Members of the French Academy learned about Ørsted’s discovery in September 1820, and several of them began to investigate it further. Of these, the most thorough in both experiment and theory was the physicist André-Marie Ampère , who may be called the father of electrodynamics.",
  "The list of four fundamental empirical laws of electricity and magnetism was made complete with the discovery of electromagnetic induction by Faraday in 1831. In brief, a change in magnetic flux through a conducting circuit produces a current in the circuit. The observation that the induced current is in a direction to oppose the change that produces it, now known as Lenz’s law , was formulated by a Russian-born physicist, Heinrich Friedrich Emil Lenz, in 1834. When the laws were put into mathematical form by Maxwell, the law of induction was generalized to include the production of electric force in space, independent of actual conducting circuits, but was otherwise unchanged. On the other hand, Ampère’s law describing the magnetic effect of a current required amendment in order to be consistent with the conservation of charge (the total charge must remain constant) in the presence of changing electric fields, and Maxwell introduced the idea of “displacement current” to make the set of equations logically consistent. As a result, he found on combining the equations that he arrived at a wave equation, according to which transverse electric and magnetic disturbances were propagated with a velocity that could be calculated from electrical measurements. These measurements were available to Maxwell, having been made in 1856 by the German physicists Rudolph Hermann Arndt Kohlrausch and Wilhelm Eduard Weber , and his calculation gave him a result that was the same, within the limits of error, as the speed of light in vacuum. It was the coincidence of this value with the velocity of the waves predicted by his theory that convinced Maxwell of the electromagnetic nature of light.",
  "Faraday introduced the concept of field and of field lines of force that exist outside material bodies. As he explained it, the region around and outside a magnet or an electric charge contains a field that describes at any location the force experienced by another small magnet or charge placed there. The lines of force around a magnet can be made visible by iron filings sprayed on a paper that is held over the magnet. The concept of field, specifying as it does a certain possible action or force at any location in space, was the key to understanding electromagnetic phenomena. It should be mentioned parenthetically that the field concept also plays (in varied forms) a pivotal role in modern theories of particles and forces.",
  "Besides introducing this important concept of electric and magnetic field lines of force, Faraday had the extraordinary insight that electrical and magnetic actions are not transmitted instantaneously but after a certain lag in time, which increases with distance from the source. Moreover, he realized the connection between magnetism and light after observing that a substance such as glass can rotate the plane of polarization of light in the presence of a magnetic field. This remarkable phenomenon is known as the Faraday effect .",
  "As noted above, Maxwell formulated a quantitative theory that linked the fundamental phenomena of electricity and magnetism and that predicted electromagnetic waves propagating with a speed, which, as well as one could determine at that time, was identical with the speed of light. He concluded his paper “On the Physical Lines of Force” (1861–62) by saying that electricity may be disseminated through space with properties identical with those of light. In 1864 Maxwell wrote that the numerical factor linking the electrostatic and the magnetic units was very close to the speed of light and that these results “show that light and magnetism are affections of the same substance, and that light is an electromagnetic disturbance propagated through the field according to [his] electromagnetic laws.”",
  "What more was needed to convince the scientific community that the mystery of light was solved and the phenomena of electricity and magnetism were unified in a grand theory? Why did it take 25 more years for Maxwell’s theory to be accepted? For one, there was little direct proof of the new theory. Furthermore, Maxwell not only had adopted a complicated formalism but also explained its various aspects by unusual mechanical concepts. Even though he stated that all such phrases are to be considered as illustrative and not as explanatory, the French mathematician Henri Poincaré remarked in 1899 that the “complicated structure” which Maxwell attributed to the ether “rendered his system strange and unattractive.”",
  "The ideas of Faraday and Maxwell that the field of force has a physical existence in space independent of material media were too new to be accepted without direct proof. On the Continent, particularly in Germany, matters were further complicated by the success of Carl Friedrich Gauss and Wilhelm Eduard Weber in developing a potential field theory for the phenomena of electrostatics and magnetostatics and their continuing effort to extend this formalism to electrodynamics.",
  "It is difficult in hindsight to appreciate the reluctance to accept the Faraday–Maxwell theory. The impasse was finally removed by Hertz’s work. In 1884 Hertz derived Maxwell’s theory by a new method and put its fundamental equations into their present-day form. In so doing, he clarified the equations, making the symmetry of electric and magnetic fields apparent. The German physicist Arnold Sommerfeld spoke for most of his learned colleagues when, after reading Hertz’s paper, he remarked, “the shades fell from my eyes,” and admitted that he understood electromagnetic theory for the first time. Four years later, Hertz made a second major contribution: he succeeded in generating electromagnetic radiation of radio and microwave frequencies, measuring their speed by a standing-wave method and proving that these waves have the properties of reflection , diffraction , refraction , and interference common to light. He showed that such electromagnetic waves can be polarized, that the electric and magnetic fields oscillate in directions that are mutually perpendicular and transverse to the direction of motion, and that their velocity is the same as the speed of light, as predicted by Maxwell’s theory.",
  "Hertz’s ingenious experiments not only settled the theoretical misconceptions in favour of Maxwell’s electromagnetic field theory but also opened the way for building transmitters, antennas , coaxial cables , and detectors for radio-frequency electromagnetic radiation. In 1896 Marconi received the first patent for wireless telegraphy, and in 1901 he achieved transatlantic radio communication.",
  "The Faraday–Maxwell–Hertz theory of electromagnetic radiation, which is commonly referred to as Maxwell’s theory, makes no reference to a medium in which the electromagnetic waves propagate. A wave of this kind is produced, for example, when a line of charges is moved back and forth along the line. Moving charges represent an electric current . In this back-and-forth motion, the current flows in one direction and then in another. As a consequence of this reversal of current direction, the magnetic field around the current (discovered by Ørsted and Ampère) has to reverse its direction. The time-varying magnetic field produces perpendicular to it a time-varying electric field, as discovered by Faraday ( Faraday’s law of induction ). These time-varying electric and magnetic fields spread out from their source, the oscillating current, at the speed of light in free space. The oscillating current in this discussion is the oscillating current in a transmitting antenna, and the time-varying electric and magnetic fields that are perpendicular to one another propagate at the speed of light and constitute an electromagnetic wave. Its frequency is that of the oscillating charges in the antenna. Once generated, it is self-propagating because a time-varying electric field produces a time-varying magnetic field, and vice versa. Electromagnetic radiation travels through space by itself. The belief in the existence of an ether medium, however, was at the time of Maxwell as strong as at the time of Plato and Aristotle . It was impossible to visualize ether because contradictory properties had to be attributed to it in order to explain the phenomena known at any given time. In his article Ether in the ninth edition of the  Encyclopædia Britannica,  Maxwell described the vast expanse of the substance, some of it possibly even inside the planets , carried along with them or passing through them as the “water of the sea passes through the meshes of a net when it is towed along by a boat.”",
  "If one believes in the ether, it is, of course, of fundamental importance to measure the speed of its motion or the effect of its motion on the speed of light. One does not know the absolute velocity of the ether, but, as Earth moves through its orbit around the Sun , there should be a difference in ether velocity along and perpendicular to Earth’s motion equal to its speed. If such is the case, the velocity of light and of any other electromagnetic radiation along and perpendicular to Earth’s motion should, predicted Maxwell, differ by a fraction that is equal to the square of the ratio of Earth’s velocity to that of light. This fraction is one part in 100 million.",
  " Michelson set out to measure this effect and, as noted above, designed for this purpose the interferometer sketched in Figure 4 . If it is assumed that the interferometer is turned so that half beam A is oriented parallel to Earth’s motion and half beam B is perpendicular to it, then the idea of using this instrument for measuring the effect of the ether motion is best explained by Michelson’s words to his children:",
  "Two beams of light race against each other, like two swimmers, one struggling upstream and back, while the other, covering the same distance, just crosses the river and returns. The second swimmer will always win, if there is any current in the river.",
  "An improved version of the interferometer, in which each half beam traversed its path eight times before both were reunited for interference, was built in 1887 by Michelson in collaboration with Morley. A heavy sandstone slab holding the interferometer was floated on a pool of mercury to allow rotation without vibration. Michelson and Morley could not detect any difference in the two light velocities parallel and perpendicular to Earth’s motion to an accuracy of one part in four billion. This negative result did not, however, shatter the belief in the existence of an ether because the ether could possibly be dragged along with Earth and thus be stationary around the Michelson-Morley apparatus . Hertz’s formulation of Maxwell’s theory made it clear that no medium of any sort was needed for the propagation of electromagnetic radiation. In spite of this, ether-drift experiments continued to be conducted until about the mid-1920s. All such tests confirmed Michelson’s negative results, and scientists finally came to accept the idea that no ether medium was needed for electromagnetic radiation.",
  "Much effort has been devoted to measuring the speed of light, beginning with the aforementioned work of Rømer in 1676. Rømer noticed that the orbital period of Jupiter’s first moon , Io , is apparently slowed as Earth and Jupiter move away from each other. The eclipses of Io occur later than expected when Jupiter is at its most remote position. This effect is understandable if light requires a finite time to reach Earth from Jupiter. From this effect, Rømer calculated the time required for light to travel from the Sun to Earth as 11 minutes. In 1728 James Bradley , an English astronomer, determined the speed of light from the apparent orbital motion of stars that is produced by Earth’s orbital motion. He computed the time for light to reach Earth from the Sun as 8 minutes 12 seconds. The first terrestrial measurements were made in 1849 by Fizeau and a year later by Foucault . Michelson improved on Foucault’s method and obtained an accuracy of one part in 100,000.",
  "Any measurement of velocity requires, however, a definition of the measure of length and of time. Current techniques allow a determination of the velocity of electromagnetic radiation to a substantially higher degree of precision than permitted by the unit of length that scientists had applied earlier. In 1983 the value of the speed of light was fixed at exactly 299,792,458 metres per second, and this value was adopted as a new standard. As a consequence, the metre was redefined as the length of the path traveled by light in a vacuum over a time interval of 1/299,792,458 of a second. Furthermore, the second —the international unit of time—has been based on the frequency of electromagnetic radiation emitted by a cesium -133 atom .",
  "After a long struggle electromagnetic wave theory had triumphed. The Faraday - Maxwell - Hertz theory of electromagnetic radiation seemed to be able to explain all phenomena of light , electricity , and magnetism . The understanding of these phenomena enabled one to produce electromagnetic radiation of many different frequencies which had never been observed before and which opened a world of new opportunities. No one suspected that the conceptional foundations of physics were about to change again.",
  "The quantum theory of absorption and emission of radiation announced in 1900 by Planck ushered in the era of modern physics. He proposed that all material systems can absorb or give off electromagnetic radiation only in “chunks” of energy, quanta E, and that these are proportional to the frequency of that radiation E = hν. (The constant of proportionality h is, as noted above, called Planck’s constant .)",
  "Planck was led to this radically new insight by trying to explain the puzzling observation of the amount of electromagnetic radiation emitted by a hot body and, in particular, the dependence of the intensity of this incandescent radiation on temperature and on frequency. The quantitative aspects of the incandescent radiation constitute the radiation laws.",
  "The Austrian physicist Josef Stefan found in 1879 that the total radiation energy per unit time emitted by a heated surface per unit area increases as the fourth power of its absolute temperature T (Kelvin scale). This means that the Sun’s surface, which is at T = 6,000 K, radiates per unit area (6,000/300) 4 = 20 4 = 160,000 times more electromagnetic energy than does the same area of Earth’s surface, which is taken to be T = 300 K. In 1889 another Austrian physicist, Ludwig Boltzmann , used the second law of thermodynamics to derive this temperature dependence for an ideal substance that emits and absorbs all frequencies. Such an object that absorbs light of all colours looks black, and so was called a blackbody . The Stefan-Boltzmann law is written in quantitative form W = σT  4 , where W is the radiant energy emitted per second and per unit area and the constant of proportionality is σ = 0.136 calories per metre 2 -second-K 4 .",
  " dW d The wavelength or frequency distribution of blackbody radiation was studied in the 1890s by Wilhelm Wien of Germany. It was his idea to use as a good approximation for the ideal blackbody an oven with a small hole. Any radiation that enters the small hole is scattered and reflected from the inner walls of the oven so often that nearly all incoming radiation is absorbed and the chance of some of it finding its way out of the hole again can be made exceedingly small. The radiation coming out of this hole is then very close to the equilibrium blackbody electromagnetic radiation corresponding to the oven temperature. Wien found that the radiative energy dW per wavelength interval d λ has a maximum at a certain wavelength λ  m  and that the maximum shifts to shorter wavelengths as the temperature T is increased, as illustrated in Figure 8 . He found that the product λ  m   T is an absolute constant: λ  m   T = 0.2898 cm-K.",
  " Wien’s law of the shift of the radiative power maximum to higher frequencies as the temperature is raised expresses in a quantitative form commonplace observations. Warm objects emit infrared radiation , which is felt by the skin; near T = 950 K a dull red glow can be observed; and the colour brightens to orange and yellow as the temperature is raised. The tungsten filament of a lightbulb is T = 2,500 K hot and emits bright light, yet the peak of its spectrum is still in the infrared according to Wien’s law. The peak shifts to the visible yellow when the temperature is T = 6,000 K, like that of the Sun’s surface.",
  "It was the shape of Wien’s radiative energy distribution as a function of frequency that Planck tried to understand. The decrease of the radiation output at low frequency had already been explained by Lord Rayleigh in terms of the decrease, with lowering frequency, in the number of modes of electromagnetic radiation per frequency interval. Rayleigh, following the principle of equipartition of energy, assumed that all possible frequency modes could radiate with equal probability. Since the number of frequency modes per frequency interval continues to increase without limit with the square of the frequency, Rayleigh’s formula predicted an ever-increasing amount of radiation of higher frequencies instead of the observed maximum and subsequent fall in radiative power. A possible way out of this dilemma was to deny the high-frequency modes an equal chance to radiate. To achieve this, Planck postulated that the radiators or oscillators can emit electromagnetic radiation only in finite amounts of energy of size E = hν. At a given temperature T , there is then not enough thermal energy available to create and emit many large radiation quanta hν . More large energy quanta hν can be emitted, however, when the temperature is raised. Quantitatively the probability of emitting at temperature T an electromagnetic energy quantum hν is   where k is Boltzmann’s constant , well known from thermodynamics. With c = λ ν, Planck’s radiation law then becomes   ",
  "This is in superb agreement with Wien’s experimental results when the value of h is properly chosen to fit the results. It should be pointed out that Planck’s quantization refers to the oscillators of the blackbody or of heated substances. These oscillators of frequency ν are incapable of absorbing or emitting electromagnetic radiation except in energy chunks of size hν . To explain quantized absorption and emission of radiation, it seemed sufficient to quantize only the energy levels of mechanical systems. Planck did not mean to say that electromagnetic radiation itself is quantized, or, as Einstein later put it, “The sale of beer in pint bottles does not imply that beer exists only in indivisible pint portions.” The idea that electromagnetic radiation itself is quantized was proposed by Einstein in 1905, as described in the subsequent section.",
  "   Hertz discovered the photoelectric effect (1887) quite by accident while generating electromagnetic waves and observing their propagation. His transmitter and receiver were induction coils with spark gaps. He measured the electromagnetic field strength by the maximum length of the spark of his detector. In order to observe this more accurately, he occasionally enclosed the spark gap of the receiver in a dark case. In doing so, he observed that the spark was always smaller with the case than without it. He concluded, correctly, that the light from the transmitter spark affected the electrical arcing of the receiver. He used a quartz prism to disperse the light of the transmitter spark and found that the ultraviolet part of the light spectrum was responsible for enhancing the receiver spark. Hertz took this discovery seriously because the only other effect of light on electrical phenomena known at that time was the increase in electrical conductance of the element  selenium with light exposure.",
  "A year after Hertz’s discovery, it became clear that ultraviolet radiation caused the emission of negatively charged particles from solid surfaces. Thomson’s discovery of electrons (1897) and his ensuing measurement of the ratio m / e (the ratio of mass to charge) finally made it possible to identify the negative particles emitted in the photoelectric effect with electrons. This was accomplished in 1899 by J.J. Thomson and independently by Philipp Lenard, one of Hertz’s students. Lenard discovered that for a given frequency of ultraviolet radiation the maximum kinetic energy of the emitted electrons depends on the metal used rather than on the intensity of the ultraviolet light. The light intensity increases the number but not the energy of emitted electrons. Moreover, he found that for each metal there is a minimum light frequency that is needed to induce the emission of electrons. Light of a frequency lower than this minimum frequency has no effect regardless of its intensity.",
  "In 1905 Einstein published an article entitled “On a Heuristic Point of View about the Creation and Conversion of Light.” Here he deduced that electromagnetic radiation itself consists of “particles” of energy hν . He arrived at this conclusion by using a simple theoretical argument comparing the change in entropy of an ideal gas caused by an isothermal change in volume with the change in entropy of an equivalent volume change for electromagnetic radiation in accordance with Wien’s or Planck’s radiation law . This derivation and comparison made no references to substances and oscillators. At the end of this paper, Einstein concluded that if electromagnetic radiation is quantized, the absorption processes are thus quantized too, yielding an elegant explanation of the threshold energies and the intensity dependence of the photoelectric effect. He then predicted that the kinetic energy of the electrons emitted in the photoelectric effect increases with light frequency ν proportional to hν − P , where P is “the amount of work that the electron must produce on leaving the body.” This quantity P , now called work function, depends on the kind of solid used, as discovered by Lenard.",
  "Einstein’s path-breaking idea of light quanta was not widely accepted by his peers. Planck himself stated as late as 1913 in his recommendation for admitting Einstein to the Prussian Academy of Sciences “the fact that he [Einstein] may occasionally have missed the mark in his speculations, as, for example, with his hypothesis of light quanta, ought not to be held too much against him, for it is impossible to introduce new ideas, even in the exact sciences, without taking risks.” In order to explain a quantized absorption and emission of radiation by matter, it seemed sufficient to quantize the possible energy states in matter. The resistance against quantizing the energies of electromagnetic radiation itself is understandable in view of the incredible success of Maxwell’s theory of electromagnetic radiation and the overwhelming evidence of the wave nature of this radiation. Moreover, a formal similarity of two theoretical expressions, in Einstein’s 1905 paper, of the entropy of an ideal gas and the entropy of electromagnetic radiation was deemed insufficient evidence for a real correspondence.",
  "Einstein’s prediction of the linear increase of the kinetic energy of photoemitted electrons with the frequency of light, hν − P , was verified by Arthur Llewelyn Hughes, Owen Williams Richardson, and Karl Taylor Compton in 1912. In 1916 Robert Andrews Millikan measured both the frequency of the light and the kinetic energy of the electron emitted by the photoelectric effect and obtained a value for Planck’s constant  h in close agreement with the value that had been arrived at by fitting Planck’s radiation law to the blackbody spectrum obtained by Wien.",
  "Convincing evidence of the particle nature of electromagnetic radiation was found in 1922 by the American physicist Arthur Holly Compton . While investigating the scattering of X-rays , he observed that such rays lose some of their energy in the scattering process and emerge with slightly decreased frequency. This energy loss increases with the scattering angle, θ, measured from the direction of an unscattered X-ray. This so-called Compton effect can be explained, according to classical mechanics , as an elastic collision of two particles comparable to the collision of two billiard balls. In this case, an X-ray photon of energy hν and momentum hν / c collides with an electron at rest. The recoiling electron was observed and measured by Compton and Alfred W. Simon in a Wilson cloud chamber . If one calculates the result of such an elastic collision by using the relativistic formulas for the energy and momentum of the scattered electron, one finds that the wavelength of an X-ray after (λ′) and before (λ) the scattering event differs by λ′ − λ = ( h / mc )(1 − cos θ ). Here m is the rest mass of the electron and h / mc is called Compton wavelength. It has the value 0.0243 angstrom . The energy hν of a photon of this wavelength is equal to the rest mass energy  mc  2  of an electron. One might argue that electrons in atoms are not at rest, but their kinetic energy is very small compared with that of energetic X-rays and can be disregarded in deriving Compton’s equation.",
  "During the mid-1800s the German physicist Gustav Robert Kirchhoff observed that atoms and molecules emit and absorb electromagnetic radiation at characteristic frequencies and that the emission and absorption frequencies are the same for a given substance. Such resonance absorption should, strictly speaking, not occur if one applies the photon picture due to the following argument. Since energy and momentum have to be conserved in the emission process, the atom recoils to the left as the photon is emitted to the right, just as a cannon recoils backward when a shot is fired. Because the recoiling atom carries off some kinetic recoil energy E   R   , the emitted photon energy is less than the energy difference of the atomic energy states by the amount E   R   . When a photon is absorbed by an atom, the momentum of the photon is likewise transmitted to the atom, thereby giving it a kinetic recoil energy E   R   . The absorbing photon must therefore supply not only the energy difference of the atomic energy states but the additional amount E   R  as well. Accordingly, resonance absorption should not occur because the emitted photon is missing 2 E   R  to accomplish it.",
  "Nevertheless, ever since Kirchhoff’s finding, investigators have observed resonance absorption for electronic transitions in atoms and molecules. This is because for visible light the recoil energy E   R  is very small compared with the natural energy uncertainty of atomic emission and absorption processes. The situation is, however, quite different for the emission and absorption of gamma-ray photons by nuclei . The recoil energy E   R  is more than 10,000 times as large for gamma-ray photons as for photons of visible light, and the nuclear energy transitions are much more sharply defined because their lifetime can be one million times longer than for electronic energy transitions. The particle nature of photons therefore prevents resonance absorption of gamma-ray photons by free nuclei.",
  "In 1958 the German physicist Rudolf Ludwig Mössbauer discovered that recoilless gamma-ray resonance absorption is, nevertheless, possible if the emitting as well as the absorbing nuclei are embedded in a solid. In this case , there is a strong probability that the recoil momentum during absorption and emission of the gamma photon is taken up by the whole solid (or more precisely by its entire lattice). This then reduces the recoil energy to nearly zero and thus allows resonance absorption to occur even for gamma rays.",
  "How can electromagnetic radiation behave like a particle in some cases while exhibiting wavelike properties that produce the interference and diffraction phenomena in others? This paradoxical behaviour came to be known as the wave-particle duality . Bohr rejected the idea of light quanta, and he searched for ways to explain the Compton effect and the photoelectric effect by arguing that the momentum and energy conservation laws need to be satisfied only statistically in the time average. In 1923 he stated that the hypothesis of light quanta excludes, in principle, the possibility of a rational definition of the concepts of frequency and wavelength that are essential for explaining interference.",
  "The following year the conceptual foundations of physics were shaken by the French physicist Louis de Broglie , who suggested in his doctoral dissertation that the wave-particle duality applies not only to light but to a particle as well. De Broglie proposed that any object has wavelike properties. In particular, he showed that the orbits and energies of the hydrogen  atom , as described by Bohr’s atomic model , correspond to the condition that the circumference of any orbit precisely matches an integral number of wavelengths λ of the matter waves of electrons . Any particle such as an electron moving with a momentum p has, according to de Broglie, a wavelength λ = h / p. This idea required a conceptual revolution of mechanics, which led to the wave and quantum mechanics of Erwin Schrödinger , Werner Heisenberg , and Max Born .",
  "De Broglie’s idea of the wavelike behaviour of particles was quickly verified experimentally. In 1927 Clinton Joseph Davisson and Lester Germer of the United States observed diffraction and hence interference of electron waves by the regular arrangement of atoms in a crystal of nickel . That same year S. Kikuchi of Japan obtained an electron diffraction pattern by shooting electrons with an energy of 68 keV through a thin mica plate and recording the resultant diffraction pattern on a photographic plate. The observed pattern corresponded to electron waves having the wavelength predicted by de Broglie. The diffraction effects of helium atoms were found in 1930, and neutron diffraction has today become an indispensable tool for determining the magnetic and atomic structure of materials.",
  " The interference pattern that results when a radiation front hits two slits in an opaque screen is often cited to explain the conceptual difficulty of the wave-particle duality. Consider an opaque screen with two openings A and B, called a double slit, and a photographic plate or a projection screen, as shown in Figure 9 . A parallel wave with a wavelength λ passing through the double slit will produce the intensity pattern on the plate or screen as shown at the right of the figure. The intensity is greatest at the centre. It falls to zero at all locations x  0 , where the distances to the openings A and B differ by odd-number multiples of a half wavelength, as, for instance, λ/2, 3λ/2, and 5λ/2. The condition for such destructive interference is the same as for Michelson’s interferometer illustrated in Figure 4 . Whereas a half-transparent mirror in Figure 4 divides the amplitude of each wave train in half, the division in Figure 9 through openings A and B is spatial. The latter is called division of wave front. Constructive interference or intensity maxima are observed on the screen at all positions whose distances from A and B differ by zero or an integer multiple of λ. This is the wave interpretation of the observed double-slit interference pattern.",
  "The description of photons is necessarily different because a particle can obviously only pass through opening A or alternatively through opening B. Yet, no interference pattern is observed when either A or B is closed. Both A and B must be open simultaneously. It was thought for a time that one photon passing through A might interfere with another photon passing through B. That possibility was ruled out after the British physicist Geoffrey Taylor demonstrated in 1909 that the same interference pattern can be recorded on a photographic plate even when the light intensity is so feeble that only one photon is present in the apparatus at any one time.",
  "Another attempt to understand the dual nature of electromagnetic radiation was to identify the photon with a wave train whose length is equal to its coherence length cτ, where τ is the coherence time, or the lifetime of an atomic transition from a higher to a lower internal atomic energy state, and c is the light velocity. This is the same as envisioning the photon to be an elongated wave packet, or “needle radiation.” Again, the term “photon” had a different meaning for different scientists, and wave nature and quantum structure remained incompatible. It was time to find a theory of electromagnetic radiation that would fuse the wave theory and the particle theory. Such a fusion was accomplished by quantum electrodynamics (QED).",
  "Among the most convincing phenomena that demonstrate the quantum nature of light are the following. As the intensity of light is dimmed further and further, one can see individual quanta being registered in light detectors. If the eyes were about 10 times more sensitive, one would perceive the individual light pulses of fainter and fainter light sources as fewer and fewer flashes of equal intensity. Moreover, a movie has been made of the buildup of a two-slit interference pattern by individual photons, such as shown in Figure 9 . Photons are particles, but they behave differently from ordinary particles like billiard balls. The rules of their behaviour and their interaction with electrons and other charged particles, as well as the interactions of charged particles with one another, constitute QED.",
  "Photons are created by perturbations in the motions of electrons and other charged particles; in reverse, photons can disappear and thereby create a pair of oppositely charged particles, usually a particle and its antiparticle (e.g., an electron and a positron ). A description of this intimate interaction between charged particles and electromagnetic radiation requires a theory that includes both quantum mechanics and special relativity . The foundations of such a theory, known as relativistic quantum mechanics, were laid beginning in 1929 by Paul A.M. Dirac , Heisenberg , and Wolfgang Pauli .",
  "The discussion that follows explains in brief the principal conceptual elements of QED. Further information on the subject can be found in subatomic particle: The development of modern theory and quantum mechanics .",
  "Many phenomena in nature do not depend on the reference scale of scientific measurements. For instance, in electromagnetism the difference in electrical potentials is relevant but not its absolute magnitude. During the 1920s, even before the emergence of quantum mechanics, the German physicist Hermann Weyl discussed the problem of constructing physical theories that are independent of certain reference bases or absolute magnitudes of certain parameters not only locally but everywhere in space. He called this property “Eichinvarianz,” which is the conceptual origin of the term “gauge invariance” that plays a crucial role in all modern quantum field theories.",
  "In quantum mechanics all observable quantities are calculated from so-called wave functions , which are complex mathematical functions that include a phase factor. The absolute magnitude of this phase is irrelevant for the observable quantities calculated from these wave functions; hence, the theory describing, for example, the motion of an electron should be the same when the phase of its wave function is changed everywhere in space. This requirement of phase invariance, or gauge invariance, is equivalent to demanding that the total charge is conserved and does not disappear in physical processes or interactions. Experimentally one does indeed observe that charge is conserved in nature.",
  "It turns out that a relativistic quantum theory of charged particles can be made gauge invariant if the interaction is mediated by a massless and chargeless entity which has all the properties of photons. Coulomb’s law of the force between charged particles can be derived from this theory, and the photon can be viewed as a “messenger” particle that conveys the electromagnetic force between charged particles of matter. In this theory, Maxwell’s equations for electric and magnetic fields are quantized.",
  "The range of a force produced by a particle with nonzero mass is its Compton wavelength h / mc, which for electrons is about 2 × 10 −10 cm. Since this length is large compared with distances over which stronger nuclear forces act, QED is a very precise theory for electrons.",
  "Despite the conceptual elegance of the QED theory, it proved difficult to calculate the outcome of specific physical situations through its application. Richard P. Feynman and, independently, Julian S. Schwinger and Freeman Dyson of the United States and Tomonaga Shin’ichirō of Japan showed in 1948 that one could calculate the effects of the interactions as a power series in which the coupling constant is called the fine structure constant and has a value close to  1  137  . A serious practical difficulty arose when each term in the series, which had to be summed to obtain the value of an observed quantity, turned out to be infinitely large. In short, the results of the calculations were meaningless. It was eventually found, however, that these divergences could be avoided by introducing “renormalized” couplings and particle masses, an idea conceived by the Dutch physicist Hendrik A. Kramers. Just as a ship moving through water has an enhanced mass due to the fluid that it drags along, so will an electron dragging along and interacting with its own field have a different mass and charge than it would without it. By adding appropriate electromagnetic components to the bare mass and charge—that is, by using renormalized quantities—the disturbing infinities could be removed from the theory. Using this method of renormalization and the perturbation theory, Feynman developed an elegant form for calculating the likelihood of observing processes that are related to the interaction of electromagnetic radiation with matter to any desired degree of accuracy. For example, the passage of an electron or a photon through the double slit illustrated in Figure 9 will, in this QED formalism, produce the observed interference pattern on a photographic plate because of the superposition of all the possible paths these particles can take through the slits.",
  "The success of unifying electricity, magnetism, and light into one theory of electromagnetism and then with the interaction of charged particles into the theory of quantum electrodynamics suggests the possibility of understanding all the forces in nature (gravitational, electromagnetic, weak nuclear , and strong nuclear ) as manifestations of a grand unified theory (GUT). The first step in this direction was taken during the 1960s by Abdus Salam , Steven Weinberg , and Sheldon Glashow , who formulated the electroweak theory , which combines the electromagnetic force and the weak nuclear force. This theory predicted that the weak nuclear force is transmitted between particles of matter by three messenger particles designated W +  , W − , and Z , much in the way that the electromagnetic force is conveyed by photons. The three new particles were discovered in 1983 during experiments at the European Organization for Nuclear Research (CERN), a large accelerator laboratory near Geneva. This triumph for the electroweak theory represented another stepping stone toward a deeper understanding of the forces and interactions that yield the multitude of physical phenomena in the universe.",
  "Accounts of the historical development of electromagnetic theories may be found in Isaac Asimov,  The History of Physics (1984); I. Bernard Cohen,  Revolution in Science (1985); and Thomas S. Kuhn,  Black-Body Theory and the Quantum Discontinuity, 1894–1912 (1978, reprinted 1987). Early works include Edmund Whittaker , A History of the Theories of Aether and Electricity, rev. and enlarged ed., 2 vol. (1951–53); and Heinrich Hertz,  Electric Waves: Being Researches on the Propagation of Electric Action with Finite Velocity Through Space (1893, reissued 1962; originally published in German, 1892). Ivan Tolstoy,  James Clerk Maxwell (1981), recounts the life of this pivotal figure, as well as his theory and its ramifications. James Clerk Maxwell: A Commemoration Volume, 1831–1931 (1931), includes essays by Max Planck and Albert Einstein, among others. Extensive treatments of visible radiation (light) are given by Michael I. Sobel,  Light (1987); Max Born and Emil Wolf , Principles of Optics: Electromagnetic Theory of Propagation, Interference, and Diffraction of Light, 6th ed. (1987); and Francis A. Jenkins and Harvey E. White,  Fundamentals of Optics, 4th ed. (1976). Classical radiation and electron theory are treated in John David Jackson , Classical Electrodynamics, 2nd ed. (1975); and Richard P. Feynman , Robert B. Leighton , and Matthew Sands,  The Feynman Lectures on Physics, 3 vol. (1963–65; vol. 1 and 2 have been reprinted, 1977). Wave–particle dualism is addressed by Louis De Broglie,  Matter and Light (1939, reissued 1955; originally published in French, 1937); S. Diner  et al. (eds.), The Wave–Particle Dualism (1984); and A.B. Arons,  The Development of Concepts of Physics: From the Rationalization of Mechanics to the First Theory of Atomic Structure (1965). Quantum electrodynamics is discussed in Richard P. Feynman,  QED: The Strange Theory of Light and Matter (1985); Rodney Loudon,  The Quantum Theory of Light, 2nd ed. (1983); W. Heitler , The Quantum Theory of Radiation, 3rd ed. (1964, reprinted 1984); J.M. Jauch and F. Rohrlich,  The Theory of Photons and Electrons: The Relativistic Quantum Field Theory of Charged Particles with Spin One-half, 2nd expanded ed. (1976); and Paul Davies (ed.), The New Physics (1989)."
]