[
  "   earthquake ,  any sudden shaking of the ground caused by the passage of seismic waves through Earth ’s rocks. Seismic waves are produced when some form of energy stored in Earth’s crust is suddenly released, usually when masses of rock straining against one another suddenly fracture and “slip.” Earthquakes occur most often along geologic faults , narrow zones where rock masses move in relation to one another. The major fault lines of the world are located at the fringes of the huge tectonic plates that make up Earth’s crust. ( See the table of major earthquakes.)",
  "  Little was understood about earthquakes until the emergence of seismology at the beginning of the 20th century. Seismology , which involves the scientific study of all aspects of earthquakes, has yielded answers to such long-standing questions as why and how earthquakes occur.",
  "  About 50,000 earthquakes large enough to be noticed without the aid of instruments occur annually over the entire Earth. Of these, approximately 100 are of sufficient size to produce substantial damage if their centres are near areas of habitation. Very great earthquakes occur on average about once per year. Over the centuries they have been responsible for millions of deaths and an incalculable amount of damage to property.",
  "  Earth’s major earthquakes occur mainly in belts coinciding with the margins of tectonic plates. This has long been apparent from early catalogs of felt earthquakes and is even more readily discernible in modern seismicity maps, which show instrumentally determined epicentres. The most important earthquake belt is the Circum-Pacific Belt, which affects many populated coastal regions around the Pacific Ocean —for example, those of New Zealand , New Guinea , Japan , the Aleutian Islands , Alaska, and the western coasts of North and South America . It is estimated that 80 percent of the energy presently released in earthquakes comes from those whose epicentres are in this belt. The seismic activity is by no means uniform throughout the belt, and there are a number of branches at various points. Because at many places the Circum-Pacific Belt is associated with volcanic activity, it has been popularly dubbed the “Pacific Ring of Fire .”",
  "A second belt, known as the Alpide Belt, passes through the Mediterranean region eastward through Asia and joins the Circum-Pacific Belt in the East Indies . The energy released in earthquakes from this belt is about 15 percent of the world total. There also are striking connected belts of seismic activity, mainly along oceanic ridges —including those in the Arctic Ocean , the Atlantic Ocean , and the western Indian Ocean —and along the rift valleys of East Africa. This global seismicity distribution is best understood in terms of its plate tectonic setting .",
  "Earthquakes are caused by the sudden release of energy within some limited region of the rocks of the Earth . The energy can be released by elastic strain, gravity, chemical reactions, or even the motion of massive bodies. Of all these the release of elastic strain is the most important cause, because this form of energy is the only kind that can be stored in sufficient quantity in the Earth to produce major disturbances. Earthquakes associated with this type of energy release are called tectonic earthquakes.",
  "  Tectonic earthquakes are explained by the so-called elastic rebound theory, formulated by the American geologist Harry Fielding Reid after the San Andreas Fault ruptured in 1906, generating the great San Francisco earthquake . According to the theory, a tectonic earthquake occurs when strains in rock masses have accumulated to a point where the resulting stresses exceed the strength of the rocks, and sudden fracturing results. The fractures propagate rapidly through the rock, usually tending in the same direction and sometimes extending many kilometres along a local zone of weakness. In 1906, for instance, the San Andreas Fault slipped along a plane 430 km (270 miles) long. Along this line the ground was displaced horizontally as much as 6 metres (20 feet).",
  "As a fault rupture progresses along or up the fault, rock masses are flung in opposite directions and thus spring back to a position where there is less strain. At any one point this movement may take place not at once but rather in irregular steps; these sudden slowings and restartings give rise to the vibrations that propagate as seismic waves . Such irregular properties of fault rupture are now included in the modeling of earthquake sources, both physically and mathematically. Roughnesses along the fault are referred to as asperities, and places where the rupture slows or stops are said to be fault barriers. Fault rupture starts at the earthquake focus, a spot that in many cases is close to 5–15 km under the surface. The rupture propagates in one or both directions over the fault plane until stopped or slowed at a barrier. Sometimes, instead of being stopped at the barrier, the fault rupture recommences on the far side; at other times the stresses in the rocks break the barrier, and the rupture continues.",
  " Earthquakes have different properties depending on the type of fault slip that causes them (as shown in the figure ). The usual fault model has a “strike” (that is, the direction from north taken by a horizontal line in the fault plane) and a “dip” (the angle from the horizontal shown by the steepest slope in the fault). The lower wall of an inclined fault is called the footwall. Lying over the footwall is the hanging wall. When rock masses slip past each other parallel to the strike, the movement is known as strike-slip faulting. Movement parallel to the dip is called dip-slip faulting. Strike-slip faults are right lateral or left lateral, depending on whether the block on the opposite side of the fault from an observer has moved to the right or left. In dip-slip faults, if the hanging-wall block moves downward relative to the footwall block, it is called “normal” faulting; the opposite motion, with the hanging wall moving upward relative to the footwall, produces reverse or thrust faulting.",
  "All known faults are assumed to have been the seat of one or more earthquakes in the past, though tectonic movements along faults are often slow, and most geologically ancient faults are now aseismic (that is, they no longer cause earthquakes). The actual faulting associated with an earthquake may be complex, and it is often not clear whether in a particular earthquake the total energy issues from a single fault plane.",
  "Observed geologic faults sometimes show relative displacements on the order of hundreds of kilometres over geologic time, whereas the sudden slip offsets that produce seismic waves may range from only several centimetres to tens of metres . In the 1976 Tangshan earthquake , for example, a surface strike-slip of about one metre was observed along the causative fault east of Beijing , and in the 1999 Taiwan earthquake the Chelung-pu fault slipped up to eight metres vertically.",
  "A separate type of earthquake is associated with volcanic activity and is called a volcanic earthquake. Yet it is likely that even in such cases the disturbance is the result of a sudden slip of rock masses adjacent to the volcano and the consequent release of elastic strain energy. The stored energy, however, may in part be of hydrodynamic origin due to heat provided by magma moving in reservoirs beneath the volcano or to the release of gas under pressure.",
  "  There is a clear correspondence between the geographic distribution of volcanoes and major earthquakes, particularly in the Circum-Pacific Belt and along oceanic ridges. Volcanic vents, however, are generally several hundred kilometres from the epicentres of most major shallow earthquakes, and many earthquake sources occur nowhere near active volcanoes. Even in cases where an earthquake’s focus occurs directly below structures marked by volcanic vents, there is probably no immediate causal connection between the two activities; most likely both are the result of the same tectonic processes.",
  "Earthquakes are sometimes caused by human activities, including the injection of fluids into deep wells, the detonation of large underground nuclear explosions, the excavation of mines, and the filling of large reservoirs. In the case of deep mining , the removal of rock produces changes in the strain around the tunnels. Slip on adjacent, preexisting faults or outward shattering of rock into the new cavities may occur. In fluid injection, the slip is thought to be induced by premature release of elastic strain, as in the case of tectonic earthquakes, after fault surfaces are lubricated by the liquid. Large underground nuclear explosions have been known to produce slip on already strained faults in the vicinity of the test devices.",
  "Of the various earthquake-causing activities cited above, the filling of large reservoirs is among the most important. More than 20 significant cases have been documented in which local seismicity has increased following the impounding of water behind high dams. Often, causality cannot be substantiated, because no data exists to allow comparison of earthquake occurrence before and after the reservoir was filled. Reservoir-induction effects are most marked for reservoirs exceeding 100 metres (330 feet) in depth and 1 cubic km (0.24 cubic mile) in volume. Three sites where such connections have very probably occurred are the Hoover Dam in the United States , the Aswan High Dam in Egypt, and the Kariba Dam on the border between Zimbabwe and Zambia . The most generally accepted explanation for earthquake occurrence in such cases assumes that rocks near the reservoir are already strained from regional tectonic forces to a point where nearby faults are almost ready to slip. Water in the reservoir adds a pressure perturbation that triggers the fault rupture. The pressure effect is perhaps enhanced by the fact that the rocks along the fault have lower strength because of increased water-pore pressure. These factors notwithstanding, the filling of most large reservoirs has not produced earthquakes large enough to be a hazard.",
  "The specific seismic source mechanisms associated with reservoir induction have been established in a few cases. For the main shock at the Koyna Dam and Reservoir in India (1967), the evidence favours strike-slip faulting motion. At both the Kremasta Dam in Greece (1965) and the Kariba Dam in Zimbabwe-Zambia (1961), the generating mechanism was dip-slip on normal faults. By contrast, thrust mechanisms have been determined for sources of earthquakes at the lake behind Nurek Dam in Tajikistan . More than 1,800 earthquakes occurred during the first nine years after water was impounded in this 317-metre-deep reservoir in 1972, a rate amounting to four times the average number of shocks in the region prior to filling.",
  "In 1958 representatives from several countries, including the United States and the Soviet Union , met to discuss the technical basis for a nuclear test-ban treaty . Among the matters considered was the feasibility of developing effective means with which to detect underground nuclear explosions and to distinguish them seismically from earthquakes. After that conference, much special research was directed to seismology , leading to major advances in seismic signal detection and analysis.",
  "Recent seismological work on treaty verification has involved using high-resolution seismographs in a worldwide network, estimating the yield of explosions, studying wave attenuation in the Earth , determining wave amplitude and frequency spectra discriminants, and applying seismic arrays. The findings of such research have shown that underground nuclear explosions, compared with natural earthquakes, usually generate seismic waves through the body of the Earth that are of much larger amplitude than the surface waves. This telltale difference along with other types of seismic evidence suggest that an international monitoring network of 270 seismographic stations could detect and locate all seismic events over the globe of magnitude 4 and above (corresponding to an explosive yield of about 100 tons of TNT).",
  " Encyclopædia Britannica  Earthquakes have varied effects, including changes in geologic features, damage to man-made structures, and impact on human and animal life. Most of these effects occur on solid ground, but, since most earthquake foci are actually located under the ocean bottom, severe effects are often observed along the margins of oceans.",
  "Earthquakes often cause dramatic geomorphological changes , including ground movements—either vertical or horizontal—along geologic fault traces; rising, dropping, and tilting of the ground surface; changes in the flow of groundwater ; liquefaction of sandy ground; landslides ; and mudflows . The investigation of topographic changes is aided by geodetic measurements, which are made systematically in a number of countries seriously affected by earthquakes.",
  "Earthquakes can do significant damage to buildings, bridges , pipelines , railways, embankments, and other structures. The type and extent of damage inflicted are related to the strength of the ground motions and to the behaviour of the foundation soils. In the most intensely damaged region, called the meizoseismal area, the effects of a severe earthquake are usually complicated and depend on the topography and the nature of the surface materials. They are often more severe on soft alluvium and unconsolidated sediments than on hard rock . At distances of more than 100 km (60 miles) from the source, the main damage is caused by seismic waves traveling along the surface. In mines there is frequently little damage below depths of a few hundred metres even though the ground surface immediately above is considerably affected.",
  "Earthquakes are frequently associated with reports of distinctive sounds and lights . The sounds are generally low-pitched and have been likened to the noise of an underground train passing through a station. The occurrence of such sounds is consistent with the passage of high-frequency seismic waves through the ground. Occasionally, luminous flashes, streamers, and bright balls have been reported in the night sky during earthquakes. These lights have been attributed to electric induction in the air along the earthquake source.",
  "  Following certain earthquakes, very long- wavelength water waves in oceans or seas sweep inshore. More properly called seismic sea waves or tsunami s ( tsunami is a Japanese word for “harbour wave”), they are commonly referred to as tidal waves, although the attractions of the Moon and Sun play no role in their formation. They sometimes come ashore to great heights—tens of metres above mean tide level—and may be extremely destructive.",
  "The usual immediate cause of a tsunami is sudden displacement in a seabed sufficient to cause the sudden raising or lowering of a large body of water. This deformation may be the fault source of an earthquake, or it may be a submarine landslide arising from an earthquake. Large volcanic eruptions along shorelines, such as those of Thera (c. 1580 bce ) and Krakatoa (1883 ce ), have also produced notable tsunamis. The most destructive tsunami ever recorded occurred on December 26, 2004, after an earthquake displaced the seabed off the coast of Sumatra , Indonesia . More than 200,000 people were killed by a series of waves that flooded coasts from Indonesia to Sri Lanka and even washed ashore on the Horn of Africa .",
  "Following the initial disturbance to the sea surface, water waves spread in all directions. Their speed of travel in deep water is given by the formula (  g  h  ), where h is the sea depth and g is the acceleration of gravity . This speed may be considerable—100 metres per second (225 miles per hour) when h is 1,000 metres (3,300 feet). However, the amplitude (that is, the height of disturbance) at the water surface does not exceed a few metres in deep water, and the principal wavelength may be on the order of hundreds of kilometres ; correspondingly, the principal wave period—that is, the time interval between arrival of successive crests—may be on the order of tens of minutes. Because of these features, tsunami waves are not noticed by ships far out at sea.",
  "  When tsunamis approach shallow water, however, the wave amplitude increases. The waves may occasionally reach a height of 20 to 30 metres above mean sea level in U- and V-shaped harbours and inlets. They characteristically do a great deal of damage in low-lying ground around such inlets. Frequently, the wave front in the inlet is nearly vertical, as in a tidal bore , and the speed of onrush may be on the order of 10 metres per second. In some cases there are several great waves separated by intervals of several minutes or more. The first of these waves is often preceded by an extraordinary recession of water from the shore, which may commence several minutes or even half an hour beforehand.",
  "Organizations, notably in Japan , Siberia , Alaska , and Hawaii , have been set up to provide tsunami warnings. A key development is the Seismic Sea Wave Warning System, an internationally supported system designed to reduce loss of life in the Pacific Ocean . Centred in Honolulu , it issues alerts based on reports of earthquakes from circum-Pacific seismographic stations.",
  " Seiches are rhythmic motions of water in nearly landlocked bays or lakes that are sometimes induced by earthquakes and tsunamis. Oscillations of this sort may last for hours or even for a day or two.",
  "The great Lisbon earthquake of 1755 caused the waters of canals and lakes in regions as far away as Scotland and Sweden to go into observable oscillations. Seiche surges in lakes in Texas , in the southwestern United States , commenced between 30 and 40 minutes after the 1964 Alaska earthquake , produced by seismic surface waves passing through the area.",
  "A related effect is the result of seismic waves from an earthquake passing through the seawater following their refraction through the seafloor. The speed of these waves is about 1.5 km (0.9 mile) per second, the speed of sound in water. If such waves meet a ship with sufficient intensity, they give the impression that the ship has struck a submerged object. This phenomenon is called a seaquake.",
  "  The violence of seismic shaking varies considerably over a single affected area. Because the entire range of observed effects is not capable of simple quantitative definition, the strength of the shaking is commonly estimated by reference to intensity scales that describe the effects in qualitative terms. Intensity scales date from the late 19th and early 20th centuries, before seismographs capable of accurate measurement of ground motion were developed. Since that time, the divisions in these scales have been associated with measurable accelerations of the local ground shaking. Intensity depends, however, in a complicated way not only on ground accelerations but also on the periods and other features of seismic waves, the distance of the measuring point from the source, and the local geologic structure. Furthermore, earthquake intensity, or strength, is distinct from earthquake magnitude , which is a measure of the amplitude, or size, of seismic waves as specified by a seismograph reading. See below  Earthquake magnitude .",
  "A number of different intensity scales have been set up during the past century and applied to both current and ancient destructive earthquakes. For many years the most widely used was a 10-point scale devised in 1878 by Michele Stefano de Rossi and Franƈois-Alphonse Forel . The scale now generally employed in North America is the Mercalli scale, as modified by Harry O. Wood and Frank Neumann in 1931, in which intensity is considered to be more suitably graded. A 12-point abridged form of the modified Mercalli scale is provided below. Modified Mercalli intensity VIII is roughly correlated with peak accelerations of about one-quarter that of gravity ( g = 9.8 metres, or 32.2 feet, per second squared) and ground velocities of 20 cm (8 inches) per second. Alternative scales have been developed in both Japan and Europe for local conditions. The European (MSK) scale of 12 grades is similar to the abridged version of the Mercalli.",
  "With the use of an intensity scale, it is possible to summarize such data for an earthquake by constructing isoseismal curves, which are lines that connect points of equal intensity. If there were complete symmetry about the vertical through the earthquake’s focus, isoseismals would be circles with the epicentre (the point at the surface of the Earth immediately above where the earthquake originated) as the centre. However, because of the many unsymmetrical geologic factors influencing intensity, the curves are often far from circular. The most probable position of the epicentre is often assumed to be at a point inside the area of highest intensity. In some cases, instrumental data verify this calculation, but not infrequently the true epicentre lies outside the area of greatest intensity.",
  "Earthquake magnitude is a measure of the “size,” or amplitude, of the seismic waves generated by an earthquake source and recorded by seismographs. (The types and nature of these waves are described in the section Seismic waves .) Because the size of earthquakes varies enormously, it is necessary for purposes of comparison to compress the range of wave amplitudes measured on seismograms by means of a mathematical device. In 1935 the American seismologist Charles F. Richter set up a magnitude scale of earthquakes as the logarithm to base 10 of the maximum seismic wave amplitude (in thousandths of a millimetre) recorded on a standard seismograph (the Wood-Anderson torsion pendulum seismograph) at a distance of 100 km (60 miles) from the earthquake epicentre. Reduction of amplitudes observed at various distances to the amplitudes expected at the standard distance of 100 km is made on the basis of empirical tables. Richter magnitudes M  L are computed on the assumption that the ratio of the maximum wave amplitudes at two given distances is the same for all earthquakes and is independent of azimuth.",
  "Richter first applied his magnitude scale to shallow-focus earthquakes recorded within 600 km of the epicentre in the southern California region. Later, additional empirical tables were set up, whereby observations made at distant stations and on seismographs other than the standard type could be used. Empirical tables were extended to cover earthquakes of all significant focal depths and to enable independent magnitude estimates to be made from body- and surface-wave observations. A current form of the Richter scale is shown in the .",
  "At the present time a number of different magnitude scales are used by scientists and engineers as a measure of the relative size of an earthquake. The P -wave magnitude ( M  b ), for one, is defined in terms of the amplitude of the P wave recorded on a standard seismograph. Similarly, the surface-wave magnitude ( M  s ) is defined in terms of the logarithm of the maximum amplitude of ground motion for surface waves with a wave period of 20 seconds.",
  "As defined, an earthquake magnitude scale has no lower or upper limit. Sensitive seismographs can record earthquakes with magnitudes of negative value and have recorded magnitudes up to about 9.0. (The 1906 San Francisco earthquake , for example, had a Richter magnitude of 8.25.)",
  "A scientific weakness is that there is no direct mechanical basis for magnitude as defined above. Rather, it is an empirical parameter analogous to stellar magnitude assessed by astronomers. In modern practice a more soundly based mechanical measure of earthquake size is used—namely, the seismic moment ( M  0 ). Such a parameter is related to the angular leverage of the forces that produce the slip on the causative fault. It can be calculated both from recorded seismic waves and from field measurements of the size of the fault rupture. Consequently, seismic moment provides a more uniform scale of earthquake size based on classical mechanics. This measure allows a more scientific magnitude to be used called moment magnitude ( M  w ). It is proportional to the logarithm of the seismic moment; values do not differ greatly from M  s values for moderate earthquakes. Given the above definitions, the great Alaska earthquake of 1964 , with a Richter magnitude ( M  L ) of 8.3, also had the values M  s = 8.4, M  0 = 820 × 10 27 dyne centimetres, and M  w = 9.2.",
  "Energy in an earthquake passing a particular surface site can be calculated directly from the recordings of seismic ground motion, given, for example, as ground velocity. Such recordings indicate an energy rate of 10 5  watts per square metre (9,300 watts per square foot) near a moderate-size earthquake source. The total power output of a rupturing fault in a shallow earthquake is on the order of 10 14 watts, compared with the 10 5 watts generated in rocket motors.",
  "The surface-wave magnitude M  s has also been connected with the surface energy E  s of an earthquake by empirical formulas. These give E  s = 6.3 × 10 11 and 1.4 × 10 25  ergs for earthquakes of M  s = 0 and 8.9, respectively. A unit increase in M  s corresponds to approximately a 32-fold increase in energy. Negative magnitudes M  s correspond to the smallest instrumentally recorded earthquakes, a magnitude of 1.5 to the smallest felt earthquakes, and one of 3.0 to any shock felt at a distance of up to 20 km (12 miles). Earthquakes of magnitude 5.0 cause light damage near the epicentre ; those of 6.0 are destructive over a restricted area; and those of 7.5 are at the lower limit of major earthquakes.",
  "The total annual energy released in all earthquakes is about 10 25 ergs, corresponding to a rate of work between 10 million and 100 million kilowatts. This is approximately one one-thousandth the annual amount of heat escaping from the Earth ’s interior. Ninety percent of the total seismic energy comes from earthquakes of magnitude 7.0 and higher—that is, those whose energy is on the order of 10 23 ergs or more.",
  "There also are empirical relations for the frequencies of earthquakes of various magnitudes. Suppose N to be the average number of shocks per year for which the magnitude lies in a range about M  s . Then log 10  N = a − b  M  s  fits the data well both globally and for particular regions; for example, for shallow earthquakes worldwide, a = 6.7 and b = 0.9 when M  s > 6.0. The frequency for larger earthquakes therefore increases by a factor of about 10 when the magnitude is diminished by one unit. The increase in frequency with reduction in M  s falls short, however, of matching the decrease in the energy E . Thus, larger earthquakes are overwhelmingly responsible for most of the total seismic energy release. The number of earthquakes per year with M  b > 4.0 reaches 50,000.",
  "Global seismicity patterns had no strong theoretical explanation until the dynamic model called plate tectonics was developed during the late 1960s. This theory holds that the Earth’s upper shell, or lithosphere , consists of nearly a dozen large, quasi-stable slabs called plates. The thickness of each of these plates is roughly 80 km (50 miles). The plates move horizontally relative to neighbouring plates at a rate of 1 to 10 cm (0.4 to 4 inches) per year over a shell of lesser strength called the asthenosphere . At the plate edges where there is contact between adjoining plates, boundary tectonic forces operate on the rocks, causing physical and chemical changes in them. New lithosphere is created at oceanic ridges by the upwelling and cooling of magma from the Earth’s mantle . The horizontally moving plates are believed to be absorbed at the ocean trenches, where a subduction process carries the lithosphere downward into the Earth’s interior. The total amount of lithospheric material destroyed at these subduction zones equals that generated at the ridges.",
  "Seismological evidence (such as the location of major earthquake belts) is everywhere in agreement with this tectonic model. Earthquake sources are concentrated along the oceanic ridges, which correspond to divergent plate boundaries . At the subduction zones, which are associated with convergent plate boundaries, intermediate- and deep-focus earthquakes mark the location of the upper part of a dipping lithosphere slab. The focal mechanisms indicate that the stresses are aligned with the dip of the lithosphere underneath the adjacent continent or island arc.",
  "Some earthquakes associated with oceanic ridges are confined to strike-slip faults, called transform faults, that offset the ridge crests. The majority of the earthquakes occurring along such horizontal shear faults are characterized by slip motions. Also in agreement with the plate tectonics theory is the high seismicity encountered along the edges of plates where they slide past each other. Plate boundaries of this kind, sometimes called fracture zones, include the San Andreas Fault in California and the North Anatolian fault system in Turkey . Such plate boundaries are the site of interplate earthquakes of shallow focus.",
  "The low seismicity within plates is consistent with the plate tectonic description. Small to large earthquakes do occur in limited regions well within the boundaries of plates; however, such intraplate seismic events can be explained by tectonic mechanisms other than plate boundary motions and their associated phenomena.",
  "Most parts of the world experience at least occasional shallow earthquakes—those that originate within 60 km (40 miles) of the Earth’s outer surface. In fact, the great majority of earthquake foci are shallow. It should be noted, however, that the geographic distribution of smaller earthquakes is less completely determined than more severe quakes, partly because the availability of relevant data is dependent on the distribution of observatories.",
  "Of the total energy released in earthquakes, 12 percent comes from intermediate earthquakes—that is, quakes with a focal depth ranging from about 60 to 300 km. About 3 percent of total energy comes from deeper earthquakes. The frequency of occurrence falls off rapidly with increasing focal depth in the intermediate range. Below intermediate depth the distribution is fairly uniform until the greatest focal depths, of about 700 km (430 miles), are approached.",
  "The deeper-focus earthquakes commonly occur in patterns called Benioff zones that dip into the Earth, indicating the presence of a subducting slab. Dip angles of these slabs average about 45°, with some shallower and others nearly vertical. Benioff zones coincide with tectonically active island arcs such as Japan , Vanuatu , Tonga , and the Aleutians , and they are normally but not always associated with deep ocean trenches such as those along the South American Andes . Exceptions to this rule include Romania and the Hindu Kush mountain system. In most Benioff zones, intermediate- and deep-earthquake foci lie in a narrow layer, although recent precise hypocentral locations in Japan and elsewhere show two distinct parallel bands of foci 20 km apart.",
  "Usually, a major or even moderate earthquake of shallow focus is followed by many lesser-size earthquakes close to the original source region. This is to be expected if the fault rupture producing a major earthquake does not relieve all the accumulated strain energy at once. In fact, this dislocation is liable to cause an increase in the stress and strain at a number of places in the vicinity of the focal region, bringing crustal rocks at certain points close to the stress at which fracture occurs. In some cases an earthquake may be followed by 1,000 or more aftershocks a day.",
  "Sometimes a large earthquake is followed by a similar one along the same fault source within an hour or perhaps a day. An extreme case of this is multiple earthquakes. In most instances, however, the first principal earthquake of a series is much more severe than the aftershocks . In general, the number of aftershocks per day decreases with time. The aftershock frequency is roughly inversely proportional to the time since the occurrence of the largest earthquake of the series.",
  "Most major earthquakes occur without detectable warning, but some principal earthquakes are preceded by foreshocks. In another common pattern, large numbers of small earthquakes may occur in a region for months without a major earthquake. In the Matsushiro region of Japan , for instance, there occurred between August 1965 and August 1967 a series of hundreds of thousands of earthquakes, some sufficiently strong (up to Richter magnitude 5) to cause property damage but no casualties. The maximum frequency was 6,780 small earthquakes on April 17, 1966. Such series of earthquakes are called earthquake swarms. Earthquakes associated with volcanic activity often occur in swarms, though swarms also have been observed in many nonvolcanic regions.",
  " P S  Seismic waves generated by an earthquake source are commonly classified into three main types. The first two, the P (or primary) and S (or secondary) waves, propagate within the body of the Earth , while the third, consisting of Love and Rayleigh waves, propagates along its surface. The existence of these types of seismic waves was mathematically predicted during the 19th century, and modern comparisons show that there is a close correspondence between such theoretical calculations and actual measurements of the seismic waves.",
  "  The P seismic waves travel as elastic motions at the highest speeds. They are longitudinal waves that can be transmitted by both solid and liquid materials in the Earth’s interior. With P waves, the particles of the medium vibrate in a manner similar to sound waves—the transmitting media is alternately compressed and expanded. The slower type of body wave, the S wave, travels only through solid material. With S waves, the particle motion is transverse to the direction of travel and involves a shearing of the transmitting rock.",
  "Because of their greater speed, P waves are the first to reach any point on the Earth’s surface. The first P -wave onset starts from the spot where an earthquake originates. This point, usually at some depth within the Earth, is called the focus, or hypocentre. The point at the surface immediately above the focus is known as the epicentre.",
  "Love and Rayleigh waves are guided by the free surface of the Earth. They follow along after the P and S waves have passed through the body of the planet. Both Love and Rayleigh waves involve horizontal particle motion, but only the latter type has vertical ground displacements. As Love and Rayleigh waves travel, they disperse into long wave trains, and, at substantial distances from the source in alluvial basins, they cause much of the shaking felt during earthquakes.",
  "At all distances from the focus, mechanical properties of the rocks, such as incompressibility, rigidity, and density, play a role in the speed with which the waves travel and the shape and duration of the wave trains. The layering of the rocks and the physical properties of surface soil also affect wave characteristics. In most cases, elastic behaviour occurs in earthquakes, but strong shaking of surface soils from the incident seismic waves sometimes results in nonelastic behaviour, including slumping (that is, the downward and outward movement of unconsolidated material) and the liquefaction of sandy soil.",
  "When a seismic wave encounters a boundary that separates rocks of different elastic properties, it undergoes reflection and refraction . There is a special complication because conversion between the wave types usually also occurs at such a boundary: an incident P or S wave can yield reflected P and S waves and refracted P and S waves. Boundaries between structural layers also give rise to diffracted and scattered waves. These additional waves are in part responsible for the complications observed in ground motion during earthquakes. Modern research is concerned with computing synthetic records of ground motion that are realistic in comparison with observed ground shaking, using the theory of waves in complex structures.",
  "The frequency range of seismic waves is large, from as high as the audible range (greater than 20 hertz ) to as low as the frequencies of the free oscillations of the whole Earth , with the gravest period being 54 minutes ( see below  Long-period oscillations of the globe ). Attenuation of the waves in rock imposes high-frequency limits, and in small to moderate earthquakes the dominant frequencies extend in surface waves from about 1 to 0.1 hertz.",
  "The amplitude range of seismic waves is also great in most earthquakes. Displacement of the ground ranges from 10 −10 to 10 −1 metre (4 −12 to 4 inches). In the greatest earthquakes the ground amplitude of the predominant P waves may be several centimetres at periods of two to five seconds. Very close to the seismic sources of great earthquakes, investigators have measured large wave amplitudes with accelerations of the ground exceeding that of gravity (9.8 metres, or 32.2 feet, per second squared) at high frequencies and ground displacements of 1 metre at low frequencies.",
  " Seismographs are used to measure ground motion in both earthquakes and microseisms (small oscillations described below). Most of these instruments are of the pendulum type. Early mechanical seismographs had a pendulum of large mass (up to several tons) and produced seismograms by scratching a line on smoked paper on a rotating drum. In later instruments, seismograms were recorded by means of a ray of light from the mirror of a galvanometer through which passed an electric current generated by electromagnetic induction when the pendulum of the seismograph moved. Technological developments in electronics have given rise to higher-precision pendulum seismometers and sensors of ground motion. In these instruments the electric voltages produced by motions of the pendulum or the equivalent are passed through electronic circuitry to amplify and digitize the ground motion for more exact readings.",
  "Generally speaking, seismographs are divided into three types: short-period, long- (or intermediate-) period, and ultralong-period, or broadband, instruments. Short-period instruments are used to record P and S body waves with high magnification of the ground motion. For this purpose, the seismograph response is shaped to peak at a period of about one second or less. The intermediate-period instruments of the type used by the World-Wide Standardized Seismographic Network (described in the section Earthquake observatories ) had a response maximum at about 20 seconds. Recently, in order to provide as much flexibility as possible for research work, the trend has been toward the operation of very broadband seismographs with digital representation of the signals. This is usually accomplished with very long-period pendulums and electronic amplifiers that pass signals in the band between 0.005 and 50 hertz.",
  "When seismic waves close to their source are to be recorded, special design criteria are needed. Instrument sensitivity must ensure that the largest ground movements can be recorded without exceeding the upper scale limit of the device. For most seismological and engineering purposes the wave frequencies that must be recorded are higher than 1 hertz, and so the pendulum or its equivalent can be small. For this reason accelerometers that measure the rate at which the ground velocity is changing have an advantage for strong-motion recording. Integration is then performed to estimate ground velocity and displacement. The ground accelerations to be registered range up to two times that of gravity . Recording such accelerations can be accomplished mechanically with short torsion suspensions or force-balance mass-spring systems.",
  "Because many strong-motion instruments need to be placed at unattended sites in ordinary buildings for periods of months or years before a strong earthquake occurs, they usually record only when a trigger mechanism is actuated with the onset of ground motion. Solid-state memories are now used, particularly with digital recording instruments, making it possible to preserve the first few seconds before the trigger starts the permanent recording and to store digitized signals on magnetic cassette tape or on a memory chip. In past design absolute timing was not provided on strong-motion records but only accurate relative time marks; the present trend, however, is to provide Universal Time (the local mean time of the prime meridian) by means of special radio receivers, small crystal clocks, or GPS (global positioning system) receivers from satellite clocks.",
  "The prediction of strong ground motion and response of engineered structures in earthquakes depends critically on measurements of the spatial variability of earthquake intensities near the seismic wave source. In an effort to secure such measurements, special arrays of strong-motion seismographs have been installed in areas of high seismicity around the world. Large-aperture seismic arrays (linear dimensions on the order of 1 to 10 km, or 0.6 to 6 miles) of strong-motion accelerometers can now be used to improve estimations of speed, direction of propagation, and types of seismic wave components. Particularly important for full understanding of seismic wave patterns at the ground surface is measurement of the variation of wave motion with depth. To aid in this effort, special digitally recording seismometers have been installed in deep boreholes.",
  "Because 70 percent of the Earth’s surface is covered by water, there is a need for ocean-bottom seismometers to augment the global land-based system of recording stations. Field tests have established the feasibility of extensive long-term recording by instruments on the seafloor. Japan already has a semipermanent seismograph system of this type that was placed on the seafloor off the Pacific coast of central Honshu in 1978 by means of a cable.",
  "Because of the mechanical difficulties of maintaining permanent ocean-bottom instrumentation, different systems have been considered. They all involve placement of instruments on the bottom of the ocean, though they employ various mechanisms for data transmission. Signals may be transmitted to the ocean surface for retransmission by auxiliary apparatus or transmitted via cable to a shore-based station. Another system is designed to release its recording device automatically, allowing it to float to the surface for later recovery.",
  "The use of ocean-bottom seismographs should yield much-improved global coverage of seismic waves and provide new information on the seismicity of oceanic regions. Ocean-bottom seismographs will enable investigators to determine the details of the crustal structure of the seafloor and, because of the relative thinness of the oceanic crust, should make it possible to collect clear seismic information about the upper mantle . Such systems are also expected to provide new data on plate boundaries, on the origin and propagation of microseisms, and on the nature of ocean-continent margins.",
  "Small ground motions known as microseisms are commonly recorded by seismographs. These weak wave motions are not generated by earthquakes, and they complicate accurate recording of the latter. However, they are of scientific interest because their form is related to the Earth’s surface structure.",
  "Some microseisms have local causes—for example, those due to traffic or machinery or due to local wind effects, storms , and the action of rough surf against an extended steep coast. Another class of microseisms exhibits features that are very similar on records traced at earthquake observatories that are widely separated, including approximately simultaneous occurrence of maximum amplitudes and similar wave frequencies. These microseisms may persist for many hours and have more or less regular periods of about five to eight seconds. The largest amplitudes of such microseisms are on the order of 10 −3 cm (0.0004 inch) and occur in coastal regions. The amplitudes also depend to some extent on local geologic structure. Some microseisms are produced when large standing water waves are formed far out at sea. The period of this type of microseism is half that of the standing wave .",
  "Worldwide during the late 1950s, there were only about 700 seismographic stations, which were equipped with seismographs of various types and frequency responses. Few instruments were calibrated; actual ground motions could not be measured, and timing errors of several seconds were common. The World-Wide Standardized Seismographic Network (WWSSN), the first modern worldwide standardized system, was established to help remedy this situation. Each station of the WWSSN had six seismographs—three short-period and three long-period seismographs. Timing and accuracy were maintained by crystal clocks, and a calibration pulse was placed daily on each record. By 1967 the WWSSN consisted of about 120 stations distributed over 60 countries. The resulting data provided the basis for significant advances in research on earthquake mechanisms, global tectonics, and the structure of the Earth ’s interior.",
  "By the 1980s a further upgrading of permanent seismographic stations began with the installation of digital equipment by a number of organizations. Among the global networks of digital seismographic stations now in operation are the Seismic Research Observatories in boreholes 100 metres (330 feet) deep and modified high-gain, long-period surface observatories. The Global Digital Seismographic Network in particular has remarkable capability, recording all motions from Earth tides to microscopic ground motions at the level of local ground noise. At present there are about 128 sites. With this system the long-term seismological goal will have been accomplished to equip global observatories with seismographs that can record every small earthquake anywhere over a broad band of frequencies.",
  "Many observatories make provisional estimates of the epicentres of important earthquakes. These estimates provide preliminary information locally about particular earthquakes and serve as first approximations for the calculations subsequently made by large coordinating centres.",
  "If an earthquake’s epicentre is less than 105° away from an observatory, the epicentre’s position can often be estimated from the readings of three seismograms recording perpendicular components of the ground motion. For a shallow earthquake the epicentral distance is indicated by the interval between the arrival times of P and S waves; the azimuth and angle of wave emergence at the surface are indicated by a comparison of the sizes and directions of the first movements shown in the seismograms and by the relative sizes of later waves, particularly surface waves. It should be noted, however, that in certain regions the first wave movement at a station arrives from a direction differing from the azimuth toward the epicentre . This anomaly is usually explained by strong variations in geologic structures.",
  "When data from more than one observatory are available, an earthquake’s epicentre may be estimated from the times of travel of the P and S waves from source to recorder. In many seismically active regions, networks of seismographs with telemetry transmission and centralized timing and recording are common. Whether analog or digital recording is used, such integrated systems greatly simplify observatory work: multichannel signal displays make identification and timing of phase onsets easier and more reliable. Moreover, online microprocessors can be programmed to pick automatically, with some degree of confidence, the onset of a significant common phase, such as P , by correlation of waveforms from parallel network channels. With the aid of specially designed computer programs , seismologists can then locate distant earthquakes to within about 10 km (6 miles) and the epicentre of a local earthquake to within a few kilometres .",
  "Catalogs of earthquakes felt by humans and of earthquake observations have appeared intermittently for many centuries. The earliest known list of instrumentally recorded earthquakes with computed times of origin and epicentres is for the period 1899–1903. In subsequent years, cataloging of earthquakes has become more uniform and complete. Especially valuable is the service provided by the International Seismological Centre (ISC) at Newbury, Eng. Each month it receives more than 1,000,000 readings from more than 2,000 stations worldwide and preliminary estimates of the locations of approximately 1,600 earthquakes from national and regional agencies and observatories. The ISC publishes a monthly bulletin—with about a two-year delay—that provides all available information on each of more than 5,000 earthquakes.",
  "Various national and regional centres control networks of stations and act as intermediaries between individual stations and the international organizations. Examples of long-standing national centres include the Japan Meteorological Agency and United States National Earthquake Information Center in Colorado (a subdivision of the United States Geological Survey). These centres normally make estimates of the magnitudes, epicentres, origin times, and focal depths of local earthquakes. On the Internet , data on global seismicity is continually accessible through the Web site of the Incorporated Research Institutions for Seismology (IRIS).",
  "An important research technique is to infer the character of faulting in an earthquake from the recorded seismograms. For example, observed distributions of the directions of the first onsets in waves arriving at the Earth’s surface have been effectively used. Onsets are called “compressional” or “dilatational” according to whether the direction is away from or toward the focus, respectively. A polarity pattern becomes recognizable when the directions of the P -wave onsets are plotted on a map—there are broad areas in which the first onsets are predominantly compressions, separated from predominantly dilatational areas by nodal curves near which the P -wave amplitudes are abnormally small.",
  "In 1926 the American geophysicist Perry E. Byerly used patterns of P onsets over the entire globe to infer the orientation of the fault plane in a large earthquake. The polarity method yields two P -nodal curves at the Earth’s surface; one curve is in the plane containing the assumed fault , and the other is in the plane (called the auxiliary plane) that passes through the focus and is perpendicular to the forces of the plane. The recent availability of worldwide broad-based digital recording has enabled computer programs to be written that estimate the fault mechanism and seismic moment from the complete pattern of seismic wave arrivals. Given a well-determined pattern at a number of earthquake observatories, it is possible to locate two planes, one of which is the plane containing the fault.",
  "The search for periodic cycles in earthquake occurrence is an old one. Generally, periodicities in time and space for major earthquakes have not been widely detected or accepted. One problem is that long-term earthquake catalogs are not homogeneous in their selection and reporting. The most extensive catalog of this kind comes from China and begins about 700 bce . The catalog contains some information on about 1,000 destructive earthquakes. The sizes of these earthquakes have been assessed from the reports of damage, intensity, and shaking.",
  "Another approach to the statistical occurrence of earthquakes involves the postulation of trigger forces that initiate the rupture. Such forces have been attributed to severe weather conditions, volcanic activity, and tidal forces, for example. Usually correlations are made between the physical phenomena assumed to provide the trigger and the repetition of earthquakes. Inquiry must always be made to discover whether a causative link is actually present, but in no cases to the present has a trigger mechanism, at least for moderate to large earthquakes, been unequivocally found that satisfies the various necessary criteria.",
  "Statistical methods also have been tried with populations of regional earthquakes. It has been suggested, but never established generally, that the slope b of the regression line between the logarithm of the number of earthquakes and the magnitude for a region may change characteristically with time. Specifically, the claim is that the b value for the population of foreshocks of a major earthquake may be significantly smaller than the mean b value for the region averaged over a long interval of time.",
  "The elastic rebound theory of earthquake sources allows rough prediction of the occurrence of large shallow earthquakes. Harry F. Reid gave, for example, a crude forecast of the next great earthquake near San Francisco . (The theory also predicted, of course, that the place would be along the San Andreas or an associated fault.) The geodetic data indicated that during an interval of 50 years relative displacements of 3.2 metres (10.5 feet) had occurred at distant points across the fault. The maximum elastic-rebound offset along the fault in the 1906 earthquake was 6.5 metres. Therefore, (6.5 ÷ 3.2) × 50, or about 100, years would again elapse before sufficient strain accumulated for the occurrence of an earthquake comparable to that of 1906. The premises are that the regional strain will grow uniformly and that various constraints have not been altered by the great 1906 rupture itself (such as by the onset of slow fault slip). Such strain rates are now being more adequately measured along a number of active faults such as the San Andreas, using networks of GPS sensors.",
  "For many years prediction research has been influenced by the basic argument that strain accumulates in the rock masses in the vicinity of a fault and results in crustal deformation. Deformations have been measured in the horizontal direction along active faults (by trilateration and triangulation) and in the vertical direction by precise leveling and tiltmeters. Some investigators believe that changes in groundwater level occur prior to earthquakes; variations of this sort have been reported mainly from China. Because water levels in wells respond to a complex array of factors such as rainfall, such factors will have to be removed if changes in water level are to be studied in relation to earthquakes.",
  " The theory of dilatancy (that is, an increase in volume) of rock prior to rupture once occupied a central position in discussions of premonitory phenomena of earthquakes, but it now receives less support. It is based on the observation that many solids exhibit dilatancy during deformation. For earthquake prediction the significance of dilatancy, if real, is in its effects on various measurable quantities of the Earth ’s crust, such as seismic velocities, electric resistivity, and ground and water levels. The consequences of dilatancy for earthquake prediction are summarized in the table . The best-studied consequence is the effect on seismic velocities. The influence of internal cracks and pores on the elastic properties of rocks can be clearly demonstrated in laboratory measurements of those properties as a function of hydrostatic pressure. In the case of saturated rocks, experiments predict—for shallow earthquakes—that dilatancy occurs as a portion of the crust is stressed to failure, causing a decrease in the velocities of seismic waves . Recovery of velocity is brought about by subsequent rise of the pore pressure of water, which also has the effect of weakening the rock and enhancing fault slip.",
  "Strain buildup in the focal region may have measurable effects on other observable properties, including electrical conductivity and gas concentration. Because the electrical conductivity of rocks depends largely on interconnected water channels within the rocks, resistivity may increase before the cracks become saturated. As pore fluid is expelled from the closing cracks, the local water table would rise and concentrations of gases such as radioactive radon would increase. No unequivocal confirming measurements have yet been published.",
  "Geologic methods of extending the seismicity record back from the present also are being explored. Field studies indicate that the sequence of surface ruptures along major active faults associated with large earthquakes can sometimes be constructed. An example is the series of large earthquakes in Turkey in the 20th century, which were caused mainly by successive westward ruptures of the North Anatolian Fault. Liquefaction effects preserved in beds of sand and peat have provided evidence—when radiometric dating methods are used—for large paleoearthquakes extending back for more than 1,000 years in many seismically active zones, including the Pacific Northwest coast of the United States .",
  "Less well-grounded precursory phenomena, particularly earthquake lights and animal behaviour, sometimes draw more public attention than the precursors discussed above. Many reports of unusual lights in the sky and abnormal animal behaviour preceding earthquakes are known to seismologists, mostly in anecdotal form. Both these phenomena are usually explained in terms of a release of gases prior to earthquakes and electric and acoustic stimuli of various types. At present there is no definitive experimental evidence to support claims that animals sometimes sense the coming of an earthquake.",
  "Considerable work has been done in seismology to explain the characteristics of the recorded ground motions in earthquakes. Such knowledge is needed to predict ground motions in future earthquakes so that earthquake-resistant structures can be designed. Although earthquakes cause death and destruction through such secondary effects as landslides, tsunamis, fires, and fault rupture, the greatest losses—both of lives and of property—result from the collapse of man-made structures during the violent shaking of the ground. Accordingly, the most effective way to mitigate the damage of earthquakes from an engineering standpoint is to design and construct structures capable of withstanding strong ground motions.",
  "Most elastic waves recorded close to an extended fault source are complicated and difficult to interpret uniquely. Understanding such near-source motion can be viewed as a three-part problem. The first part stems from the generation of elastic waves by the slipping fault as the moving rupture sweeps out an area of slip along the fault plane within a given time. The pattern of waves produced is dependent on several parameters, such as fault dimension and rupture velocity. Elastic waves of various types radiate from the vicinity of the moving rupture in all directions. The geometry and frictional properties of the fault critically affect the pattern of radiation from it.",
  "The second part of the problem concerns the passage of the waves through the intervening rocks to the site and the effect of geologic conditions. The third part involves the conditions at the recording site itself, such as topography and highly attenuating soils. All these questions must be considered when estimating likely earthquake effects at a site of any proposed structure.",
  "  Experience has shown that the ground strong-motion recordings have a variable pattern in detail but predictable regular shapes in general (except in the case of strong multiple earthquakes). In a strong horizontal shaking of the ground near the fault source, there is an initial segment of motion made up mainly of P waves, which frequently manifest themselves strongly in the vertical motion. This is followed by the onset of S waves, often associated with a longer-period pulse of ground velocity and displacement related to the near-site fault slip or fling. This pulse is often enhanced in the direction of the fault rupture and normal to it. After the S onset there is shaking that consists of a mixture of S and P waves, but the S motions become dominant as the duration increases. Later, in the horizontal component, surface waves dominate, mixed with some S body waves. Depending on the distance of the site from the fault and the structure of the intervening rocks and soils , surface waves are spread out into long trains.",
  "In many regions, seismic expectancy maps or hazard maps are now available for planning purposes. The anticipated intensity of ground shaking is represented by a number called the peak acceleration or the peak velocity.",
  "To avoid weaknesses found in earlier earthquake hazard maps, the following general principles are usually adopted today:",
  "Developing engineered structural designs that are able to resist the forces generated by seismic waves can be achieved either by following building codes based on hazard maps or by appropriate methods of analysis. Many countries reserve theoretical structural analyses for the larger, more costly, or critical buildings to be constructed in the most seismically active regions, while simply requiring that ordinary structures conform to local building codes. Economic realities usually determine the goal, not of preventing all damage in all earthquakes but of minimizing damage in moderate, more common earthquakes and ensuring no major collapse at the strongest intensities. An essential part of what goes into engineering decisions on design and into the development and revision of earthquake-resistant design codes is therefore seismological, involving measurement of strong seismic waves, field studies of intensity and damage, and the probability of earthquake occurrence.",
  "Earthquake risk can also be reduced by rapid post-earthquake response. Strong-motion accelerographs have been connected in some urban areas, such as Los Angeles , Tokyo , and Mexico City , to interactive computers . The recorded waves are correlated with seismic intensity scales and rapidly displayed graphically on regional maps via the World Wide Web .",
  "Seismological data on the Earth’s deep structure come from several sources. These include P and S waves in earthquakes and nuclear explosions, the dispersion of surface waves from distant earthquakes, and vibrations of the whole Earth from large earthquakes.",
  "One of the major aims of seismology is to infer the minimum set of properties of the Earth ’s interior that will explain recorded seismic wave trains in detail. Notwithstanding the tremendous progress made in the exploration of the Earth’s deep structure during the first half of the 20th century, realization of this goal was severely limited until the 1960s because of the laborious effort required to evaluate theoretical models and to process the large amounts of earthquake data recorded. The application of high-speed computers with their enormous storage and rapid retrieval capabilities opened the way for major advances in both theoretical work and data handling.",
  "Since the mid-1970s, researchers have studied realistic models of the Earth’s structure that include continental and oceanic boundaries, mountains, and river valleys rather than simple structures such as those involving variation only with depth. In addition, various technical developments have benefited observational seismology. For example, the implications of seismic exploratory techniques developed by the petroleum industry (such as seismic reflection ) have been recognized and the procedures adopted. Equally significant has been the application of three-dimensional imaging methods to the exploration of the Earth’s deep structure. This has been made possible by the development of very fast microprocessors and computers with peripheral display equipment.",
  "The major method for determining the structure of the Earth’s deep interior is the detailed analysis of seismograms of seismic waves. (Such earthquake readings also provide estimates of wave velocities, density, and elastic and inelastic parameters in the Earth.) The primary procedure is to measure the travel times of various wave types, such as P and S , from their source to the recording seismograph. First, however, identification of each wave type with its ray path through the Earth must be made.",
  " F Seismic rays for many paths of P and S waves leaving the earthquake focus F are shown in the figure . Rays corresponding to waves that have been reflected at the Earth’s outer surface (or possibly at one of the interior discontinuity surfaces) are denoted as P  P , P  S , S  P , P  S  S , and so on. For example, P  S corresponds to a wave that is of P type before surface reflection and of S type afterward. In addition, there are rays such as p  P  P , s  P  P , and s  P  S , the symbols p and s corresponding to an initial ascent to the outer surface as P or S waves, respectively, from a deep focus.",
  "An especially important class of rays is associated with a discontinuity surface separating the central core of the Earth from the mantle at a depth of about 2,900 km (1,800 miles) below the outer surface. The symbol c is used to indicate an upward reflection at this discontinuity. Thus, if a P wave travels down from a focus to the discontinuity surface in question, the upward reflection into an S wave is recorded at an observing station as the ray P  c  S and similarly with P  c  P , S  c  S , and S  c  P . The symbol K is used to denote the part (of P type) of the path of a wave that passes through the liquid central core. Thus, the ray S  K  S corresponds to a wave that starts as an S wave, is refracted into the central core as a P wave, and is refracted back into the mantle, wherein it finally emerges as an S wave. Such rays as S  K  K  S correspond to waves that have suffered an internal reflection at the boundary of the central core.",
  "The discovery of the existence of an inner core in 1936 by the Danish seismologist Inge Lehmann made it necessary to introduce additional basic symbols. For paths of waves inside the central core, the symbols i and I are used analogously to c and K for the whole Earth; therefore, i indicates reflection upward at the boundary between the outer and inner portions of the central core, and I corresponds to the part (of P type) of the path of a wave that lies inside the inner portion. Thus, for instance, discrimination needs to be made between the rays P  K  P , P  K  i  K  P , and P  K  I  K  P . The first of these corresponds to a wave that has entered the outer part of the central core but has not reached the inner core, the second to one that has been reflected upward at the inner core boundary, and the third to one that has penetrated into the inner portion.",
  "By combining the symbols p , s , P , S , c , K , i , and I in various ways, notation is developed for all the main rays associated with body earthquake waves. The symbol J has been introduced to correspond to S waves in the inner core, should evidence ever be found for such waves.",
  "Finally, the use of times of travel along rays to infer hidden structure is analogous to the use of X-rays in medical tomography. The method involves reconstructing an image of internal anomalies from measurements made at the outer surface. Nowadays, hundreds of thousands of travel times of P and S waves are available in earthquake catalogs for the tomographic imaging of the Earth’s interior and the mapping of internal structure.",
  "Studies with earthquake recordings have given a picture inside the Earth of a solid but layered and flow-patterned mantle about 2,900 km (1,800 miles) thick, which in places lies within 10 km (6 miles) of the surface under the oceans.",
  "The thin surface rock layer surrounding the mantle is the crust, whose lower boundary is called the Mohorovičić discontinuity. In normal continental regions the crust is about 30 to 40 km thick; there is usually a superficial low-velocity sedimentary layer underlain by a zone in which seismic velocity increases with depth. Beneath this zone there is a layer in which P -wave velocities in some places fall from 6 to 5.6 km per second. The middle part of the crust is characterized by a heterogeneous zone with P velocities of nearly 6 to 6.3 km per second. The lowest layer of the crust (about 10 km thick) has significantly higher P  velocities , ranging up to nearly 7 km per second.",
  "In the deep ocean there is a sedimentary layer that is about 1 km thick. Underneath is the lower layer of the oceanic crust , which is about 4 km thick. This layer is inferred to consist of basalt that formed where extrusions of basaltic magma at oceanic ridges have been added to the upper part of lithospheric plates as they spread away from the ridge crests . This crustal layer cools as it moves away from the ridge crest, and its seismic velocities increase correspondingly.",
  "Below the mantle lies a shell that is 2,255 km thick, which seismic waves show to have the properties of a liquid . At the very centre of the planet is a separate solid core with a radius of 1,216 km. Recent work with observed seismic waves has revealed three-dimensional structural details inside the Earth, especially in the crust and lithosphere, under the subduction zones , at the base of the mantle, and in the inner core. These regional variations are important in explaining the dynamic history of the planet.",
  "Sometimes earthquakes are large enough to cause the whole Earth to ring like a bell. The deepest tone of vibration of the planet is one with a period (the length of time between the arrival of successive crests in a wave train) of 54 minutes. Knowledge of these vibrations has come from a remarkable extension in the range of periods of ground movements that can be recorded by modern digital long-period seismographs that span the entire allowable spectrum of earthquake wave periods: from ordinary P waves with periods of tenths of seconds to vibrations with periods on the order of 12 and 24 hours such as those that occur in Earth tidal movements.",
  " The measurements of vibrations of the whole Earth provide important information on the properties of the interior of the planet. It should be emphasized that these free vibrations are set up by the energy release of the earthquake source but continue for many hours and sometimes even days. For an elastic sphere such as the Earth, two types of vibrations are known to be possible. In one type, called S modes, or spheroidal vibrations, the motions of the elements of the sphere have components along the radius as well as along the tangent. In the second type, which are designated as T modes, or torsional vibrations, there is shear but no radial displacements. The nomenclature is  n   S   l  and  n   T   l  , where the letters n and l are related to the surfaces in the vibration at which there is zero motion. Four examples are illustrated in the figure . The subscript n gives a count of the number of internal zero-motion (nodal) surfaces, and l indicates the number of surface nodal lines.",
  "Several hundred types of S and T vibrations have been identified and the associated periods measured. The amplitudes of the ground motion in the vibrations have been determined for particular earthquakes, and, more important, the attenuation of each component vibration has been measured. The dimensionless measure of this decay constant is called the quality factor Q . The greater the value of Q , the less the wave or vibration damping. Typically, for o  S  10 and o  T  10 , the Q values are about 250.",
  " The rate of decay of the vibrations of the whole Earth with the passage of time can be seen in the figure , where they appear superimposed for 20 hours of the 12-hour tidal deformations of the Earth . At the bottom of the figure these vibrations have been split up into a series of peaks, each with a definite frequency , similar to that of the spectrum of light . Such a spectrum indicates the relative amplitude of each harmonic present in the free oscillations. If the physical properties of the Earth’s interior were known, all these individual peaks could be calculated directly. Instead, the internal structure must be estimated from the observed peaks.",
  "Recent research has shown that observations of long-period oscillations of the Earth discriminate fairly finely between different Earth models. In applying the observations to improve the resolution and precision of such representations of the planet’s internal structure, a considerable number of Earth models are set up, and all the periods of their free oscillations are computed and checked against the observations. Models can then be successively eliminated until only a small range remains. In practice, the work starts with existing models; efforts are made to amend them by sequential steps until full compatibility with the observations is achieved, within the uncertainties of the observations. Even so, the resulting computed Earth structure is not a unique solution to the problem.",
  "Space vehicles have carried equipment to the surface of the Moon and Mars with which to record seismic waves, and seismologists on Earth have received telemetered signals from seismic events in both cases.",
  "By 1969, seismographs had been placed at six sites on the Moon during the U.S. Apollo missions . Recording of seismic data ceased in September 1977. The instruments detected between 600 and 3,000 moonquakes during each year of their operation, though most of these seismic events were very small. The ground noise on the lunar surface is low compared with that of the Earth, so that the seismographs could be operated at very high magnifications. Because there was more than one station on the Moon, it was possible to use the arrival times of P and S waves at the lunar stations from the moonquakes to determine foci in the same way as is done on the Earth.",
  "Moonquakes are of three types. First, there are the events caused by the impact of lunar modules, booster rockets , and meteorites . The lunar seismograph stations were able to detect meteorites hitting the Moon’s surface more than 1,000 km (600 miles) away. The two other types of moonquakes had natural sources in the Moon’s interior: they presumably resulted from rock fracturing, as on Earth. The most common type of natural moonquake had deep foci, at depths of 600 to 1,000 km; the less common variety had shallow focal depths.",
  "Seismological research on Mars has been less successful. Only one of the seismometers carried to the Martian surface by the U.S. Viking landers during the mid-1970s remained operational, and only one potential marsquake was detected in 546 Martian days.",
  "Major historical earthquakes are listed chronologically in the table.",
  "Earthquakes are covered mainly in books on seismology. Recommended introductory texts are Bruce A. Bolt , Earthquakes , 4th ed. (1999), and Earthquakes and Geological Discovery (1993); and Jack Oliver , Shocks and Rocks: Seismology and the Plate Tectonics Revolution (1996). Comprehensive books on key aspects of seismic hazards are Leon Reiter , Earthquake Hazard Analysis—Issues and Insights (1990); and Robert S. Yeats , Kerry Sieh , and Clarence R. Allen , The Geology of Earthquakes (1997). A history of discrimination between underground nuclear explosions and natural earthquakes is given by Bruce A. Bolt , Nuclear Explosions and Earthquakes: The Parted Veil (1976).",
  "More advanced texts that treat the theory of earthquake waves in detail are Agustín Udías , Principles of Seismology (1999); Thorne Lay and Terry C. Wallace , Modern Global Seismology (1995); Peter M. Shearer , Introduction to Seismology (1999); and K.E. Bullen and Bruce A. Bolt , An Introduction to the Theory of Seismology , 4th ed. (1985)."
]