[
  " B-film , also called B-movie, or B-picture , cheaply produced, formulaic film initially intended to serve as the second feature on a double bill. During the 1930s and ’40s, a period often called the Golden Age of Hollywood, B-films were usually paired with bigger-budget, more prestigious A-pictures; but two B-films were sometimes used for midweek or Saturday matinee showings. The characteristics of B-films included low budgets, tight shooting schedules, formulaic scripts, relatively short running times, and minimal production design.",
  "  (Read Martin Scorsese’s Britannica essay on film preservation.)  ",
  "B-films existed because of the exhibition practices of the Golden Age. Showing a program consisting of two full-length feature films began as a way to entice viewers into movie theatres during the Great Depression, when audience levels began to drop. By 1935, 85 percent of American motion-picture theatres were programming double features. A typical bill at this time lasted three hours or more and included two features, cartoons, a newsreel, and previews of forthcoming films.",
  "The major studios, which owned their own theatre chains during the Golden Age, were compelled to meet the demand for double bills. They soon found the most profitable combination to be the pairing of an A-film with a low-budget, quickly produced genre film. A-films pulled in the audience and were rented to theatres for a percentage of the box office receipts. B-pictures were rented at a fixed rate, making the profits easy to calculate but small.",
  "Major studios such as Metro-Goldwyn-Mayer, Inc. (MGM), and RKO Radio Pictures, Inc., had separate operations—called B-units—to produce their B-films. The “B” designation did not originally mean poor quality. Films later considered influential—including producer Val Lewton’s horror series at RKO (e.g., Cat People, 1942; I Walked with a Zombie, 1943) and film noir classics such as director Robert Siodmak’s Criss Cross (1949)—were made as B-films.",
  "As the cost of film production rose during the 1940s, the major studios began to abandon their B-units. Several small studios, including Republic and Monogram, stepped in to fulfill the need for low-budget movies. These studios were collectively known as Poverty Row, Gower Gulch, or the B-Hive.",
  "The B-film further declined after 1948 when the U.S. Supreme Court issued the Paramount decrees, which prohibited restrictive booking practices and forced the major studios to sell their theatres. This restructuring, along with competition from television and changes in tastes, resulted in the demise of double bills.",
  "Low-budget film production and exhibition did not cease, however. Studios such as American International Pictures emerged during the 1950s to offer cheaply produced exploitation movies, which were targeted to specific audiences or low-rent exhibitors. These films, which were not necessarily exhibited with an A-picture, were also dubbed B-films. It was at this juncture that the term B-movie became equated with shoddy production values and poor-quality filmmaking.",
  "Todd McCarthy and Charles Flynn (eds.), Kings of the Bs: Working Within the Hollywood System (1975)."
]