[
  " sports , physical contests pursued for the goals and challenges they entail. Sports are part of every culture past and present, but each culture has its own definition of sports. The most useful definitions are those that clarify the relationship of sports to play , games, and contests. “Play,” wrote the German theorist Carl Diem, “is purposeless activity, for its own sake, the opposite of work.” Humans work because they have to; they play because they want to. Play is autotelic—that is, it has its own goals. It is voluntary and uncoerced. Recalcitrant children compelled by their parents or teachers to compete in a game of football (soccer) are not really engaged in a sport. Neither are professional athletes if their only motivation is their paycheck. In the real world, as a practical matter, motives are frequently mixed and often quite impossible to determine. Unambiguous definition is nonetheless a prerequisite to practical determinations about what is and is not an example of play.",
  "There are at least two types of play. The first is spontaneous and unconstrained. Examples abound. A child sees a flat stone, picks it up, and sends it skipping across the waters of a pond. An adult realizes with a laugh that he has uttered an unintended pun. Neither action is premeditated, and both are at least relatively free of constraint. The second type of play is regulated. There are rules to determine which actions are legitimate and which are not. These rules transform spontaneous play into games, which can thus be defined as rule-bound or regulated play. Leapfrog, chess , “playing house,” and basketball are all games, some with rather simple rules, others governed by a somewhat more complex set of regulations. In fact, the rule books for games such as basketball are hundreds of pages long.",
  "As games, chess and basketball are obviously different from leapfrog and playing house. The first two games are competitive, the second two are not. One can win a game of basketball, but it makes no sense to ask who has won a game of leapfrog. In other words, chess and basketball are contests.",
  "A final distinction separates contests into two types: those that require at least a minimum of physical skill and those that do not. Shuffleboard is a good example of the first; the board games Scrabble and Monopoly will do to exemplify the second. It must of course be understood that even the simplest sports, such as weightlifting, require a modicum of intellectual effort, while others, such as baseball, involve a considerable amount of mental alertness. It must also be understood that the sports that have most excited the passions of humankind, as participants and as spectators, have required a great deal more physical prowess than a game of shuffleboard. Through the ages, sports heroes have demonstrated awesome strength, speed, stamina, endurance, and dexterity.",
  "  Sports, then, can be defined as autotelic (played for their own sake) physical contests. On the basis of this definition, one can devise a simple inverted-tree diagram. Despite the clarity of the definition, difficult questions arise. Is mountain climbing a sport? It is if one understands the activity as a contest between the climber and the mountain or as a competition between climbers to be the first to accomplish an ascent. Are the drivers at the Indianapolis 500 automobile race really athletes? They are if one believes that at least a modicum of physical skill is required for winning the competition. The point of a clear definition is that it enables one to give more or less satisfactory answers to questions such as these. One can hardly understand sport if one does not begin with some conception of what sports are.",
  "No one can say when sports began. Since it is impossible to imagine a time when children did not spontaneously run races or wrestle, it is clear that children have always included sports in their play, but one can only speculate about the emergence of sports as autotelic physical contests for adults. Hunters are depicted in prehistoric art, but it cannot be known whether the hunters pursued their prey in a mood of grim necessity or with the joyful abandon of sportsmen. It is certain, however, from the rich literary and iconographic evidence of all ancient civilizations that hunting soon became an end in itself—at least for royalty and nobility. Archaeological evidence also indicates that ball games were common among ancient peoples as different as the Chinese and the Aztecs. If ball games were contests rather than noncompetitive ritual performances, such as the Japanese football game kemari , then they were sports in the most rigorously defined sense. That it cannot simply be assumed that they were contests is clear from the evidence presented by Greek and Roman antiquity, which indicates that ball games had been for the most part playful pastimes like those recommended for health by the Greek physician Galen in the 2nd century ce .",
  "It is unlikely that the 7th-century Islamic conquest of North Africa radically altered the traditional sports of the region. As long as wars were fought with bow and arrow, archery contests continued to serve as demonstrations of ready prowess. The prophet Muhammad specifically authorized horse races, and geography dictated that men race camels as well as horses. Hunters, too, took their pleasures on horseback.",
  "Among the many games of North Africa was ta kurt om el mahag (“the ball of the pilgrim’s mother”), a Berber bat-and-ball contest whose configuration bore an uncanny resemblance to baseball. Koura , more widely played, was similar to football (soccer).",
  "Cultural variation among black Africans was far greater than among the Arab peoples of the northern littoral. Ball games were rare, but wrestling of one kind or another was ubiquitous. Wrestling’s forms and functions varied from tribe to tribe. For the Nuba of southern Sudan, ritual bouts, for which men’s bodies were elaborately decorated as well as carefully trained, were the primary source of male status and prestige. The Tutsi and Hutu of Rwanda were among the peoples who staged contests between females. Among the various peoples of sub-Saharan Africa, wrestling matches were a way to celebrate or symbolically encourage human fertility and the earth’s fecundity. In southern Nigeria, for instance, Igbo tribesmen participated in wrestling matches held every eighth day throughout the three months of the rainy season; hard-fought contests, it was thought, persuaded the gods to grant abundant harvests of corn (maize) and yams. Among the Diola of the Gambia, adolescent boys and girls wrestled (though not against one another) in what was clearly a prenuptial ceremony. Male champions were married to their female counterparts. In other tribes, such as the Yala of Nigeria, the Fon of Benin, and the Njabi of the Congo, boys and girls grappled with each other. Among the Kole, it was the kin of the bride and the bridegroom who wrestled. Stick fights, which seem to have been less closely associated with religious practices, were common among many tribes, including the Zulu and Mpondo of southern Africa.",
  "Contests for runners and jumpers were to be found across the length and breadth of the continent. During the age of imperialism, explorers and colonizers were often astonished by the prowess of these “primitive” peoples. Nandi runners of Kenya’s Rift Valley seemed to run distances effortlessly at a pace that brought European runners to pitiable physical collapse. Tutsi high jumpers of Rwanda and Burundi soared to heights that might have seemed incredible had not the jumpers been photographed in flight by members of Adolf Friedrich zu Mecklenburg’s anthropological expedition at the turn of the 20th century.",
  "Long before European conquest introduced modern sports and marginalized native customs, conversion to Islam tended to undercut—if not totally eliminate—the religious function of African sports, but elements of pre-Christian and pre-Islamic magical cults have survived into postcolonial times. Zulu football players rely not only on their coaches and trainers but also on the services of their inyanga (“witch doctor”).",
  "Like the highly evolved civilizations of which they are a part, traditional Asian sports are ancient and various. Competitions were never as simple as they seemed to be. From the Islamic Middle East across the Indian subcontinent to China and Japan, wrestlers—mostly but not exclusively male—embodied and enacted the values of their cultures. The wrestler’s strength was always more than a merely personal statement. More often than not, the men who strained and struggled understood themselves to be involved in a religious endeavour. Prayers, incantations, and rituals of purification were for centuries an important aspect of the hand-to-hand combat of Islamic wrestlers. It was not unusual to combine the skills of the wrestler with those of a mystic poet. Indeed, the celebrated 14th-century Persian pahlavan (ritual wrestler) Maḥmūd Khwārezmī was both.",
  "Typical of the place of sport within a religious context was the spectacle of 50 sturdy Turks who wrestled in Istanbul in 1582 to celebrate the circumcision of the son of Murad III. When Indian wrestlers join an akhara (gymnasium), they commit themselves to the quest for a holy life. As devout Hindus, they recite mantras as they do their knee bends and push-ups. In their struggle against “pollution,” they strictly control their diet, sexual habits, breathing, and even their urination and defecation.",
  "  While the religious aspects of Turkish and Iranian “houses of strength” (where weightlifting and gymnastics were practiced) became much less salient in the course of the 20th century, the elders in charge of Japanese sumo added a number of Shintō elements to the rituals of their sport to underscore their claim that it is a unique expression of Japanese tradition. A somewhat arbitrary distinction can be made between wrestling and the many forms of unarmed hand-to-hand combat categorized as martial arts. The emphasis of the latter is military rather than religious, instrumental rather than expressive. Chinese wushu (“military skill”), which included armed as well as unarmed combat, was highly developed by the 3rd century bce . Its unarmed techniques were especially prized within Chinese culture and were an important influence on the martial arts of Korea, Japan, and Southeast Asia. Much less well known in the West are varma adi (“hitting the vital spots”) and other martial arts traditions of South Asia. In the early modern era, as unarmed combat became obsolete, the emphasis of Asian martial arts tended to shift back toward religion. This shift can often be seen in the language of sports. Japanese kenjutsu (“techniques of the sword”) became  kendō  (“the way of the sword”).",
  "Of the armed (as opposed to unarmed) martial arts, archery was among the most important in the lives of Asian warriors from the Arabian to the Korean peninsulas. Notably, the Japanese samurai practiced many forms of archery, the most colourful of which was probably yabusame , whose mounted contestants drew their bows and loosed their arrows while galloping down a straight track some 720 to 885 feet (220 to 270 metres) long. They were required to shoot in quick succession at three small targets—each about 9 square inches (55 square cm) placed on 3-foot- (0.9-metre-) high poles 23 to 36 feet (7 to 11 metres) from the track and spaced at intervals of 235 to 295 feet (71.5 to 90 metres). In yabusame , accuracy was paramount.",
  "In Turkey, where the composite (wood plus horn) bow was an instrument of great power, archers competed for distance. At Istanbul’s Okmeydanı (“Arrow Field”), the record was set in 1798 when Selim III ’s arrow flew more than 2,900 feet (884 metres).",
  "As can be seen in Mughal art of the 16th and 17th centuries, aristocratic Indians—like their counterparts throughout Asia—used their bows and arrows for hunting as well as for archery contests. Mounted hunters demonstrated equestrian as well as toxophilite skills. The Asian aristocrat’s passion for horses, which can be traced as far back as Hittite times, if not earlier, led not only to horse races (universal throughout Asia) but also to the development of polo and a host of similar equestrian contests. These equestrian games may in fact be the most distinctive Asian contribution to the repertory of modern sports.",
  "In all probability, polo evolved from a far rougher game played by the nomads of Afghanistan and Central Asia. In the form that survived into the 21st century, Afghan buzkashi is characterized by a dusty melee in which hundreds of mounted tribesmen fought over the headless carcass of a goat. The winner was the hardy rider who managed to grab the animal by the leg and drag it clear of the pack. Since buzkashi was clearly an inappropriate passion for a civilized monarch, polo filled the bill. Persian manuscripts from the 6th century refer to polo played during the reign of Hormuz I (271–273). The game was painted by miniaturists and celebrated by Persian poets such as Ferdowsī (c. 935–c. 1020) and Ḥāfeẓ (1325/26–1389/90). By 627 polo had spread throughout the Indian subcontinent and had reached China, where it became a passion among those wealthy enough to own horses. (All 16 emperors of the Tang dynasty [618–907] were polo players.) As with most sports, the vast majority of polo players were male, but the 12th-century Persian poet Neẓāmī commemorated the skills of Princess Shīrīn. Moreover, if numerous terra-cotta figures can be trusted as evidence, polo was also played by aristocratic Chinese women.",
  "There were also ball games for ordinary men and women. Played with carefully sewn stuffed skins, with animal bladders, or with found objects as simple as gourds, chunks of wood, or rounded stones, ball games are universal. Ball games of all sorts were quite popular among the Chinese. Descriptions of the game cuju , which resembled modern football (soccer), appeared as early as the Eastern Han dynasty (25–220). Games similar to modern badminton were also played in the 1st century. Finally, the Ming dynasty (1368–1644) scroll painting Grove of Violets depicts elegantly attired ladies playing chuiwan , a game similar to modern golf.",
  "Sports were unquestionably common in ancient Egypt, where pharaohs used their hunting prowess and exhibitions of strength and skill in archery to demonstrate their fitness to rule. In such exhibitions, pharaohs such as Amenhotep II (ruled 1426–1400 bce ) never competed against anyone else, however, and there is reason to suspect that their extraordinary achievements were scribal fictions. Nonetheless, Egyptians with less claim to divinity wrestled, jumped, and engaged in ball games and stick fights. In paintings found at Beni Hassan, in a tomb dating from the Middle Kingdom (1938–c. 1630 bce ), there are studies of 406 pairs of wrestlers demonstrating their skill.",
  "Since Minoan script still baffles scholars, it is uncertain whether images of Cretan boys and girls testing their acrobatic skills against bulls depict sport, religious ritual, or both. That the feats of the Cretans may have been both sport and ritual is suggested by evidence from Greece, where sports had a cultural significance unequaled anywhere else before the rise of modern sports. Secular and religious motives mingle in history’s first extensive “sports report,” found in Book XXIII of Homer’s  Iliad  in the form of funeral games for the dead Patroclus. These games were part of Greek religion and were not, therefore, autotelic; the contests in the Odyssey , on the other hand, were essentially secular. Odysseus was challenged by the Phaeacians to demonstrate his prowess as an athlete. In general, Greek culture included both cultic sports, such as the Olympic Games honouring Zeus , and secular contests.",
  "The most famous association of sports and religion was certainly the Olympic Games , which Greek tradition dates from 776 bce . In the course of time, the earth goddess Gaea, originally worshiped at Olympia, was supplanted in importance by the sky god Zeus, in whose honour priestly officials conducted quadrennial athletic contests. Sacred games also were held at Delphi (in honour of Apollo), Corinth, and Nemea. These four events were known as the periodos , and great athletes, such as Theagenes of Thasos, prided themselves on victories at all four sites. Although most of the events contested at Greek sacred games remain familiar, the most important competition was the chariot race. The extraordinary prestige accorded athletic triumphs brought with it not only literary accolades (as in the odes of Pindar ) and visual commemoration (in the form of statues of the victors) but also material benefits, contrary to the amateur myth propagated by 19th-century philhellenists. Since the Greeks were devoted to secular sports as well as to sacred games, no polis, or city-state, was considered a proper community if it lacked a gymnasium where, as the word gymnos indicates, naked male athletes trained and competed. Except in militaristic Sparta, Greek women rarely participated in sports of any kind. They were excluded from the Olympic Games even as spectators (except for the priestess of Demeter). The 2nd-century- ce traveler Pausanias wrote of races for girls at Olympia, but these events in honour of Hera were of minor importance.",
  "Although chariot races were among the most popular sports spectacles of the Roman and Byzantine eras, as they had been in Greek times, the Romans of the republic and the early empire were quite selectively enthusiastic about Greek athletic contests. Emphasizing physical exercises for military preparedness, an important motive in all ancient civilizations, the Romans preferred boxing, wrestling, and hurling the javelin to running footraces and throwing the discus. The historian Livy wrote of Greek athletes’ appearing in Rome as early as 186 bce ; however, the contestants’ nudity shocked Roman moralists. The emperor Augustus instituted the Actian Games in 27 bce to celebrate his victory over Antony and Cleopatra, and several of his successors began similar games, but it was not until the later empire, especially during the reign of Hadrian (117–138 ce ), that many of the Roman elite developed an enthusiasm for Greek athletics.",
  "Greater numbers flocked to the chariot races held in Rome’s Circus Maximus . They were watched by as many as 250,000 spectators, five times the number that crowded into the Colosseum to enjoy gladiatorial combat. Nevertheless, there is some evidence that the latter contests were actually more popular than the former. Indeed, the munera , which pitted man against man, and the venationes , which set men against animals, became popular even in the Greek-speaking Eastern Empire, which historians once thought immune from the lust for blood. The greater frequency of chariot races can be explained in part by the fact that they were relatively inexpensive compared with the enormous costs of gladiatorial combat. The editor who staged the games usually rented the gladiators from a lanista (the manager of a troupe of gladiators) and was required to reimburse him for losers executed in response to a “thumbs down” sign. Brutal as these combats were, many of the gladiators were free men who volunteered to fight, an obvious sign of intrinsic motivation. Indeed, imperial edicts were needed to discourage the aristocracy’s participation. During the reign of Nero (54–68), female gladiators were introduced into the arena.",
  "The Roman circus and the Byzantine hippodrome continued to provide chariot racing long after Christian protests (and heavy economic costs) ended the gladiatorial games, probably early in the 5th century. In many ways the chariot races were quite modern. The charioteers were divided into bureaucratically organized factions (e.g., the “Blues” and the “Greens”), which excited the loyalties of fans from Britain to Mesopotamia. Charioteers boasted of the number of their victories as modern athletes brag about their “stats,” indicating, perhaps, some incipient awareness of what in modern times are called sports records. The gladiatorial games, however, like the Greek games before them, had a powerful religious dimension. The first Roman combats, in 264 bce , were probably derived from Etruscan funeral games in which mortal combat provided companions for the deceased. It was the idolatry of the games, even more than their brutality, that horrified Christian protesters. The less-obtrusive pagan religious associations of the chariot races helped them survive for centuries after Constantine’s conversion to Christianity in 337 ce .",
  "The sports of medieval Europe were less well-organized than those of classical antiquity. Fairs and seasonal festivals were occasions for men to lift stones or sacks of grain and for women to run smock races (for a smock, not in one). The favourite sport of the peasantry was folk football, a wild no-holds-barred unbounded game that pitted married men against bachelors or one village against another. The violence of the game, which survived in Britain and in France until the late 19th century, prompted Renaissance humanists, such as Sir Thomas Elyot , to condemn it as more likely to maim than to benefit the participants.",
  "The nascent bourgeoisie of the Middle Ages and the Renaissance amused itself with archery matches, some of which were arranged months in advance and staged with considerable fanfare. When town met town in a challenge of skill, the companies of crossbowmen and longbowmen marched behind the symbols of St. George, St. Sebastian, and other patrons of the sport. It was not unusual for contests in running, jumping, cudgeling, and wrestling to be offered for the lower classes who attended the match as spectators. Grand feasts were part of the program, and drunkenness commonly added to the revelry. In Germanic areas a Pritschenkoenig was supposed to simultaneously keep order and entertain the crowd with clever verses.",
  "  The burghers of medieval towns were welcome to watch the aristocracy at play, but they were not allowed to participate in tournaments or even, in most parts of Europe, to compete in imitative tournaments of their own. Tournaments were the jealously guarded prerogative of the medieval knight and were, along with hunting and hawking, his favourite pastime. At the tilt, in which mounted knights with lances tried to unhorse one another, the knight was practicing the art of war, his raison d’être. He displayed his prowess before lords, ladies, and commoners and profited not only from valuable prizes but also from ransoms exacted from the losers. Between the 12th and the 16th century, the dangerously wild free-for-all of the early tournament evolved into dramatic presentations of courtly life in which elaborate pageantry and allegorical display quite overshadowed the frequently inept jousting. Some danger remained even amid the display. At one of the last great tournaments, in 1559, Henry II of France was mortally wounded by a splintered lance.",
  "Peasant women participated freely in the ball games and footraces of medieval times, and aristocratic ladies hunted and kept falcons, but middle-class women contented themselves with spectatorship. Even so, they were more active than their contemporaries in Heian Japan during the 8th to 12th centuries. Encumbered by many-layered robes and sequestered in their homes, the Japanese ladies were unable to do more than peep from behind their screens at the courtiers’ mounted archery contests.",
  "By the time of the Renaissance , sports had become entirely secular, but in the minds of the 17th-century Czech educator John Amos Comenius and other humanists, a concern for physical education on what were thought to be classic models overshadowed the competitive aspects of sports. Indeed, 15th- and 16th-century elites preferred dances to sports and delighted in geometric patterns of movement. Influenced by the ballet, which developed in France during this period, choreographers trained horses to perform graceful movements rather than to win races. French and Italian fencers such as the famed Girard Thibault, whose L’Académie de l’espée (“Fencing Academy”) appeared in 1628, thought of their activity more as an art form than as a combat. Northern Europeans emulated them. Humanistically inclined Englishmen and Germans admired the cultivated Florentine game of calcio , a form of football that stressed the good looks and elegant attire of the players. Within the world of sports, the emphasis on aesthetics, rather than achievement, was never stronger.",
  "While the aesthetic element survives in sports such as figure skating , diving , and gymnastics , the modern emphasis is generally on quantified achievement. In fact, the transition from Renaissance to modern sports can be seen in a semantic shift; the word measure , which once connoted a sense of balance and proportion, began to refer almost exclusively to numerical measurements.",
  "Behind this epochal transition from Renaissance to modern sports lay the scientific developments that sustained the Industrial Revolution . Technicians sought to perfect equipment. Athletes trained systematically to achieve their physical maximum. New games, such as basketball, volleyball, and team handball, were consciously invented to specifications as if they were new products for the market. As early as the late 17th century, quantification became an important aspect of sports, and the cultural basis was created for the concept of the sports record. The word record , in the sense of an unsurpassed quantified achievement, appeared, first in English and then in other languages, late in the 19th century, but the concept went back nearly 200 years.",
  "The development of modern sports having begun in late 17th-century England, it was appropriate that the concept of the sports record also first appeared there. During the Restoration and throughout the 18th century, traditional pastimes such as stick fighting and bullbaiting, which the Puritans had condemned and driven underground, gave way to organized games such as cricket , which developed under the leadership of the Marylebone Cricket Club (founded 1787). Behind these changes lay a new conception of rationalized competition. Contests that seem odd to the modern mind, such as those in which the physically impaired were matched against children, were replaced by horse races in which fleeter steeds were handicapped, a notion of equality that led eventually to age and weight classes (though not to height classes) in many modern sports. Although the traditional sport of boxing flourished throughout the 18th century, it was not until 1743 that boxer-entrepreneur Jack Broughton formulated rules to rationalize and regulate the sport. The minimal controls on mayhem imposed by Broughton were strengthened in 1867 by the marquess of Queensberry .",
  "In the course of the 19th century, modern forms of British sports spread from the privileged classes to the common people. National organizations developed to standardize rules and regulations, to transform sporadic challenge matches into systematic league competition, to certify eligibility, and to register results.",
  " Rowing (crew), one of the first sports to assume its modern form, began to attract a following after the first boat race between the Universities of Oxford and Cambridge (1829) and the inauguration of the Henley Regatta (1839). “ Athletics ” became popular after Oxford and Cambridge held their first track-and-field meet in 1864. The Amateur Athletic Association, which emphasized track-and-field sports, was founded in 1880, the Amateur Rowing Association in 1882.",
  "Neither sport enjoyed the popularity of association football . The various versions of football played at elite schools such as Eton, Winchester, and Charterhouse were codified in the 1840s, and England’s Football Association was formed in 1863 to propagate what came to be known as “association football” (or simply “soccer”). The Rugby Football Union followed in 1871. Although the Football Association and most of its affiliated clubs were initially dominated by the middle and upper classes, soccer had definitely become “the people’s game” by the end of the century. For instance, Manchester United, one of Britain’s most storied teams, can trace its history to a club established by the city’s railroad workers in 1880.",
  "The entry of working-class athletes into soccer and other sports, as participants if not as administrators, inspired Britain’s middle and upper classes to formulate the amateur rule, which originally excluded not only anyone paid for athletic performances but also anyone who earned his living by manual labour of any sort.",
  "From the British Isles, modern sports (and the amateur rule) were diffused throughout the world. Sports that originally began elsewhere, such as tennis (which comes from Renaissance France), were modernized and exported as if they too were raw materials imported for British industry to transform and then export as finished goods.",
  "In the 18th and 19th centuries, the British expelled the French from Canada and from India and extended British rule over much of Africa. To the ends of the earth, cricket followed the Union Jack, which explains the game’s current popularity in Australia, South Asia, and the West Indies. Rugby football flourishes in other postcolonial cultures, such as New Zealand and South Africa, where the British once ruled. It was, however, association football’s destiny to become the world’s most widely played modern sport.",
  "Cricket and rugby seemed to require British rule in order to take root. Football needed only the presence of British economic and cultural influence. In Buenos Aires, for instance, British residents founded clubs for cricket and a dozen other sports, but it was the Buenos Aires Football Club, founded June 20, 1867, that kindled Argentine passions. In almost every instance, the first to adopt football were the cosmopolitan sons of local elites, many of whom had been sent to British schools by their Anglophile parents. Seeking status as well as diversion, middle-class employees of British firms followed the upper-class lead. From the gamut of games played by the upper and middle classes, the industrial workers of Europe and Latin America, like the indigenous population of Africa, appropriated football as their own.",
  " Harper’s  By the late 19th century, the United States had begun to rival Great Britain as an industrial power and as an inventor of modern sports. Enthusiasts of baseball denied its origins in British children’s games such as cat and rounders and concocted the myth of Abner Doubleday , who allegedly invented the game in 1839 in Cooperstown, New York. A more plausible date for the transformation of cat and rounders into baseball is 1845, when a New York bank clerk named Alexander Cartwright formulated the rules of the Knickerbocker Base Ball Club. Even before the Civil War, the game had been taken over by urban workers such as the volunteer firemen who organized the New York Mutuals in 1857. By the time the National League was created in 1876, the game had spread from coast to coast. (It was not until the 1950s, however, that Major League Baseball planted its first franchises on the West Coast.)",
  " Basketball , invented in 1891 by James Naismith , and volleyball, invented four years later by William Morgan, are both quintessentially modern sports. Both were scientifically designed to fulfill a perceived need for indoor games during harsh New England winters.",
  "Football (soccer) is the world’s most popular ball game, but, wherever American economic and culture influence has been dominant, the attraction to baseball, basketball, and volleyball has tended to exceed that to football. Baseball, for example, boomed in Cuba, where Nemesio Guilló introduced the game to his countrymen in 1863, and in Japan, where Horace Wilson, an American educator, taught it to his Japanese students in 1873. Since basketball and volleyball were both invented under the auspices of the YMCA (Young Men’s Christian Association), it seemed reasonable for YMCA workers to take the games to China, Japan, and the Philippines, where the games took root early in the 20th century. It was, however, only in the post-World War II world that U.S. influence generally overwhelmed British; only then did basketball and volleyball become globally popular.",
  "American gridiron football, which now enjoys enclaves of enthusiasm in Great Britain and on the European continent, traces its origins to 1874, when a rugby team from Montreal’s McGill University traveled to Cambridge, Massachusetts, to challenge a team of Harvard University students. Adopted by American students, rugby evolved into gridiron football , and in that form it became the leading intercollegiate game. Although the National Football League was established in 1920 (at $100 a franchise), the professional game was a relatively minor affair until after World War II, when football joined baseball and basketball to form the “trinity” of American sports. ( Ice hockey , imported from Canada, runs a poor fourth in the race for fans of team sports.)",
  "In the dramatic global diffusion of modern sports, the French have also played a significant role. They left it to an Englishman, Walter Wingfield, to modernize the game of tennis , which originated in Renaissance France, but the French took the lead, early in the 19th century, in the development of the bicycle and in the popularization of cycling races. The first Paris–Rouen race took place in 1869; the Tour de France was inaugurated in 1903. The huge success of the latter inspired the Giro d’Italia (1909) and a number of other long-distance races.",
  "The French also left their mark on sports in another way. In 1894, at a conference held at the Sorbonne in Paris, Pierre de Coubertin selected the first members of a Comité International Olympique ( International Olympic Committee ; IOC) and arranged for the first Olympic Games of the modern era to be held in Athens in 1896. In 1904 Robert Guérin led a group of football (soccer) enthusiasts in forming the Fédération Internationale de Football Association (FIFA), which England’s insular Football Association was at first too arrogant to join. The English name of the International Amateur Athletic Federation (1912; since 2001 known as the International Association of Athletics Federations ; IAAF) suggests that the British were more cooperative in track-and-field sports than in football, but the IAAF’s founder was a Swedish industrialist, Sigfrid Edström.",
  "Japan, one of the few non-Western nations where traditional sports still rival modern ones in popularity, is also one of the few non-Western nations to contribute significantly to the repertory of modern sports. Judo , invented in 1882 by Kanō Jigorō in an effort to combine Western and Asian traditions, attracted European adherents early in the 20th century. In 1964 judo became an Olympic sport.",
  "From 1952, when the Soviet Union emerged from its self-imposed sports isolation, to 1991, when the Union of Soviet Socialist Republics ceased to exist, the communist societies of eastern Europe dominated the Olympic Games. In 1988, for instance, the German Democratic Republic (East Germany), with a population of some 16 million, outscored the United States, 15 times its size. While anabolic steroids and other banned substances contributed to the East Germans’ triumph, credit must also be given to their relentless application of scientific methods in the search for the ultimate sports performance. The collapse of communism undermined state-sponsored elite sports in eastern Europe, but not before the nations of western Europe had begun to emulate their athletic adversaries by sponsoring scientific research, subsidizing elite athletes, and constructing vast training centres.",
  "In the 20th century, sports underwent social as well as spatial diffusion. After a long and frequently bitter struggle, African Americans, Australian Aboriginal people, “Cape Coloureds” (in South Africa), and other excluded racial and ethnic groups won the right to participate in sports. After a long and somewhat less-bitter struggle, women also won the right to compete in sports—such as rugby—that had been considered quintessentially masculine.",
  "While the British Isles may be considered the homeland of modern sports, modern physical education can be traced back to German and Scandinavian developments of the late 18th and early 19th centuries. Men such as Johann Christoph Friedrich Guts Muths in Germany and Per Henrik Ling in Sweden elaborated systems of gymnastic exercise that were eventually adopted by school systems in Britain, the United States, and Japan. These noncompetitive alternatives to modern sports also flourished in eastern Europe during the late 19th and early 20th centuries. Among repressed ethnic peoples such as the Poles and Czechs, gymnastics became almost a way of life. For them, gymnastic festivals were grand occasions at which tens of thousands of disciplined men and women demonstrated nationalistic fervour.",
  "Gymnastic fervour was not, however, much in evidence among the world’s schoolchildren and college students as they encountered gymnastics in required physical-education classes. Calisthenic exercises designed to improve health and fitness were dull and dreary compared with the excitement of modern sports. Long before the end of the 20th century, even German educators had abandoned Leibeserziehung (“physical education”) in favour of Sportunterricht (“instruction in sports”). For young and for old, for better and for worse, sports are the world’s passion.",
  "Although the German scholar Heinz Risse published Soziologie des Sports (“Sociology of Sports”) in 1921, it was not until 1966 that an international group of sociologists formed a committee and founded a journal to study the place of sports in society. Since then, many universities have established centres for research into the sociology of sports. Organizations such as the North American Society for the Sociology of Sport have proliferated. Prominent among the topics investigated by sports sociologists are socialization into and through sports; sports and national identity; globalization and sports processes; elite sports systems; labour migration and elite sports; mass media and the rise of professional sports; commercialization of sports; violence and sports; gender and sports; race, ethnicity, and sports; and human performance and the use of drugs.",
  "Several questions are central to understanding the socialization into sports. How exactly are young people socialized to become involved in sports and to stay involved in them? Why do some continue to participate actively in sports throughout their lives while others are content to watch? Different questions arise when one asks how people are changed as a result of their socialization into sports. Why do some people find their primary identity as athletes, and what happens when injury, age, or loss of motivation brings their athletic careers to an end? More generally, what impact do sports have on an individual’s character, relationships, thoughts, and feelings?",
  "Socialization is the process by which people become familiar with and adapt themselves to the interpersonal relationships of their social world. Through socialization, people develop ideas about themselves and about those with whom they interact. Inevitably, socialization is a two-way process that affects everyone to a greater or lesser degree. It takes place throughout one’s life, but it is during the early years that the most crucial phases occur. In these phases a person’s sense of self, social identity, and relationships with others are shaped.",
  " Play , games, contests, and sports have crucial and quite specific roles in the general socialization process. The sense of self is not natural; it develops through childhood socialization as a result of role-playing. Influenced by George Herbert Mead and Jean Piaget among others, sociologists have identified two stages in childhood socialization: a “play stage” and a “game stage.” In the play stage (more accurately, the stage of noncompetitive games), children play the role of a father, mother, teacher, firefighter, or athlete. Children learn the difference between their real selves and the parts they are playing. As they grow older, children shift from noncompetitive games (such as peekaboo and playing house) to contests (such as footraces and ball games). In the game stage (more accurately, the stage of competitive games), children encounter stricter rules and regulations. They develop a reflexive conception of the self and its position in relation to others, and they learn to see themselves as others see them. Through socialization with “significant others” and with the “generalized other,” children develop their sense of identity and self. They become self-conscious social actors.",
  "In most premodern societies, boys were encouraged by their families to compete in sports, which were presumed to prepare them for their adult roles as warriors and workers, while girls were encouraged to continue to play noncompetitive games that prepared them for motherhood. In modern societies, boys and young men continue to outnumber girls and young women involved in sports competition, but the gender gap has narrowed considerably. This has been true for the private clubs that organize European sports as well as for the interscholastic and intercollegiate teams that are a prominent feature of the North American sports landscape.",
  "The role of socializer into sports has been played by many actors, among them parents, older siblings, peers, teachers, coaches, and elite athletes appearing in the mass media. In the course of the 20th century, parents and older siblings became relatively less influential while coaches and elite athletes became more influential.",
  "In modern as in premodern societies, there is a tendency for sports participation to decline with age because of both the added responsibilities and time demands of paid employment and of parenthood and the physical decline of the body. Early socialization into sports is the best predictor of lifelong involvement in sports. Those who disliked sports as children are unlikely to become involved as adults, while those who loved sports are likely to participate throughout their lives. Elite athletes may be an exception to this rule. If pushed as children to compete nationally and internationally, they are liable to experience burnout and to abandon their sports careers before reaching adulthood.",
  "The value of socialization through sports has long been recognized, which is one reason for state support of physical education in the schools and adult-organized children’s sports programs. The effects of sports socialization, however, are not always what the socializers expect. They are in fact quite controversial. From the mid-19th to the early 21st century, sports were alleged to train young athletes in self-discipline, teamwork, leadership, and other highly prized traits and behaviours. Empirical research has shown that involvement in sports can also inculcate a socially destructive desire to win at all costs. Depending on the values of the socializing agents, sports can encourage young people to play fairly or to cheat. The evidence suggests that the propensity to cheat increases with age and the level of competition.",
  "Another important aspect of the experience of sports is emotion, the feelings that reflect athletes’ self-evaluation or expectation of their performance and their perception of others’ evaluations and expectations. Some of the feelings expressed are anticipatory, prior to performing. Pregame “butterflies in the stomach” are as familiar to an athlete as stage fright is to an actor. Other feelings occur during and after the performance. All these feelings are “scripted” by the subculture of the sport in question. These scripts, or “feeling rules,” guide athletes as they manage their emotions, prompting, for instance, appropriate behaviour during pregame renditions of national anthems or during postgame victory celebrations. Norms for the display of emotions vary widely among sports. Rugby players and boxers are permitted to express their feelings with ostentatious displays that are impermissible for golfers and sumo wrestlers. The importance of the contest is another variable influencing the emotions involved. Exhibition matches evoke less-intense feelings than football’s World Cup championship game.",
  "The orchestration of emotions in sports begins with the arousal of expectations, provoking a diffuse emotional state that is then directed into a series of discrete and identifiable emotional displays. In other words, competitors become “psyched up.” In elite sports, players have already internalized the scripts that coaches call upon them to rehearse immediately before the contest and to adhere to during the contest. It is not, however, just the players who experience this scripting. Drawing upon fans’ previous experiences, media pundits and other “stage setters” also contribute to the management of the fans’ emotions. Cues provided by the stage setters prompt fans to express a variety of emotions throughout a game. These emotions range from passionate identification with one’s representative team and with one’s fellow fans to hatred for the opposing team and its misguided supporters. Fans feel despair when an idolized player is injured; they feel ecstasy when a last-minute goal transforms humiliating defeat into triumphant victory. ( See the Britannica Classic: cheering .)",
  "While there may be a scripting or an orchestration of the emotions, individuals vary in the degree to which they internalize and follow scripts. Despite such individual variations, rules do structure the emotional experience of sports subcultures. These emotional processes, which help define roles of players, coaches, and fans, also help forge the link between sports and national identity.",
  "In addition to the social practices that contribute actively to a nation’s image, national cultures are characterized by competing discourses through which people construct meanings that influence their self-conception and behaviour. These discourses often take the form of stories that are told about the nation in history books, novels, plays, poems, the mass media, and popular culture. Memories of shared experiences—not only triumphs but also sorrows and disasters—are recounted in compelling ways that connect a nation’s present with its past. The construction of a national identity in large part involves reference to an imagined community based on a range of characteristics thought to be shared by and specific to a set of people. Stories and memories held in common contribute to the description of those characteristics and give meaning to the notion of nation and national identity. Presented in this way, nationalism can be used to legitimize, or justify, the existence and activities of modern territorial states.",
  "Sports, which offer influential representations of individuals and communities, are especially well placed to contribute to this process of identity formation and to the invention of traditions. Sports are inherently dramatic (from Greek dran, “to act, do, perform”). They are physical contests whose meanings can be “read” and understood by everyone. Ordinary citizens who are indifferent to national literary classics can become emotionally engaged in the discourses promoted in and through sports. Sometimes the nationhood of countries is viewed as indivisible from the fortunes of the national teams of specific sports. Uruguay, which hosted and won the first World Cup football championship in 1930, and Wales, where rugby union is closely woven with religion and community to reflect Welsh values, are prime examples. In both cases national identity has been closely tied to the fortunes of male athletes engaged in the “national sport.” England’s eclipse as a cricket power is often thought, illogically, to be symptomatic of a wider social malaise. These examples highlight the fact that a sport can be used to support, or undermine, a sense of national identity. Clifford Geertz’s classic study of Balinese cockfighting , Deep Play: Notes on the Balinese Cockfight (1972), illustrates another case in point. Although Balinese culture is based on the avoidance of conflict, men’s identification with their birds allows for the vicarious expression of hostility.",
  "By the beginning of the final decades of the 19th century, sports had become a form of “patriot games” in which particular views of national identity were constructed. Both established and outsider groups used and continue to use sports to represent, maintain, and challenge identities. In this way sports can either support or undermine hegemonic social relations. The interweaving of sports and national identity politics can be illustrated with several telling examples.",
  "In 1896 a team of Japanese schoolboys soundly defeated a team of Americans from the Yokohama Athletic Club in a series of highly publicized baseball games. Their victories, “beating them at their own game,” were seen as a national triumph and as a repudiation of the American stereotype of the Japanese as myopic weaklings.",
  "Similarly, the “bodyline” controversy of the 1932–33 cricket Test series between Australia and England exemplifies the convergence of sports and politics. At issue were the violent tactics employed by the English bowlers, who deliberately threw at the bodies of the Australian batsmen in order to injure or intimidate them. The bowlers’ “unsporting” behaviour raised questions about fair play, good sportsmanship, and national honour. It also jeopardized Australia’s political relationship with Great Britain . So great was the resulting controversy that the Australian and British governments became involved. Arguably, one consequence was the forging of a more independent attitude in Australians’ dealings with the British in the political, economic, and cultural realms.",
  "The Soviet Union’s military suppression of reformist efforts to create “socialism with a human face” in Hungary (1956) and in Czechoslovakia (1968) were followed by famous symbolic reenactments of the conflicts in the form of an Olympic water-polo match (U.S.S.R. versus Hungary) and an ice hockey encounter (U.S.S.R. versus Czechoslovakia ). In both cases, sports were invested with tremendous political significance, and the Soviet team’s defeat was seen as a vindication of national identity.",
  "In each of these examples, a historical legacy was invoked, past glories or travesties were emphasized, and the players were faced with maintaining or challenging a set of invented traditions. This link between sports, national culture, and identity can be extended further. Some sports are seen to encompass all the qualities of national character. In the value system of upper-class Englishmen, for example, cricket embodies the qualities of fair play, valour, graceful conduct, and steadfastness in the face of adversity. Seen to represent the essence of England, the game is a focus of national identification in the emotions of upper-class males. Moreover, just as Englishness is represented as an indefinable essence too subtle for foreigners to comprehend, so too are the mysteries of cricket deemed to be inscrutable to the outsider.",
  "In a similar manner, bullfighting has been portrayed in the visual and the verbal arts as a material embodiment of the Spanish soul, Gaelic football is thought to be an expression of an authentic Irishness, and sumo wrestling is said to represent the indefinable uniqueness of Japanese culture (which is why foreign-born sumo wrestlers are almost never elevated to the sport’s highest rank of yokozuna ).",
  "National culture and identity are also represented by an emphasis on origins, continuity, tradition, and timelessness. For most English people, for example, the origins of their culture and national identity seem to be lost in antiquity. Englishness is taken for granted as the result of centuries of uninterrupted tradition. This emphasis on continuity is strikingly evident in sports contests between nations. Accordingly, when teams from England and Scotland compete, they are characterized as “auld enemies.” That political institutions are also imbued with a sense of venerable tradition is easily exemplified in the pageantry that surrounds the English monarchy. Yet the traditions associated with both the monarchy and sports are not as old as claimed. Indeed, both appear to be based on foundational myths—that is, on myths that seek to locate the origins of a nation, a people, or a national character much earlier in time and place than the evidence supports.",
  "Baseball, which for a century was considered to be the \"national game\" of the United States, is a case in point. Instead of tracing the origins of the game to its English roots in children’s games such as cat and rounders, Americans accepted the addled recollections of a lone octogenarian and credited Abner Doubleday with having invented a game that he may never have played. Similarly, Italians use the word calcio to describe the sport known to the rest of the world as “association football,” as “soccer,” or simply as “football” (or “fútbol” or “voetbal” or another cognate). The use of calcio implies that the origins of modern football can be traced to Renaissance Italy. Sumo provides another striking example of invented tradition. The colourful traditional costume worn by sumo officials suggests that the sport has evolved almost unchanged since the 11th century, but the costume was actually devised in 1909 during a period of intense nationalism.",
  "The role sports play in the interaction of culture and national identity is sometimes viewed as inherently conservative. Some believe that the association of sports with nationalism goes beyond mere patriotism and becomes chauvinistic and xenophobic. The behaviour of football hooligans at international matches lends support to the argument. On the other hand, sports also have contributed to liberal nationalist political struggles. One frequently cited example is the 19th-century Slavic gymnastics movement known as Sokol (“Falcon”). Gymnastic clubs in what is now the Czech Republic, Slovakia, and Poland were in the forefront of the struggle for national liberation from Austrian and Russian rule. A similar role was played by Algerian football clubs when they became centres of resistance to French colonialism. Sports—through the use of nostalgia, mythology, invented traditions, flags, anthems, and ceremonies—contribute greatly to the quest for national identity. Sports serve to nurture, refine, and develop the sense that nations have of themselves. Yet, in the context of global sports, this role has become increasingly contradictory. In introducing people to other societies, global sports strengthen cosmopolitanism even as they feed ethnic defensiveness and exclusiveness. For example, the development of cricket in South Asia reflects that region’s imperial past and postcolonial present, but the game has taken on uniquely Indian, Pakistani, and Sri Lankan attributes far removed from the pastoral values associated with the English village green.",
  "The globalization of sports is part of a much larger—and much more controversial— globalization process. Examined historically and analytically, this larger globalization process can be understood as the development of a worldwide network of interdependencies. The 20th century witnessed the advent of a global economy, a transnational cosmopolitan culture, and a variety of international social movements. As a result of modern technology, people, money, images, and ideas are able to traverse the globe with tremendous speed. The development of modern sports was influenced by the interwoven economic, political, social, and cultural patterns of globalization. These patterns both enable and constrain people’s actions, which means that there are winners and losers in the diffusion of modern sports from Europe and North America to the rest of the world.",
  "The emergence and diffusion of modern sports in the 19th and 20th centuries are clearly part of the larger process of globalization. The globalization of sports has been characterized by the creation of national and international sports organizations, the standardization and worldwide acceptance of the rules and regulations for individual and team sports, the development of regularly scheduled international competitions, and the establishment of special competitions, such as the Olympic Games and the various world championships, that aspire to involve athletes from nations in all corners of the globe.",
  "The emergence and diffusion of modern sports is bound up in complex networks and interdependency chains that are marked by unequal power relations. The world can be understood as an interdependent whole, where groups constantly compete for dominant (or less-subordinate) positions. In sports as in other social realms, Europe and North America have been hegemonic. Modern sports are to an overwhelming degree Western sports. As modern sports spread throughout the world, the myriad traditional sports of Asia, Africa, and South America were marginalized. Sports such as Japanese kemari and Afghan  buzkashi  survive as folkloric curiosities.",
  "No master plan has governed the process of sports globalization. Throughout the period of Western imperialism that reached its apogee in the late 19th and early 20th centuries, colonized peoples were often forced to adopt Western sports. (This was especially true at missionary schools.) More often than not, however, politically and economically colonized peoples were motivated by emulation. Anglophile Argentines formed football teams not because they were coerced to play but rather because football was the game played by the English whom they admired. More recently, however, as transnational corporations have sought to sell every kind of product to every reachable consumer, modern sports have been systematically marketed to the entire world, not only as sources of pleasure but also as signs of distinction, prestige, and power.",
  "Western values and capitalist marketing, advertising, and consumption have influenced the ways people throughout the world construct, use, represent, imagine, and feel about their bodies. Unquestionably, there is a political economy at work in the production and consumption of global sports and leisure products that has resulted in the relative ascendancy of a narrow selection of Western sports, but non-Western sports and attitudes toward the physical self have not completely disappeared. Not only have they survived, but some of them, such as the martial arts and yoga , have also found a prominent place in the sports and body cultures of Europe and North America.",
  "It is possible, therefore, to overstate the extent to which the West has dominated in terms of global sports structures, organizations, and ideologies. As noted, non-Western cultures resist and reinterpret Western sports and maintain, foster, and promote on a global scale their own indigenous recreational pursuits. The popularity of Asian martial arts in Europe and the Americas is one sign of this. In other words, global sports processes involve multidirectional movements of people, practices, customs, and ideas that reflect a series of shifting power balances. These processes have unintended as well as intended consequences. While the intentional actions of transnational agencies or corporations such as the International Olympic Committee (IOC) or Nike, Inc., are probably more significant in the short term, over the longer term the unintentional, relatively autonomous transnational practices predominate. The 19th-century diffusion of football (soccer) is one example of this sort of globalization. The 20th-century diffusion of surfboarding from Hawaii is another.",
  "In sum, the speed, scale, and volume of sports development can be imagined as eddies within the broader global flows of people, technology, finance, images, and ideologies that are dominated by Europe and North America (whose elites are predominantly white males). There are, however, signs that global processes may be leading to the diminution of Western power in a variety of contexts, including sports. Sports may become increasingly contested, with Asian and African cultures challenging 19th- and 20th-century hegemonic masculine notions regarding the content, meaning, control, organization, and ideology of sports. Moreover, global flows are simultaneously increasing the varieties of body cultures and identities available to people in local cultures. Global sports, then, seem to be leading not only to the reduction in contrasts between societies but also to the simultaneous emergence of new varieties of body cultures and identities.",
  "That international sports success in the late 20th century involved a contest between systems located within a global context was vividly displayed in the sporting struggles of the Cold War era. From the 1950s to the dissolution of the Soviet Union in the 1990s, there was intense athletic rivalry between the Soviet bloc on the one hand and the United States and its allies on the other. On both sides of the Iron Curtain, sports victories were touted as proof of ideological superiority. A partial list of the most memorable Soviet-Western showdowns might include the Soviet Union’s disputed victory over the U.S. basketball team in the final seconds of the gold medal game of the 1972 Summer Olympics; Canada’s last-minute goal against the Soviet Union in the concluding game of their 1972 eight-game ice hockey series; the defeat of the veteran Soviet ice hockey team by a much younger American squad at the 1980 Winter Olympics; and a number of track-and-field showdowns between East and West Germany.",
  "Success in these encounters depended on several factors, among them the identification and recruitment of human resources (including coaches and trainers as well as athletes), innovations in coaching and training, advances in sports medicine and sports psychology, and—not surprisingly—the expenditure of a significant portion of the gross domestic product to support these systems. While neglecting the infrastructure for recreational sports for ordinary citizens, the Soviet Union and the German Democratic Republic (East Germany) sought to enhance their international prestige by investing huge sums in elite sports. At universities and sports centres in Moscow, Leipzig, Bucharest, and elsewhere, Soviet-bloc countries developed an elaborate sports-medicine and sports-science program (allied in the case of East Germany with a state-sponsored drug regime). For a time, the Soviet-bloc countries were outcompeting their Western counterparts, but the major Western sporting nations began to create similar state-sponsored programs. Poorer nations, with the notable exception of Fidel Castro’s Cuba, were for the most part unable or unwilling to dedicate scarce economic resources to the athletic “arms race.” As a result, they had difficulty competing on the world stage.",
  "Even after the dissolution of the Soviet bloc, an international order persists in which nations can be grouped into core, semiperipheral, and peripheral blocs, not by geography but rather by politics, economics, and culture. The core of the sports world comprises the United States, Russia, western Europe, Australia, New Zealand, and Canada. Japan, South Korea, Cuba, China, Brazil, and several of the former Soviet-bloc states can be classified as semiperipheral sports powers. On the periphery are most Asian, African, and Latin American nations. The core may be challenged on the field of play in one sport or another (East African runners dominate middle-distance races), but control over the ideological and economic resources associated with sports still tends to lie in the West, where the IOC and the headquarters of nearly all the international sports federations are located. Despite their relative weakness in international competition, noncore countries have used regularly recurring sports festivals, such as the Asian Games, to solidify regional and national identities and to enhance international recognition and prestige.",
  "Despite programs such as Olympic Solidarity, which provides aid and technical assistance to poorer nations, material resources still tend to be concentrated in the core nations, while those on the periphery lack the means to develop and retain their athletic talent. They lose many of their best athletes to more powerful nations that can offer better training facilities, stiffer competition, and greater financial rewards. The more commercialized the sport, the greater the “brawn drain.” At the turn of the 21st century, Western nations recruited not only sports scientists and coaches from the former Soviet bloc but also athletic talent from Africa and South America. This was especially true in sports such as football, where players were lured by the lucrative contracts offered by European and Japanese clubs. Noncore leagues remain in a dependent relationship with the dominant European core. In other sports, such as track and field and baseball, this drain of talent flows to the United States. Despite some competition from Japan, the West also remains overwhelmingly dominant in terms of the design, production, and marketing of sportswear and equipment.",
  "Labour migration is an important and established feature of the sporting “global village.” While this movement of workers primarily involves athletes, it also includes coaches, officials, administrators, and sports scientists. Although migrant labour has been a feature of the sports process since ancient times, the phenomenon increased in complexity and intensity during the last decades of the 20th century. This acceleration is closely tied to globalization processes.",
  "The migration of athletes and others involved in sports occurs at three levels: within nations, between nations located on the same continent, and between nations located in different continents and hemispheres. Extensive migration within nations has been common since the beginnings of modern sports in the 18th century, but intercontinental migration was infrequent before the 20th century. Recent examples of intracontinental migration include the flow of baseball players from the Dominican Republic to the United States and of eastern European football, ice hockey, and basketball players to western Europe. Coaches in these and other sports have joined the exodus. Availing themselves of their new freedom of movement, Poles, Hungarians, Czechs, Slovaks, and Romanians have moved west. Eastward expansion of the European Union , whose rules have further liberalized the labour market, has accelerated this migration.",
  "Movement of sports labour also occurs between North America , Europe, South America, Africa, and Asia in many sports, including football (soccer), baseball, and basketball. Canadians play ice hockey in Britain, Germany , France, and Switzerland ; conversely, there is a flow of sports labour in the opposite direction when North American ice hockey teams acquire Russian, Czech, and Scandinavian players. American universities actively recruit Europeans to participate in track and field, football (soccer), rugby, basketball, and swimming, while large numbers of Africans have competed at the college level in the United States in basketball and track-and-field sports. What had begun as the unilateral movement of American basketball players to European professional leagues in the 1960s became a two-way flow by the end of the century, and the number of international players in the National Basketball Association increased dramatically. Similarly, while American baseball players had for decades competed on Japanese teams, beginning in the 1990s a few elite Japanese players made an impact on Major League Baseball. Australian, Afro-Caribbean, South Asian, and South African players have for decades figured prominently in English cricket.",
  "The migration of athletes between nations is sometimes complicated by the imposition by professional leagues and associations of quotas that limit the number of foreign players a team can field. In some cases these restrictions are circumvented when a player is able to claim ancestral links to another country, as Diego Maradona did when he moved from Argentina to Italy.",
  "In specific sports, such as cricket and rugby, labour migration has a seasonal pattern, with the Northern and Southern hemispheres scheduling two different seasons of play. One consequence is that the natural rhythm of the traditional sporting calendar (most often governed by climate) has diminished in importance. In other sports, participants experience an even more transitory form of migration because their “workplace” constantly changes as the venue for competition shifts. Examples include the experience of European, American, and African track-and-field athletes on Europe’s Grand Prix circuit and that of European and North American skiers competing in World Cup Alpine skiing.",
  "Occasionally seasonal and transitory migration patterns interweave, as they do for golf and tennis players. Tennis stars crisscross the globe in pursuit of Grand Slam titles and points that determine their world ranking. These migratory forays tend to last no more then eight days per tournament venue. In this respect, tennis players and golfers are probably the ultimate nomads of the sports migration process, with constantly shifting workplaces and places of residence. Migrant athletes have generally improved their lives, experiencing social as well as spatial mobility, but they have also experienced economic exploitation, dislocation, and culture shock.",
  "Gender relations play a significant role in contouring a migrant athlete’s life. The disadvantages of sports migration have been greater for female athletes. Although women now travel more frequently and in greater numbers than in the past, men continue to move more freely (and to be paid more generously). This pattern results from social structures that continue to assume that women are solely responsible for domestic matters and child care.",
  "As with broader global processes, an economic analysis is a necessary but insufficient explanation of sports migration. The migrant trails of world sports are constructed by shifting sets of multilayered interdependencies that include not only economic but also political, historical, geographic, social, and cultural factors. As with global sports in general, a broad approach must be taken to make sense of these migration processes.",
  "The experience of migrant athletes once they arrive in a host country (along with the impact of their presence on the hosts) is determined by a wide range of factors, including the residual impact of colonial heritages and cultural traditions; cultural and legal encouragement or discouragement of migration; economic, social, and cultural dependency; and political changes within and between societies and power blocs. A number of processes that are more immediately related to sports are also involved. Special status is ascribed to particular sporting traditions and particular leagues. Young cricket players are often eager to bowl and bat in England; aspiring football players dream of a career in Germany’s Bundesliga. Ethnic and racial stereotyping, which categorizes athletes as desirable or undesirable candidates for recruitment, also plays a role. Other factors influencing migration include the political, economic, and playing ambitions of individual clubs, leagues, and national associations; the role of agents and coaching networks; and the resources available for the identification, development, and exploitation of new talent sources. All of these factors will influence the speed, scale, and volume of future sports migration.",
  "The relationship between mass media and sports has profoundly influenced both institutions. From the late 18th century onward, this relationship has passed through a series of stages, the first of which was parallel development, with the mass media reaching a broader audience through new technologies and market growth while sports were attracting a growing base of paying spectators. Next, their trajectories began to intersect—the commercial mass media (especially after their emergence in electronic form) increasingly viewed sports coverage as an inexpensive way of supplying much-needed content. Sports were correctly perceived as ideal for capturing audiences for advertisers. Public or state media also recognized sporting events as opportunities to reaffirm national culture and to bolster patriotism. As the economic infrastructure of sports developed to the level of a bona fide industry, sports entrepreneurs began to see the mass media as important for generating interest among spectators and sponsors.",
  "Finally, by the late 20th century, mass media and elite sports formed a marriage of convenience, becoming in this last stage so economically interdependent as to be virtually inseparable. It is now, for example, impossible to imagine the continued existence of professional sports—football, basketball, gridiron football, or baseball—without billion-dollar broadcast rights and saturation coverage in the sports pages. It is also difficult to suggest another cultural form capable of attracting billions of viewers to watch live events (such as the Olympic Games opening ceremony or football’s World Cup final). Media magnates such as Ted Turner , Rupert Murdoch, and Silvio Berlusconi , along with the Walt Disney Company , have developed this logic of convergence to the highest level, becoming the owners of sports teams—the Atlanta Braves and Los Angeles Dodgers baseball teams, football’s AC Milan, and the National Hockey League’s Mighty Ducks, respectively. This coming together of media and sports, however, can reinstate older practices, with the costs to media corporations of acquiring broadcast rights and sports clubs offset by reintroducing the charge for watching that home viewers previously evaded. The introduction of cable, satellite, and microwave delivery systems has enabled broadcasters to exact payment for access to 24-hour sports channels or, in an even more direct revival of turnstile arrangements, for access to pay-per-view live broadcasts of especially popular sports events such as championship boxing matches. Sports bars and other entertainment venues with multiple television screens also offer a more public way of watching sports, just as large screens are now a feature at most major sports stadiums. For those who prefer to stay at home, however, the spreading availability of the Internet has created many new ways of connecting sports fans, media companies, sponsors, and advertisers. For example, all the major American media companies now have a substantial online presence. Cyberspace is the latest site for the intimate relationship between the mass media and professional sports to be consummated.",
  "Tracing the rise of the mass media and professional sports demonstrates constant change and innovation in the presentation of sports in the media. The pace of this change has accelerated with the intensification of competition between media organizations, between different sports, and between sports and other forms of leisure entertainment. The print sports media have evolved far beyond their original 18th-century role of announcing imminent sports events and recording their outcomes. Beginning in the early 19th century with the boxing reports of England’s Pierce Egan , newspapers transformed their sports coverage from factual statements of results to expansive, dramatic, and linguistically innovative accounts of sporting events. By the end of the century, the popularity of these sports stories among (mostly male) readers had prompted the growth of sports desks staffed by specialized journalists. They produced sports pages, often conveniently located at the back of the newspaper, that provided readers with abundant, although largely sanitized, information about athletes and their performances. Sportswriters tended to concentrate on the anticipation, atmospheric description, and postmortem dissection of major sporting occasions. Newspaper proprietors quickly discovered that the back page was often consulted before the weightier matters of state at the front of the newspaper. The importance of sports for newspaper circulation can be illustrated by the placement, as a lure for its readers, of a detailed horse-racing form in The Morning Star, the long-running (but now defunct) British Communist Party newspaper.",
  "The space devoted to sports coverage in the daily press increased to the point where, by the middle of the 20th century, even the august New York Times was producing bulky sports sections. By that time the public’s appetite for sports news was so great that daily newspapers exclusively dedicated to sports had sprung up in many countries. The most famous of them, L’Équipe (Paris), traces its origins to the beginning of the 20th century.",
  "A host of sportswriting styles and genres are available to readers. Some of these are of long standing—for example, the “morning after” sports report detailing the outcomes and the main features of a sports contest. Others are of more recent invention, such as “soft news” and celebrity sports gossip. Journalists have become increasingly enthusiastic about probing sports scandals. Sports fans have been enlightened about official corruption (such as that surrounding the successful bid by Salt Lake City , Utah , to host the 2002 Winter Olympics), performance-enhancing drugs, and off-field violence committed by athletes and fans. There is also considerable space in the print media devoted to in-depth profiles of athletes and the examination of sports issues, some of which are collected in books such as the Best American Sports Writing series. In book publishing there are fictions (e.g., Henry de Montherlant ’s Les Olympiques [1938], Alan Sillitoe ’s The Loneliness of the Long-Distance Runner [1959]); biographies and autobiographies (usually ghostwritten) of prominent athletes (e.g., Muhammad Ali , Pelé , Martina Navratilova , Michael Jordan ); reflections on the experience of sports fandom (e.g., Nick Hornby’s Fever Pitch [1992]); various coaching manuals and guides; and an increasing body of academic literature on sports. These and other forms of writing contribute to (and are a result of) the prominence of sports in the contemporary economy and society.",
  "However evocative sportswriting might be, it lacks the immediate impact of a striking visual sports image. As newspapers have developed their design appeal, sports photography has enhanced the attractiveness of the sports pages and of general current-affairs magazines such as Time , Newsweek , Paris-Match , and Der Spiegel . In the thousands of specialized magazines devoted entirely to sports, verbal texts and visual images are appealingly combined with an eye to the adult male sports fans who are the magazines’ principal readers. One consequence of this focus on male readers is that magazines such as Sports Illustrated and The Sporting News provide minimal coverage of women’s sports (and tend to emphasize the erotic appeal of female athletes when they do allot space to women’s sports).",
  "Despite the convenience of sports journalism in the print media, the reader’s experience is—by definition—mediated. It still lacks a vibrant sense of immediacy. The diffusion of radio technology throughout Europe and North America in the 1920s allowed fans, absent from the game for whatever reason (distance, scheduling, venue capacity, cost), to listen in to play-by-play descriptions of events. A new market developed around those who tuned in to sports and hearkened to the sponsors’ and advertisers’ messages. Once radio broadcasting had been established, the next technological innovation— television —added the crucial visual to the existing audio dimension of live sports spectatorship.",
  "Television provides an unprecedented opportunity for vicarious experience. Initially, in the 1950s, those who staged, organized, and performed at sports events feared that the availability of games on television might keep fans from attending, especially if they could receive these live television sports broadcasts “free-to-air”—that is, for only the cost of the reception equipment and electrical power. The doubts quickly disappeared when it was discovered that television also had the capacity to generate legions of new sports fans. The enthusiastic response to sports programming provided sports organizations with a powerful new revenue stream: the sale of broadcast rights. By the late 20th century, as the cultural economy became increasingly important and the need to attract consumers to converging broadcast, computer, and telecommunications technologies became ever more urgent, entrepreneurs sold audiovisual access to their performances at vastly inflated prices. It has been estimated that the global value of broadcast income to the IOC for the Summer and Winter Games of 1996 through 2008 will exceed $10 billion.",
  "For televised sports, technical and presentational complexity has increased alongside the cost, scope, and density of coverage. From a single, static camera attempting to capture sports events as if from the perspective of a well-positioned spectator at the venue, the number and capabilities of cameras and microphones have vastly increased. At contemporary major sports events, multiple cameras are positioned to capture the action from a variety of angles (including overhead), distances (from extreme close-ups to panoramas), and speeds (from super slow motion to time-lapse speed). Highly sensitive directional microphones and “lipstick” cameras and microphones placed on sports participants or their equipment take the spectator ever closer to the play. Electronic sports will move far beyond today’s relatively passive viewing when home stadium and virtual-reality technology are introduced. The first will allow viewers to make their own production choices of camera angle and displayed sports data; the second will so immerse viewers in the sports action that they will feel like participants.",
  "This heightened “spectacularization” of the electronic sports media is designed to maintain the interest of sports fans and to attract detached viewers seeking sensation and stimulation. In this way sports will remain central to the economics of the media. When combined with the treatment of sports in other media —from Hollywood films such as Field of Dreams (1989) and Any Given Sunday (1999) to the compact-disc recording of Plácido Domingo , Luciano Pavarotti , and José Carreras singing at the opening ceremonies of football’s 1990 World Cup—the vibrancy and inventiveness of the sports media are readily apparent. This popularity and adaptability have ensured that media companies will continue to invest a major share of their resources in one of their most valuable commercial assets—sports.",
  "Modern sports and modern mass media are both multibillion-dollar businesses. Elite sports cannot function as they do without the mass media to publicize and underwrite them. The huge market for sports equipment and team-related merchandise is to a large extent sustained by the media’s 24-hour-a-day sports coverage, and the economic infrastructure of the mass media depends to a considerable extent on the capacity of sports to create large, loyal cohorts of readers, listeners, viewers, and interactive consumers. This dynamic synergy between sports and the mass media is not without its problems. The mass media have enormous influence not only on the way that sports events are staged but also on when they take place. When Olympic sprinters run their races at 5 am so that New Yorkers can watch them in prime time, as happened at the 1988 Summer Games in Seoul, South Korea, the media have clearly exercised a degree of influence that was unthinkable in the days of Olympic founder Pierre de Coubertin . That the media’s economic interests are uppermost is evidenced by the advertisements that continually interrupt the action of sports events covered by commercial television networks. Not surprisingly, there is an occasional backlash against the symbiosis of sports and the media. Some athletes and spectators resentfully accuse the media (especially television) of “taking over sports” and altering their ethos, rules, and structure. Evidence of concern about the economic power of the mass media was provided in 1999 when the British government decided to prevent Rupert Murdoch’s BSkyB, which owns the broadcast rights to English Premier League association football, from acquiring control of Manchester United, one of the world’s richest and best-known sports “brands.” There is also some evidence that the commercial interests of individual media companies, especially when monopolistic, may damage the crucial requirement for uncertain outcomes in sports leagues and tournaments and create a popular perception that sports contests have been “fixed” to further the interests of media corporations. With various abuses in mind, some critics have argued that sports need to be monitored by governments, elite sports bodies, and fan organizations in order, ironically, to secure their long-term commercial value.",
  "Corporate sponsorship is one key area where the “brand value” of sports is central to the relationship between mass media and sports. Corporate sponsorship, which has long since replaced the aristocratic patrons who once staged sports events, has enabled sports organizations and competitions to be funded while expanding brand recognition, identification, and loyalty for the sponsors. Naming-rights sponsorship for events and facilities and the prominent placement of the sponsors’ logos where spectators cannot help but see them are extremely valuable marketing tools for which sponsors are prepared to pay enormous sums. In 1997, for example, when the newly elected British Labour government attempted to introduce a comprehensive ban on tobacco advertising and sponsorship in sports, it was delayed by the fact that the revenue from advertisements and sponsorships was in excess of £300 million a year. Linked to sponsorship is merchandising, which enables sports, sponsors, and companies to derive additional income and exposure by selling to sports fans goods and services that identify the fans as supporters both of teams (such as football shirts) and of sponsors (through displaying, for example, the Nike sportswear company’s “swoosh” or the distinctive stripes of Adidas). Additional impetus to this marketing effort is bestowed by paying star athletes, such as basketball player Michael Jordan or tennis player Anna Kournikova, to actively endorse branded sports products or merely to display or use them.",
  "The key to the commercialization of sports through sponsorship, celebrity endorsement, and merchandising is, of course, the mass media, whose astonishing capacity to showcase sports events and individual athletes has propelled sports contests from local to global phenomena. The story of the development and evolution of modern sports is therefore one in which the mass media are among the essential agents of change across the whole field of sports culture. Economically, sports are intimately and enduringly married to the mass media—with no prospect of a divorce.",
  "Violence can be defined as any interpersonal behaviour intended to cause physical harm or mental distress. Most discussions of sports-related violence concentrate on physical harm—i.e., bodily injury. Setting aside the question of motivation, most psychologists approach the study of sports-related physical violence from a behaviouristic perspective. They infer the intention of assailants from their observable actions. In a sports context, aggression, which is often discussed as if it were synonymous with violence, can best be defined as an unprovoked physical or verbal assault. Aggressiveness, therefore, is the propensity to commit such an assault.",
  "In attempting to map patterns of violence, sociologists such as Michael Smith have developed a sports-violence typology in which “brutal body contact” is seen as integral to some sports. This contact conforms to the rules of the sport and is completely legitimate even when the same sort of behaviour outside the sports context is defined as criminal. Examples of legitimate violence can be found in rugby and gridiron football and in boxing , wrestling , and Asian martial arts. Participants in these sports, by the very act of taking part, have implicitly accepted the inevitability of rough contact. They have implicitly consented to the probability of minor injury and the possibility of serious injury. They cannot, however, reasonably be said to have agreed to injuries sustained from physical assaults that violate the written and unwritten rules of the sport. Although violence of this latter sort is definitely illegitimate and sometimes illegal, it has proved very difficult for injured athletes to find redress in the courts. Judges and juries are reluctant to convict athletes of criminal behaviour committed in the course of a sports contest, and they are equally reluctant to convict coaches, schools, and sports leagues of negligence.",
  "“Borderline violence” consists of behaviours that violate the official rules of the sport but that are accepted by players and fans alike as a legitimate part of the game. Such behaviour—a fistfight in ice hockey or an intentional foul in association football’s penalty zone—is rarely subject to legal proceedings and tends to be dealt with by penalties imposed by referees, umpires, or league administrators. A memorable example of this occurred in 1997 when the Nevada Boxing Commission censured and banned heavyweight boxer Mike Tyson for biting his opponent. More-extreme rule infractions—i.e., those that violate not only the formal rules of the sport but also the law of the land—elicit a harsher formal response, especially when the violence results in serious injury. High or late tackles in gridiron football usually create serious outrage and have on occasion led to the strict imposition of a lifetime ban, but recourse to the law in cases of quasi-criminal violence is infrequent. Finally, Smith’s typology includes what he termed “criminal violence”—that is, behaviour so egregious that it is handled legally from the outset because it is not considered part of the game.",
  "While legal scholars have sought to distinguish legitimate from illegitimate sports violence, social psychologists and sociologists have investigated the causes of sports-related violence. Here the discussion revolves around broader nature-nurture debates and the role that sports are believed to play in society. Those who believe that aggression and violence are “natural” tend to view them as instinctive and inevitable aspects of human behaviour. From the perspective of Konrad Lorenz and others in this camp, sports are seen as a form of catharsis; they allow for the safe and channeled release of the aggression that is part of every person’s instinctive makeup. Most sports sociologists, however, challenge this hypothesis and believe instead that research confirms that violence and aggression are socially learned. This latter view is supported by the fact that the levels and types of sports-related violence vary greatly from culture to culture, which strongly suggests that they are not the result of some universal human nature. Canadian ice hockey, for example, is more violent in some respects than its Scandinavian counterpart. The reason for this is that Canadian ice hockey provides a subcultural context in which boys and young men are introduced to highly aggressive behaviour. In this and in many other sports subcultures, brutal body contact and physical assault are part and parcel of what it means to be a man. Conformity to the code of toughness certifies a player’s masculinity and confers upon him honour and prestige. Those who fail to meet such expectations drop out of the subculture or are subject to peer sanctions.",
  "Sports-related spectator violence is often more strongly associated with a social group than with the specific nature of the sport itself. Roman gladiatorial combats were, for example, history’s most violent sport, but the closely supervised spectators, carefully segregated by social class and gender, rarely rioted. In modern times, football (soccer) is certainly less violent than rugby, but soccer hooliganism is a worldwide phenomenon, while spectator violence associated with the more upper-class but rougher sport of rugby has been minimal. Similarly, crowds at baseball games have been more unruly than the generally more affluent and better-educated fans of gridiron football, although the latter is unquestionably the rougher sport. Efforts by the police to curb sports-related violence are often counterproductive, because the young working-class males responsible for most of the trouble are frequently hostile to the authorities. Media coverage of disturbances can also act to exaggerate their importance and incite the crowd behaviour that the media then simultaneously condemn and sensationalize. The most effective means to reduce the level of spectator violence is also the simplest: abolish \"terraces,\" where spectators stand, and provide seats for all ticket holders.",
  "With few exceptions, modern sports were devised by and for men, with the content, meaning, and significance of the contests reflecting male values, strengths, and interests. The 19th-century institutionalization of modern sports involved changes in personality, body deportment, and social interaction; the result was a body culture that valued youthful masculinity.",
  "A great deal of research has focused on the role sports play in the making of modern masculinity. For young men and adolescent boys, the path to manhood appears to be reinforced and confirmed by participation in sports. In some respects this can be a positive relationship. As the consideration of sports-related violence indicates, however, sports do not simply “build character,” as Victorian educators and 20th-century coaches were prone to assert; sports also create characters. Some of these characters are socially responsible role models; others can develop a tough masculine style that aggravates broader social problems such as domestic violence. Male sports heroes have at times enjoyed certain social privileges, including a tolerance of antisocial behaviour based on the rationalization that “boys will be boys.” Some sports cultures generate forms of behaviour that are openly antagonistic toward people of different sexual orientation. Gender discrimination can also take less-extreme forms. For most of the 19th and 20th centuries, for example, it was assumed that cheerleading was the most appropriate way for girls to contribute to sports.",
  "Although in some respects modern sports remain the male preserve they were in the Victorian era, male privilege has never gone unchallenged. Many upper-middle-class women played golf, tennis, and field hockey; a few lower-class women boxed and wrestled. Women have had to campaign strenuously for access to “inappropriate” sports such as rugby and weightlifting, but they have been relatively successful in their efforts and now participate in a great range of sports, many of which were thought to be prototypically masculine. Still, even at the turn of the 21st century, at the 2000 Summer Olympics men participated in 48 more events than women did. While the number of female competitors varies considerably from one Olympic team to another, it is rare for a National Olympic Committee to send equal numbers of men and women, and some Islamic countries are represented by all-male teams. Access and opportunity remain key issues, but attention has also been paid to gender-based differences in status, prestige, and the distribution of resources and rewards. Research in these areas emphasizes that, while there are individual cases of gender bias, the more fundamental problem is the persistence of social structures that systematically privilege men.",
  "Statistical studies documenting the greatly increased participation of women in recreational and elite sports, which are cause for optimism, must be supplemented by analyses of the way in which female athletes are positioned within the media-sports complex. Much recent evidence indicates that the mass media still tend, despite some laudable attempts to overcome gender bias, to reinforce conventional notions of masculinity. Although female athletes rarely suffer from role conflict (\"an athlete or a woman?\") as they once did, the mass media still contribute to the trivialization of female athletes, whose physical attractiveness is often stressed at the expense of their sporting prowess. At work is a set of enabling and constraining features that determine the recognition and financial rewards women receive for their participation in sports. Female athletes who conform to mainstream canons of sex appeal (which now call for an athletic rather than a voluptuous body) are eagerly sought after to appear on magazine covers and in product endorsements, while equally successful female competitors whose bodies are less conventionally attractive are passed over.",
  "At the end of the 20th century, there was greater tolerance of homosexuality in many nations; however, homosexuality remained taboo in the sporting world. While a handful of elite athletes such as diver Greg Louganis and tennis star Martina Navratilova have \"come out of the closet,” homosexuality among professional athletes remains largely unknown and hidden. Women’s sports in particular have struggled with issues of sexuality. Basketball and softball, for example, have been portrayed in popular culture as a haven for lesbians, which to some degree they have been. To combat this stereotype , which has damaged efforts to increase wider participation and greater spectator interest, conventional feminine ideals have been stressed in the marketing of women’s sports. The Gay Games, established in 1980, were created to provide an opportunity for male and female gay athletes to compete openly and to counteract negative perceptions about homosexuals.",
  "Frequently overlooked in analyses of sports and gender relations is the controversial practice, common in the sporting-goods industry, of using women and children to produce equipment and clothing. Nike and a number of other manufacturers have been accused of economically exploiting women and children in developing nations (so-called sweat-shop labour) while at the same time running advertising campaigns asserting that their products empower young women.",
  "In sports, as elsewhere in society, there is a tendency to explain differences in performance in terms of some alleged physical differences between races . When Austrians do well at skiing and Swedes excel at tennis, cultural explanations have been sought through the analysis of social structures and environmental conditions. On the other hand, when Kenyans prove exceptionally good at middle-distance running, there has been a tendency to look for a physiological explanation.",
  "The tendency is misguided. As a result of the mapping of human DNA, the concept of \"race\" has become highly problematic. Scientists have discovered that the genetic diversity within populations sharing certain physical traits, such as skin colour, is as great as the diversity between different groups. If there are physical differences that account for Kenyan success and for the success of African American sprinters, physiologists have not yet discovered them and are not likely to. Ironically, while racism remains a useful concept for sociological analysis of some sports phenomena, such as the exclusion of African Americans from early 20th-century Major League Baseball, references to race are more likely to confuse than to clarify research into athletic performance.",
  "Despite the consensus among geneticists, some sociologists continue to conduct research on the assumption that race is a meaningful concept. Most sociologists, however, prefer to use the concept of ethnicity in their attempts to account for observed differences in performance. Ethnicity refers to the shared cultural heritage of a group. This cultural heritage, which may be claimed or imposed, includes language, customs, practices, traditions, and institutions. Since ethnic cultures are normally learned in childhood, they are so familiar that they become second nature or what Pierre Bourdieu refers to as “habitus.” Ethnic differences in sports are observable in pose and style as well as in quantifiable sports performance. Sports fans are adept at reading the distinctive nonverbal body language of different groups playing the same game. In the 1950s the exuberant play of the Brazilian national football (soccer) team, which emphasized individual skill, was strikingly different from the disciplined team-oriented style of the German side.",
  "Different ethnic groups have different rates of involvement in sports. Palestinians who are citizens of Israel are less likely than Jewish citizens to participate in sports. Turks residing in Germany are less likely than ethnic Germans to be members of sports clubs. Within both these Islamic ethnic minorities, girls and women are even less likely than boys and young men to be athletically active. Journalists have noted and sociologists have investigated the overrepresentation of African Americans in some sports (basketball, boxing, track) and their underrepresentation in others (polo, swimming, yachting). Such patterns of participation can be the result of early socialization, role modeling, peer group subcultures, economic and community structures, stereotyping, and scapegoating. Sociologists have employed these and other concepts to demonstrate why ethnic minorities tend to be less involved in sports and why, when they are involved in sports, they still tend to be excluded from or underrepresented in management, administration, and ownership. Sociological surveyors have demonstrated that sports are far from the level playing field they purport to be.",
  "The empirical evidence demonstrates that the nature and extent of athletic involvement, the chance for success, the opportunities to hold positions of power and prestige, and the gaining of positive experiences through sports are all structured along the ethnic fault lines that exist within and between societies. These processes are part of the social structures that enable and constrain different ethnic groups. The role, meaning, and significance of sports involvement is related to but not solely determined by these processes. The concept of ethnicity not only helps make sense of the differential performance attributed to race but also aids in explaining how sports are used by groups for political ends. The roles of football (soccer) and rugby in Ireland are a case in point. While separate football teams represent Northern Ireland and the Republic of Ireland (the former a symbol of Protestant ethnic identity), international rugby games are played by a unified team that seeks to represent the whole of Ireland. These differences are tied to the complex cultural traditions of the two sports and the class profile of those involved. Similarly, games between formerly colonized nations and their former colonizers, such as cricket matches between India and England, tend to become rites of passage and are imbued with a heightened sense of symbolism. The games count as part of broader cultural struggles. Perhaps the best example of the usefulness of the concept of ethnicity rather than race as an explanation for differences in performance levels is Beyond a Boundary (1963), C.L.R. James ’s classic study of the making of Caribbean cricket. James combines careful historical analysis with detailed observations of the cricket culture of his day, finding in the sport a symbolic reenactment of the struggles and inequalities that existed and still exist in the Caribbean.",
  "Although performance-enhancing drugs were known as early as the 19th century, when professional cyclists used strychnine as a stimulant, the widespread use of drugs began in the 1960s. It is a practice that cuts across national and ideological boundaries. Sociologists investigating the phenomenon of drug use in sports normally put aside the moral outrage that characterizes media coverage of and political commentary on this issue. Media personnel tend to focus on the actions of high-profile stars such as Canadian sprinter Ben Johnson and Irish swimmer Michelle Smith, whose Olympic gold medals were stripped away (Johnson) or sadly tarnished by the suspicion of drug use (Smith). Whenever a prominent athlete tests positive for a banned substance, journalists, politicians, and sports administrations are likely to respond with calls for zero-tolerance policies. In contrast, sociologists ask: What is a drug? What are the social and sporting roots of drug usage? Why is the focus almost exclusively on drugs that enhance performance? What would constitute a viable policy for drug usage?",
  "Three broad categories of drugs have been identified: recreational, restorative, and additive, or performance-enhancing, drugs. While attention is focused on recreational drugs such as marijuana and cocaine or on anabolic steroids (synthetic compounds of the male hormone testosterone) and other performance-enhancing drugs, little or no attention is given to drugs that restore athletes to fitness. This is unfortunate because the overuse of vitamins and food supplements can also be detrimental to an athlete’s health. Greater consideration should be given to all categories of drug consumption, not just to the abuse of cocaine and anabolic steroids.",
  "One hindrance to the formulation of a rational policy about drugs is the often tenuous distinction between the natural and the artificial. This is especially true for vitamins, special diets, human growth hormones , and blood doping (the extraction and later infusion of an athlete’s own blood). In addition, there is no hard-and-fast distinction between different categories of drugs; some drugs, such as beta-blockers , fall into both the restorative and performance-enhancing categories.",
  "In examining the case for and against the implementation of bans on athletes who test positive for drug use, several key arguments can be identified. The most widely used argument for a ban is that performance-enhancing drugs confer an unfair advantage on those who use them. This argument brings the ethics of sports into play, along with the notion that athletes have a moral duty not only to adhere to the rules but also to serve as role models. Also widely used is the argument that drugs harm the athletes’ health. The “harm principle” asserts or implies that athletes must be protected from themselves. Closely associated with both arguments is the notion that bans act as a deterrent, preventing athletes from cheating and from inflicting harm on themselves.",
  "The counterargument is twofold. The argument based on fairness is said to be unpersuasive because drugs would confer no special advantage if they were legalized and made available to all athletes. Proponents of this viewpoint also note that the rules now in force allow athletes from wealthy nations to train more efficiently, with better coaching and equipment, than athletes from poorer countries, a situation that is manifestly unfair. The argument based on the “harm principle” is said to treat athletes as children. Adult athletes should be allowed to decide for themselves whether they want to harm their health by drug use.",
  "Sociologists have contributed to the debate on drugs by pointing out that focusing on the actions of the athlete individualizes the issue of drug usage rather than examining the social roots of drug consumption. Among the causes of drug usage that have been identified are the medicalization of social life and the vastly increased importance of sports as a source of self-esteem and material benefits. Victory has always brought greater rewards than defeat, but the differences are now on an unprecedented scale. Sociologists have also raised questions about privacy rights being violated by mandatory drug testing and about the meagre resources being provided for the rehabilitation of drug offenders.",
  "Discussions of performance-enhancing drugs are also complicated by the fact that most spectators say they disapprove of drugs even as they turn out to support athletes who have tested positive for banned substances. After the French police uncovered massive doping during the 1998 Tour de France , roadside crowds increased.",
  "The debate over drugs is further complicated when \"unnatural\" factors influencing performance are considered—for example, the use of psychological techniques and biotechnological intervention. The role of sports psychology began to increase significantly in the 1990s. Goal setting, focus, and visualization exercises were designed to ensure that athletes would concentrate on reaching their peak performance. Distractions were to be eliminated.",
  "The growth of biotechnological intervention in human affairs, including the potential impact of genetic engineering, also raises many issues for sports. While many people uncritically accept this type of intervention in the context of restorative medicine, the boundary line between rehabilitation and enhancement, as in the case of drugs, is not clear. Reconstructive surgery , implants, and technological adjustments contribute, along with drug use and masochistically intense training regimes, to the creation of what John M. Hoberman calls “mortal engines.” These interventions into the “natural” body have to be considered within the broader debate concerning sports and what it is to be human.",
  "Although a book titled Psychologie des sports (“Psychology of Sports”) was published in 1927 by the German psychologist Alfred Peters, the field developed slowly. The International Society of Sport Psychology was not established until 1965. At that time, research tended to focus on personality, motivation, and aggression.",
  "For decades, psychologists attempted to identify personality traits that distinguished athletes in one sport from those in another (and from nonathletes). Using American psychologist Raymond Cattell ’s Personality Factor Questionnaire and a battery of other paper-and-pencil inventories, researchers came to contradictory results. Beyond the fact that athletes are more physically active than nonathletes and the equally obvious fact that athletes drawn to individual sports score higher on \"autonomy\" and \"independence\" than athletes devoted to team sports, there was little consensus on \"the athletic personality.\" If one controls for social class, athletes tend to be very much like nonathletes and to be like one another.",
  "Studies of the \"athletic personality\" have become rare, but studies of motivation and of aggression have increased in number and have become increasingly multifactored and sophisticated. Early studies of motivation, often inspired by the work of American psychologists David McClelland and John Atkinson, examined the relationship between the need for achievement and the fear of failure. Female athletes proved to be a special problem. For a number of years, their lower levels of motivation were explained as a fear that athletic success came at the cost of diminished femininity. This fear was, in turn, explained as the result of role conflict. A woman’s fervent interest in sports might be perceived as an expression of a masculine nature or of lesbianism ; psychological tests such as American psychologist Sandra Bem’s Sex Role Inventory routinely classified female athletes as \"masculine\" because they scored high on scales for competition and aggressiveness. By the end of the century, however, in Europe and North America greater social acceptance of intensely competitive female athletes (and of lesbianism) more or less eliminated role conflict and the \"fear of success.\" At the recreational level as well as at the elite level, recent studies have shown conclusively that sports participation generally leads to increased, rather than diminished, self-esteem for girls and women as well as for boys and men.",
  "In Problem Athletes and How to Handle Them (1966), Americans Bruce Ogilvie and Thomas Tutko attempted to apply motivational principles to improve sports performance. Their widely used Athletic Motivation Inventory was designed to measure personality traits, such as leadership and mental toughness, conducive to athletic achievement. Other psychologists have explored a variety of techniques, including meditation, mental imaging, and even hypnosis, to lessen anxiety or control arousal or improve concentration. Still other psychologists have sought to enhance performance by studying the dynamics of small-group interaction and the relative efficacy of different coaching and leadership styles. Gender accounts for some of the observed differences. Although female athletes are increasingly similar psychologically to male athletes, they continue to respond more readily than men do to encouragement and to react more negatively than men do to admonition. Cultural differences, which sports psychologists sometimes neglect, are also important. Japanese athletes respond better than their North American counterparts to harsh criticism and punitive discipline. Cultural differences also play an important role when the stage is set for pharmacological intervention. The more authoritarian the culture is, the more likely it has been that coaches will demand that elite athletes use performance-enhancing drugs, such as anabolic steroids, and abjure recreational drugs, such as cocaine.",
  "The motivation for recreational sports is unquestionably different from the motivation at the elite level. Recreational and elite athletes share a common desire to improve their skills and to win, rather than lose, a contest. Both are likely to value the social pleasures of team membership and to experience the moments of ecstatic fulfillment that some psychologists refer to as \"flow.\" There are, however, important differences in the kind and in the intensity of their motivation. Material rewards figure, of course, among the motives of openly professional athletes, but, even when economic motives are not in play, elite athletes are a breed apart. They are likely to feel themselves to be representatives of their nation (or of some other collectivity). Standing on the victor’s podium and watching one’s national flag rise to the strains of one’s national anthem can motivate as strongly as the prospect of signing a million-dollar contract (and the first frequently leads to the second). When inspired by a combination of economic and representational motives, elite athletes can reach almost unimaginable levels of athletic performance, but they are also liable to develop a win-at-all-costs attitude that motivates them to use performance-enhancing drugs, to commit intentional fouls, and to risk lifelong physical disability by \"playing hurt\" (continuing to compete despite a serious injury).",
  "This disregard for one’s health is perhaps the most important motivational difference between the elite and the recreational athlete. For the latter, a principal motive for sports participation (and for visits to an aerobics class or a fitness centre) is a desire to improve one’s health and to shape one’s body into closer conformity to contemporary ideals of physical attractiveness. For the former, the physical self is frequently jeopardized and sometimes sacrificed on the altar of sports success.",
  "Sports spectators have also been the focus of a great deal of psychological research. Despite the 19th-century code of impartial good sportsmanship, spectators do strongly identify with athletes whom they see as representatives of their race, religion, national state, ethnic group, city, or school. American psychologist Daniel L. Wann has shown, among other things, that knowledge about the sport correlates strongly with the intensity of this identification. The fans’ behaviour varies in response to winning and losing. When their team wins, fans refer to \"our victory\" and wear the sweatshirts that identify them as loyal supporters; when their team fares badly, fans tend to doff the sweatshirts and to complain about \"the team’s loss.\" (Similarly, studies have demonstrated that winning athletes tend to attribute their success to their own superior skills, while losing athletes tend to attribute their failure to bad luck or to their opponents’ unfairness.)",
  "Sometimes fans do more than complain. In the 1960s and 1970s, there was a dramatic increase in violence committed by sports spectators. Most of the research on this phenomenon has been done by Eric Dunning of Great Britain and other sports sociologists, but a number of social psychologists have also studied sports-related aggression. Behind their research lay a question: Is aggressiveness innate, as Sigmund Freud insists, or is it learned, as American psychologist Albert Bandura (among others) argues? If the former, sports spectators may experience a \"safety-valve\" catharsis, thanks to which the propensity to commit acts of aggression is diminished; if the latter, sports spectatorship may actually increase aggressiveness. Experiments conducted with an apparatus originally designed by American Arnold Buss measured the level of electric shock subjects were ready to administer to another person. Subjects who had watched a sports event on film were willing to administer higher levels of shock than subjects who had seen a travelogue or some other nonviolent film. These experiments, in conjunction with paper-and-pencil tests and the obvious fact that sports-related riots commonly occur after (rather than before) a contest, proved conclusively that sports spectators do not experience a \"safety-valve\" catharsis. After leaving the venue or turning off their television sets, they are more, rather than less, prone to violence than they were before the contest began. Sports psychology leads to the odd conclusion that sports may be good for athletes and bad for spectators.",
  "One of the most popular forms of gambling is wagering on sports, which taps into the passion of sports fans. A bet placed on a race or a game allows fans to prove their knowledge of a sport or to show their loyalty to a particular team or competitor. In addition to promoting camaraderie among friends, sports betting can enliven otherwise boring or one-sided contests when handicapping systems offering odds and point spreads increase the bettors’ stake in the competition. Although legal sports betting is increasingly common, most of wagering on athletic competitions is illegal and is conducted through bookmakers, also known as bookies (operating as individuals or for crime organizations), and Internet gambling operations (which are legal in some countries).",
  "Wagering on horse races is the most prevalent form of sports betting, but football matches—including soccer, rugby, and Australian rules football—also are the focus of considerable gambling. Other sports noted for heavy wagering are boxing, basketball, baseball, cricket, ice hockey, dog and camel racing, and jai alai.",
  "The oldest form of betting is probably one in which gamblers bet winner take all on the outcome of a contest. Today one of the most common forms of sports gambling is odds betting, in which a casino or bookmaker evaluates the contestants in a competition and assesses the probability of victory: 2 to 1, 5 to 1, 1 to 4, and so forth. With a $1 wager on a 2-to-1 underdog, for example, a bettor stands to pocket $2 if the underdog wins. A winning bet on the favourite offers a lesser payoff—e.g., a five dollar bet on a 2-to-5 favourite yields a $2 payoff. Today odds betting is commonly used in boxing and baseball.",
  "For most races (e.g., horses, dogs, camels) and some games (e.g., jai alai), a pari-mutuel wagering system is used. In this system, introduced in 1865 following the invention of the “totalizator” by Frenchman Pierre Oller, a calculating machine records the amount bet on each competitor prior to the start of the contest. In horse racing, for example, the “totalizator” calculates the odds, based on the proportion of the total bet on each horse, and determines what should be paid to those who picked the winner. The bookmaker or track owner takes his or her share by skimming off a percentage of the total amount bet.",
  "Most football (soccer, gridiron football, rugby, etc.) matches, as well as basketball games, use a system known as a point spread. Bookmakers determine the number of points that will serve as a spread for a particular contest. A bet on the favoured team requires that the bettor yield (or give) the point spread. A bet on the underdog team grants the bettor the point spread. For example, an underdog team may be bet as +4, meaning it has four points added to its final score for purposes of determining the winning bettor. A −4 bet on a favoured team wins only if that team wins by over four points (or goals in the case of soccer).",
  "There is also mixed systems betting. In ice hockey, bettors first get extra goals (or give them up) and then bet with odds. In soccer, odds are often set for the exact score of the game. Among the many other propositions available is betting on both teams’ combined scores, known as an “over/under” bet because the bookmaker predicts the total points for a game and the bettor bets on the “over” (total points will exceed the predicted amount) or the “under” (total points will fall short of the predicted amount). At the beginning of a sports season, odds are given on whether a team will win the championship. Several bets also can be grouped together in what is known as a parlay bet. To win a parlay bet, the wagerer must win each of the individual bets that have been linked.",
  " Pools and fantasy leagues are also popular methods of sports gambling. They are largely organized by friends and coworkers, though Internet-based companies increasingly run large-scale versions of these activities. Pools range from predictions of the outcome of tournaments or the week’s roster of games to lotteries consisting of numbers that win if they match a final or partial score. Fantasy leagues involve bettors’ selecting actual athletes for a \"fantasy team\" before a contest (or season) begins. The gambler with players who perform the best in terms of selected statistics wins.",
  "Sports gambling can be consistently profitable if bettors have superior knowledge regarding athletes and teams, which many sports fans believe (usually falsely) they have. The proliferation of media coverage of sports and the variety of information services available give gamblers a sense of control and confidence that encourages them to wager. They keep betting even when they lose, blaming losses on bad luck or bad performances by players, coaches, or referees.",
  "Most bettors assume that athletes in competition perform to the best of their ability. Even the slightest indication that the athletes are “on the take” or “throwing” games or matches for pecuniary gain can irreparably harm a sport. As professional sports grew in popularity in the 19th century, so too did fears that gambling would corrupt the games. Indeed, unregulated gambling routinely attracted criminal elements looking to make easy money, and many scandals resulted. Most involved bribing athletes to lose matches purposely, or, in the case of football and basketball, to “shave” points—that is, to win by less than the point spread. Among the most infamous of these scandals was the Black Sox Scandal , which occurred when eight members of the Chicago White Sox were charged with having thrown the 1919 World Series. In the 1950s, intercollegiate basketball in the United States was rocked by numerous bribery scandals. In subsequent decades it was the turn of German and Italian football (soccer) leagues to suffer from widespread corruption. Professional boxing has long been tainted by its association with crime syndicates that have influenced prizefighters to “take dives.”",
  "During the modern era of sports, gambling has been mostly illegal, with the exception of horse and dog racing and a few other sports. Indeed, sports organizations and governments have enacted strict antigambling policies and laws in order to protect both the public and the legitimacy of sporting competition. The illegality of sports gambling, however, never diminished its popularity, and, by the second half of the 20th century, many nations were looking for ways to allow gambling while avoiding the corruption that seems to go hand in hand with it. Pro-gambling groups argued that legalization and regulation were the obvious answers. Great Britain legalized wagering in 1960. In the United States, differences between state and federal laws created a patchwork in which some forms of sports gambling were legal and others were not. Betting on sports increased after federal taxes on legal betting were reduced in 1983. In Germany and many other countries, the profits from lotteries and betting pools are used to subsidize amateur sports.",
  "Despite legalization, gambling-related scandals continue to haunt the world of sports. A 1999 survey found that 45 percent of male college athletes in the United States bet on sports, and 5 percent indicated that they furnished information to gamblers. In 2002 it was revealed that members of the Jockey Club in Great Britain manipulated races by giving prohibited drugs to horses and by sharing inside information with gamblers. In 2004 it was alleged that soccer players in Italy skewed matches to help gamblers betting millions around the world. The legitimate gambling industry, however, is quick to point out that most scandals involve illegal gambling. Indeed, Nevada casinos have worked with sports leagues and federal authorities investigating corruption and have provided key information about scandals, maintaining that is it the unregulated bookies and Internet gambling that pose the biggest threats to the integrity of the games.",
  "General studies include Richard D. Mandell , Sport: A Cultural History (1984, reissued 1999); Allen Guttmann , Sports: The First Five Millennia (2004); and David Levinson and Karen Christensen (eds.), Berkshire Encyclopedia of World Sport , 4 vol. (2005). Allen Guttmann , From Ritual to Record: The Nature of Modern Sports (1978; revised 2004), provides a theoretical interpretation of the uniqueness of modern sports. Guttmann has also written three thematic studies: Games and Empires: Modern Sports and Cultural Imperialism (1994) surveys the global diffusion of modern sports; Sports Spectators (1986) considers spectatorship from antiquity to modern times; and Women’s Sports: A History (1991) examines women’s experience with sports.",
  "Among regional studies of sports in Africa are William J. Baker and J.A. Mangan (eds.), Sport in Africa: Essays in Social History (1987); Douglas Booth , The Race Game: Sport and Politics in South Africa (1998); John Nauright , Sports, Cultures, and Identities in South Africa (1997); and Bernadette Deville-Danthu , Le Sport en noir et blanc (1997), which focuses on the sports of French West Africa.",
  "Studies of sports in Asia include J.A. Mangan and Fan Hong ( Hong Fan ) (eds.), Sport in Asian Society (2003); and Susan Brownell , Training the Body for China: Sports in the Moral Order of the People’s Republic (1995). Fan Hong ( Hong Fan ), Footbinding, Feminism, and Freedom: The Liberation of Women’s Bodies in Modern China (1997), reveals the role played by sports and physical exercise in the growth of women’s rights in China. Richard Cashman , Patrons, Players, and the Crowd: The Phenomenon of Indian Cricket (1980), examines Indian cricket.",
  " Richard Cashman , Paradise of Sport: The Rise of Organised Sport in Australia (1995); Brian Stoddart , Saturday Afternoon Fever: Sport in the Australian Culture (1986); Wray Vamplew and Brian Stoddart (eds.), Sport in Australia: A Social History (1994); and John Nauright (ed.), Sport, Power and Society in New Zealand: Historical and Contemporary Perspectives (1995), are country-specific studies.",
  "Examinations of sports in Europe during antiquity include Mark Golden , Sport and Society in Ancient Greece (1998); Donald G. Kyle , Athletics in Ancient Athens , 2nd rev. ed. (1993); and Michael B. Poliakoff , Combat Sports in the Ancient World: Competition, Violence, and Culture (1987). Alan Cameron , Circus Factions: Blues and Greens at Rome and Byzantium (1976); and John H. Humphrey , Roman Circuses: Arenas for Chariot Racing (1986), examine chariot racing. Gladiators are the focus of Thomas Wiedemann , Emperors and Gladiators (1992, reissued 1995).",
  "Medieval sports and leisure in Europe are the subject of Jean Verdon , Les Loisirs au moyen age , new ed. (1996). More specific studies include Juliet R.V. Barker , The Tournament in England, 1100–1400 (1986); and John Cummins , The Hound and the Hawk: The Art of Medieval Hunting (1988).",
  "Sports during the Renaissance are covered in Philippe Ariès and  Jean-Claude Margolin  (eds.), Les Jeux à la Renaissance (1982); Robert C. Davis , The War of the Fists: Popular Culture and Public Violence in Late Renaissance Venice (1994); William Heywood , Palio and Ponte: An Account of the Sports of Central Italy from the Age of Dante to the XXth Century (1904, reprinted 1969); and Marcia Vale , The Gentleman’s Recreations: Accomplishments and Pastimes of the English Gentleman, 1580–1630 (1977).",
  " Richard Holt , Sport and Society in Modern France (1981); and Ronald Hubscher et al., L’Histoire en mouvements: le sport dans la société française (XIXe–XXe siècle) (1992), examine sports in France in the 19th and 20th centuries. Dennis Brailsford , Sport and Society: Elizabeth to Anne (1969), considers British sports from the 16th to the 18th century. British boxing in the 18th and early 19th centuries is the subject of Dennis Brailsford , Bareknuckles: A Social History of Prize-Fighting (1988). Other important studies of British sports include Robert W. Malcolmson , Popular Recreations in English Society, 1700–1850 (1973, reprinted 1981); J.A. Mangan , Athleticism in the Victorian and Edwardian Public School: The Emergence and Consolidation of an Educational Ideology (1981, reissued 2000); Tony Mason , Association Football and English Society, 1863–1915 (1980); Christopher Brookes , English Cricket: The Game and Its Players Through the Ages (1978); and Neil Tranter ( N.L. Tranter ), Sport, Economy, and Society in Britain, 1750–1914 (1998). Stephen G. Jones , Sport, Politics, and the Working Class: Organised Labour and Sport in Inter-war Britain (1988, reissued 1992), looks at sports in modern Britain. Grant Jarvie and Graham Walker (eds.), Scottish Sport in the Making of the Nation: Ninety Minute Patriots? (1994), explores Scotland’s unique sports heritage; Wray Vamplew , Pay Up and Play the Game: Professional Sport in Britain, 1875–1914 (1988), provides an economic history of British sports. Football (soccer) and rugby football spectators are studied by Eric Dunning and Kenneth Sheard , Barbarians, Gentlemen, and Players: A Sociological Study of the Development of Rugby Football (1979); Eric Dunning , Patrick Murphy , and John Williams , The Roots of Football Hooliganism: An Historical and Sociological Study (1988); and Christian Bromberger , Le Match de football (1995). Henning Eichberg , Der Weg des Sports in die industrielle Zivilisation , 2nd ed. (1979), explores the origins of modern sports, and Leistung, Spannung, Geschwindigkeit (1978), delineates the transition from early modern to modern sports. The German adoption of English sports is the focus of Christiane Eisenberg , “English Sports” und Deutsche Bürger (1999). Nationalistic gymnastics in eastern Europe are covered in Diethelm Blecking (ed.), Die slawische Sokolbewegung (1991). James Riordan , Sport in Soviet Society (1977, reissued 1980), examines sports during the communist era.",
  "The standard general study is Joseph L. Arbena (ed.), Sport and Society in Latin America: Diffusion, Dependency, and the Rise of Mass Culture (1988). National studies include Paula J. Pettavino and Geralyn Pye , Sport in Cuba: The Diamond in the Rough (1994); Janet Lever , Soccer Madness (1983, reissued with changes, 1995), an examination of Brazilian football; Rob Ruck , The Tropic of Baseball (1991, reissued 1999), on baseball in the Dominican Republic; and Vernon L. Scarborough and David R. Wilcox (eds.), The Mesoamerican Ballgame (1991), an examination of ritual football in Central America.",
  "Native American sports are explored in Joseph B. Oxendine , American Indian Sports Heritage (1988, reissued 1995). Canadian sports are discussed in Bruce Kidd , The Struggle for Canadian Sport (1996); Alan Metcalfe , Canada Learns to Play: The Emergence of Organized Sport, 1807–1914 (1987, reissued 1997); and Don Morrow and Kevin B. Wamsley (eds.), Sport in Canada: A History (2005). Studies on sports in the United States include Benjamin G. Rader , American Sports: From the Age of Folk Games to the Age of Televised Sports , 4th ed. (1999); Nancy L. Struna , People of Prowess (1996), on sports and leisure in colonial and early republican America; George B. Kirsch , The Creation of American Team Sports: Baseball and Cricket, 1838–72 (1989); Melvin L. Adelman , A Sporting Time (1986, reprinted 1990); and Steven A. Riess , Sport in Industrial America, 1850–1920 (1995). Specific sports are examined in Harold Seymour , Baseball , 3 vol. (1960–90); John Sayle Watterson , College Football: History, Spectacle, Controversy (2000); and Elliott J. Gorn , The Manly Art: Bare-Knuckle Prize Fighting in America (1986, reissued 1989). Peter Levine , Ellis Island to Ebbets Field (1992), looks at the relationship between American Jews and sports; David K. Wiggins , Glory Bound (1997), compiles essays on African Americans and sports; and Ronald A. Smith , Sport and Freedom (1988, reissued 1990), surveys intercollegiate athletics in the United States.",
  " Susan K. Cahn , Coming on Strong (1994), focuses on 20th-century women’s sports in the United States. Jennifer Hargreaves , Sporting Females: Critical Issues in the History and Sociology of Women’s Sports (1994), looks at 20th-century women’s sports in the United States and Great Britain. Kathleen E. McCrone , Playing the Game (1988); and Catriona M. Parratt , More than Mere Amusement: Working-Class Women’s Leisure in England, 1750–1914 (2001), centre on Great Britain. Karen Christensen, Allen Guttmann , and Gertrud Pfister (eds.), International Encyclopedia of Women and Sports , 3 vol. (2001), is a comprehensive reference work.",
  "Olympic sports in antiquity are the subject of M.I. Finley and H.W. Pleket , The Olympic Games: The First Thousand Years (1976); and Wendy J. Raschke (ed.), The Archaeology of the Olympics (1988). The Olympics in modern times are covered in Allen Guttmann , The Olympics: A History of the Modern Games (1992, reissued 1994); and Alfred Erich Senn , Power, Politics, and the Olympic Games (1999).",
  "An overview of the relationship between sports, culture, and society is provided in Jay Coakley and Eric Dunning (eds.), Handbook of Sports Studies (2000). Theoretical approaches to sports are taken in William J. Morgan , Leftist Theories of Sport: A Critique and Reconstruction (1994); Grant Jarvie and Joseph Maguire , Sport and Leisure in Social Thought (1994); Richard Gruneau , Class, Sports, and Social Development (1983, reissued 1999); and Geneviève Rail (ed.), Sport and Postmodern Times (1998).",
  "Anthropological studies include Kendall Blanchard , The Anthropology of Sport: An Introduction , rev. ed. (1995); Janet C. Harris and Roberta J. Park (eds.), Play, Games, and Sports in Cultural Contexts (1983); Jay Coakley , Sport in Society: Issues & Controversies , 7th ed. (2001); and Gary Alan Fine , With the Boys: Little League Baseball and Preadolescent Culture (1987).",
  "Studies of sports and national identity include Mike Cronin , Sport and Nationalism in Ireland: Gaelic Games, Soccer, and Irish Identity Since 1884 (1999); Joseph L. Arbena (ed.), Sport and Society in Latin America: Diffusion, Dependency, and the Rise of Mass Culture (1988); and Alan M. Klein , Baseball on the Border: A Tale of Two Laredos (1997).",
  "Globalization’s impact on sports is the focus of Joseph Maguire , Global Sport: Identities, Societies, Civilizations (1999); Ralph C. Wilcox (ed.), Sport in the Global Village (1994); and John Sugden and Alan Tomlinson , FIFA and the Contest for World Football: Who Rules the People’s Game? (1998). The migration of elite athletes is the subject of John Bale and Joseph Maguire (eds.), The Global Sports Arena: Athletic Talent Migration in an Interdependent World (1994).",
  " Norbert Elias and Eric Dunning , Quest for Excitement: Sport and Leisure in the Civilizing Process (1986, reissued 1993); Richard S. Gruneau and David Whitson , Hockey Night in Canada: Sport, Identities, and Cultural Politics (1993); and Michael D. Smith , Violence and Sport (1983, reissued 1988), survey the connection between violence and sports.",
  "Studies on gender and sports include Allen Guttmann , The Erotic in Sports (1996); Varda Burstyn , The Rites of Men: Manhood, Politics, and the Culture of Sport (1999); and Michael A. Messner , Taking the Field (2002).",
  "Attitudes and theories concerning the relationship of race and sports are discussed in Dana Brooks and Ronald C. Althouse (eds.), Racism in College Athletics: The African-American Athlete’s Experience, 2nd ed. (2000); C.L.R. James , Beyond a Boundary (1963, reissued 1994); and John M. Hoberman , Darwin’s Athletes: How Sport Has Damaged Black America and Preserved the Myth of Race (1997).",
  "A strong argument about the relationship between sports, science, and human performance is provided by John M. Hoberman , Mortal Engines: The Science of Performance and the Dehumanization of Sport (1992). Overviews of the relationship between drugs and sports are provided by Robert Voy and Kirk D. Deeter , Drugs, Sport, and Politics (1991); Barrie Houlihan , Dying to Win: Doping in Sport and the Development of Anti-doping Policy (1999); and Ivan Waddington,  Sport, Health, and Drugs: A Critical Sociological Perspective (2000).",
  " Aaron Baker and Todd Boyd (eds.), Out of Bounds: Sports, Media, and the Politics of Identity (1997), collects critical writing on racism and ethnocentrism in media’s representation of sports. Raymond Boyle and Richard Haynes , Power Play: Sport, the Media, and Popular Culture (2000), is a British-based critical analysis. John Goldlust , Playing for Keeps: Sport, the Media, and Society (1987), is an influential historical and textual analysis of the development of media sports. David Rowe , Sport, Culture, and the Media: The Unruly Trinity (1999), analyzes the ways in which different forms of media sports are both produced and interpreted. Lawrence A. Wenner (ed.), MediaSport (1998), is a wide-ranging and incisive collection on the place of sports in the contemporary mass media. Garry Whannel , Fields in Vision: Television Sport and Cultural Transformation (1992), provides a valuable historical account of the rise of sports television and a critical reading of television sports programs and trends."
]