[
  "  language , a system of conventional spoken, manual (signed), or written symbols by means of which human beings, as members of a social group and participants in its culture, express themselves. The functions of language include communication , the expression of identity , play , imaginative expression, and emotional release.",
  "Many definitions of language have been proposed. Henry Sweet, an English phonetician and language scholar, stated: “Language is the expression of ideas by means of speech-sounds combined into words. Words are combined into sentences, this combination answering to that of ideas into thoughts.” The American linguists Bernard Bloch and George L. Trager formulated the following definition: “A language is a system of arbitrary vocal symbols by means of which a social group cooperates.” Any succinct definition of language makes a number of presuppositions and begs a number of questions. The first, for example, puts excessive weight on “thought,” and the second uses “arbitrary” in a specialized, though legitimate, way.",
  "A number of considerations (marked in italics below) enter into a proper understanding of language as a subject:",
  " Every physiologically and mentally typical person acquires in childhood the ability to make use, as both sender and receiver, of a system of communication that comprises a circumscribed set of symbols (e.g., sounds, gestures, or written or typed characters). In spoken language , this symbol set consists of noises resulting from movements of certain organs within the throat and mouth. In signed languages , these symbols may be hand or body movements, gestures, or facial expressions. By means of these symbols, people are able to impart information, to express feelings and emotions, to influence the activities of others, and to comport themselves with varying degrees of friendliness or hostility toward persons who make use of substantially the same set of symbols.",
  " Different systems of communication constitute different languages; the degree of difference needed to establish a different language cannot be stated exactly. No two people speak exactly alike; hence, one is able to recognize the voices of friends over the telephone and to keep distinct a number of unseen speakers in a radio broadcast. Yet, clearly, no one would say that they speak different languages. Generally, systems of communication are recognized as different languages if they cannot be understood without specific learning by both parties, though the precise limits of mutual intelligibility are hard to draw and belong on a scale rather than on either side of a definite dividing line. Substantially different systems of communication that may impede but do not prevent mutual comprehension are called dialects of a language. In order to describe in detail the actual different language patterns of individuals, the term idiolect , meaning the habits of expression of a single person, has been coined.",
  " Typically, people acquire a single language initially—their first language, or native tongue, the language used by those with whom, or by whom, they are brought up from infancy. Subsequent “second” languages are learned to different degrees of competence under various conditions. Complete mastery of two languages is designated as bilingualism ; in many cases—such as upbringing by parents using different languages at home or being raised within a multilingual community—children grow up as bilinguals. In traditionally monolingual cultures, the learning, to any extent, of a second or other language is an activity superimposed on the prior mastery of one’s first language and is a different process intellectually.",
  " Language, as described above, is species-specific to human beings. Other members of the animal kingdom have the ability to communicate, through vocal noises or by other means, but the most important single feature characterizing human language (that is, every individual language), against every known mode of animal communication, is its infinite productivity and creativity . Human beings are unrestricted in what they can communicate; no area of experience is accepted as necessarily incommunicable, though it may be necessary to adapt one’s language in order to cope with new discoveries or new modes of thought . Animal communication systems are by contrast very tightly circumscribed in what may be communicated. Indeed, displaced reference, the ability to communicate about things outside immediate temporal and spatial contiguity, which is fundamental to speech, is found elsewhere only in the so-called language of bees. Bees are able, by carrying out various conventionalized movements (referred to as bee dances) in or near the hive, to indicate to others the locations and strengths of food sources. But food sources are the only known theme of this communication system. Surprisingly, however, this system, nearest to human language in function, belongs to a species remote from humanity in the animal kingdom. On the other hand, the animal performance superficially most like human speech, the mimicry of parrots and of some other birds that have been kept in the company of humans, is wholly derivative and serves no independent communicative function. Humankind’s nearest relatives among the primates, though possessing a vocal physiology similar to that of humans, have not developed anything like a spoken language. Attempts to teach sign language to chimpanzees and other apes through imitation have achieved limited success, though the interpretation of the significance of ape signing ability remains controversial.",
  " In most accounts, the primary purpose of language is to facilitate communication, in the sense of transmission of information from one person to another. However, sociolinguistic and psycholinguistic studies have drawn attention to a range of other functions for language. Among these is the use of language to express a national or local identity (a common source of conflict in situations of multiethnicity around the world, such as in Belgium, India, and Quebec). Also important are the “ludic” (playful) function of language—encountered in such phenomena as puns , riddles , and crossword puzzles —and the range of functions seen in imaginative or symbolic contexts, such as poetry , drama , and religious expression.",
  "Language interacts with every aspect of human life in society, and it can be understood only if it is considered in relation to society. This article attempts to survey language in this light and to consider its various functions and the purposes it can and has been made to serve. Because each language is both a working system of communication in the period and in the community wherein it is used and also the product of its history and the source of its future development, any account of language must consider it from both these points of view.",
  "The science of language is known as linguistics . It includes what are generally distinguished as descriptive linguistics and historical linguistics . Linguistics is now a highly technical subject; it embraces, both descriptively and historically, such major divisions as phonetics , grammar (including syntax and morphology ), semantics , and pragmatics , dealing in detail with these various aspects of language.",
  "As is evident from the discussion above, human life in its present form would be impossible and inconceivable without the use of language. People have long recognized the force and significance of language. Naming —applying a word to pick out and refer to a fellow human being, an animal, an object, or a class of such beings or objects—is only one part of the use of language, but it is an essential and prominent part. In many cultures people have seen in the ability to name a means to control or to possess; this explains the reluctance, in some communities, with which names are revealed to strangers and the taboo restrictions found in several parts of the world on using the names of persons recently dead. Such restrictions echo widespread and perhaps universal taboos on naming directly things considered obscene, blasphemous, or very fearful.",
  "Perhaps not surprisingly, several independent traditions ascribe a divine or at least a supernatural origin to language or to the language of a particular community. The biblical account, representing ancient Jewish beliefs, of Adam ’s naming the creatures of the earth under God’s guidance is one such example:",
  "So out of the ground the Lord God formed every beast of the field and every bird of the air, and brought them to the man to see what he would call them; and whatever the man called every living creature, that was its name. (Genesis 2:19)",
  "Norse mythology preserves a similar story of divine participation in the creation of language, and in India the god Indra is said to have invented articulate speech. In the debate on the nature and origin of language given in Plato ’s Socratic dialogue Cratylus , Socrates is made to speak of the gods as those responsible for first fixing the names of things in the proper way.",
  "A similar divine aura pervades early accounts of the origin of writing . The Norse god Odin was held responsible for the invention of the runic alphabet . The inspired stroke of genius whereby the ancient Greeks adapted a variety of the Phoenician consonantal script so as to represent the distinctive consonant and vowel sounds of Greek, thus producing the first alphabet such as is known today, was linked with the mythological figure Cadmus , who, coming from Phoenicia, was said to have founded Thebes and introduced writing into Greece ( see  Phoenician language ). By a traditional account, the Arabic alphabet , together with the language itself , was given to Adam by God.",
  " The Tower of Babel The Tower of Babel  The later biblical tradition of the Tower of Babel (Genesis 11:1–9) exemplifies three aspects of early thought about language: (1) divine interest in and control over its use and development, (2) a recognition of the power it gives to humans in relation to their environment, and (3) an explanation of linguistic diversity, of the fact that people in adjacent communities speak different and mutually unintelligible languages, together with a survey of the various speech communities of the world known at the time to the Hebrew people.",
  "The origin of language has never failed to provide a subject for speculation, and its inaccessibility adds to its fascination. Informed investigations of the probable conditions under which language might have originated and developed are seen in the late 18th-century essay of the German philosopher Johann Gottfried von Herder , “Abhandlung über den Ursprung der Sprache” (“Essay on the Origin of Language”), and in numerous other treatments. But people have tried to go farther, to discover or to reconstruct something like the actual forms and structure of the first language. This lies forever beyond the reach of science, in that spoken language in some form is almost certainly coeval with  Homo sapiens  . The earliest records of written language, the only linguistic fossils humanity can hope to have, go back no more than 4,000 to 5,000 years. Some people have tried to claim that the cries of animals and birds, or nonlexical expressions of excitement or anger, evolved into human speech, as if onomatopoeia were the essence of language; these claims have been ridiculed for their inadequacy (by, for example, the Oxford philologist  Max Müller in the 19th century) and have been given nicknames such as “bowwow” and “pooh-pooh” theories.",
  "On several occasions attempts have been made to identify one particular existing language as representing the original or oldest tongue of humankind, but, in fact, the universal process of linguistic change rules out any such hopes from the start. The Greek historian Herodotus told a (possibly satirical) story in which King Psamtik I of Egypt (reigned 664–610 bce ) caused a child to be brought up without ever hearing a word spoken in his presence. On one occasion it ran up to its guardian as he brought it some bread, calling out “bekos, bekos”; this, being said to be the Phrygian word for bread, proved that Phrygian was the oldest language. The naiveté and absurdity of such an account have not prevented the repetition of this experiment elsewhere at other times.",
  "In Christian Europe the position of Hebrew as the language of the Hebrew Bible ( Old Testament ) gave valid grounds through many centuries for regarding Hebrew , the language in which God was assumed to have addressed Adam, as the parent language of all humankind. Such a view continued to be expressed even well into the 19th century. Only since the mid-1800s has linguistic science made sufficient progress finally to clarify the impracticability of speculation along these lines.",
  "When people have begun to reflect on language, its relation to thinking becomes a central concern. Several cultures have independently viewed the main function of language as the expression of thought. Ancient Indian grammarians speak of the soul apprehending things with the intellect and inspiring the mind with a desire to speak, and in the Greek intellectual tradition Aristotle declared, “Speech is the representation of the experiences of the mind” ( On Interpretation ). Such an attitude passed into Latin theory and thence into medieval doctrine. Medieval grammarians envisaged three stages in the speaking process: things in the world exhibit properties; these properties are understood by the minds of humans; and, in the manner in which they have been understood, so they are communicated to others by the resources of language. Rationalist writers on language in the 17th century gave essentially a similar account: speaking is expressing thoughts by signs invented for the purpose, and words of different classes (the different parts of speech) came into being to correspond to the different aspects of thinking.",
  "Such a view of language continued to be accepted as generally adequate and gave rise to the sort of definition proposed by Henry Sweet and quoted above. The main objection to it is that it either gives so wide an interpretation to thought as virtually to empty the word of any specific content or gives such a narrow interpretation of language as to exclude a great deal of normal usage. A recognition of the part played by speaking and writing in social cooperation in everyday life has highlighted the many and varied functions of language in all cultures, apart from the functions strictly involved in the communication of thought, which had been the main focus of attention for those who approached language from the standpoint of the philosopher. To allow for the full range of language used by speakers, more-comprehensive definitions of language have been proposed on the lines of the second one quoted at the beginning of this article—namely, “A language is a system of arbitrary vocal symbols by means of which a social group cooperates.” Despite the breadth of this definition, however, its use of the word vocal excludes all languages that are not vocalized, particularly manual (signed) languages.",
  "A rather different criticism of accepted views on language began to be made in the 18th century, most notably by the French philosopher Étienne Bonnot de Condillac in “Essai sur l’origine des connaissances humaines” (1746; “Essay on the Origin of Human Knowledge”) and by Johann Gottfried von Herder . These thinkers were concerned with the origin and development of language in relation to thought in a way that earlier students had not been. The medieval and rationalist views implied that humans, as rational, thinking creatures, invented language to express their thoughts, fitting words to an already developed structure of intellectual competence. With the examination of the actual and the probable historical relations between thinking and communicating, it became more plausible to say that language emerged not as the means of expressing already formulated judgments, questions, and the like but as the means of thought itself, and that humans’ rationality developed together with the development of their capacity for communicating.",
  "The relations between thought and communication are certainly not fully explained today, and it is clear that it is a great oversimplification to define thought as subvocal speech, in the manner of some behaviourists . But it is no less clear that propositions and other alleged logical structures cannot be wholly separated from the language structures said to express them. Even the symbolizations of modern formal logic are ultimately derived from statements made in some natural language and are interpreted in that light.",
  "The intimate connection between language and thought, as opposed to the earlier assumed unilateral dependence of language on thought, opened the way to a recognition of the possibility that different language structures might in part favour or even determine different ways of understanding and thinking about the world. All people inhabit a broadly similar world, or they would be unable to translate from one language to another, but they do not all inhabit a world exactly the same in all particulars, and translation is not merely a matter of substituting different but equivalent labels for the contents of the same inventory. From this stem the notorious difficulties in translation, especially when the systematizations of science, law, morals, social structure, and so on are involved. The extent of the interdependence of language and thought—linguistic relativity, as it has been termed—is still a matter of debate, but the fact of such interdependence can hardly fail to be acknowledged.",
  "Languages are immensely complicated structures. One soon realizes how complicated any language is when trying to learn it as a second language. If one tries to frame an exhaustive description of all the rules embodied in one’s language—the rules by means of which a native user is able to produce and understand an infinite number of correct well-formed sentences—one can easily appreciate the complexity of the knowledge that a child acquires while mastering a native vernacular. The descriptions of languages written so far are in most cases excellent as far as they go, but they still omit more than they contain of an explicit account of native users’ competence in their language, whether that language is English, Swahili, or Japanese Sign Language ( nihon shuwa ). Likewise, ongoing work in the study of language has underscored just how much effort is needed to bring palpable fact within systematic statement.",
  "This article proposes simply to give a brief outline of the way language or languages can be considered and described from different points of view, or at different levels, each contributing something essential and unique to a full understanding of the subject. A more detailed treatment of the science of linguistics can be found in the article linguistics .",
  "The most obvious aspect of language is speech . Speech is not essential to the definition of an infinitely productive communication system, such as is constituted by a language. But, in fact, speech is the universal material of most human language, and the conditions of speaking and hearing have, throughout human history, shaped and determined its development. The study of the anatomy , physiology , neurology , and acoustics of speaking is called phonetics ; this subject is dealt with further below ( see  Physiological and physical basis of speech ). Articulatory phonetics relates to the physiology of speech, and acoustic phonetics relates to the physics of sound waves—i.e., their transmission and reception.",
  "Phonetics covers much of the ground loosely referred to in language study as pronunciation. But, from a rather different point of view, speech sounds are also studied in phonology . Spoken language makes use of a very wide range of the articulations and resultant sounds that are available within the human vocal and auditory resources. Each spoken language uses a somewhat different range, and this is partly responsible for the difficulty of learning to speak a foreign language and for speaking it “with an accent.” But mere repertoires of sounds are not all that is involved. Far fewer general classes of sounds are distinctive (carry meaning differences) in any language than the number of sounds that are actually phonetically different. The English t sounds at the beginning and end of tot and in the two places in stouter are all different, though these differences are not readily noticed by English speakers, and, rightly, the same letter is used for them all. Similar statements could be made about most or all of the other consonant and vowel sounds in English.",
  "What is distinctive in one language may not be distinctive in another or may be used in a different way; this is an additional difficulty to be overcome in learning a foreign language. In Chinese and in several other languages loosely called tone languages, the pitch, or tone, on which a syllable is said helps to distinguish one word from another: ma in northern Chinese on a level tone means “mother,” on a rising tone means “hemp,” and on a falling tone means “to curse.” In English and in most of the languages of Europe (though not all—Swedish and Norwegian are exceptions), pitch differences do not distinguish one word from another but form part of the intonation tunes that contribute to the structure and structural meaning of spoken sentences.",
  "Languages differ in the ways in which consonant and vowel sounds can be grouped into syllables in words. English and German tolerate several consonants before and after a single vowel: strengths has three consonant sounds before and three after a single vowel sound ( ng and th stand for one sound each). Italian does not have such complex syllables, and in Japanese and Swahili, for example, the ratio of consonant and vowel sounds in syllables and in words is much more even. Speakers of such languages find English words of the sort just mentioned very hard to pronounce, though to a native speaker of English they are perfectly natural, natural in this context meaning “within the sounds and sound sequences whose mastery is acquired in early childhood as part of one’s primary language.”",
  "All these considerations relating to the use of speech sounds in particular languages fall under the general heading of phonology, which may be defined as the sound system of a language; phonology is often regarded as one component of language structure.",
  "Another component of language structure is grammar . There is more to language than sounds, and words are not to be regarded as merely sequences of syllables. The concept of the word is a grammatical concept; in speech, words are not separated by pauses, but they are recognized as recurrent units that make up sentences. Very generally, grammar is concerned with the relations between words in sentences. Classes of words, or parts of speech, as they are often called, are distinguished because they occupy different places in sentence structure, and in most languages some of them appear in different forms according to their function (English man, men ; walk, walked ; I, me ; and so on). Languages differ in the extent to which word-form variation is used in their grammar; Classical Chinese had almost none, English does not have much, and Latin and Greek had quite a lot. Conversely, English makes much more use of word order in grammar than did Latin or Greek.",
  "Traditionally, grammar has been divided into syntax and morphology , syntax dealing with the relations between words in sentence structure and morphology with the internal grammatical structure of words. The relation between girl and girls and the relationship (irregular) between woman and women would be part of morphology; the relation of concord between the girl [or woman ] is here and the girls [or women ] are here would be part of syntax. It must, however, be emphasized that the distinction between the two is not as clear-cut as this brief illustration might suggest. This is a matter for debate between linguists of different persuasions; some would deny the relevance of distinguishing morphology from syntax at all, referring to grammatical structure as a whole under the term syntax .",
  "Grammar is different from phonology and vocabulary ( see below  Semantics ), though the word grammar is often used comprehensively to cover all aspects of language structure. Categories such as plural, past tense, and genitive case are not phonological categories. In spoken language they are, like everything else, expressed in speech sounds, but within a language these may be very different for one and the same category. In English noun plurals, the added - s in cats , the vowel changes in man, men and in goose, geese , and the - en in oxen are quite different phonologically; so are the past-tense formatives such as - ed in guarded , - t in burnt , vowel change in take, took , and vowel and consonant change in bring, brought . In Latin the genitive case can be represented in singular nouns by - ī , - is , - ae , - ūs , and - eī . The phonological difference does not matter, provided only that the category distinction is somehow expressed.",
  "The same is true of the orthographic representation of grammatical differences, and the examples just given illustrate both cases. This is why the grammar of written language can be dealt with separately. In the case of dead languages, known with certainty only in their written forms, this must necessarily be done; insofar as the somewhat different grammar of their spoken forms made use of sound features not represented in writing (e.g., stress differences), this can, at best, only be inferred or reconstructed.",
  "Grammatical forms and grammatical structures are part of the communicative apparatus of languages, and along with vocabulary, or lexicon (the stock of individual words in a language), they serve to express all the meanings required. Spoken language has, in addition, resources such as emphatic stressing and intonation. This is not to say, however, that grammatical categories can be everywhere directly related to specific meanings. Plural and past tense are fairly clear as regards meaning in English, but even here there are difficulties; in if I knew his address, I would tell you, the past-tense form knew refers not to the past but to an unfulfilled condition in the present. In some other languages greater problems arise. The gender distinctions of French, German, and Latin are very much part of the grammar of these languages, but only in a small number of words do masculine, feminine, and neuter genders correspond with differences of sex, or with any other category of meaning in relation to the external world.",
  "Language exists to be meaningful; the study of meaning, both in general theoretical terms and in reference to a specific language, is known as semantics . Semantics embraces the meaningful functions of phonological features, such as intonation, and of grammatical structures and the meanings of individual words. It is this last domain, the lexicon, that forms much of the subject matter of semantics. The word stock of a language is very large;  The Oxford English Dictionary  , for example, consists of some 600,000 words. When the lexicons of specialized, dialectal, and global varieties of English are taken into account, this total must easily exceed one million. The lexicons of less widely used languages can be just as large.",
  "Among the many examples of investigation for study within semantics are the sense relations between words (such as synonymy and antonymy), the nature of “semantic features” of word meaning (e.g., woman = [adult, female, human]), and the ways in which words group themselves into domains (“semantic fields”). Once again, it must be stressed that questions arising from the relations between semantics, grammar, and phonology are the subjects of continuing controversy.",
  "The word language contains a multiplicity of different designations. Two senses have already been distinguished: language as a universal species-specific capability of the human race and languages as the various manifestations of that capability, as with English, French, Latin, Swahili, Malay, and so on. There is, of course, no observable universal language over and above the various languages that have been or are spoken or written, but one may choose to concentrate on the general and even the universal features, characteristics, and components of different languages and on the ways in which the same sets of descriptive procedures and explanatory theories may be applied to different languages. In so doing one may refer to language (in general) as one’s object of study. This is what is done by linguists, or linguistic scientists, persons devoting themselves to the scientific study of languages (as opposed to the popular sense of linguists as polyglots, persons having a command of several different languages).",
  "It has already been pointed out that no two persons speak exactly alike, and, within the area of all but the smallest speech communities (groups of people speaking the same language), there are subdivisions of recognizably different types of language, called dialects , that do not, however, render intercommunication impossible or markedly difficult. Because intercomprehensibility lies along a scale, the degree required for two or more forms of speech to qualify as dialects of a single language, instead of being regarded as separate languages, is not easy to quantify or to lay down in advance, and the actual cutoff point must in the last resort be arbitrary. In practice, however, the terms dialect and language can be used with reasonable agreement. One speaks of different dialects of English (Southern British English, Northern British English, Scottish English, Midwest American English, New England American English, Australian English, and so on, with, of course, many more delicately distinguished subdialects within these very general categories), but no one would speak of Welsh and English or of Irish and English as dialects of a single language, although they are spoken within the same areas and often by people living in the same villages as each other.",
  "Sometimes, as in the case of criminal argots, part of the function of special languages is deliberately to mislead and obstruct the rest of society and the authorities in particular; they may even become wholly impenetrable to outsiders. But this is not the sole or main purpose of most specialized varieties of language. Professions whose members value their standing in society and are eager to render their services to the public foster their own vocabulary and usage, partly to enhance the dignity of their profession and the skills they represent but partly also to increase their efficiency. An example of this is the language of the law and of lawyers.",
  "The cultivation and maintenance of specialized types of language by certain professions should not be regarded as trivially or superficially motivated. In general usage, languages are necessarily imprecise, or they would lack the flexibility and infinite extensibility demanded of them. But for certain purposes in restricted situations, much greater precision is required, and part of the function of the particular style and vocabulary of legal language is the avoidance, so far as may be possible, of all ambiguity and the explicit statement of all necessary distinctions. This is why legal texts, when read out of their context, seem so absurdly pedantic and are an easy target for ridicule. Similar provision for detail and clarity characterizes the specialist jargons of medicine and of the sciences in general and also of philosophy. Indeed, one might regard the formulas of modern symbolic logic as the result of a consciously developed and specialized written language for making precise the relations of implication and inference between statements that, when couched in everyday language, are inexact and open to misinterpretation. Some have gone as far as to say that traditional metaphysics is no more than the result of misunderstanding everyday discourse and that the main purpose of philosophy is to resolve the puzzles that arise from such misunderstandings.",
  "The use of specialized types of language in fostering unity is also evidenced in the stereotyped forms of vocabulary employed in almost all sports and games . Among traditional sports, for example, tennis scores use the sequence love , 15 , 30 , 40 , and game ; cricketers verbally appeal to the umpire when a batsman may be out by calling “How’s that?” and the ways of being out are designated by stereotypes, “run out,” “leg before wicket,” “stumped,” and so forth.",
  "The efficacy of religious worship and of prayers is frequently associated with the strict maintenance of correct forms of language, taught by priests to their successors, lest the ritual become invalid. In ancient India the preservation of the language used in the performance of certain religious rituals (Sanskrit) gave rise to one of the world’s most important schools of linguistics and phonetics. In the Christian churches one can observe the value placed by the Church of England on the formal English of the Authorized Version of the Bible and of  The Book of Common Prayer  , despite attempts at replacing these ritual forms of language by forms taken from modern spoken vernaculars.",
  "Some specialized languages were developed to keep the outsider at bay. In other circumstances, languages have been deliberately created to facilitate communication with outsiders. This happens when people speaking two different languages have to work together, usually in some form of trade relation or administrative routine. In such situations the so-called pidgins arise, more or less purposely made up of vocabulary items from each language, with mutual abandonment of grammatical complexities that would cause confusion to either party. Pidgins have been particularly associated with areas settled by European traders; examples have been Chinook Jargon, a lingua franca based on an American Indian language and English that was formerly used in Washington and Oregon, and Beach-la-mar, an English-based pidgin of parts of the South Seas. Some pidgins have come to be extensively used, such as Tok Pisin in Papua New Guinea and the pidgins of the West African coast.",
  "Sometimes, as the result of relatively permanent settlement and the intermixture of two speech communities, a pidgin becomes the first language of later generations, ultimately displacing both the original languages. First languages arising in this way from artificially created pidgins are called creoles . Notable among creoles is Haitian Creole, which grew primarily from the interactions between French colonists and enslaved Africans on Haiti’s plantations. It is one of Haiti’s official languages (the other being French), and it shows lexical and grammatical features of both French and African languages.",
  "Creoles differ from pidgins in that, as first languages, they are subject to the natural processes of change like any other language ( see below  Linguistic change ), and, despite the deliberately simplified form of the original pidgin, creoles develop their own complexities in the course of generations. This occurs because the restricted uses to which pidgins were first put and for which they were devised did not require any great flexibility. Once such a language becomes the first or only language of many people, it must acquire the resources (i.e., the complexity) to respond adequately to all the requirements of a natural language. The study of the processes whereby a pidgin becomes a creole and of the relationship between creoles and a country’s standard language is carried on within sociolinguistics . The investigation can be controversial, as historical records may be missing and major issues of cultural and ethnic identity are involved.",
  "Signed languages and gesture languages have the same linguistic components as spoken languages. Although they do not involve speech sounds, they have their own grammar, syntax, and morphology. Sign language is most often used in deaf communities, although it is also sometimes used by hearing people when they are unable to communicate verbally. Although some sign languages are related to spoken languages, often within a geographic community (such as American [spoken] English and American Sign Language ), they are not necessarily direct translations. The scope, history, and unique linguistic and sociological characteristics of sign language are too broad to be fully discussed here; for further treatment of the subject, see  sign language .",
  "When individuals speak, they do not normally confine themselves to the mere emission of speech sounds. Because speaking usually involves at least two parties in sight of each other, a great deal of meaning is conveyed by facial expression and movements and postures of the whole body but especially of the hands; these are collectively known as gestures. The contribution of bodily gestures to the total meaning of a conversation is in part culturally determined and differs in different communities. Just how important these visual symbols are may be seen when one considers how much less effective phone conversation is as compared with conversation face to face. Again, the part played in emotional contact and in the expression of feelings by facial expressions and tone of voice, quite independently of the words used, has been shown in tests in which subjects have been asked to react to sentences that appear as friendly and inviting when read but are spoken angrily and, conversely, to sentences that appear as hostile but are spoken with friendly facial expressions. It is found that it is the visual accompaniments and tone of voice that elicit the main emotional response. A good deal of sarcasm exploits these contrasts, which are sometimes described under the heading of paralanguage.",
  "Just as there are paralinguistic activities such as facial expressions and bodily gestures integrated with and assisting the communicative function of spoken language, so there are vocally produced noises that cannot be regarded as part of any language, though they help in communication and in the expression of feeling. These include laughter, shouts and screams of joy, fear, pain, and so forth, and conventional expressions of disgust, triumph, and so on, traditionally spelled ugh! , ha ha! , and so on, in English. These sorts of nonlexical expressions are much more similar in form and meaning throughout humankind as a whole, in contrast to the great diversity of languages. They are also far less arbitrary than most of the lexical components of language, and they are much nearer the cries of animals produced under similar circumstances and serve similar expressive and communicative purposes (as far as animals’ intentions and behaviour can be understood). Some people have tried to trace the origin of language itself to them.",
  "A language is a symbol system. It may be regarded, because of its infinite flexibility and productivity, as the symbol system par excellence. But there are other symbol systems recognized and institutionalized in the different cultures of humankind. Examples of these exist on maps and blueprints and in the conventions of representational art (e.g., the golden halos around the heads of saints in religious paintings). Other symbol systems are musical notation and dance notation , wherein graphic symbols designate musical pitches and other features of musical performance and the movements of formalized dances. More loosely, because music itself can convey and arouse emotions and certain musical forms and structures are often associated with certain types of feeling, one frequently reads of the “language of music” or even of “the grammar of music.” The terms language and grammar are here being used metaphorically, however, if only because no symbol system other than language has the same potential of infinite productivity, extension, and precision.",
  "Languages are used by human beings to communicate with other human beings. Derivatively, bits of languages may be used by humans to control machinery, as when different buttons and switches are marked with words or phrases designating their functions. A specialized development of human-machine language is seen in computer programming languages , which provide the means whereby sets of instructions and data of various kinds are supplied to computers in forms acceptable to these machines. Various types of such languages are employed for different purposes.",
  "In societies in which literacy is all but universal and language teaching at school begins with reading and writing in the native tongue, one is apt to think of language as a writing system that may be pronounced. In point of fact, language generally begins as a system of spoken communication that may be represented in various ways in writing.",
  "The human being has almost certainly been in some sense a speaking animal from early in the emergence of Homo sapiens as a recognizably distinct species. The earliest known systems of writing go back perhaps 4,000 to 5,000 years. This means that for many years (perhaps hundreds of thousands) human languages were transmitted from generation to generation and were developed entirely as spoken means of communication. Moreover, in the world as it is today, literacy is still the privilege of a minority in some language communities. Even when literacy is widespread, some languages remain unwritten if they are not economically or culturally important enough to justify creating an alphabet for them and teaching them. Then literacy is acquired in a second language learned at school. Such is the case with many speakers of South American Indian languages, who become literate in Spanish or Portuguese. A similar situation prevails in some parts of Africa, where reading and writing are taught in languages spoken over relatively wide areas. In all communities, speaking (or signing) is learned by children before writing, and, typically, people act as speakers and hearers much more than as writers and readers. The lexical content of languages varies according to the culture and the needs of their speakers, and all languages are complexly structured, rich in vocabulary, and efficient as a tool of communication.",
  "All this means that the structure and composition of language and of all spoken languages have been conditioned by the requirements of speech, not those of writing. Spoken languages are what they are by virtue of their verbal, not their written, manifestations. The study of spoken language must be based on a knowledge of the physiological and physical nature of speaking and hearing.",
  "Speaking is in essence the by-product of a necessary bodily process, the expulsion from the lungs of air charged with carbon dioxide after it has fulfilled its function in respiration. Most of the time one breathes out silently, but it is possible, by adopting various postures and by making various movements within the vocal tract, to interfere with the egressive airstream so as to generate noises of different sorts. This is what speech is made of.",
  "The vocal tract comprises the passage from the trachea (windpipe) to the orifices of the mouth and nose; all the organs used in speaking lie in this passage. Conventionally, these are called the organs of speech, and the use in several languages of the same word for the tongue as a part of the body and for language shows the awareness people have of the role played by this part of the mouth in speaking. But few if any of the major organs of speech are exclusively or even mainly concerned with speaking. The lips, the tongue , and the teeth all have essential functions in the bodily economy, quite apart from talking; to think, for example, of the tongue as an organ of speech in the same way that the stomach is regarded as the organ of digestion is fallacious. Speaking is a function superimposed on these organs, and the material of speech is a waste product, spent air, exploited to produce perhaps the most wonderful by-product ever created.",
  "Relatively few types of speech sounds are produced by other sources of air movement; the clicks in some South African languages are examples, and so is the fringe linguistic sound used in English to express disapproval, conventionally spelled tut . In all spoken languages, however, the great majority of speech sounds have their origin in air expelled through the contraction of the lungs. Air forced through a narrow passage or momentarily blocked and then released creates noise, and characteristic components of speech sounds are types of noise produced by blockage or narrowing of the passage at different places.",
  "  If the vocal cords (really more like two curtains) are held taut as the air passes through them, the resultant regular vibrations in the larynx produce what is technically called voice , or voicing. These vibrations can be readily observed by contrasting the sounds of f and v or of s and z as usually pronounced; five and size each begin and end with voiceless and voiced sounds, respectively, which are otherwise formed alike, with the tongue and the lips in the same position. Most consonant sounds and all vowel sounds in English and in the majority of languages are voiced, and voice, in this sense, is the basis of singing and of the rise and fall in speaking that is called intonation , as well as of the tone distinctions in tone languages. The vocal cords may be drawn together more or less tightly, and the vibrations will be correspondingly more or less frequent. A rise in frequency causes a rise in perceived vocal pitch . Speech in which voice is completely excluded is called whispering .",
  " heed hid head had hod hawed hood who’d  Above the larynx, places of articulation in frequent use are between the back of the tongue and the soft palate , between the blade of the tongue and the ridge just behind the upper front teeth, and between the lips. Stoppage and release (technically, plosion) at these places form the k (often written as c , as in cat ), t , and p sounds in English and, when voicing is also present, the g (as in gift ), d , and b sounds. Obstruction at these and other places sufficient to cause noise gives rise to what are called fricative sounds; in English these include the normal pronunciations of s , z , f , and v and the th sounds in “thin” and “then.” A vowel is characterized as the product of the shape of the entire tract between the lips and larynx, without local obstruction though usually with voicing from the vocal cords. It is contrasted with a consonant, though the exact division between these two categories of speech sound is not always easy to draw. Different shaping of the tract produces the different vowel sounds of languages.",
  "The soft palate may be raised or lowered. It is lowered in breathing and allows air to pass in and out through the nose. In the utterance of most speech sounds it is raised, so that air passing through the mouth alone forms the sound; if it is lowered, air passes additionally or alternatively through the nose, producing nasal sounds. All but a few languages have nasal consonants (the English sounds m , n , and ng as in sing ), and some, such as French, have nasalized vowels as well. A few people regularly allow air to pass through their nasal passages while they speak; such persons are said to “speak through the nose.”",
  "All articulatory movements, including the initial expulsion of air from the lungs, may be made with greater or less vigour, giving rise to louder or softer speech or to greater loudness on one part of what is said.",
  "Every different configuration and movement of the vocal tract creates corresponding differences in the air vibrations that comprise and transmit sound. These vibrations, like those of all noises, extend outward in all directions from the source, gradually decreasing to zero or to below the threshold of audibility. They are called sound waves, and they consist of rapid rises and falls in air pressure. The speed at which pressure rises and falls is the frequency. Speech sounds involve complex waves containing vibrations at a number of different frequencies, the most complex being those produced by the vocal cords in voiced sounds.",
  "The eardrum responds to the different frequencies of speech, provided they retain enough energy, or amplitude (i.e., are still audible). The different speech sounds that make up the utterances of any language are the result of the different impacts on one’s ears made by the different complexes of frequencies in the waves produced by different articulatory processes. As the result of careful and detailed observation of the movements of the vocal organs in speaking, aided by various instruments to supplement the naked eye, a great deal is now known about the processes of articulation. Other instruments have provided much information about the nature of the sound waves produced by articulation. Speech sounds have been described and classified both from an articulatory viewpoint, in terms of how they are produced, and from an acoustic viewpoint, by reference to the resulting sound waves (their frequencies, amplitudes, and so forth). Articulatory descriptions are more readily understood, being couched in terms such as nasal , bilabial lip-rounded , and so on. Acoustic terminology requires a knowledge of the technicalities involved for its comprehension. Both sorts of description and classification are important, and each has its particular value for certain parts of the scientific study of language.",
  "In regard to the production of speech sounds, all typical humans are physiologically alike. It has been shown repeatedly that children learn the language of those who bring them up from infancy. These are often the biological parents, but one’s first language is acquired from environment and learning, not from physiological inheritance. Adopted infants, whatever their physical characteristics and whatever the language of their biological parents, acquire the language of the adoptive parents.",
  "Different shapes of lips, throat, and other parts of the vocal tract have an effect on voice quality; this is part of the individuality of each person’s voice referred to above. Physiological differences, including size of throat and larynx, both overall and in relation to the rest of the vocal tract, are largely responsible for the different pitch ranges characteristic of any individual’s speech. These differences do not affect one’s ability or aptitude to speak any particular language.",
  "Speech is species-specific to humankind. Physiologically, animal communications systems are of all sorts. The animal sounds superficially most resembling speech, the imitative cries of parrots and some other birds, are produced by very different physiological means: birds have no teeth or lips but vocalize by means of the syrinx , a modification of the windpipe above the lungs. Almost all mammals and many other animal species make vocal noises and evince feelings thereby and keep in contact with each other through a rudimentary sort of communication, but those members of the animal kingdom nearest to humans genetically, the great apes, lack the anatomical apparatus necessary for speech.",
  "The development of speech has been linked to upright posture and the freeing of the vocal cords from the frequent need to “hold one’s breath” in using the arms for locomotion. Certainly, speaking and hearing—as a primary means of communication—have a number of striking advantages: speech does not depend on daylight or on mutual visibility; it can operate in all directions over reasonably wide areas; and it can be adjusted in loudness to cope with distance. As is seen in crowded rooms, it is possible to pick out some one person’s voice despite a good deal of other noise and in the midst of other voices speaking the same language. Also, the physical energy required in speaking is extremely small in relation to the immense power wielded by speech in human life, and scarcely any other activity, such as running, walking, or tool using, interferes seriously with the process.",
  "The characteristics just outlined pertain to all of the world’s spoken languages. What is more a matter of controversy is the extent to which biological inheritance is involved in language acquisition and language use. The fact that language traditionally has been viewed as species-specific to human beings argues an essential cerebral or mental component, and in the 19th century certain aspects of speech control and use were located in a particular part of the human brain (the Broca area , named for the 19th-century French surgeon who discovered it, Paul Broca ).",
  "Whether the great apes have the mental capacity to acquire at least a rudimentary form of language has developed into an area of active research. While apes lack the anatomical structures that are necessary for the vocalization of human speech, many investigators nevertheless claim to have taught chimpanzees, gorillas, and orangutans to communicate in languages whose “words” are composed of hand signs or geometric symbols. These claims have been disputed, with critics arguing that the apes have not demonstrated true language acquisition in the sense of understanding the “words” as symbolic abstractions that can be used in new and grammatically meaningful constructions. Researchers working with the apes, however, maintain that at least some of the apes have learned to understand and manipulate the “words” as abstractions.",
  "No one inherits the ability to use a particular language, but children are typically born with the ability and the drive to acquire language—namely, the one (or ones) to which they are routinely exposed from infancy. Children bring to this task considerable innate ability, because their exposure is largely to a random selection of utterances (apart from any attempts at systematic teaching that they may encounter) occurring in their general vicinity or addressed to them. Yet by late childhood they have, through progressive stages, acquired the basic vocabulary of at least one language, together with its phonological and grammatical structure. This is substantially the same situation the world over, among literate and illiterate communities, and the process takes up much the same number of years of childhood. Thus, it would appear that all languages are roughly equal in complexity and in difficulty of mastery. Moreover, it is thought that some two-thirds of the world’s children grow up in multilingual settings, suggesting that bilingualism is actually a more common human condition than monolingualism. Certainly, children who acquire two languages do so at the same rate as children who acquire one language. There seems to be no theoretical limit to the number of languages a young child is capable of acquiring.",
  "It is therefore clear that humans bring into the world an innate faculty for language acquisition, language use, and grammar construction. The last phrase refers to the internalization of the rules of the grammar of one’s first language from a more or less random exposure to utterances in it. Human children are very soon able to construct new, grammatically acceptable sentences from material they have already encountered; unlike the parrot in human society, they are not limited to mere repetition of utterances.",
  "  The part played by this innate ability and its exact nature remain unclear. Until the 1950s scholars considered language acquisition to be carried out largely by analogical creation from observed patterns of sentences occurring in utterances received and understood by the child. Such a view, much favoured by persons inclined to a behaviourist interpretation of human learning processes (e.g., the American linguist Leonard Bloomfield ), stressed the very evident differences between the structures of different languages, particularly on the surface. Following the pioneering work of the American linguist Noam Chomsky in the late 1950s, a number of linguists placed much more emphasis on the inherent grammar-building disposition and competence of the human brain, which is activated by exposure to utterances in a language, especially during childhood, in such a way that it fits the utterances into predetermined general categories and structures. Such linguists, inheritors of the 17th- and 18th-century interest in “ universal grammar ,” put their stress on the underlying similarities of all languages, especially in the deeper areas of grammatical analysis ( see  linguistics: Transformational-generative grammar ). Additional areas of investigation in the late 20th century were the cognitive systems and abilities underlying language acquisition and use (e.g., concept development, memory , and attention ) and the relevance of social interaction (especially language play) between child and adult. Theories of child language acquisition, as a consequence, became more multifaceted and complex than the approaches that dominated linguistic research in the 1970s and ’80s.",
  "The whole object and purpose of language is to be meaningful . Languages have developed and are constituted in their present forms in order to meet the needs of communication in all its aspects.",
  "It is because the needs of human communication are so various and so multifarious that the study of meaning is probably the most difficult and baffling part of the serious study of language. Traditionally, language has been defined as the expression of thought, but this involves far too narrow an interpretation of language or far too wide a view of thought to be serviceable. The expression of thought is just one among the many functions performed by language in certain contexts.",
  "First, one must recognize that the meaning of any sentence comprises two parts: the meanings of the words it contains and the structural or grammatical meaning carried by the sentence itself. In English  the dog chased the cat and the boy chased the cat differ in meaning because dog and boy are different words with different word meanings; the same applies to equivalent sentences in other languages. The two sentences the dog chased the cat and the cat chased the dog , though containing exactly the same words, are different in meaning because the different word orders distinguish what are conventionally called subject and object. In Latin the two corresponding sentences would be distinguished not by word order, which is grammatically indifferent and largely a matter of style, but by different shapes in the lexical equivalents of dog and cat . In Japanese the grammatical distinction of subject and object, normally marked by the word order subject–object–verb (SOV), can be reinforced by a subject particle after the first word and an object particle after the second.",
  "The formal resources of any language for making distinctions in the structural meanings of sentences are limited by two things: the linear (time) dimension of speaking and the limited memory span of the human brain. Writing copies the time stream of speech with the linear flow of scripts. Diagrams and pictures employ two dimensions, and models employ three; but writing is partially relieved of memory-span restrictions by the permanence of visual marks. Because written texts are almost entirely divorced from oral pronunciation, sentence length and sentence complexity can be carried to extremes, as may be observed in some legal and legislative documents that are virtually unintelligible if read aloud.",
  "Within these linear restrictions, distinctions corresponding to the main uses of language can be made. All languages can employ different sentence structures to state facts (declarative), to ask questions (interrogative), and to enjoin or forbid some course of action (imperative). More delicate means exist to soften or modify these basic distinctions—e.g., It’s cold today, isn’t it? ; Isn’t it still raining? ; Shut the door, if you don’t mind ; Don’t be long, will you? Languages use their resources differently for these purposes, but, generally speaking, each seems to be equally flexible structurally. The principal resources are word order, word form, and, in speech, pitch and stress placement. In English, as an example, a word or phrase can be highlighted by being placed first in the sentence when it would not normally occur there: compare he can’t bear loud noises with loud noises he can’t bear or loud noises, he can’t bear them . The object noun or noun phrase can also be put first by making the sentence passive; this allows the original subject to be omitted if one does not know or does not want to refer to an agent: the town was destroyed (by the revolutionaries ). Within and together with all these possibilities, almost any word can be made contrastively prominent in spoken language by being stressed (spoken more loudly) or by being uttered on a higher pitch , and very often these two are combined: I asked you for RED roses (not yellow) ; I meant it for YOU (not her) ; HE knows nothing about it (someone else may) . Prominence is especially associated with intonation , itself an important carrier of structural meaning in speech. One may state facts, ask questions, and give instructions with a variety of intonations indicating, along with visible gestures, different attitudes, feelings, and social and personal relations between speaker and hearer.",
  "The possibilities of expressing structural meanings are a highly important part of any language. They are acquired along with the rest of one’s first language in childhood and are learned more slowly and with more difficulty in mastering a second or later language. Scholars continue to analyze these resources as they pursue a full understanding of all the semantic functions performed by means of these resources.",
  "The other component of sentence meaning is word meaning, the individual meanings of the words in a sentence, as lexical items. The concept of word meaning is a familiar one. Dictionaries list words and in one way or another state their meanings. It is regarded as a sensible question to ask of any word in a language, “What does it mean?” This question, like many others about language, is easier to ask than to answer.",
  "It is through lexical resources that languages maintain the flexibility their open-ended commitments demand. Every language has a vocabulary of many thousands of words, though not all are in active use, and some are known only to relatively few speakers. Perhaps the commonest delusion in considering vocabularies is the assumption that the words of different languages, or at least their nouns, verbs, and adjectives, label the same inventory of things, processes, and qualities in the world but unfortunately label them with different labels from language to language. If this were so, translation would be easier than it is; but the fact that translation, though often difficult, is possible indicates that people are talking about similar worlds of experience in their various languages.",
  "Languages in part create the world in which humans live. Of course, many words do name existing bits and pieces of earth and heaven: stone , tree , dog , woman , star , cloud , and so on. Others, however, do not so much pick out what is there as classify it and organize one’s relations with it and with each other with regard to it. A range of living creatures are mammals or are vertebrates, because people classify them in these ways, among others, by applying selected criteria and so determining the denotation of the words mammal and vertebrate . Plants are vegetables or weeds according as groups of people classify them, and different plants are included and excluded by such classifications in different languages and different cultures.",
  "Time and its associated vocabulary ( year , month , day , hour , minute , yesterday , tomorrow , and so on) do not refer to discrete sections of reality but enable people to impose some sort of order, in agreement with others, on the processes of change observed in the world. Personal pronouns pick out the persons speaking, spoken to, and spoken about; but some languages make different distinctions in their pronouns from those made in English. For example, in Malay, kita , which means “we,” including the person addressed, is distinct from kami , a form for “we” that includes the speaker and a third person or persons but excludes the person addressed. In Japanese and in several other languages, a variety of words denoting the first and second persons indicate additionally the observed or intended social relationship of those involved.",
  "Other word meanings are even more language- and culture-bound and, in consequence, harder to translate. Right and wrong , theft , inheritance , property , debt , sin , and crime are just a few of the words regulating one’s conduct and relations with one’s fellows in a particular culture. Translation becomes progressively harder as one moves to languages of more remote cultures, and it has been said that it requires “a unification of cultural context.” Insofar as a person’s understanding of the universe and of the relations between that person and other people is closely linked with the language used, it must be assumed, and the evidence confirms this assumption, that children progressively acquire such understanding along with their language.",
  "The great majority of word shapes bear no direct relation to their lexical meanings. If they did, languages would be more alike. What are called onomatopoeic words have some similarity in shape through different languages: French coucou , English cuckoo , and German Kuckuck directly mimic the call of the bird. English dingdong and German bim-bam share several sound features in common that partially resemble the clanging of bells. More abstractly, some direct “sound symbolism” has been seen between certain sound types and visual or tactile shapes. Most people agree that the made-up word oomboolu would better designate a round, bulbous object than a spiky one. In addition, the appropriateness of the vowel sound represented by ee in English wee and i in French petit and Italian piccolo for expressing things of small size has been traced in several languages.",
  "All this, however, is a very small part of the vocabulary of any language. For by far the largest number of words in a spoken language, there is no direct association between sound and meaning. English horse , German Pferd , French cheval , Latin equus , and Greek hippos are all unrelated to the animal so named, except that these words are so used in the languages concerned. This is what is meant by the term arbitrary in the second definition of language quoted at the beginning of this article. Vocabulary has to be largely arbitrary, because the greater part of the world and of human experience is not directly associated with any kind of noise, or even with specific gestures or hand shapes.",
  "The relations between sentence structure and structural meanings are also largely arbitrary and tacitly conventional. The use of loudness and stress for emphasis in spoken languages as well as certain linguistic indications of anger and excitement are akin to nonlinguistic expressions of emotion and are somewhat similar across language divisions. But actual intonations and features such as word order, word inflection, and grammatical particles, used in maintaining distinctions in structural meaning, differ markedly in different languages.",
  "Not only are word meanings somewhat different in different languages; they are not fixed for all time in any one language. Semantic changes take place all along ( see below  Linguistic change ), and at any moment the semantic area covered by a word is indeterminately bordered and differs from context to context. This is a further aspect and condition of the inherent and necessary flexibility of language.",
  "People can be as precise or as imprecise as they need or wish to be. In general, words are fairly imprecise, yet for particular purposes their meanings can be tightened up, usually by bringing in more words or phrases to divide up a given field in more detail. Good contrasts generally with bad , but one can, for example, grade students as first-class, excellent, very good, good, fair, poor, and failed (or bad ). In this case, good now covers a restricted and relatively low place in a field of associated terms.",
  "Colour words get their meanings from their mutual contrasts. The field of visually discriminable hues is very large and goes far beyond the resources of any vocabulary as it is normally used. Children learn the central or basic colour words of their language fairly early and at the same time; such terms as red and green are normally learned before subdivisions such as crimson and scarlet or chartreuse . It is well known that languages make their primary divisions of the spectrum of colours in different places; Japanese aoi covers many of the hues referred to in English by green and blue , while blue covers much of the range of the two Russian words goluboy and siny . While the actual colour vocabularies of languages differ, however, research by Brent Berlin and Paul Kay in the 1960s sought to show that “there exist universally for humans eleven basic perceptual color categories” that serve as reference points for the colour words of a language, whatever number may be regularly employed at any time. The claim remains controversial.",
  "Ordinarily, considerable areas of indeterminate designation in colour vocabulary and in other fields are tolerated; between red and purple and between purple and blue , there are hues that one would hesitate to assign firmly to one or the other and on which there would be considerable personal disagreement. When greater precision than normal is required—as, for example, in listing paint or textile colours—all kinds of additional terms can be brought into service to supplement the usual vocabulary: off-white , light cream , lemon , blush pink , and so on.",
  "The vocabulary of kinship terms varies from language to language, reflecting cultural differences. English distinguishes the nearer kinsfolk by sex: mother, father ; sister, brother ; aunt, uncle ; and others. Other languages, such as Malay, make a lexical distinction of age the primary one, with separate words for elder brother or sister and younger brother or sister. Still other languages—for example, some American Indian ones—use different words for the sister of a man and for the sister of a woman. But beyond this any language can be as precise as the situation demands in kin designation. When it is necessary, English speakers can specify elder sister and female cousin , and within the overall category it is possible to distinguish first and second cousins and cousins once removed , distinctions that it is ordinarily pedantic to make.",
  "The best example of infinite precision available from a strictly limited lexical stock is in the field of arithmetic. Between any two whole numbers a further fractional or decimal number may always be inserted, and this may go on indefinitely: between 10 and 11, 10  1  2  (10.5), 10  1  4  (10.25), 10  1  8  (10.125), and so on. Thus, mathematicians and physical scientists are able to achieve any desired degree of quantitative precision appropriate to their purposes, and hence the importance of quantitative statements in the sciences; any thermometric scale contains far more distinctions of temperature than are reasonably available in the vocabulary of a language ( hot , warm , cool , tepid , cold , and so on). For this reason mathematics has been described as the “ideal use of language.” This characterization, however, applies to relatively few areas of expression, and for many purposes in everyday life the very imprecision of natural languages is the source of their strength and adaptability.",
  "Every living language can readily be adapted to meet changes occurring in the life and culture of its speakers, and the main weight of such changes falls on vocabulary. Grammatical and phonological structures are relatively stable and change noticeably over centuries rather than decades ( see below  Linguistic change ), but vocabularies can change very quickly both in word stock and in word meanings. Among the drivers of this sort of change, technology is among the most significant.",
  "Every language can alter its vocabulary very easily, which means that every user can without effort adopt new words, accept or invent new meanings for existing words, and, of course, cease to use some words or cease to use them in certain meanings. Dictionaries identify some words and some meanings as “obsolete” or “obsolescent” to indicate this process. No two speakers share precisely the same vocabulary of words readily used and readily understood, though they may speak the same dialect. They will, however, naturally have the great majority of words in their vocabularies in common.",
  "Languages have various resources for effecting changes in vocabulary. Meanings of existing words may change. With the virtual disappearance of falconry as a sport in England, lure has lost its original meaning of a bunch of feathers on a string by which hawks were recalled to their handler and is used now mainly in its metaphorical sense of enticement. Words such as computer and jet acquired new ranges of meaning in the mid-20th century.",
  "All languages have the means of creating new words to bear new meanings. These can be new creations; chortle , which entered into general use in the 20th century, was a jocular creation of the English writer and mathematician Lewis Carroll (creator of Alice in Wonderland ), and gas was formed in the 17th century by the Belgian chemist and physician Jan Baptista van Helmont as a technical term in chemistry, loosely modeled on the Greek chaos (“formless void”). Mostly, though, languages follow definite patterns in their innovations. Words can be made up without limit from existing words or from parts of words; the sources of railroad and aircraft are obvious. The controversy over the relations between church and state in the 19th and early 20th centuries gave rise to a chain of new words as the debate proceeded: disestablishmentarian , antidisestablishmentarian , antidisestablishmentarianism . Usually, the bits and pieces of words used in this way are those found in other such combinations, but this is not always so. The term permafrost (terrain that is perennially frozen) contains a bit of permanent probably not hitherto found in any other word.",
  "A particular source of technical neologisms in European languages has been the words and word elements of Latin and Greek . This is part of the cultural history of western Europe, in so many ways the continuation of Greco-Roman civilization. Microbiology and dolichocephalic are words well formed according to the rules of Greek as they would be taken over into English, but no records survive of mikrobiologia and dolichokephalikos ever having been used in Ancient Greek. The same is true of Latinate creations such as reinvestment and longiverbosity . The long tradition of looking to Latin and, since the Renaissance, to Greek also as the languages of European civilization keeps alive the continuing formation of learned and scientific vocabulary in English and other European languages from these sources (late 20th-century coinages using the Greek prefix cyber- provide an example). The dependence on the classical languages in Europe is matched by a similar use of Sanskrit words for certain parts of learned vocabulary in some modern Indian languages (Sanskrit being the classical language of India). Such phenomena are examples of loanwords, one of the readiest sources for vocabulary extension.",
  "Loanwords are words taken into a language from another language (the term borrowing is used for the process). Most obviously, this occurs when new things come into individuals’ experiences as the result of contacts with users of other languages. This is part of the history of every language, except for one used by an impossibly isolated community. Tea from Chinese, coffee from Arabic , and tomato , potato , and tobacco from American Indian languages are familiar examples of loanwords designating new products that have been added to the vocabulary of English. In more abstract areas, several modern languages of India and Pakistan contain many words that relate to government, industry, and current technology taken in from English. This is the result of British rule in these countries up to independence and the worldwide use of English as a language of international science since then.",
  "In general, loanwords are rapidly and completely assimilated to the prevailing grammatical and phonological patterns of the borrowing language. The German word Kindergarten , literally “children’s garden,” was borrowed into English in the middle of the 19th century to designate an informal school for young children. It is now regularly pronounced as an English word, and the plural is kindergartens (not Kindergärten , as in German). Occasionally, however, some loanwords retain marks of their foreign origin; examples include Latin plurals such as cacti and narcissi (as contrasted with native patterns such as cactuses and narcissuses ).",
  "Languages differ in their acceptance of loanwords. An alternative way of extending vocabulary to cope with new products is to create a descriptive compound from within one’s own language. English aircraft and aeroplane are, respectively, examples of a native compound and a Greek loan creation for the same thing. English potato is a loan; French pomme de terre (literally, “apple of the earth”) is a descriptive compound. Chinese is particularly resistant to loans; aircraft , railway , and telephone are translated by newly formed compounds meaning literally fly machine , fire vehicle , and lightning (electricity) language . Some countries try to resist loans, believing that they reduce a language’s identity or “purity,” and introduce laws aimed at stopping the influx and form committees to provide native translations. Language change, however, is never restrained by such efforts; even in countries that have followed a legal road (such as France), loanwords continue to flow into everyday speech. It can be argued that loans add to a language’s richness and flexibility: English itself has received loans from more than 350 languages.",
  "The ability to communicate and the ability to conceptualize are very closely linked, and the typical child learns both these skills together at the same time. This is not to say that thinking is no more than subvocal speech, as some behaviourists have proposed; most people can think pictorially and in simple diagrams, some to a greater degree than others, and one has the experience of responding rationally to external stimuli without intervening verbalization. But, as 18th-century thinkers saw, human rationality developed and still goes hand in hand with the use of language, and a good deal of the flexibility of languages has been exploited in humans’ progressive understanding and conceptualizing of the world they live in and of their relations with others. Different cultures and different periods have seen this process differently developed. The anthropological linguist Edward Sapir put it well: “The ‘real world’ is to a large extent unconsciously built up on the language habits of the group.”",
  "Much of this lies in the irrecoverable prehistory of languages. The idea that there are still some primitive, almost “fossil,” languages, embodying a very low level of conceptualization, is a vain one. All that can be said is that languages are different and that, in part, the world is seen differently through the eyes of speakers or users of different languages. But, in some cases, part of the lexical adaptation of a language to developing thought patterns can be followed through.",
  " Ancient Greece saw a wholly unique growth and flowering of civilization in the 1st millennium bce , which has put virtually the entire civilized world in its debt ever since. In Greek, along with the emergence of certain abstract concepts and ways of thinking, one can follow some of the changes of word meanings and the coining of new words that accompanied this. As an example, the word dikē originally meant “way” or “manner,” and thereafter it acquired the meaning of the “right way of doing something,” “the right way of behaving,” and finally “abstract right.” Its derivative dikaiosynē , traditionally translated “justice,” became the subject of philosophical debate and analysis by the Greek philosophers and covered almost the whole range of moral obligation involved in the relations of one person with others in society. Similar debate and refinement of key terms in the various branches of thought covered by Greek philosophy can be followed through; indeed, the term philosophy is directly taken from Greek philosophia , a compound formed not later than the 5th century bce from philo- (compare philein , “to love”) and sophia (“wisdom”) to refer to abstract speculation and debate of a fundamental nature about the world and humans’ place in it.",
  "An examination of the lexical structure of languages throws some light on the relations between various aspects of human conceptualization. Spatial relations and their expression seem to lie very deep in the content of vocabulary. Words referring to time are drawn metaphorically from spatial words with great frequency: a long/short time , the near future , far ahead/separated in time . Although time is a continuum, people readily divide it up into bits and record it rather as they do materials extended in space: five years , three months , six seconds . This last use of vocabulary may be a particular trait of European languages and some others. An American Indian language is reported not to do this nearly so readily; it uses cardinal numbers only for discrete, countable objects. A separate class of words aligns the vocabulary of sequential time with that of intensity, so repetition of the same activity again and again (to a European) is rather the intensification of a single activity. Certain differences in cultural attitudes and world outlook are said to accompany this kind of linguistic difference.",
  "Spatial terms are also freely used in the expression of other, more abstract relationships: higher temperature , higher quality , lower expectations , summit of a career , far removed from any sensible course of action , a distant relationship , close friends , over and above what had been said . It has been theorized that the linguistic forms most closely associated semantically with the expression of relations—case inflections in languages exhibiting this category—are originally and basically spatial in meaning. This “localist” theory, as it has been called, has been debated since the beginning of the 19th century and probably cannot be accepted as it stands, but the fact that it can be proposed and argued shows the dominant position that spatial relations hold in the conceptualization and verbalization of relations in other realms of thought.",
  "It has been maintained that the human brain has a preference for binary oppositions, or polarities. If this is so, it will help explain the numerous pairs of related antonyms that are found: good, bad ; hot, cold ; high, low ; right, wrong ; dark, light ; and so on. For finer discriminations, these terms can be put into more narrowly specified fields containing more than two terms taken together, but their most general use is in binary contrasts. Here, however, one term seems to represent the fundamental semantic category in question. In asking about size, one asks How big is it? ; about weight, How heavy is it? ; and about evaluation, How good is it? It is possible to ask how small, how light, or how bad something is, but such questions presuppose that the thing in mind has already been graded on the small side, on the light side, or on the bad side.",
  "The capacity for conceptualization possessed and developed by languages is by no means the only purpose language serves. A person’s speech, supplemented by facial expression and gesture when speaker and hearer are mutually in sight, indicates and is intended to indicate a great deal more than factual information, inquiries, and requests. Similarly, sign languages incorporate facial expressions and body language to add meaning and nuance. The fact that some of these other functions are performed by parts of a language usually mastered later by foreign learners gives rise to misinterpretation and often makes foreign speakers appear rude or insensitive when they are, in actuality, simply deploying fewer resources in the language.",
  "Within the range of the structural and lexical possibilities of a language, speakers (or senders) are able to convey their emotional attitudes and feelings toward the person or persons they are addressing (receivers) and toward the subject matter of what they are saying (sending). They are also able to conceal such feelings as one form of linguistic deception, though this is usually a harder task. These same resources are also exploited to arouse appropriate feelings and responses in others, again independently of any factual content. This is the chosen field of the propagandist, the preacher, the orator, the barrister (lawyer), and the advertiser. Spoken languages make use of intonation and voice qualities in these different ways; a person can produce and recognize the intonation and type of voice employed in coaxing, in pleading, in browbeating, in threatening, in pleasure, and in anger, as well as those appropriate for matter-of-fact statements and the exposition of details about which the speaker has little or no emotional involvement.",
  "To describe exactly which phonetic features are brought into play is quite another matter, involving advanced competence in phonetic discrimination and analysis. Grammar and vocabulary are equally involved, though differently in each language. English speakers know the difference between Come and give me a hand! and Could you possibly come and help me? ; He’s got the gift of gab and He is undoubtedly a fluent and persuasive speaker are each appropriate for different occasions. By greetings and leave-takings a great deal of intended interpretation of the social relations between individuals can be expressed. Much of this is the “good manners” taught to children and expected of adults; these aspects of language behaviour vary from culture to culture and group to group, but in none are they wholly absent. It is, of course, equally possible to be deliberately bad mannered or deliberately to flout a linguistic convention or expectation, but this can be done only by knowing what is expected in the situation. The refinements of rudeness, like the refinements of politeness, insofar as the use of language is involved, require a very good knowledge of a language. Equal levels of sophistication are behind the process known as code-switching , wherein individuals move between different linguistic codes depending on the social contexts in which they find themselves.",
  "Written language is no less adapted to conveying more than just factual information, asking factual questions, and giving instructions. Intonation and tone of voice are not easily reproducible in orthographic systems, but part of the skill of novelists or reporters is to convey these features of speech in their descriptions. Additionally, as the examples above show, grammatical and lexical choices are available to the writer, and anyone who has written anything to someone else knows the challenges of making words achieve precisely the purpose for which they are intended.",
  "These variations within a language or within any dialect of a language, may be referred to as styles. Each time people communicate, they do so in one or another style, deliberately chosen with the sort of considerations in mind that have just been mentioned, even though in speech the choice may often be routine. Sometimes style, especially in literature, is contrasted with plain everyday language. In using such plain unmarked types of language, however, one is no less choosing a particular style, even though it is the most commonly used one and the most neutral in that it conveys and arouses the least emotional involvement or personal feelings.",
  "Stylistic differences are available to all mature native speakers or users and in literate communities to all writers, as well as to foreigners who know a second language very well. But there is undoubtedly a considerable range of skills in exploiting all the resources of a language, and communities have always recognized and usually respected certain individuals as preeminently skilled in particular styles, as orators, storytellers, preachers, poets, scribes, belletrists, and so forth. This is the material of literature and, in societies without writing, oral literature .",
  "In all languages, certain forms of expression have been considered worthy of preservation, study, and cultivation. In writing, the nature of written surfaces makes this fairly easy, though not all written material is deliberately preserved; much of it is deliberately destroyed, and, although the chance survival of inscriptions on stone or clay is of the greatest value to the archaeologist and historian, a good deal of such material was never intended to survive. Literature, on the other hand, is essentially regarded as of permanent worth. Printing and, in earlier days, the copying of manuscripts are the means of preserving written literature. In communities without writing, certain persons memorize narratives, poems, songs, prayers, ritual texts, and the like, and these are passed on, with new creations in such styles, to succeeding generations. Such skills, preservative as well as creative, are likely to be lost along with much of the surrounding culture under the impact of literacy. Here, modern recording technology has come to the rescue, and many workers in the field of unwritten languages are preserving specimens of oral literatures with transcriptions and translations while speakers having the requisite knowledge and skills are still available. A great amount of such material, however, must have been irretrievably lost from cultures without writing before the 20th century.",
  "All languages have a literature, but different types of literature flourish in different languages and in different cultures. A warrior caste or a general respect for martial prowess fosters heroic verse or prose tales; urban yearnings for the supposed joys of country life encourage the development of pastoral poetry, itself an outgrowth of the songs of shepherds and rural workers; and the same sense of the jadedness of city life is the best ground for the cultivation of satirical verse and prose, a form of literature probably confined largely to urban civilizations. Every language has the resources to meet these and other cultural requirements in its literature as the occasions arise, but some literary forms are more deeply involved in the structure of the language itself; this is made clear by the relative difficulty of translating certain types of literature and literary styles from one language to another. Poetry , in particular, is closely bound to the structure of the language in which it is composed, and poetry is notoriously difficult to translate from one language into another.",
  "The special vocabularies and linguistic forms used in several games have already been mentioned. Here one may point to the widespread existence of verbal games themselves, based on the accidental features of a particular language. English-speaking children are accustomed to riddles, puns, and spelling games: “I spy with my little eye something beginning with p ” (notice the regular formula with which this opens). These and similar word games have been found all over the world. Homer records the punning use by Odysseus of No-man (Greek Outis ) as his name when he was about to attack Cyclops, who then roared out “No-man is killing me!” and so failed to attract any help. In some languages that make use of lexically distinctive tones, tone puns (words alike but for having different tones) are a form of word play.",
  "As an intellectual challenge, the crossword puzzle in all its varieties, originally an American development early in the 20th century, has maintained popularity over much of the literate world that employs the Latin (Roman) alphabet. Crossword-puzzle solvers rely heavily on the relative probabilities of letter sequences in written words to suggest an answer to a partly filled line, and, depending on the particular style of the originator, crossword clues make use of many sorts of formal features in the language, among them spelling puns, spoken puns, and accidental letter sequences in words and phrases. To be able to solve a crossword puzzle in a second language shows a high degree of skill and knowledge therein.",
  "It has been seen that language is much more than the external expression and communication of internal thoughts formulated independently of their verbalization. In demonstrating the inadequacy and inappropriateness of such a view of language, attention has already been drawn to the ways in which one’s native language is intimately and in all sorts of details related to the rest of one’s life in a community and to smaller groups within that community. This is true of all peoples and all languages; it is a universal fact about language.",
  "Anthropologists speak of the relations between language and culture. It is indeed more in accordance with reality to consider language as a part of culture. Culture is here being used, as it is throughout this article, in the anthropological sense, to refer to all aspects of human life insofar as they are determined or conditioned by membership in a society. The fact that people eat or drink is not in itself cultural; it is a biological necessity for the preservation of life. That they eat particular foods and refrain from eating other substances, though they may be perfectly edible and nourishing, and that they eat and drink at particular times of day and in certain places are matters of culture, something “acquired by man as a member of society,” according to the classic definition of culture by the English anthropologist Sir Edward Burnett Tylor . As thus defined and envisaged, culture covers a very wide area of human life and behaviour, and language is manifestly a part, probably the most important part, of it.",
  "Although the faculty of language acquisition and language use is innate and inherited, and there is legitimate debate over the extent of this innateness, every individual’s language is “acquired by man as a member of society,” along with and at the same time as other aspects of that society’s culture in which people are brought up. Society and language are mutually indispensable. Language can have developed only in a social setting, however this may have been structured, and human society in any form even remotely resembling what is known today or is recorded in history could be maintained only among people utilizing and understanding a language in common use.",
  "Language is transmitted culturally; that is, it is learned . To a lesser extent it is taught , when parents, for example, deliberately encourage their children to talk and to respond to talk, correct their mistakes, and enlarge their vocabulary. But it must be emphasized that children very largely acquire their first language by “grammar construction” from exposure to a random collection of utterances that they encounter. What is classed as language teaching in school either relates to second-language acquisition or, insofar as it concerns the pupils’ first language, is in the main directed at reading and writing, the study of literature, formal grammar, and alleged standards of correctness, which may not be those of all the pupils’ regional or social dialects. All of what goes under the title of language teaching at school presupposes and relies on the prior knowledge of a first language in its basic vocabulary and essential structure, acquired before school age.",
  "If language is transmitted as part of culture, it is no less true that culture as a whole is transmitted very largely through language, insofar as it is explicitly taught. The fact that humankind has a history in the sense that animals do not is entirely the result of language. So far as researchers can tell, animals learn through spontaneous imitation or through imitation taught by other animals. This does not exclude the performance of quite complex and substantial pieces of cooperative physical work, such as a beaver’s dam or an ant’s nest, nor does it preclude the intricate social organization of some species, such as bees. But it does mean that changes in organization and work will be the gradual result of mutation cumulatively reinforced by survival value; those groups whose behaviour altered in any way that increased their security from predators or from famine would survive in greater numbers than others. This would be an extremely slow process, comparable to the evolution of the different species themselves.",
  "There is no reason to believe that animal behaviour has materially altered during the period available for the study of human history—say, the last 5,000 years or so—except, of course, when human intervention by domestication or other forms of interference has itself brought about such alterations. Nor do members of the same species differ markedly in behaviour over widely scattered areas, again apart from differences resulting from human interference. Bird songs are reported to differ somewhat from place to place within species, but there is little other evidence for areal divergence. In contrast to this unity of animal behaviour, human cultures are as divergent as are human languages over the world, and they can and do change all the time, sometimes with great rapidity, as among the industrialized countries of the 21st century.",
  "The processes of linguistic change and its consequences will be treated below. Here, cultural change in general and its relation to language will be considered. By far the greatest part of learned behaviour, which is what culture involves, is transmitted by vocal instruction, not by imitation. Some imitation is clearly involved, especially in infancy, in the learning process, but proportionately this is hardly significant.",
  "Through the use of language, any skills, techniques, products, modes of social control, and so on can be explained, and the end results of anyone’s inventiveness can be made available to anyone else with the intellectual ability to grasp what is being said. Spoken language alone would thus vastly extend the amount of usable information in any human community and speed up the acquisition of new skills and the adaptation of techniques to changed circumstances or new environments. With the invention and diffusion of writing, this process widened immediately, and the relative permanence of writing made the diffusion of information still easier. Printing and the increase in literacy only further intensified this process. Modern techniques for broadcast or almost instantaneous transmission of communication all over the globe, together with the tools for rapidly translating between the languages of the world, have made it possible for usable knowledge of all sorts to be made accessible to people almost anywhere in the world. This accounts for the great rapidity of scientific, technological, political, and social change in the contemporary world. All of this, whether ultimately for the good or ill of humankind, must be attributed to the dominant role of language in the transmission of culture.",
  "The part played by variations within a language in differentiating social and occupational groups in a society has already been referred to above. In language transmission this tends to be self-perpetuating unless deliberately interfered with. Children are in general brought up within the social group to which their parents and immediate family circle belong, and they learn the dialect and communication styles of that group along with the rest of the subculture and behavioral traits and attitudes that are characteristic of it. This is a largely unconscious and involuntary process of acculturation , but the importance of the linguistic manifestations of social status and of social hierarchies is not lost on aspirants for personal advancement in stratified societies. The deliberate cultivation of an appropriate dialect, in its lexical, grammatical, and phonological features, has been the self-imposed task of many persons wishing “to better themselves” and the butt of unkind ridicule on the part of persons already feeling themselves secure in their social status or unwilling to attempt any change in it. Much of the comedy in George Bernard Shaw ’s  Pygmalion  (first performed in 1913, with subsequent film adaptations) turns on Eliza Doolittle ’s need to unlearn her native Cockney if she is to rise in the social scale. Culturally and subculturally determined taboos play a part in all this, and persons desirous of moving up or down in the social scale have to learn what words to use and what words to avoid if they are to be accepted and to “belong” in their new position.",
  "The same considerations apply to changing one’s language as to changing one’s dialect. Language changing is harder for the individual and is generally a rarer occurrence, but it is likely to be widespread in any mass immigration movement. In the 19th and early 20th centuries, the eagerness with which immigrants and the children of immigrants from continental Europe living in the United States learned and insisted on speaking English is an illustration of their realization that English was the linguistic badge of full membership in their new homeland at the time when the country was proud to consider itself the melting pot in which people of diverse linguistic and cultural origins would become citizens of a unified community. A reverse movement, typically by third-generation immigrants, manifests a concern to be in contact again with the ancestral language.",
  "The same sort of self-perpetuation, in the absence of deliberate rejection, operates in the special languages of sports and games and of trades and professions (these are in the main concerned with special vocabularies). Game learners, apprentices, and professional students learn the locutions together with the rest of the game or the job. The specific words and phrases occur in the teaching process and are observed in use, and novices are only too eager to display an easy competence with such phraseology as a mark of their full membership of the group.",
  "Languages and variations within languages play both a unifying and a diversifying role in human society as a whole. Language is a part of culture, but culture is a complex totality containing many different features, and the boundaries between cultural features are not clear-cut, nor do they all coincide. Physical barriers such as oceans, high mountains, and wide rivers constitute impediments to human intercourse and to culture contacts, though modern technology in the fields of travel and communications makes such geographical factors of less and less account. More potent for much of the 20th century were political restrictions on the movement of people and of ideas, such as divided western Europe from formerly communist eastern Europe; the frontiers between these two political blocs represented much more of a cultural dividing line than any other European frontiers.",
  "The distribution of the various components of cultures differs, and the distribution of languages may differ from that of nonlinguistic cultural features. This results from the varying ease and rapidity with which changes may be acquired or enforced and from the historical circumstances responsible for these changes. From the end of World War II until 1990, for example, the division between East and West Germany represented a major political and cultural split in an area of relative linguistic unity. It is significant that differences of vocabulary and usage were noticeable on each side of that division, overlying earlier differences attributed to regional dialects.",
  "Language, no less than other aspects of human behaviour, is subject to purposive interference. When people with different languages need to communicate, various expedients are open to them, the most obvious being second-language learning and teaching. This takes time, effort, and organization, and, when more than two languages are involved, the time and effort are that much greater. Other expedients may also be applied. Ad hoc pidgins for the restricted purposes of trade and administration are mentioned above. Tacit or deliberate agreements have been reached whereby one language is chosen for international purposes when users of several different languages are involved. In the Roman Empire, broadly, the western half used Latin as a lingua franca , and the eastern half used Greek. In western Europe during the Middle Ages, Latin continued as the international language of educated people, and Latin was the second language taught in schools. Later the cultural, diplomatic, and military reputation of France made French the language of European diplomacy. This use of French as the language of international relations persisted until the 20th century. At important conferences among representatives of different nations, it is usually agreed which languages shall be officially recognized for registering the decisions reached, and the provisions of treaties are interpreted in the light of texts in a limited number of languages, those of the major participants.",
  "  After World War II the dominant use of English in science and technology and in international commerce led to the recognition of that language as the major international language in the world of practical affairs, with more and more countries making English the first foreign language to be taught and thus producing a vast expansion of English-language-teaching programs all over the world. Those whose native language is English do not sufficiently realize the amount of effort, by teacher and learner alike, that is put into the acquisition of a working knowledge of English by educated first speakers of other languages.",
  "As an alternative to the recognition of particular natural languages as international in status, attempts have been made to invent and propagate new and genuinely international languages, devised for the purpose. Of these, Esperanto , invented by the Polish-Russian doctor L.L. Zamenhof in the 19th century, is the best known. Such languages are generally built up from parts of the vocabulary and grammatical apparatus of the better-known existing languages of the world. The relationship between the written letter and its pronunciation is more systematic than with many existing orthographies (English spelling is notoriously unreliable as an indication of pronunciation), and care is taken to avoid the grammatical irregularities to which all natural languages are subject and also to avoid sounds found difficult by many speakers (e.g., the English th sounds, which most Europeans, apart from English speakers, dislike). These artificial languages have not made much progress, though an international society of Esperanto speakers does exist.",
  "Deliberate interference with the natural course of linguistic changes and the distribution of languages is not confined to the facilitating of international intercourse and cooperation. Language as a cohesive force for nation-states and for linguistic groups within nation-states has for long been manipulated for political ends. Multilingual states can exist and prosper; Switzerland is a good example. But linguistic rivalry and strife can be disruptive. Language riots have occurred in Belgium between French and Flemish speakers and in parts of India between rival vernacular communities. A language can become or be made a focus of loyalty for a minority community that thinks itself suppressed, persecuted, or subjected to discrimination. The French language in Canada in the mid-20th century is an example. In the 19th and early 20th centuries, Irish Gaelic, or Irish, came to symbolize Irish patriotism and Irish independence from Great Britain, and Irish became Ireland’s first official language at that country’s independence. Government documents are published in Irish and English (the country’s second official language), and Irish is taught in state schools, though it remains under the significant international pressures exerted by English that are described above.",
  "A language may be a target for attack or suppression if the authorities associate it with what they consider a disaffected or rebellious group or a culturally inferior one. There have been periods when American Indian children were forbidden to speak a language other than English at school and when pupils were not allowed to speak Welsh in British state schools in Wales. Both these prohibitions have been abandoned. After the Spanish Civil War of the 1930s, Basque speakers were discouraged from using their language in public as a consequence of the strong support given by the Basques to the republican forces. Interestingly, on the other side of the Franco-Spanish frontier, French Basques were positively encouraged to keep their language in use, if only as an object of touristic interest and consequent economic benefit to the area.",
  "So far, some of the relatively large-scale effects of culture contacts on languages and on dialects within languages have been surveyed. A continuous concomitant of contact between two mutually incomprehensible languages and one that does not lead either to suppression or extension of either is translation. As soon as two users of different languages need to converse, translation is necessary, either through a third party or directly.",
  "Before the invention and diffusion of writing, translation was instantaneous and oral; persons professionally specializing in such work were called interpreters. In predominantly or wholly literate communities, translation is usually thought of as the conversion of a written text (i.e., a text consisting of visual symbols recorded in a physical or electronic medium) in one language into a written text in another, though the advent of real-time oral translation devices, as well as the continued use of professional interpreters at international conferences, has kept the oral side of translation very much alive.",
  "The tasks of the translator are the same whether the material is oral, manual (signed), or written, but, of course, translation between written texts allows more time for stylistic adjustment and technical expertise. The main problems have been recognized since antiquity and were expressed by St. Jerome , translator of the famed Latin Bible, the Vulgate , from the Hebrew and Greek originals. Semantically, these problems relate to the adjustment of the literal and the literary and to the conflicts that so often occur between an exact translation of each word, as far as this is possible, and the production of a whole sentence or even a whole text that conveys as much of the meaning of the original as can be managed. These problems and conflicts arise because of factors already noticed in the use and functioning of language: languages operate not in isolation but within and as part of cultures, and cultures differ from each other in various ways. Even between the languages of communities whose cultures are fairly closely allied, there is by no means a one-to-one relation of exact lexical equivalence between the items of their vocabularies.",
  "In their lexical meanings, words acquire various overtones and associations that are not shared by the nearest corresponding words in other languages; this may vitiate a literal translation. The English author and theologian Ronald Knox pointed to the historical connections of the Greek skandalon , “stumbling block, trap, or snare,” inadequately rendered by “offense,” its usual New Testament translation. In modern times translators of the Bible into the languages of peoples culturally remote from Europe are well aware of the difficulties of finding a lexical equivalent for lamb when the intended readers, even if they have seen sheep and lambs, have no tradition of blood sacrifice for expiation or long-hallowed associations of lambs with lovableness, innocence, and apparent helplessness. The English word uncle has, for various reasons, a cozy and slightly comic set of associations. The Latin poet Virgil used the words avunculus Hector in a solemn heroic passage of the Aeneid (Book III, line 343); to translate this by “uncle Hector” gives an entirely unsuitable flavour to the text.",
  "The translation of poetry , especially into poetry, presents very special difficulties, and the better the original poem, the harder the translator’s task. This is because poetry is, in the first instance, carefully contrived to express exactly what the poet wants to say. Second, to achieve this end, poets call forth all the resources of the language in which they are composing, matching the choice of words, the order of words, and grammatical constructions, as well as phonological features peculiar to the language in metre , perhaps supplemented by rhyme , assonance , and alliteration . The available resources differ from language to language; English and German rely on stress-marked metres, but Latin and Greek used quantitative metres, contrasting long and short syllables, while French places approximately equal stress and length on each syllable. Translators must try to match the stylistic exploitation of the particular resources in the original language with comparable resources from their own. Because lexical, grammatical, and metrical considerations are all interrelated and interwoven in poetry, a satisfactory literary translation is usually very far from a literal word-for-word rendering. The more poets rely on language form, the more embedded their verses are in that particular language and the harder the texts are to translate adequately. This is especially true with lyrical poetry in several languages, with its wordplay, complex rhymes, and frequent assonances.",
  "At the other end of the translator’s spectrum, technical prose dealing with internationally agreed scientific subjects may be the easiest type of material to translate, because cultural unification (in this respect), lexical correspondences, and stylistic similarity already exist in this type of usage in the languages most commonly involved, to a higher degree than in other fields of discourse. Remarkable advances in machine translation have been made since the 1990s, while the growth of the Internet and social media in subsequent decades transformed approaches to, and the ease of, all forms of translation.",
  "  Translation serves to extend the communicative value of a text. Sometimes people want to restrict it. Confidential messages require for their efficacy that they be known to and understood by only the single person or the few persons to whom they are addressed. Such are diplomatic exchanges, operational messages in wartime, and some transmissions of commercial information. Protection of written messages from interception has been practiced for many centuries. Twentieth-century developments in telegraphy and telephony, and the emergence and growth of the Internet, made protection against unauthorized reception more urgent, whether of texts transmitted as speech or those sent as series of letters of the alphabet. Codes and ciphers ( cryptography ) are of much longer standing in the concealment of written messages, though their techniques are being constantly developed. Such gains are, of course, countered by developments in the techniques of decipherment and decoding (as distinct from getting hold of the key to the system in use). An important by-product of such techniques has been the reading and interpretation of inscriptions written in otherwise unknown languages or unknown writing systems for which no translation exists. The decipherment of the Linear B script in the 1950s and its recognition as Mycenaean Greek, an early Greek dialect written in a form of orthography quite distinct from the later classical Greek alphabet, was first achieved by the application of cryptographic “code cracking” methods ( see also  cryptology ).",
  "All physiologically and mentally typical people learn the main structure and basic vocabulary of their native language by the end of childhood. It has been pointed out above that the process of first-language acquisition as a medium of communication is largely achieved from random exposure. There is legitimate controversy, however, over the nature and extent of the positive contribution that the human brain brings, both cognitively and linguistically, to the activity of grammar construction—the activity by which children develop an indefinitely creative competence from the finite data that make up their actual experience of the language. The importance of social interaction between children and their interlocutors is another significant factor. Creativity is what must be stressed as the product of first-language acquisition. By far the greater number of all the sentences people create during their lifetime are new; that is, they have not occurred before in their personal experience. But individuals find no difficulty at all in understanding at once almost everything they hear (or otherwise receive) or for the most part in producing sentences to suit the requirements of every situation. This very ease of creativity in human linguistic competence makes it hard to realize its extent. The only regularly reproduced sentences in most users’ experience are the stereotyped forms of greeting and leave-taking and certain formalized responses to recurrent situations, such as shopping, cooperative activities in repetitive jobs, the stylized parts of religious services, and the like.",
  "Yet, despite the truly immense achievement that the progressive mastery of one’s first language constitutes, it arouses no comment and attracts no credit. It is simply part of what is expected in growing up. Different people may be singled out for praise in certain uses of their language, as good public speakers, authors, poets, tellers of tales, and solvers of puzzles, but not just as communicators. The credit that some individuals acquire in certain communities for “speaking correctly” is a different matter, usually the result of speaking as one’s mother tongue a prestigious standard dialect among people most of whom speak another, less-favoured one.",
  "  The learning of a second and of any subsequently acquired language is quite a separate matter. Except for one form of bilingualism , it is a deliberate activity undertaken when one has already nearly or fully acquired the basic structure and vocabulary of one’s first language. Of course, many people never do master significantly more than their own first language. It is only in encountering a second language that one realizes how complex language is and how much effort must be devoted to subsequent acquisition. It has been said that the principal obstacle to learning a language is knowing one already, and common experience suggests that the faculty of grammar construction exhibited in childhood is one that is gradually lost as childhood recedes.",
  "Whereas most people master their native language with unconscious ease, individuals vary in their ability to learn additional languages, just as they vary in other intellectual activities. Situational motivation, however, appears to be by far the strongest influence on the speed and apparent ease of this learning. The greatest difficulty is experienced by those who learn because they are told to or are expected to, without supporting reasons that they can justify. Given a motive other than external compulsion or expectation, the task is achieved much more easily (this, of course, is an observation in no way confined to language learning). In Welsh schools, for instance, it has been found that English children make slower progress in Welsh when their only apparent reason for learning Welsh is that there are Welsh classes. Welsh children, on the other hand, make rapid progress in English, the language of most further education, the newspapers, most television and radio, most of the better-paid jobs, and any job outside Welsh-speaking areas. Similar differences in motivation have accounted for the excellent standard of English, French, and German acquired by educated persons in the Scandinavian countries and in the Netherlands, small countries whose languages, being spoken by relatively few foreigners, are of little use in international communication. This attainment may be compared with the much poorer showing in second-language acquisition among comparably educated persons in England and the United States, who have for long been able to rely on foreigners accommodating to their ignorance by speaking and understanding English.",
  "It is sometimes held that children brought up bilingually in places in which two languages are regularly in use are slower in schoolwork than comparable monolingual children, as a greater amount of mental effort has to be expended in the mastery of two languages. This has by no means been proved, and indeed there is evidence to the contrary. Moreover, because much of a child’s language acquisition takes place in infancy and in the preschool years, it does not represent an effort in the way that consciously learning a language in school does, and, indeed, it probably occupies a separate part of the child’s mental equipment. The question of speed of general learning by bilinguals and monolinguals must be left open. It is quite a separate matter from the job of learning, by teaching at home or in school, to read and write in two languages; this undoubtedly is more of a labour than the acquisition of monolingual literacy.",
  "Two types of bilingualism have been distinguished, according to whether the two languages were acquired from the simultaneous experience of the use of both in the same circumstances and settings or from exposure to each language used in different settings (an example of the latter is the experience of English children living in India during the period of British ascendancy there, learning English from their parents and an Indian language from their nurses and family servants). However acquired, bilingualism leads to mutual interference between the two languages; extensive bilingualism within a community is sometimes held partly responsible for linguistic change. Interference may take place in pronunciation, in grammar, and in the meanings of words. Bilinguals often speak their two languages each with “an accent”; i.e., they carry into each certain pronunciation features from the other. The German word order in He comes tomorrow home has been reported as an example of grammatical interference, and in Canadian French the verb introduire has acquired from English the additional meaning “introduce, make acquainted” (which in metropolitan French is présenter ).",
  "The acquisition of literacy is something very different from the acquisition of one’s spoken or signed native language, even when the same language is involved, as it usually is. Speaking, signing, and writing are learned skills, but there the resemblance ends. Children learn their first language at the start involuntarily and mostly unconsciously from random exposure, even if no attempts at teaching are made. Literacy is deliberately taught and consciously and deliberately learned. There is ongoing debate on the best methods and techniques for teaching literacy in various social and linguistic settings. Literacy is learned by a person already possessed of the basic structure and vocabulary of his language.",
  "Such facts should be obvious, but the now-accepted standard of near-universal literacy in technologically advanced countries, along with the fact that in second-language learning one usually acquires speech and writing skills at the same time, tends to bring these parts of language learning under one head. Literacy is manifestly a desirable attainment for all communities, though not necessarily in all languages. It must be borne in mind that there are many distinct languages spoken in the world today by fewer than 1,000 or 500 or even 50 persons. The capital investment in literacy, including teaching resources, teacher time and training, printing, publications, and so forth, is vast, and it can be economically and socially justified only when applied to languages used and likely to continue to be used by substantial numbers over a wide area.",
  "Literacy is in no way necessary for the maintenance of linguistic structure or vocabulary, though it does enable people to add words from the common written stock in dictionaries to their personal vocabulary very easily. It is worth emphasizing that until relatively recently in human history all languages were spoken or signed by illiterate speakers and that there is no essential difference as regards pronunciation, structure, and complexity of vocabulary between spoken or signed languages that have writing systems used by all or nearly all their speakers and the languages of illiterate communities.",
  "Literacy has many effects on the uses to which language may be put; storage, retrieval, and dissemination of information are greatly facilitated, and some uses of language, such as philosophical system building and the keeping of detailed historical records, would scarcely be possible in a community wholly without writing. In these respects the lexical content of a language is affected, for example, by the creation of sets of technical terms for philosophical writing and debate. Because the permanence of writing overcomes the limitations of memory span imposed on speech or signing, sentences of greater length can easily occur in writing, especially in types of written language that are not normally read aloud and that do not directly represent what would be spoken. An examination of some kinds of oral literature, however, reveals the ability of the human brain to receive and interpret spoken sentences of considerable grammatical complexity.",
  "In relation to pronunciation, writing does not prevent the historical changes that occur in all languages. Part of the apparent irrationality of English spelling, such as is found also in some other orthographies, lies just in the fact that letter sequences have remained constant while the sounds represented by them have changed. For example, the gh of light once stood for a consonant sound, as it still does in the word as pronounced in some Scots dialects, and the k of knave and knight likewise stood for an initial k sound (compare the related German words Knabe and Knecht ). A few relatively uncommon words, including some proper names, are reformed phonetically, specifically to bring their pronunciation more in line with their spelling. Spelling pronunciations, as these are called, are a product of general literacy. In London the pronunciation of St. Mary Axe as if it were spelled “Simmery Axe” is now decidedly old-fashioned. St. John (“Sinjin”) and St. Clair (“Sinclair”) survive as proper names with their old pronunciations, in the latter case helped by the presence of the alternative spelling Sinclair .",
  "Historically, culturally, and in the individual’s life, writing is subsequent to speech or signing and presupposes it. Aristotle expressed the relation thus: “Speech is the representation of the experiences of the mind, and writing is the representation of speech” ( On Interpretation ). But it is not as simple as this would suggest. Alphabetic writing, in which, broadly, consonant and vowel sounds are indicated by letters in sequence, is the most widespread system in use today, and it is the means by which literacy will be disseminated, but it is not the only system, nor is it the earliest.",
  "Writing appears to have been evolved from an extension of picture signs: signs that directly and iconically represented some thing or action and then the word that bore that meaning. Other words or word elements not readily represented pictorially could be assigned picture signs already standing for a word of the same or nearly the same pronunciation, perhaps with some additional mark to keep the two signs apart. This sort of device is used in children’s word puzzles, as when the picture of a berry is used to represent, say, the second half of the name Canterbury. This opens the way for what is called a character script, such as that of Chinese, in which each word is graphically represented by a separate individual symbol or character or by a sequence of two or more such characters. Writing systems of this sort have appeared independently in different parts of the world.",
  " Chinese character writing has for many centuries been stylized, but it still bears marks of the pictorial origin of some characters. Chinese characters and the characters of similar writing systems are sometimes called ideograms, as if they directly represented thoughts or ideas. This is not so. Chinese characters stand for Chinese words or, particularly as in modern Chinese, bits of words ( logograms ); they are the symbolization of a particular language, not a potentially universal representation of thought. The ampersand (&) sign, standing for and in English printing, is a good isolated example of a logographic character used in an alphabetic writing system.",
  "Character writing is laborious to learn and imposes a burden on the memory. Alternatives to it, in addition to alphabetic writing, include scripts that employ separate symbols for the syllable sequences of consonants and vowels in a language, with graphic devices to indicate consonants not followed by a vowel. The Devanagari script, in which classical Sanskrit and modern Hindi are written, is of this type, and the Mycenaean writing system, a form of Greek writing in use in the 2nd millennium bce and quite independent of the later Greek alphabet, was syllabic in structure. Japanese employs a mixed system, broadly representing the roots of words by Chinese characters (  kanji  ) and the inflectional endings by syllable signs (  kana  ). These syllable signs are an illustration of the way in which a syllabic script can develop from a character script: certain Chinese characters were selected for their sound values alone and, reduced in size and complexity, have been standardized as signs of a particular consonant and vowel sequence or of a single vowel sound.",
  "The Greek alphabet came from the Phoenician script , a syllabic-type writing system that indicated the consonant sounds. By a stroke of genius, a Greek community decided to employ certain consonantal signs to which no consonant sound corresponded in Greek as independent vowel signs, thus producing an alphabet, a set of letters standing for consonants and vowels. The Greek alphabet spread over the ancient Greek world, undergoing minor changes. From a Western version sprang the Latin (Roman) alphabet . Also derived from the Greek alphabet, the Cyrillic alphabet was devised in the 9th century ce by a Greek missionary, St. Cyril, for writing the Slavic languages.",
  "Alphabetic writing is not and cannot be an exact representation of the sequence of sounds or even of the sequence of distinctive sounds in the spoken forms of words and sentences.  Consonant  and  vowel  mean different things when applied to letters and to sounds, though there is, of course, much overlap. The y at the beginning of yet stands for a consonant sound; at the end of jetty it stands for a vowel sound. In thick and thin the sequence th represents a single sound, not a t sound followed by an h sound. In kite the e represents no sound directly but distinguishes the vowel between k and t from the vowel in kit . These disharmonies arise from a number of causes. Economy in the use of letters is one factor. In addition, spoken forms are always changing over the centuries, whereas writing, particularly since the invention of printing , is very conservative. At one time the e at the end of words such as kite did stand for a vowel sound. This sound was lost between the 14th and 16th century, a time when other changes in the pronunciation of such words also occurred. The notorious ough spellings in English, standing for different sounds and sound sequences in rough , cough , dough , plough , ought , and other such words, have arisen from historical changes that have driven spelling and pronunciation farther apart.",
  "This, of course, does not mean that spelling reforms are out of the question. Spelling reform has been talked of in relation to English for many centuries without much effect, but in some countries—for example, Germany, Norway and the Netherlands—official action has prescribed certain reforms to be made, and these have then been taught in school and have gradually found their way into printed works. The sheer volume of printed matter preserved for use and consultation in the modern world adds much weight against the convenience otherwise accruing from reforms designed to correct the historically produced disharmonies between spelling and pronunciation. Nevertheless, Noah Webster successfully introduced some changes into English in the late 18th century, and active movements supporting spelling reform in the language do exist.",
  "Moreover, it is not always most useful for spellings to represent exactly the sound sequences in a word and nothing else; this is the task for which phoneticians have devised transcriptions. As far as the sounds themselves are concerned, the plural signs of cats , dogs , and horses are different: the final sound of cats is like the initial sound of sink , that of dogs like the initial sound of zinc , and the plural of horse is indicated by a sound sequence rather like that in is . But they are all indicated in writing by one and the same letter and always have been, because only one grammatical distinction, that of singular as against plural, is involved, and at this point in the language the actual differences in the sounds, important elsewhere, are irrelevant.",
  "Letters, insofar as they stand for sounds, stand for consonants and vowels. But other sound features are involved in languages. In English words the location of the stress is important, and the words import as a noun and import as a verb are distinguished by this alone. All spoken languages make use of sequences of rises and falls in pitch, called intonation . These phenomena are unrepresented in orthography except for certain punctuation marks such as ? and ! and sometimes by italicization and underlining.",
  "This is not a weakness in orthography. Writing is normally intended to be read and when necessary read aloud by people who already know the language and are therefore able to supply from their own competence the required detail. For specific purposes such as foreign-language teaching, as well as for the specific study of pronunciation in phonetics and phonology, various forms of transcription have been devised to indicate unambiguously by written signs the precise form of the spoken utterance, without regard to other considerations.",
  "For these reasons one should distinguish the grammar of a written language (e.g., written English) from the grammar of the corresponding spoken language (spoken English). The two grammars will be very similar, and they will overlap in most places, but the description of spoken English will have to take into account the grammatical uses of features such as intonation, largely unrepresented in writing, and a great deal of colloquial construction and spontaneous discourse processing; by contrast, the description of written English must deal adequately with the greater average length of sentences and some different syntactic constructions and word forms characterizing certain written styles but almost unknown in ordinary speech (e.g., whom as the objective form of who ).",
  "In studying ancient (dead) languages one is, of course, limited to studying the grammar of their written forms and styles, as their written records alone survive. Such is the case with Latin, Ancient Greek, and Sanskrit (Latin lives as a spoken language in very restricted situations, such as the official language of some religious communities, but this is not the same sort of Latin as that studied in classical Latin literature ; Sanskrit survives also as a spoken language in similarly restricted situations in a few places in India). Scholars may be able to reconstruct something of the pronunciation of a dead language from historical inferences and from descriptions of its pronunciation by authors writing when the language was still spoken. They know a good deal about the pronunciation of Sanskrit, in particular, because ancient Indian scholars left a collection of extremely detailed and systematic literature on its pronunciation. But this does not alter the fact that when one teaches and learns dead languages today, largely for their literary value and because of the place of the communities formerly speaking them in our own cultural history, one is teaching and learning the grammar of their written forms. Indeed, despite what is known about the actual pronunciation of Greek and Latin, Europeans on the whole pronounce what they read in terms of the pronunciation patterns of their own languages.",
  "Under present conditions, with universal literacy either an accepted fact or an accepted target, it is assumed that, wherever it is convenient or useful, writing may be employed for any purpose for which speech might have been used and by all sections of the community. This has not always been so. Literacy was until the 19th century the privilege of the few. In other periods and cultures, writing was the preserve of certain defined groups, such as the priesthood and the official class, and it was restricted to certain purposes, such as the annals of important events, genealogical tables, and records of inventories of things and persons. It is highly probable that writing first developed for particular types of use by particular groups of specialists within communities and subsequently, because of its obvious utility, spread outside these limits.",
  "Every language has a history, and, as in the rest of human culture, changes are constantly taking place in the course of the learned transmission of a language from one generation to another. This is just part of the difference between human culture and animal behaviour . Languages change in all their aspects, in their pronunciation, word forms, syntax , and word meanings ( semantic change). These changes are mostly very gradual in their operation, becoming noticeable only cumulatively over the course of several generations. But, in some areas of vocabulary, particular words closely related to rapid cultural change are subject to equally rapid and therefore noticeable changes within a generation or even within a decade. In the 20th century the vocabulary of science and technology was an outstanding example. The same is also true of those parts of vocabulary that are involved in fashionable slangs and jargons , whose raison d’être in promoting group, particularly age-group, solidarity depends on their being always fresh and distinctive. Old slangs date, as any novel or film more than 10 years old is apt to show.",
  "  In the structural aspects of spoken language, their pronunciation and grammar , and in vocabulary less closely involved in rapid cultural movement, the processes of linguistic change are best observed by comparing written records of a language over extended periods. This is most readily seen by English speakers through setting side by side present-day English texts with 18th-century English, the English of the Authorized Version of the Bible, Shakespearean English, Chaucer ’s English, and the varieties of Old English (Anglo-Saxon) that survive in written form. Noticeably, as one goes back in time, the effort required in understanding increases, and, while people do not hesitate to speak of “Shakespearean English,” they are more doubtful about Chaucer, and for the most part Old English texts are as unintelligible to a modern English speaker as, for example, texts in German. It is clear that the differences involved include word meanings, grammar, and, so far as this can be reconstructed, pronunciation.",
  "Similar evidence, together with what is known of the cultural history of the peoples concerned, makes clear the continuous historical connections linking French, Spanish, Portuguese, Italian, and Romanian with the spoken (“vulgar”) Latin of the western Roman Empire . This group constitutes the Romance subfamily of languages and is an example of how, as the result of linguistic change over a wide area, a group of distinct, though historically related, languages comes into being.",
  "In the transmission of a language from parent to child, slight deviations in all aspects of language use occur all the time, and, as children’s communication contacts widen, they confront a growing range of slight differences in personal language use, some of them correlating with social or regional differences within a community, these differences themselves being the results of the transmission process. As a consequence, children’s language comes to differ slightly from that of their parents’ generation. In urbanized communities an additional factor is involved: children have been shown to be effectively influenced by the language habits of their peer groups once they have made contacts with them in and out of school.",
  "  Such changes, though slight at the time, are progressively cumulative. Since ready intercommunication is a primary purpose of language, as long as a community remains unitary, with strong central direction and a central cultural focus, such changes will not go beyond the limits of intercomprehensibility. But in more-scattered communities and in larger language areas, especially when cultural and administrative ties are weakened and broken, these cumulative deviations in the course of generations give rise to wider regional differences. Such differences take the form of dialectal differentiation as long as there is some degree of mutual comprehension but eventually result in the emergence of distinct languages. This is what happened in the history of the colloquial Latin of the western Roman Empire, and it can be assumed that a similar course of events gave rise to the separate Germanic languages (English, German, Dutch, Danish, Norwegian, Swedish, and some others), though in this family the original unitary language is not known historically but inferred as “Common Germanic” or “Proto-Germanic” and tentatively assigned to early in the 1st millennium bce as the period before separation began.",
  "This is how language families have developed. Most but not all of the languages of Europe belong to the Indo-European family , so-called because in addition it includes the classical Indian language Sanskrit and most of the modern languages of northern India and Pakistan. It includes as subfamilies the two families just mentioned, Romance and Germanic, and several others. It is assumed that the subfamilies, and from them the individual languages of the Indo-European family, are ultimately derived from a unitary language spoken somewhere in eastern Europe or western Asia (its exact location is still under debate), perhaps 5,000 years ago. This unitary language has itself been referred to as “Indo-European,” “Proto-Indo-European,” the “common parent language,” or the “original language” ( Ursprache ) of the family. But it must be emphasized that, whatever it may have been like, it was just one language among many and of no special status in itself. It was certainly in no way the original language of humankind or anything like it. It had its own earlier history, of which virtually nothing can be inferred, and it was, of course, very recent in relation to the time span of human language itself. What is really special about such “parent” or “proto-” languages is that they represent the farthest point to which available techniques and resources enable linguists to reconstruct the prehistory of attested and living languages. Similarly constituted families of languages derived from inferred common sources have been established for other parts of the world—for example, Altaic , covering Turkish and several languages of Central Asia, and Bantu , containing many of the languages of central and southern Africa.",
  "If enough material in the form of written records from past ages were available, it would be possible to group all the world’s languages into historically related families. In addition, an answer could perhaps be posited to the question of whether all languages are descended from a single original language or whether languages emerged independently among several groups of early peoples (the rival theories of monogenesis and polygenesis, a controversy more confidently disputed in the 19th century than today). In actual fact, written records, when they are available, go back only a fraction of the time in which human language has been developed and used, and over much of the globe written records are nonexistent. In addition, there are few linguistically relevant fossils comparable to the fossils of geological prehistory, though a certain amount of information about the early development of the vocal tract can be deduced from skeletal remains. This means that the history and prehistory of languages will not be able to go back more than to a few thousand years bce and will be much more-restricted in language areas in which few or no written records are available, as in much of Africa and in South America. Many languages will remain not related with certainty to any family.",
  "Nevertheless, the methods of historical linguistics , involving the precise and systematic comparison of word forms and word meanings, have produced remarkable results in establishing language families on the same basis as Indo-European was established, in far less-favourable fields. But any attempt by these means to get back to “the origin of language” or to reconstruct the original language of the human race, if indeed there was one, has so far been beyond the reach of science. However, hypotheses based on large-scale comparative studies using statistical methods continue to be proposed. For example, in 2011 a study of 504 languages by New Zealand biologist Quentin D. Atkinson suggested that the number of phonemes a language contains may be an index of evolutionary diversity. In this sample, the languages of southwest Africa had the largest phoneme inventories, and the number of phonemes declined the farther away from this area humans settled, showing an interesting parallel with the reduction in human genetic diversity seen over increasing distance from Africa already noted by biologists. The findings are suggestive, but they need to be tested against a much larger sample of languages.",
  "The fundamental cause of linguistic change and hence of linguistic diversification is the minute deviations occurring in the transmission of language from one generation to another. But other factors contribute to the historical development of languages and determine the spread of a language family over the world’s surface. Population movements naturally play a large part, and movements of peoples in prehistoric times carried the Indo-European languages from a relatively restricted area into most of Europe and into northern India, Persia, and Armenia. The spread of the Indo-European languages resulted, in the main, from the imposition of the languages on the earlier populations of the territories occupied. In the historical period, within Indo-European, the same process can be seen at work in the Western Roman Empire . Latin superseded the earlier, largely Celtic languages of the Iberian Peninsula and of Gaul (France) not through population replacement (the number of Roman soldiers and settlers in the empire was never large) but through the abandonment of these languages by the inhabitants over the generations as they found in Latin the language of commerce, civilization, law, literature, and social prestige.",
  "Conquest does not always lead to the supersession of a language. Greek survived centuries of Turkish rule and indeed remained a focus of national feeling, as has happened elsewhere in history. Much depends on the various circumstances and on the mutual attitudes of those involved; what must be kept quite clear is the difference between movements of peoples and the spread of languages.",
  "Languages do not just spread and compete with each other for territorial use. They are in constant contact, and every language bears evidence of this throughout its history. Modern Greek is full of words of Turkish origin, despite efforts made at various times since independence to “purify” the language by official action. The Norman Conquest and a period in which French was the language of the ruling class in England effected great changes on English and contributed a very substantial number of French words to English vocabulary—hence the quantity of near synonymous pairs available today: begin, commence ; end, finish ; kingly, royal ; fight, combat ; and so on.",
  "These historical processes take place without any direct volition on the part of speakers as regards the language itself. Latin was learned as part of personal advancement, not for its own sake. Loans were incorporated almost without their being noticed, along with the concomitant cultural changes and innovations. Deliberate action directly related to a language does occur. The creation of pidgins involves some degree of linguistic consciousness on the part of their first users. More deliberate, however, have been various attempts at preserving the purity of a language, at least for some uses, or at arresting the processes of change. The care bestowed on the preservation of the Sanskrit used in religious ritual in ancient India and efforts to free Modern Greek from much of its Turkish vocabulary have already been noticed. For a period, under Nazi rule, efforts were made to replace some foreign words in the German language by words of native origin, and there have been movements to replace later accretions in English by words derived from Old English forms. In the long run, such attempts never succeed in preventing or reversing change; at best they preserve collaterally supposedly purer forms and styles for certain purposes and in certain contexts.",
  "With the picture painted above of the tendency for languages to fragment first into dialects and then into separate languages, it might be thought that dialects are relatively late in appearance in the history of a language family. This impression is reinforced by the fact that most nonstandard dialects are unrepresented as such in writing, and so comparatively little is known about dialectal differences within most languages as one goes back in time. In this respect the very detailed knowledge of the Ancient Greek dialect situation is quite untypical.",
  "In fact, dialect divisions must have been a feature of linguistic communities as early as there is any knowledge of them. Dialect splitting is fostered by isolation and loss of contact between groups within a speech community, and the sparse populations of earlier days, often nomadic and spread over large areas relative to their numbers, will have encouraged this process. It is simply the case that all but literate dialects have been lost in the past, and an artificial homogeneity is attributed to most ancient languages and to the so-called reconstructed parent languages of families.",
  "Present-day conditions tend toward the amalgamation of dialects and the disappearance of those spoken by relatively few people. Urbanization , mass travel, universal education , broadcasting , ease of communication , and social mobility are among the forces that foster rather large regional and social dialects, with special occupational types of language within them, in place of the small, strictly localized dialects of earlier times. This is one reason for the urgency with which dialect studies are being pursued in many Western industrialized countries, such as England and parts of the United States. If work is not done soon, many dialects may perish unrecorded.",
  "For the same reasons, dialect divisions that earlier would have widened into distinct languages are now unlikely to do so. One may compare the emergence of the separate Romance languages from once unitary Latin with the splitting of South American Spanish and Portuguese into different dialects of those two languages. Those dialectal divisions are not now expected to widen beyond the range of intercomprehensibility. Those same conditions, together with the spread of literacy , are leading to the extinction of languages spoken by relatively small communities. Such is the fate of most of the North American Indian languages , and Irish, Welsh, Scots Gaelic, and Cornish may ultimately survive only as learned second languages, preserved as cultural focuses for their communities. But in situations like that, both past and present, the intervening period of extensive bilingualism and the concomitant use of two languages has its effect on the changes taking place in the dominant language, which is influenced by the phonetic and grammatical composition of the speakers’ former language. The closing decades of the 20th century also saw a new enthusiasm for the preservation of minority languages, illustrated by the formation of the European Bureau for Lesser-Used Languages in 1982 (although it ceased functioning in 2010).",
  "Language families, as conceived in the historical study of languages, should not be confused with the quite separate classifications of languages by reference to their sharing certain predominant features of grammatical structure. Such classifications give rise to what are called typological classes.",
  "In fulfilling the requirements of open-ended creativity imposed on language by human beings, grammatical structure has things in common in all known languages, particularly at the deeper levels of grammar . All known languages have words or wordlike elements combined in accordance with rules into sentences; all known languages distinguish in some way nounlike and verblike sentence components; and all known languages have the means of embedding or subordinating one sentence within another as an included clause (e.g., the sun set and we returned home : When the sun set, we returned home ; Joan was playing tennis and Joan twisted her ankle : Joan, who was playing tennis, twisted her ankle , or while she was playing tennis, Joan twisted her ankle ). Descriptive analyses of all the languages of the world have not yet been prepared, and, of course, there is information about only a minute number of those that are no longer used—namely, those few that were written. But there is enough known to make the assertion of such universal features as have been given with fair confidence. These are often referred to as language universals; their nature and extent is the subject of ongoing discussion and research.",
  "Within these very general guidelines, however, languages exhibit various types of structure. This can most readily be seen by comparing the relations between the forms of words and their syntactic functions in different languages. Such a comparison is the basis of three broad types of language that have been distinguished since the beginning of the 19th century. They are, in fact, more like characteristics than types, in that most languages contain traces of all three, in different proportions.",
  "Classical Chinese made little or no use of word-form variation, such as is found, for example, in Latin, for grammatical purposes. Sentence structure was expressed by word order, word grouping, and the use of specific grammatical words, or particles. Such languages have been called isolating or analytic. Modern Chinese languages are much less analytic than is often believed; probably, Vietnamese is the most fully representative of this type today. Some languages string together, or agglutinate, successive bits, each with a specific grammatical function, into the body of single words. Turkish is a typical agglutinative language: compare Turkish evleri , “houses” (accusative case), in which ev is the root meaning “house,” -ler marks plurality, and -i is the sign for accusative, with Latin domūs , in which -ūs combines the representation of accusative and plural without the possibility of assigning either category separately to one part of the word ending. Latin is in this respect an inflectional, or fusional, language. In a more extreme example, Latin ī “go!” cumulatively represents in one fused form the verb meaning “go,” active voice, imperative mood, second person, and singular number, each a grammatically distinct category.",
  " English , like many other languages, includes features of all three types. In its use of word order alone to distinguish grammatical differences ( the dog chased the cat ; the cat chased the dog ), it resembles Classical Chinese rather than Latin. In a word form such as manliness , in which each bit can be assigned a grammatical function ( man the basic noun, -li- the adjective formative, and -ness the abstract noun formative), it makes use of agglutination , whereas plurals such as men and geese and past tenses such as came and ran fuse distinct grammatical categories into a word form in which only arbitrarily can one allot some sound segments, or letters, to one and some to the other.",
  "Assigning languages to different types in this way involves a delicate procedure of balancing one part of the grammar against another and deciding which type of structure predominates and how well the other types are represented. Languages predominantly of each of the types are found in communities at all levels of civilization and with all types of culture.",
  "In the course of transmission, grammatical structures change, just as do pronunciation and meanings, and in time the cumulative effect may be the transference of a language from one overall type to another, although it remains descended from the earlier language and therefore is just as much part of the same historical family. Latin is very different typologically from French in its grammatical structure, but French is nevertheless the form that Latin took in France in the course of time. In the matter of the grammatical relevance of word order, the absence of case inflections in nouns, and the use of verbal auxiliaries instead of single word tense forms, French is more like English, a distant cousin within the Indo-European family, than it is like Latin, its immediate progenitor (compare French j’ai donné , English I have given , Latin dedī ). The two sorts of language classification, historical and typological, serve different purposes and are differently based. Language families group languages together on the basis of descent—i.e., unbroken transmission from an earlier common parent language. The evidence is, in the main, systematic correspondences among the shapes of words of similar meanings (e.g., Greek patēr , Latin pater , French père , German Vater , English father ). Languages are put into typological classes, with the reservation already mentioned, on the basis of certain overall similarities of structure irrespective of historical relations. Though these two classifications may coincide with some languages, as is the case to a great extent in the Bantu family, they do so only contingently; being based on different data and oriented differently, they do not logically or necessarily imply each other.",
  "In a way, these two systems of classification involve the two most important aspects in which languages must be seen for them to be properly understood: as products of a continuous historical process and also as self-sufficient systems of communication in any one period. Both as a component of cultural history and as a central part of culture itself, language is able to reveal, more than any other human activity and achievement, what is involved in humankind’s distinctive humanity.",
  "A bibliography for language is likely to overlap at least partially with a bibliography for linguistics. This bibliography draws attention to some books that may usefully be consulted without prior specialist knowledge and that develop in further detail the major topics introduced in the article.",
  "Classical accounts include Edward Sapir , Language: An Introduction to the Study of Speech (1921, reissued 2014); Leonard Bloomfield , Language (1933, reprinted 1984); and Otto Jespersen , Language: Its Nature, Development, and Origin (1921, reissued 2007). Noteworthy encyclopaedic treatments are David Crystal , The Cambridge Encyclopedia of Language , 3rd ed. (2010); N.E. Collinge (ed.), An Encyclopaedia of Language (1990); William J. Frawley (ed.), International Encyclopedia of Linguistics , 2nd ed., 4 vol. (2003); Kirsten Malmkjaer (ed.), The Routledge Linguistics Encyclopedia , 3rd ed. (2010); Keith Brown (ed.), Encyclopedia of Language & Linguistics , 2nd ed., 14 vol. (2006); and Frederick J. Newmeyer (ed.), Linguistics: The Cambridge Survey , 4 vol. (1988).",
  "Introductory textbooks from different eras include John Lyons , Language and Linguistics (1981); Victoria Fromkin , Robert Rodman , and Nina Hyams , An Introduction to Language , 10th ed. (2014); and Dwight Bolinger and Donald A. Sears , Aspects of Language , 3rd ed. (1981). Introductions aimed at a popular audience are Steven Pinker , The Language Instinct: How the Mind Creates Language (1995, reissued 2007); John H. McWhorter , The Power of Babel: A Natural History of Language (2001); Christine Kenneally , The First Word: The Search for the Origins of Language (2007); and Laurie Bauer and Peter Trudgill (eds.), Language Myths (1998).",
  "Works on special topics within the field include Peter Trudgill , Sociolinguistics: An Introduction , 4th ed. (2000); John Edwards , Language, Society, and Identity (1985); Jean Aitchison , Language Change: Progress or Decay? , 3rd ed. (2001); David Crystal , Language Death (2000, reissued 2014); Paul Fletcher and Michael Garman (eds.), Language Acquisition: Studies in First Language Development , 2nd ed. (1986, reissued 1997); Ronald Wardhaugh , Investigating Language: Central Problems in Linguistics (1993); Rebecca S. Wheeler (ed.), The Workings of Language: From Prescriptions to Perspectives (1999); W. Tecumseh Fitch , The Evolution of Language (2010); and Roy Harris (ed.), The Origin of Language (1996).",
  "The world’s languages are reviewed in Bernard Comrie (ed.), The World’s Major Languages , 2nd ed. (2009); and George L. Campbell and Gareth King , Compendium of the World’s Languages , 2 vol., 3rd ed. (2013)."
]