[
  " concept formation , process by which a person learns to sort specific experiences into general rules or classes. With regard to action, a person picks up a particular stone or drives a specific car. With regard to thought, however, a person appears to deal with classes. For instance, one knows that stones (in general) sink and automobiles (as a class) are powered by engines. In other words, these things are considered in a general sense beyond any particular stone or automobile. Awareness of such classes can help guide behaviour in new situations. Thus two people in a bakery may never have met before, but, if one can be classified as customer and the other as clerk, they tend to behave appropriately. Similarly, many people are able to drive almost any automobile by knowing how to drive a specific automobile.",
  "The term concept formation describes how a person learns to form classes, whereas the term conceptual thinking refers to an individual’s subjective manipulation of those abstract classes. A concept is a rule that may be applied to decide if a particular object falls into a certain class. The concept “citizen of the United States” refers to such a decision rule, meaning any person who was born in U.S. territory or who is a child of a U.S. citizen or who has been legally naturalized. The rule suggests questions to ask in checking the citizenship of any particular individual. As most concepts do, it rests on other concepts; “U.S. citizen” is defined in terms of the concepts “child” and “territory.” Many scientific or mathematical concepts cannot be understood until the terms by which they are defined have been grasped. In this way concept formation builds on itself.",
  "Conceptual classification may be contrasted with another type of classification behaviour called discrimination learning. In discrimination learning, objects are classified on the basis of directly perceived properties such as physical size or shape. The emphasis on concrete physical features in discrimination learning can be contrasted with the more abstract nature of concept formation. When a stimulus is perceived to match several different past experiences, however, the response may be a compromise, because an object need not bear an all-or-none relation to a set of others in discrimination learning; for example, there is no absolute distinction between tall and short people.",
  "While human beings are capable of abstract thought, many of the classifications people make seem to be concrete discriminations. For example, people may use the same term in a discriminative or conceptual way. A child might use the term policeman in discriminating a man who wears a distinctive uniform, while a lawyer may use the term to represent a civil servant charged with enforcing criminal codes. In practice, people seem to think in ways that combine abstractness and concreteness. They also may blend class membership with assignment along a scale—e.g., such concepts as leadership, an abstract quality that people are said to exhibit in varying degrees. The same would apply to vivacity, avarice, and other personality traits.",
  "People seem to develop more-complex sets of classes than do other animals, but this does not necessarily mean that human modes of learning are unique. It may be that all animals have the same basic biochemical machinery for learning but human animals exhibit it in greater variety. Yet, it seems no more appropriate to account for human concept formation in terms of discrimination learning alone than it does to reduce the functions of a piston engine to chemical reactions.",
  "Because careful observation of informal, everyday behaviour is difficult, most evidence about human concept formation comes from laboratory subjects. For example, each subject is asked to learn a rule for classifying geometric figures.",
  "The experimenter may concoct the rule that all green objects are called GEK. The subject is shown some of the figures, told which are named GEK, and asked to infer the rule or to apply it to other figures. This is roughly akin to teaching a young child to identify a class of barking animals with the name DOG. In both cases a general rule is derived from specific examples.",
  "The problem of discovering that GEK = GREEN is almost trivial when four GEK and four NOT GEK figures are presented at once, but the problem becomes surprisingly difficult if the figures are presented one at a time and need to be remembered. Furthermore, when two concepts are to be learned together (e.g., JIG = TRIANGLE and GEK = GREEN), memory for each concept tends to be mixed, and it becomes a formidable task to solve either problem. This suggests that short-term memory is important to concept learning and that short-term memory can often serve as a limiting factor in performance. The mastery of more-complex concept learning often depends on allotting enough time for the information to be fixed in memory.",
  "Most such experiments involve very simple rules. They properly concern concept identification (rather than formation) when the learner is asked to recognize rules he already knows. Adult subjects tend to focus on one stimulus attribute after another (e.g., shape or colour) until the answer is found. (This represents problem solving with a minimum of thinking; they simply keep guessing until they are right.) People tend to avoid repeating errors but seem to make surprisingly little use of very recent short-term experience.",
  "Most people try out attributes in an orderly manner, first considering such striking features as size, shape, and colour and only later turning to the more abstract attributes (e.g., number of similar figures, or equilateral versus isosceles triangles). This suggests that there is no sharp distinction between discrimination learning (relatively concrete) and concept formation (more abstract); instead, one progresses from the concrete to the abstract.",
  "Study can shift from concept identification to concept learning by requiring combinations of previously learned rules. A conjunctive concept (in which the rule is based on the joint presence of two or more features; e.g., GEK patterns now are LARGE and GREEN) is fairly easy to learn when the common characteristics stand out. But learning a disjunctive rule (e.g., GEK objects now are either LARGE or GREEN but not both) is quite difficult; there is no invariant, relatively concrete feature on which to rely.",
  "Concept learning in adults may be understood as a two-step process: first the discovery of which attributes are relevant, then the discovery of how they are relevant. In the conjunctive illustration used here, the learner is likely first to notice that size and colour have something to do with the answer and then to determine what it is. This two-step interpretation presupposes that the subject has already learned rules for colour, size, shape, or similar dimensions.",
  "In an example of what is called “intradimensional” shift, initially the subject learns that GEK = GREEN; then, without warning, the experimenter changes the rule to GEK = RED. The same attribute or dimension (colour) is still relevant, but the way in which it is used has been changed. In “extradimensional” shift, the relevant dimension is changed (e.g., from GEK = GREEN to GEK = TRIANGLE), but the classification of some objects does not change (GREEN TRIANGLE is a GEK under both rules). The relative ease with which subjects handle such problems suggests something about how they learn. If they tend to learn simply by associating GEK with specific figures without considering the selected attribute, then they should find extradimensional-shift problems easier, since only some of their associations need be relearned. But if they have learned stepwise in terms of relevant attributes (e.g., to say “What is the colour?…Ah, that colour means it is GEK”), intradimensional shift should be easier, since only the “how” phase of the two-step process need be relearned.",
  "College students tend to find intradimensional-shift problems easier, indicating that they are prone to use the two-step process. On the other hand, suppose a rat initially is rewarded when it runs into the right-hand side of a maze for food, then a change is made by rewarding entries to the left (intradimensional shift) or by rewarding entries to any brightly lighted alley regardless of location (extradimensional shift). The rat will perform best on the extradimensional-shift problem. Among children, performance depends substantially on age. Preschool children are likely to do best with extradimensional shifts (as rats do), but children beyond kindergarten age tend to find the intradimensional shift easiest.",
  "Concepts need not be limited to simple classifications. They also can be interpreted as models or rules that reflect crucial possibilities for change. To take a simple case, an adult is not apt to think that the volume of water changes when it is poured into a container of different shape. Young children may claim that it does. In the adult’s concept, volume is not synonymous with the shape of a container but is based on a model of how fluids behave. Concepts offer a basis for deciding if certain changes will have significant effects.",
  "Through clinical observations, Swiss psychologist Jean Piaget initiated considerable study of how young children learn concepts that help them cope with their physical surroundings. As models for defining feasible change, concepts are at least as important in such contexts as they are for classification. Piaget stressed that infants must first learn to distinguish themselves from the external environment. Next they form understandings of the physical world (for example, identifying objects that fall) that allow further exploration of the world. Later in the preschool period, children grasp the concept of spatial localization—objects that are separated in space. Piaget characterized this period of learning as classifying objects only on the basis of perceptually attractive, concrete physical features (in agreement with laboratory studies of intradimensional and extradimensional shift).",
  "He and others who used his methods reported that preschool children are apt to explain external change in terms of their own needs: a four-year-old is likely to say that a cloud moves “because the sun is in my eyes.” Among children in early primary grades, other interpretations of cause and effect might be expressed by saying a moving cloud “wants to hide the sun.” In later primary grades, volitional and passive movement usually become conceptually distinct. By adolescence, children develop an ability to deal analytically with objects apart from their immediate perceptual characteristics. This marks an understanding of the hierarchies of subclasses within more general classes—for example, a normal child of eleven applies the properties of all living things to the class called birds.",
  "Given proper information, by the age of six many children display significant concept-forming abilities. They ordinarily have considerable linguistic competence, using (though often not being able to explain) such abstract qualifications as present and past tense. Rules of formal logic (such as “new math”) can be taught in the elementary grades. Progressive use of abstract concepts seems to reflect both maturation and learning.",
  "The role of instruction in concept formation remains poorly understood, yet practically all cultural heritage is explicitly taught. Better knowledge of how to instruct and of the role of imitation in transmitting cultural concepts is needed. In addition, some linguists believe that language itself guides how concepts will be formed; if a language has no words for a concept, they assert, it is unlikely that a speaker of that language will think of that concept.",
  "It is generally thought that the potential for learning new abstractions tends to decrease in old age and that in extreme cases (such as senility, severe alcoholism, or brain injury) the deficit is dramatic. Much less is known, however, about changes in conceptual ability during the active period of adult life, in part because much of the evidence is conflicting.",
  "As gifted children age, they tend to retain superior ability in grasping new abstractions. Among more typical people, however, little correlation is found between conceptual ability evaluated in the early teens and the same ability measured 10 or more years later.",
  "In such abstract pursuits as pure mathematics or theoretical physics, there is a tendency for creative scientists and writers to be most productive in their late 20s and early 30s, but there are many exceptions. As people get older, they acquire a wealth of concepts that they can apply to a problem, so the net change in ability is hard to predict. Deterioration in learning new concepts is likely to be more rapid past age 60, its severity varying markedly from person to person. Deterioration may be associated with illness or injury rather than with mere aging. In general, fluid intelligence (the ability to manipulate abstract concepts) decreases with age while crystallized intelligence (the use of the accumulated concepts) increases with age.",
  "Rats learn to enter lighted or unlighted alleys to get food, and goldfish can be taught to swim toward or away from an object. In such discrimination learning, the animal is said to associate a physical property of the stimulus with its response, and with some contingency of reward or punishment. Thus, while a dog can be trained to come when called, it need not mean that he knows his name in the same sense that a man apparently does.",
  "Most animals show classification behaviour that seems indicative of discrimination learning. A crow will respond to the danger call of a bird of another species—but only if that call resembles the crow’s. Chimpanzees, however, which have been observed using sticks as primitive tools, behave as if they have a concept of things that extend reach. Based on considerable evidence of this sort, many are reluctant to say that animals are incapable of abstract thinking.",
  "Most studies aimed at evidence of concept formation among laboratory animals have involved primates, although there are reports of abstract behaviour among other animals such as dogs, dolphins, pigs, and parrots. Monkeys have been taught to solve the oddity problem: presented with two objects of one kind and one of another, they can be trained to select the discrepant one. This behaviour persists even for sets of objects that have never been presented to them before. The animals behave as if they grasp the general concept of similarity, which is an abstraction rather than a simple discrimination. Animals also have been tested on the ability to learn languages . With great effort, chimpanzees have been taught to “speak” (through physical gestures) and to use correctly a very few words. A much more successful attempt was made by Beatrice and Allan Gardner to teach a chimpanzee, Washoe, the sign language used by deaf people—the gestures of this language apparently being more appropriate to the anatomic structure of chimpanzees. The chimpanzee learned to use the signs for hat, dog, food, yes, me (self), sorry, funny, go, come, and many others. Washoe’s foster son learned 68 words simply through observation, while Washoe’s companions learned to use sign language to communicate transactions and reassurance. They also taught others the concepts they had learned.",
  "Computers can be programmed to process information and to develop classification rules (e.g., they can play chess and make decisions about business or military problems; see  artificial intelligence ). Essentially, such devices are programmed to mimic the processes of human problem solving. In this sense, machines have formed concepts; but their functions remain relatively impoverished. Efficient linguistic behaviour has proved particularly difficult to produce in a machine. While many believe that human thinking can be explained mechanistically in physiological terms, scientists themselves have yet to develop concepts adequate for producing machines that can approach the full range of human talent. Machine translation of language, however, has shown some success.",
  "    Renate Bartsch , Dynamic Conceptual Semantics (1998), provides an investigation into concept formation. Jerome S. Bruner , Jacqueline J. Goodnow , and George A. Austin , A Study of Thinking (1956, reprinted 1986), is a classic description of some experiments in the field. Works covering specialized topics include Steven Pinker , Language Learnability and Language Development (1984, reissued 1996), Words and Rules: The Ingredients of Language (1999), and The Blank Slate (2002); and Henry M. Wellman , The Child’s Theory of Mind (1990, reissued 1992)."
]