[
  "  soap and detergent , substances that, when dissolved in water, possess the ability to remove dirt from surfaces such as the human skin, textiles, and other solids. The seemingly simple process of cleaning a soiled surface is, in fact, complex and consists of the following physical-chemical steps:",
  "If detached oil droplets and dirt particles did not become suspended in the detergent solution in a stable and highly dispersed condition, they would be inclined to flocculate, or coalesce into aggregates large enough to be redeposited on the cleansed surface. In the washing of fabrics and similar materials, small oil droplets or fine, deflocculated dirt particles are more easily carried through interstices in the material than are relatively large ones. The action of the detergent in maintaining the dirt in a highly dispersed condition is therefore important in preventing retention of detached dirt by the fabric.",
  "In order to perform as detergents (surface-active agents), soaps and detergents must have certain chemical structures: their molecules must contain a hydrophobic (water-insoluble) part, such as a fatty acid or a rather long chain carbon group, such as fatty alcohols or alkylbenzene. The molecule must also contain a hydrophilic (water-soluble) group, such as ―COONa, or a sulfo group, such as ―OSO 3 Na or ―SO 3 Na (such as in fatty alcohol sulfate or alkylbenzene sulfonate), or a long ethylene oxide chain in nonionic synthetic detergents. This hydrophilic part makes the molecule soluble in water. In general, the hydrophobic part of the molecule attaches itself to the solid or fibre and onto the soil, and the hydrophilic part attaches itself to the water.",
  "Four groups of surface-active agents are distinguished:",
  "The first detergent (or surface-active agent) was soap. In a strictly chemical sense, any compound formed by the reaction of a water-insoluble fatty acid with an organic base or an alkali metal may be called a soap. Practically, however, the soap industry is concerned mainly with those water-soluble soaps that result from the interaction between fatty acids and alkali metals. In certain cases, however, the salts of fatty acids with ammonia or with triethanolamine are also used, as in shaving preparations.",
  "Soap has been known for at least 2,300 years. According to Pliny the Elder , the Phoenicians prepared it from goat’s tallow and wood ashes in 600 bce and sometimes used it as an article of barter with the Gauls. Soap was widely known in the Roman Empire ; whether the Romans learned its use and manufacture from ancient Mediterranean peoples or from the Celts, inhabitants of Britannia , is not known. The Celts, who produced their soap from animal fats and plant ashes, named the product saipo, from which the word soap is derived. The importance of soap for washing and cleaning was apparently not recognized until the 2nd century ce ; the Greek physician Galen mentions it as a medicament and as a means of cleansing the body. Previously soap had been used as medicine. The writings attributed to the 8th-century Arab savant Jābir ibn Hayyān (Geber) repeatedly mention soap as a cleansing agent.",
  "In Europe, soap production in the Middle Ages centred first at Marseille , later at Genoa , and then at Venice . Although some soap manufacture developed in Germany, the substance was so little used in central Europe that a box of soap presented to the Duchess of Juelich in 1549 caused a sensation. As late as 1672, when a German, A. Leo, sent Lady von Schleinitz a parcel containing soap from Italy, he accompanied it with a detailed description of how to use the mysterious product.",
  "The first English soapmakers appeared at the end of the 12th century in Bristol . In the 13th and 14th centuries, a small community of them grew up in the neighbourhood of Cheapside in London . In those days soapmakers had to pay a duty on all the soap they produced. After the Napoleonic Wars this tax rose as high as three pence per pound; soap-boiling pans were fitted with lids that could be locked every night by the tax collector in order to prevent production under cover of darkness. Not until 1853 was this high tax finally abolished, at a sacrifice to the state of over £1,000,000. Soap came into such common use in the 19th century that Justus von Liebig , a German chemist, declared that the quantity of soap consumed by a nation was an accurate measure of its wealth and civilization.",
  "Early soapmakers probably used ashes and animal fats. Simple wood or plant ashes containing potassium carbonate were dispersed in water, and fat was added to the solution. This mixture was then boiled; ashes were added again and again as the water evaporated. During this process a slow chemical splitting of the neutral fat took place; the fatty acids could then react with the alkali carbonates of the plant ash to form soap (this reaction is called saponification).",
  "  Animal fats containing a percentage of free fatty acids were used by the Celts. The presence of free fatty acids certainly helped to get the process started. This method probably prevailed until the end of the Middle Ages , when slaked lime came to be used to causticize the alkali carbonate. Through this process, chemically neutral fats could be saponified easily with the caustic lye. The production of soap from a handicraft to an industry was helped by the introduction of the Leblanc process for the production of soda ash from brine (about 1790) and by the work of a French chemist, Michel Eugène Chevreul, who in 1823 showed that the process of saponification is the chemical process of splitting fat into the alkali salt of fatty acids (that is, soap) and glycerin.",
  "The method of producing soap by boiling with open steam, introduced at the end of the 19th century, was another step toward industrialization.",
  "If turkey-red oil—i.e., sulfated castor oil, still used in textile and leather industries today—is considered the first synthetic detergent, the industry began in the midst of the 19th century. The first synthetic detergents for general use, however, were produced by the Germans in the World War I period so that available fats could be utilized for other purposes. These detergents were chemicals of the short-chain alkylnaphthalene-sulfonate type, made by coupling propyl or butyl alcohols with naphthalene and subsequent sulfonation, and appeared under the name of Nekal. These products were only fair detergents but good wetting agents and are still being produced in large quantities for use in the textile industry.",
  "In the late 1920s and early ’30s, molecules consisting of long-chain alcohols were sulfonated and sold as the neutralized sodium salts without any further additions except for sodium sulfate as an extender. In the early ’30s molecules consisting of long-chain alkylaryl sulfonates (with benzene as the aromatic nucleus and the alkyl portion made from a kerosene fraction) appeared on the market in the United States. Again, these were available as the sodium salts extended with sodium sulfates. Both the alcohol sulfates and the alkylaryl sulfonates were sold as cleaning materials but did not make any appreciable impression on the total market. By the end of World War II the alkylaryl sulfonates had almost completely swamped the sales of alcohol sulfates for the limited uses to which they were applied as general cleaning materials, but the alcohol sulfates were making big inroads into the shampoo and fine detergent fields.",
  "Historically, synthetic detergents began as mainly a substitute for fat-based soap but developed into a sophisticated product, superior in many respects to soap.",
  "Soap forms a scum or precipitate in hard water, leaving a ring around the bathtub, a whitish residue on glassware, and a sticky curd in the rinse water of the laundry tub. Not so easily perceived is the relation of this hard-water scum to a dull, lustreless condition of hair after shampooing, yellow spots on laundry after ironing, and a heavy usage of soap in the household. All these effects point to a serious defect of soaps, namely, their reaction with the calcium and other metal salts present in hard water to give a precipitate that constitutes the hardness of the water. Soaps also react with traces of acidic compounds to form a precipitate. On the other hand, the synthetic detergents generally are unaffected or very little affected by metal salts or acids; although they may react chemically with them, the resulting compounds are either soluble or remain dispersed in colloidal form in the solution. Other useful properties of the synthetics, such as solubility in cold water and flexibility in formulation, also contributed to their rapid replacement of soap products.",
  "Hot caustic alkali solution, such as caustic soda (sodium hydroxide), acts on natural fats or oils, such as tallow or vegetable oil, to produce sodium fatty acid salt (soap) and glycerin (or glycerol). This saponification reaction is the basis for all soapmaking. If industrially produced fatty acids are used in place of natural fats or oils, the reaction with caustic soda yields soap and water instead of soap and glycerin.",
  "The major raw materials for soap manufacture are fat and alkali. Other substances, such as optical brighteners, water softeners, and abrasives, are often added to obtain specific characteristics.",
  "Sodium hydroxide is employed as the saponification alkali for most soap now produced. Soap may also be manufactured with potassium hydroxide (caustic potash) as the alkali. Potassium soaps are more soluble in water than sodium soaps; in concentrated form, they are called soft soap. Although soft soaps are declining in importance, potassium soap is still produced in various liquid concentrations for use in combination with sodium soaps in shaving products and in the textile industry.",
  "Certain alkaline materials (builders) are almost universally present in laundry soaps, functioning to increase detergency. The most important are sodium silicate (water glass), sodium carbonate (soda ash), sodium perborate, and various phosphates.",
  "Fatty raw materials for soap manufacture include animal and vegetable oils and fats or fatty acids, as well as by-products of the cellulose and paper industry, such as rosin and tall oil . Four groups of these raw materials can be distinguished according to the properties of the soap products they yield:",
  "Now an integral part of all washing powders, optical brighteners are dyestuffs absorbed by textile fibres from solution but not subsequently removed in rinsing. They convert invisible ultraviolet light into visible light on the blue side of the spectrum, causing the fibre to reflect a greater proportion of visible light and making it appear brighter. Furthermore, since the tone of the extra light reflected is on the blue side of the spectrum, this blue-violet tinge will complement any yellowishness present on the fibre to make it look whiter as well as brighter. The chemical structures of optical brightening agents are complicated; many formulas are trade secrets.",
  "Although the action of optical brighteners resembles old-style laundry blueing in some ways, the two methods must not be confused. In the old method, a blue dye or pigment is adsorbed onto the fibre; this blue tends to absorb yellow light falling on it, reflecting light richer in blue. With blueing, however, the fabric absorbs some of the light falling on it and hence reflects less light than it receives. Thus, the fabric looks whiter, not brighter.",
  "EDTA (ethylenediaminetetraacetic acid) or its sodium salt has the property of combining with certain metal ions to form a molecular complex that locks up or chelates the calcium ion so that it no longer exhibits ionic properties. In hard water, calcium and magnesium ions are thus inactivated, and the water is effectively softened. EDTA can form similar complexes with other metallic ions.",
  "Water-insoluble minerals such as talc, diatomaceous earth, silica, marble, volcanic ash (pumice), chalk, feldspar, quartz, and sand are often powdered and added to soap or synthetic detergent formulations. Abrasives of an organic nature, such as sawdust, are also used.",
  "Several techniques are employed in making soap, most of which involve heat. Processes can be either continuous or on a batch basis.",
  "Still widely used by small and medium-sized producers is the classical boiling process. Its object is to produce neat soap in purified condition, free from glycerin. Neat soap is the starting material for making bars, flakes, beads, and powders. The boiling process is conducted in a series of steps called changes; these occur in the kettle (called the pan in Great Britain).",
  "In the first step, melted fats are placed in the kettle, and caustic soda solution is added gradually. The whole mass is then boiled with open steam from perforated coils within the kettle. The saponification reaction now takes place; the mass gradually thickens or emulsifies as the caustic soda reacts with the fat to produce both soap and glycerin.",
  "To separate the glycerin from the soap, the pasty boiling mass is treated with brine. Contents of the kettle salt out, or separate, into an upper layer that is a curdy mass of impure soap and a lower layer that consists of an aqueous salt solution with the glycerin dissolved in it. Thus the basis of glycerin removal is the solubility of glycerin and the insolubility of soap in salt solution. The slightly alkaline salt solution, termed spent lye, is extracted from the bottom of the pan or kettle and subsequently treated for glycerin recovery.",
  "The grainy, curdy mass of soap remaining in the kettle after the spent lye has been removed contains any unsaponified fat (usually traces that escaped reaction during saponification) plus dirt and colouring matter present in the original oils. During the next step, called strong change, strong caustic solution is added to the mass, which is then boiled to remove the last of the free fat.",
  "The final stage, called pitching and settling, transforms the mass into neat soap and removes dirt and colouring matter. After the strong change, the soap may be given one or more saltwater washes to remove free alkali, or it may be pitched directly. Pitching involves boiling the mass with added water until a concentration is attained that causes the kettle contents to separate into two layers. The upper layer is neat soap, sometimes called kettle soap, of almost constant composition for a given fat (about 70 percent soap, 30 percent water); the lower, called nigre, varies in soap content from 15 percent to 40 percent. Since colouring matter, dirt, salt, alkali, and metal soaps are soluble in nigre but relatively insoluble in neat soap, and since most of the impurities are dense and tend to settle, the nigre layer takes these from the neat soap.",
  "The boiling process is very time consuming; settling takes days. To produce soap in quantity, huge kettles must be used. For this reason, continuous soapmaking has largely replaced the old boiling process. Most continuous processes today employ fatty acids in the saponification reaction in preference to natural fats and oils. These acids do not contain impurities and, as explained at the beginning of this section, produce water instead of glycerin when they react with alkali. Hence, it is not necessary to remove impurities or glycerin from soap produced with fatty acids. Furthermore, control of the entire process is easier and more precise. The fatty acids are proportionally fed into the saponification system either by flowmeter or by metering pump; final adjustment of the mixture is usually made by use of a pH meter (to test acidity and alkalinity) and conductivity-measuring instruments.",
  "The continuous hydrolyzer process begins with natural fat that is split into fatty acids and glycerin by means of water at high temperature and pressure in the presence of a catalyst, zinc soap. The splitting reaction is carried on continuously, usually in a vertical column 50 feet (15 metres) or more in height. Molten fat and water are introduced continuously into opposite ends of the column; fatty acids and glycerin are simultaneously withdrawn. Next, the fatty acids are distilled under vacuum to effect purification. They are then neutralized with an alkali solution such as sodium hydroxide (caustic soda) to yield neat soap. In bath-soap manufacture, a surplus of free fatty acid, often in combination with such superfatting agents as olive oil or coconut oil, is left or added at the final stage so that there is no danger of too much alkali in the final product. The entire hydrolyzer process, from natural fat to final marketable product, requires a few hours, as compared with the 4 to 11 days necessary for the old boiling process. The by-product glycerin is purified and concentrated as the fatty acid is being produced.",
  "In the cold method, a fat and oil mixture, often containing a high percentage of coconut or palm-kernel oil, is mixed with the alkali solution. Slightly less alkali is used than theoretically required in order to leave a small amount of unsaponified fat or oil as a superfatting agent in the finished soap. The mass is mixed and agitated in an open pan until it begins to thicken. Then it is poured into frames and left there to saponify and solidify.",
  "In the semiboiled method, the fat is placed in the kettle and alkali solution is added while the mixture is stirred and heated but not boiled. The mass saponifies in the kettle and is poured from there into frames, where it solidifies. Because these methods are technically simple and because they require very little investment for machinery, they are ideal for small factories.",
  "Finishing operations transform the hot mass coming from the boiling pan or from continuous production equipment into the end product desired. For laundry soap, the soap mass is cooled in frames or cooling presses, cut to size, and stamped. If soap flakes, usually transparent and very thin, are to be the final product, the soap mass is extruded into ribbons, dried, and cut to size. For bath or hand soap, the mass is treated with perfumes, colours, or superfatting agents, is vacuum dried, then is cooled and solidified. The dried solidified soap is homogenized (often by milling or crushing) in stages to produce various degrees of fineness. Air can be introduced under pressure into the warm soap mass as it leaves the vacuum drier to produce a floating soap. Medicated soaps are usually bath soaps with special additives—chlorinated phenol, xylenol derivatives, and similar compounds—added to give a deodorant and disinfectant effect. As mentioned above, shaving creams are based on potassium and sodium soap combinations.",
  "Among synthetic detergents, commonly referred to as syndets, anionic-active types are the most important. The molecule of an anionic-active synthetic detergent is a long carbon chain to which a sulfo group (―SO 3 ) is attached, forming the negatively charged (anionic) part. This carbon chain must be so structured that a sulfo group can be attached easily by industrial processes (sulfonation), which may employ sulfuric acid, oleum (fuming sulfuric acid), gaseous sulfur trioxide, or chlorosulfonic acid.",
  "Fatty alcohols are important raw materials for anionic synthetic detergents. Development of commercially feasible methods in the 1930s for obtaining these provided a great impetus to synthetic-detergent production. The first fatty alcohols used in production of synthetic detergents were derived from body oil of the sperm or bottlenose whale (sperm oil). Efforts soon followed to derive these materials from the less expensive triglycerides (coconut and palm-kernel oils and tallow). The first such process, the Bouveault-Blanc method of 1903, long used in laboratories, employed metallic sodium; it became commercially feasible in the 1950s when sodium prices fell to acceptable levels. When the chemical processing industry developed high-pressure hydrogenation and oil-hardening processes for natural oils, detergent manufacturers began to adopt these methods for reduction of coconut oil, palm-kernel oil, and other oils into fatty alcohols. Synthetic fatty alcohols have been produced from ethylene; the process, known as the Alfol process, employs diethylaluminum hydride.",
  "Soon after World War II, another raw material, alkylbenzene, became available in huge quantities. Today it is the most important raw material for synthetic detergent production; about 50 percent of all synthetic detergents produced in the United States and western Europe are based on it. The alkyl molecular group has in the past usually been C 1  2 H 2  4 (tetrapropylene) obtained from the petrochemical gas propylene. This molecular group is attached to benzene by a reaction called alkylation, with various catalysts, to form the alkylbenzene. By sulfonation, alkylbenzene sulfonate is produced; marketed in powder and liquid form, it has excellent detergent and cleaning properties and produces high foam.",
  "An undesirable effect of the alkylbenzene sulfonates, in contrast to the soap and fatty-alcohol-based synthetic detergents, has been that the large quantity of foam they produce is difficult to get rid of. This foam remains on the surface of wastewater as it passes from towns through drains to sewers and sewage systems, then to rivers, and finally to the sea. It has caused difficulties with river navigation; and, because the foam retards biological degradation of organic material in sewage, it caused problems in sewage-water regeneration systems. In countries where sewage water is used for irrigation, the foam was also a problem. Intensive research in the 1960s led to changes in the alkylbenzene sulfonate molecules. The tetrapropylene, which has a branched structure, was replaced by an alkyl group consisting of a straight carbon chain which is more easily broken down by bacteria.",
  "The organic compounds (fatty alcohols or alkylbenzene) are transformed into anionic surface-active detergents by the process called sulfonation. Sulfation is the chemically exact term when a fatty alcohol is used and sulfonation when alkylbenzene is used. The difference between them is that the detergent produced from a fatty alcohol has a sulfate molecular group (―OSO 3 Na) attached and the detergent produced from an alkylbenzene has a sulfonate group (―SO 3 Na) attached directly to the benzene ring. Both products are similarly hydrophilic (attracted to water).",
  "Recent sulfonation methods have revolutionized the industry; gaseous sulfur trioxide is now widely used to attach the sulfonate or sulfate group. The sulfur trioxide may be obtained either by vaporizing sulfuric acid anhydride (liquid stabilized SO 3 ) or by burning sulfur and thus converting it to sulfur trioxide.",
  "The basic chemical reaction for a fatty alcohol is    R in both reactions represents a hydrocarbon radical.",
  "  Following this, caustic soda solution is used to neutralize the acidic products of the reaction. Research on the part of the petrochemical industry has evolved new anionic synthetic detergents, such as directly sulfonated paraffinic compounds—alpha olefins, for example. Paraffins have been transformed directly into sulfonates by treatment with sulfur dioxide and air using a catalyst of radioactive cobalt.",
  "The most important nonionic detergents are obtained by condensing compounds having a hydrophobic molecular group, usually a hydroxyl (OH) group, with ethylene oxide or propylene oxide. The most usual compounds are either alkylphenol or a long-chain alcohol having a hydroxyl group at the end of the molecule. During the condensation reaction, the ethylene oxide molecules form a chain which links to the hydroxyl group. The length of this chain and the structure of the alkylphenol or alcohol determine the properties of the detergent.",
  "The reaction may take place continuously or in batches. It is strongly exothermic (heat producing), and both ethylene and propylene oxide are toxic and dangerously explosive. They are liquid only when under pressure. Hence, synthesis of these detergents requires specialized, explosion-proof equipment and careful, skilled supervision and control.",
  "Other nonionic detergents are condensed from fatty acids and organic amines. They are important as foam stabilizers in liquid detergent preparations and shampoos.",
  "Some nonionic synthetic detergents may cause problems with unwanted foam in wastewater systems; the problem is not as serious as with anionic synthetic detergents, however.",
  "Cationic detergents contain a long-chain cation that is responsible for their surface-active properties. Marketed in powder form, as paste, or in aqueous solution, they possess important wetting, foaming, and emulsifying properties but are not good detergents. Most applications are in areas in which anionic detergents cannot be used. Cationic-active agents are used as emulsifying agents for asphalt in the surfacing of roads; these emulsions are expected to “break” soon after being applied and to deposit an adhering coat of asphalt on the surface of the stone aggregate. These agents absorb strongly on minerals, particularly on silicates, and therefore make a strong bond between the asphalt and the aggregate. Cationic detergents also possess excellent germicidal properties and are utilized in surgery in dilute form.",
  "Ampholytic detergents are used for special purposes in shampoos, cosmetics, and in the electroplating industry. They are not consumed in large quantities at present.",
  "The largest quantities of synthetic detergents are consumed in the household in the form of spray-dried powders. They are produced from an aqueous slurry, which is prepared continuously or in batches and which contains all the builder components. Builders, consisting of certain alkaline materials, are almost universally present in laundry soaps. These materials give increased detergent action. The most important are sodium silicate (water glass), sodium carbonate (soda ash), and various phosphates; the latter have contributed to the problem of wastewater pollution by contributing nutrients that sustain undesirable algae and bacteria growth, and much work has been done to find acceptable builders to replace, at least partially, phosphates, the use of which was banned in most Western countries. The slurry is atomized in heat to remove practically all the water. The powder thus obtained consists of hollow particles, called beads, that dissolve quickly in water and are practically dust free. Another portion of the syndets is transformed into liquid detergent products and used primarily for hand dishwashing. Although syndet pastes are seldom produced, solid products, manufactured in the same way as bath or laundry soap, have been sold in increasingly greater quantity. Sodium perborate is sometimes added to the spray-dried beads to increase cleaning power by oxidation. Enzymes may be added as well. Many modern washing powders combine synthetic detergents, anionic and nonionic, with soap to give maximum efficiency and controlled foam for use in household washing machines.",
  "Encyclopaedic coverage of every aspect of the chemical industry is provided by Herman F. Mark  et al. (eds.), Encyclopedia of Chemical Technology, 3rd ed., 31 vol. (1978–84), formerly known as Kirk-Othmer Encyclopedia of Chemical Technology, with a 4th edition begun in 1991; Ullmann’s Encyclopedia of Industrial Chemistry, 5th, completely rev. ed., edited by Wolfgang Gerhartz  et al. (1985– ); and Thorpe’s Dictionary of Applied Chemistry, 4th ed., 12 vol. (1937–56).",
  "Soaps and detergents are covered in detail in J. Davidsohn ( Isser Davidsohn ) et al.,  Soap Manufacture, vol. 1 (1953); A.M. Schwartz , J.W. Perry , and J. Berch , Surface Active Agents and Detergents, vol. 2 (1958); A. Davidsohn and B.M. Milwidsky , Synthetic Detergents (1967); J.G. Kane , Soaps: Their Chemistry and Technology (1959); W.W. Niven (ed.), Industrial Detergency (1955); J.L. Molliet , B. Collie , and W. Black , Surface Activity: The Physical Chemistry, Technical Applications, and Chemical Constitution of Synthetic Surface-Active Agents, 2nd ed. rev. (1961). Information may also be found in chapters on soaps and detergents in A.E. Bailey , Industrial Oil and Fat Products, 3rd ed. by D. Swern (1964); and in R.N. Shreve , Chemical Process Industries, 3rd ed. (1967)."
]