[
  "  photosynthesis , the process by which green plants and certain other organisms transform light energy into chemical energy . During photosynthesis in green plants, light energy is captured and used to convert water , carbon dioxide , and minerals into oxygen and energy-rich organic compounds.",
  "It would be impossible to overestimate the importance of photosynthesis in the maintenance of life on Earth . If photosynthesis ceased, there would soon be little food or other organic matter on Earth. Most organisms would disappear, and in time Earth’s atmosphere would become nearly devoid of gaseous oxygen. The only organisms able to exist under such conditions would be the chemosynthetic bacteria , which can utilize the chemical energy of certain inorganic compounds and thus are not dependent on the conversion of light energy.",
  "Energy produced by photosynthesis carried out by plants millions of years ago is responsible for the fossil fuels (i.e., coal , oil , and gas ) that power industrial society. In past ages, green plants and small organisms that fed on plants increased faster than they were consumed, and their remains were deposited in Earth’s crust by sedimentation and other geological processes. There, protected from oxidation , these organic remains were slowly converted to fossil fuels. These fuels not only provide much of the energy used in factories, homes, and transportation but also serve as the raw material for plastics and other synthetic products. Unfortunately, modern civilization is using up in a few centuries the excess of photosynthetic production accumulated over millions of years. Consequently, the carbon dioxide that has been removed from the air to make carbohydrates in photosynthesis over millions of years is being returned at an incredibly rapid rate. The carbon dioxide concentration in Earth’s atmosphere is rising the fastest it ever has in Earth’s history, and this phenomenon is expected to have major implications on Earth’s climate .",
  "Requirements for food, materials, and energy in a world where human population is rapidly growing have created a need to increase both the amount of photosynthesis and the efficiency of converting photosynthetic output into products useful to people. One response to those needs—the so-called Green Revolution , begun in the mid-20th century—achieved enormous improvements in agricultural yield through the use of chemical fertilizers , pest and plant- disease control, plant breeding , and mechanized tilling, harvesting, and crop processing. This effort limited severe famines to a few areas of the world despite rapid population growth, but it did not eliminate widespread malnutrition . Moreover, beginning in the early 1990s, the rate at which yields of major crops increased began to decline. This was especially true for rice in Asia. Rising costs associated with sustaining high rates of agricultural production, which required ever-increasing inputs of fertilizers and pesticides and constant development of new plant varieties, also became problematic for farmers in many countries.",
  "A second agricultural revolution, based on plant genetic engineering , was forecast to lead to increases in plant productivity and thereby partially alleviate malnutrition. Since the 1970s, molecular biologists have possessed the means to alter a plant’s genetic material (deoxyribonucleic acid, or DNA ) with the aim of achieving improvements in disease and drought resistance, product yield and quality, frost hardiness, and other desirable properties. However, such traits are inherently complex, and the process of making changes to crop plants through genetic engineering has turned out to be more complicated than anticipated. In the future such genetic engineering may result in improvements in the process of photosynthesis, but by the first decades of the 21st century, it had yet to demonstrate that it could dramatically increase crop yields.",
  "Another intriguing area in the study of photosynthesis has been the discovery that certain animals are able to convert light energy into chemical energy. The emerald green sea slug ( Elysia chlorotica ), for example, acquires genes and chloroplasts from Vaucheria litorea , an alga it consumes, giving it a limited ability to produce chlorophyll. When enough chloroplasts are assimilated, the slug may forgo the ingestion of food. The pea aphid ( Acyrthosiphon pisum ) can harness light to manufacture the energy-rich compound adenosine triphosphate (ATP); this ability has been linked to the aphid’s manufacture of carotenoid pigments.",
  "The study of photosynthesis began in 1771 with observations made by the English clergyman and scientist Joseph Priestley . Priestley had burned a candle in a closed container until the air within the container could no longer support combustion . He then placed a sprig of mint plant in the container and discovered that after several days the mint had produced some substance (later recognized as oxygen) that enabled the confined air to again support combustion. In 1779 the Dutch physician Jan Ingenhousz expanded upon Priestley’s work, showing that the plant had to be exposed to light if the combustible substance (i.e., oxygen) was to be restored. He also demonstrated that this process required the presence of the green tissues of the plant.",
  "In 1782 it was demonstrated that the combustion-supporting gas (oxygen) was formed at the expense of another gas, or “fixed air,” which had been identified the year before as carbon dioxide. Gas-exchange experiments in 1804 showed that the gain in weight of a plant grown in a carefully weighed pot resulted from the uptake of carbon, which came entirely from absorbed carbon dioxide, and water taken up by plant roots; the balance is oxygen, released back to the atmosphere. Almost half a century passed before the concept of chemical energy had developed sufficiently to permit the discovery (in 1845) that light energy from the sun is stored as chemical energy in products formed during photosynthesis.",
  "In chemical terms, photosynthesis is a light-energized oxidation–reduction process . (Oxidation refers to the removal of electrons from a molecule; reduction refers to the gain of electrons by a molecule.) In plant photosynthesis, the energy of light is used to drive the oxidation of water (H 2 O), producing oxygen gas (O 2 ), hydrogen ions (H + ), and electrons. Most of the removed electrons and hydrogen ions ultimately are transferred to carbon dioxide (CO 2 ), which is reduced to organic products. Other electrons and hydrogen ions are used to reduce nitrate and sulfate to amino and sulfhydryl groups in amino acids , which are the building blocks of proteins . In most green cells , carbohydrates—especially starch and the sugar sucrose —are the major direct organic products of photosynthesis. The overall reaction in which carbohydrates—represented by the general formula (CH 2 O)—are formed during plant photosynthesis can be indicated by the following equation:   ",
  "This equation is merely a summary statement, for the process of photosynthesis actually involves numerous reactions catalyzed by enzymes (organic catalysts ). These reactions occur in two stages: the “light” stage, consisting of photochemical (i.e., light-capturing) reactions; and the “dark” stage, comprising chemical reactions controlled by enzymes. During the first stage, the energy of light is absorbed and used to drive a series of electron transfers, resulting in the synthesis of ATP and the electron-donor-reduced nicotine adenine dinucleotide phosphate (NADPH). During the dark stage, the ATP and NADPH formed in the light-capturing reactions are used to reduce carbon dioxide to organic carbon compounds. This assimilation of inorganic carbon into organic compounds is called carbon fixation.",
  "During the 20th century, comparisons between photosynthetic processes in green plants and in certain photosynthetic sulfur bacteria provided important information about the photosynthetic mechanism. Sulfur bacteria use hydrogen sulfide (H 2 S) as a source of hydrogen atoms and produce sulfur instead of oxygen during photosynthesis. The overall reaction is   ",
  "In the 1930s Dutch biologist Cornelis van Niel recognized that the utilization of carbon dioxide to form organic compounds was similar in the two types of photosynthetic organisms. Suggesting that differences existed in the light-dependent stage and in the nature of the compounds used as a source of hydrogen atoms, he proposed that hydrogen was transferred from hydrogen sulfide (in bacteria) or water (in green plants) to an unknown acceptor (called A), which was reduced to H 2 A. During the dark reactions, which are similar in both bacteria and green plants, the reduced acceptor (H 2 A) reacted with carbon dioxide (CO 2 ) to form carbohydrate (CH 2 O) and to oxidize the unknown acceptor to A. This putative reaction can be represented as:   ",
  "Van Niel’s proposal was important because the popular (but incorrect) theory had been that oxygen was removed from carbon dioxide (rather than hydrogen from water, releasing oxygen) and that carbon then combined with water to form carbohydrate (rather than the hydrogen from water combining with CO 2 to form CH 2 O).",
  "By 1940 chemists were using heavy isotopes to follow the reactions of photosynthesis. Water marked with an isotope of oxygen ( 18 O) was used in early experiments. Plants that photosynthesized in the presence of water containing H 2  18 O produced oxygen gas containing 18 O; those that photosynthesized in the presence of normal water produced normal oxygen gas. These results provided definitive support for van Niel’s theory that the oxygen gas produced during photosynthesis is derived from water.",
  "    As has been stated, carbohydrates are the most-important direct organic product of photosynthesis in the majority of green plants. The formation of a simple carbohydrate, glucose , is indicated by a chemical equation,   ",
  "Little free glucose is produced in plants; instead, glucose units are linked to form starch or are joined with fructose , another sugar, to form sucrose ( see  carbohydrate ).",
  "Not only carbohydrates, as was once thought, but also amino acids, proteins, lipids (or fats), pigments , and other organic components of green tissues are synthesized during photosynthesis. Minerals supply the elements (e.g., nitrogen , N; phosphorus , P; sulfur , S) required to form these compounds. Chemical bonds are broken between oxygen (O) and carbon (C), hydrogen (H), nitrogen, and sulfur, and new bonds are formed in products that include gaseous oxygen (O 2 ) and organic compounds. More energy is required to break the bonds between oxygen and other elements (e.g., in water, nitrate, and sulfate) than is released when new bonds form in the products. This difference in bond energy accounts for a large part of the light energy stored as chemical energy in the organic products formed during photosynthesis. Additional energy is stored in making complex molecules from simple ones.",
  "Although life and the quality of the atmosphere today depend on photosynthesis, it is likely that green plants evolved long after the first living cells . When Earth was young, electrical storms and solar radiation probably provided the energy for the synthesis of complex molecules from abundant simpler ones, such as water, ammonia , and methane . The first living cells probably evolved from these complex molecules ( see  life: Production of polymers ). For example, the accidental joining (condensation) of the amino acid glycine and the fatty acid acetate may have formed complex organic molecules known as porphyrins . These molecules, in turn, may have evolved further into coloured molecules called pigments—e.g., chlorophylls of green plants, bacteriochlorophyll of photosynthetic bacteria, hemin (the red pigment of blood), and cytochromes , a group of pigment molecules essential in both photosynthesis and cellular respiration .",
  "Primitive coloured cells then had to evolve mechanisms for using the light energy absorbed by their pigments. At first, the energy may have been used immediately to initiate reactions useful to the cell. As the process for utilization of light energy continued to evolve, however, a larger part of the absorbed light energy probably was stored as chemical energy, to be used to maintain life. Green plants, with their ability to use light energy to convert carbon dioxide and water to carbohydrates and oxygen, are the culmination of this evolutionary process.",
  "The first oxygenic (oxygen-producing) cells probably were the blue-green algae (cyanobacteria), which appeared about two billion to three billion years ago. These microscopic organisms are believed to have greatly increased the oxygen content of the atmosphere, making possible the development of aerobic (oxygen-using) organisms. Cyanophytes are prokaryotic cells ; that is, they contain no distinct membrane -enclosed subcellular particles ( organelles ), such as nuclei and chloroplasts . Green plants, by contrast, are composed of eukaryotic cells , in which the photosynthetic apparatus is contained within membrane-bound chloroplasts. The complete genome sequences of cyanobacteria and higher plants provide evidence that the first photosynthetic eukaryotes were likely the red algae that developed when nonphotosynthetic eukaryotic cells engulfed cyanobacteria. Within the host cells, these cyanobacteria evolved into chloroplasts.",
  "There are a number of photosynthetic bacteria that are not oxygenic (e.g., the sulfur bacteria previously discussed). The evolutionary pathway that led to these bacteria diverged from the one that resulted in oxygenic organisms. In addition to the absence of oxygen production, nonoxygenic photosynthesis differs from oxygenic photosynthesis in two other ways: light of longer wavelengths is absorbed and used by pigments called bacteriochlorophylls, and reduced compounds other than water (such as hydrogen sulfide or organic molecules) provide the electrons needed for the reduction of carbon dioxide.",
  "The rate of photosynthesis is defined in terms of the rate of oxygen production either per unit mass (or area) of green plant tissues or per unit weight of total chlorophyll. The amount of light, the carbon dioxide supply, temperature , water supply, and the availability of minerals are the most important environmental factors that affect the rate of photosynthesis in land plants. The rate of photosynthesis is also determined by the plant species and its physiological state—e.g., its health, its maturity, and whether it is in flower.",
  "As has been mentioned, the complex mechanism of photosynthesis includes a photochemical, or light-harvesting, stage and an enzymatic, or carbon-assimilating, stage that involves chemical reactions. These stages can be distinguished by studying the rates of photosynthesis at various degrees of light saturation (i.e., intensity) and at different temperatures. Over a range of moderate temperatures and at low to medium light intensities (relative to the normal range of the plant species), the rate of photosynthesis increases as the intensity increases and is relatively independent of temperature. As the light intensity increases to higher levels, however, the rate becomes saturated; light “saturation” is achieved at a specific light intensity, dependent on species and growing conditions. In the light-dependent range before saturation, therefore, the rate of photosynthesis is determined by the rates of photochemical steps. At high light intensities, some of the chemical reactions of the dark stage become rate-limiting. In many land plants, a process called photorespiration occurs, and its influence upon photosynthesis increases with rising temperatures. More specifically, photorespiration competes with photosynthesis and limits further increases in the rate of photosynthesis, especially if the supply of water is limited ( see below  Photorespiration ).",
  "Included among the rate-limiting steps of the dark stage of photosynthesis are the chemical reactions by which organic compounds are formed by using carbon dioxide as a carbon source. The rates of these reactions can be increased somewhat by increasing the carbon dioxide concentration. Since the middle of the 19th century, the level of carbon dioxide in the atmosphere has been rising because of the extensive combustion of fossil fuels, cement production, and land-use changes associated with deforestation . The atmospheric level of carbon dioxide climbed from about 0.028 percent in 1860 to 0.032 percent by 1958 (when improved measurements began) and to 0.041 percent by 2020. This increase in carbon dioxide directly increases plant photosynthesis up to a point, but the size of the increase depends on the species and physiological condition of the plant. Furthermore, most scientists maintain that increasing levels of atmospheric carbon dioxide affect climate, increasing global temperatures and changing rainfall patterns. Such changes will also affect photosynthesis rates.",
  "For land plants, water availability can function as a limiting factor in photosynthesis and plant growth. Besides the requirement for a small amount of water in the photosynthetic reaction itself, large amounts of water are transpired from the leaves ; that is, water evaporates from the leaves to the atmosphere via the stomata . Stomata are small openings through the leaf epidermis , or outer skin; they permit the entry of carbon dioxide but inevitably also allow the exit of water vapour. The stomata open and close according to the physiological needs of the leaf. In hot and arid climates the stomata may close to conserve water, but this closure limits the entry of carbon dioxide and hence the rate of photosynthesis. The decreased transpiration means there is less cooling of the leaves and hence leaf temperatures rise. The decreased carbon dioxide concentration inside the leaves and the increased leaf temperatures favour the wasteful process of photorespiration. If the level of carbon dioxide in the atmosphere increases, more carbon dioxide could enter through a smaller opening of the stomata, so more photosynthesis could occur with a given supply of water.",
  "Several minerals are required for healthy plant growth and for maximum rates of photosynthesis. Nitrogen, sulfate, phosphate , iron , magnesium , calcium, and potassium are required in substantial amounts for the synthesis of amino acids, proteins, coenzymes , deoxyribonucleic acid (DNA) and ribonucleic acid (RNA), chlorophyll and other pigments, and other essential plant constituents. Smaller amounts of such elements as manganese , copper , and chloride are required in photosynthesis. Some other trace elements are needed for various nonphotosynthetic functions in plants.",
  "Each plant species is adapted to a range of environmental factors. Within this normal range of conditions, complex regulatory mechanisms in the plant’s cells adjust the activities of enzymes (i.e., organic catalysts). These adjustments maintain a balance in the overall photosynthetic process and control it in accordance with the needs of the whole plant. With a given plant species, for example, doubling the carbon dioxide level might cause a temporary increase of nearly twofold in the rate of photosynthesis; a few hours or days later, however, the rate might fall to the original level because photosynthesis produced more sucrose than the rest of the plant could use. By contrast, another plant species provided with such carbon dioxide enrichment might be able to use more sucrose, because it had more carbon-demanding organs, and would continue to photosynthesize and to grow faster throughout most of its life cycle.",
  "The energy efficiency of photosynthesis is the ratio of the energy stored to the energy of light absorbed. The chemical energy stored is the difference between that contained in gaseous oxygen and organic compound products and the energy of water, carbon dioxide, and other reactants. The amount of energy stored can only be estimated because many products are formed, and these vary with the plant species and environmental conditions. If the equation for glucose formation given earlier is used to approximate the actual storage process, the production of one mole (i.e., 6.02 × 10 23 molecules; abbreviated N ) of oxygen and one-sixth mole of glucose results in the storage of about 117 kilocalories (kcal) of chemical energy. This amount must then be compared with the energy of light absorbed to produce one mole of oxygen in order to calculate the efficiency of photosynthesis.",
  "Light can be described as a wave of particles known as photons ; these are units of energy, or light quanta . The quantity N photons is called an einstein. The energy of light varies inversely with the length of the photon waves; that is, the shorter the wavelength, the greater the energy content. The energy ( e ) of a photon is given by the equation e = h  c /λ, where c is the velocity of light, h is Planck’s constant , and λ is the light wavelength. The energy ( E ) of an einstein is E = N  e = N  h  c /λ = 28,600/λ, when E is in kilocalories and λ is given in nanometres (nm; 1 nm = 10 −9 metres). An einstein of red light with a wavelength of 680 nm has an energy of about 42 kcal. Blue light has a shorter wavelength and therefore more energy than red light. Regardless of whether the light is blue or red, however, the same number of einsteins are required for photosynthesis per mole of oxygen formed. The part of the solar spectrum used by plants has an estimated mean wavelength of 570 nm; therefore, the energy of light used during photosynthesis is approximately 28,600/570, or 50 kcal per einstein.",
  "In order to compute the amount of light energy involved in photosynthesis, one other value is needed: the number of einsteins absorbed per mole of oxygen evolved. This is called the quantum requirement. The minimum quantum requirement for photosynthesis under optimal conditions is about nine. Thus, the energy used is 9 × 50, or 450 kcal per mole of oxygen evolved. Therefore, the estimated maximum energy efficiency of photosynthesis is the energy stored per mole of oxygen evolved, 117 kcal, divided by 450—that is, 117/450, or 26 percent.",
  "The actual percentage of solar energy stored by plants is much less than the maximum energy efficiency of photosynthesis. An agricultural crop in which the biomass (total dry weight) stores as much as 1 percent of total solar energy received on an annual areawide basis is exceptional, although a few cases of higher yields (perhaps as much as 3.5 percent in sugarcane ) have been reported. There are several reasons for this difference between the predicted maximum efficiency of photosynthesis and the actual energy stored in biomass. First, more than half of the incident sunlight is composed of wavelengths too long to be absorbed, and some of the remainder is reflected or lost to the leaves. Consequently, plants can at best absorb only about 34 percent of the incident sunlight. Second, plants must carry out a variety of physiological processes in such nonphotosynthetic tissues as roots and stems; these processes, as well as cellular respiration in all parts of the plant, use up stored energy. Third, rates of photosynthesis in bright sunlight sometimes exceed the needs of the plants, resulting in the formation of excess sugars and starch. When this happens, the regulatory mechanisms of the plant slow down the process of photosynthesis, allowing more absorbed sunlight to go unused. Fourth, in many plants, energy is wasted by the process of photorespiration. Finally, the growing season may last only a few months of the year; sunlight received during other seasons is not used. Furthermore, it should be noted that if only agricultural products (e.g., seeds, fruits, and tubers , rather than total biomass) are considered as the end product of the energy-conversion process of photosynthesis, the efficiency falls even further.",
  "  The process of plant photosynthesis takes place entirely within the chloroplasts . Detailed studies of the role of these organelles date from the work of British biochemist Robert Hill. About 1940 Hill discovered that green particles obtained from broken cells could produce oxygen from water in the presence of light and a chemical compound, such as ferric oxalate, able to serve as an electron acceptor. This process is known as the Hill reaction. During the 1950s Daniel Arnon and other American biochemists prepared plant cell fragments in which not only the Hill reaction but also the synthesis of the energy-storage compound ATP occurred. In addition, the coenzyme NADP was used as the final acceptor of electrons, replacing the nonphysiological electron acceptors used by Hill. His procedures were refined further so that small individual pieces of isolated chloroplast membranes, or lamellae, could perform the Hill reaction. These small pieces of lamellae were then fragmented into pieces so small that they performed only the light reactions of the photosynthetic process. It is now possible also to isolate the entire chloroplast so that it can carry out the complete process of photosynthesis, from light absorption, oxygen formation, and the reduction of carbon dioxide to the formation of glucose and other products.",
  "  The intricate structural organization of the photosynthetic apparatus is essential for the efficient performance of the complex process of photosynthesis. The chloroplast is enclosed in a double outer membrane, and its size approximates a spheroid about 2,500 nm thick and 5,000 nm long. Some single-celled algae have one chloroplast that occupies more than half the cell volume. Leaf cells of higher plants contain many chloroplasts, each approximately the size of the one in some algal cells.",
  "When thin sections of a chloroplast are examined under the electron microscope , several features are apparent. Chief among these are the intricate internal membranes (i.e., the lamellae) and the stroma, a colourless matrix in which the lamellae are embedded. Also visible are starch granules, which appear as dense bodies.",
  "The stroma is basically a solution of enzymes and small molecules. The dark reactions occur in the stroma, the soluble enzymes of which catalyze the conversion of carbon dioxide and minerals to carbohydrates and other organic compounds. The capacity for carbon fixation and reduction is lost if the outer membrane of the chloroplast is broken, allowing the stroma enzymes to leak out.",
  "A single lamella, which contains all the photosynthetic pigments, is approximately 10–15 nm thick. The lamellae exist in more-or-less flat sheets, a few of which extend through much of the length of the chloroplast. Examination of cross sections of lamellae under the electron microscope shows that their edges are joined to form closed hollow disks that are called thylakoids (“saclike”). The chloroplasts of most higher plants have regions, called grana, in which the thylakoids are very tightly stacked. When viewed by electron microscopy at an oblique angle, the grana appear as stacks of disks. When viewed in cross section, it is apparent that some thylakoids extend from one grana through the stroma into other grana. The thin aqueous spaces inside the thylakoids are believed to be connected with each other via these stroma thylakoids. These thylakoid spaces are isolated from the stroma spaces by the relatively impermeable lamellae.",
  "The light reactions occur exclusively in the thylakoids. The complex structural organization of lamellae is required for proper thylakoid function; intact thylakoids are necessary for the formation of ATP. Thylakoids that have been broken down to smaller units can no longer form ATP, even when the conversion of light into chemical energy occurs during electron transport in these units. Such lamellar fragments can carry out the Hill reaction, with the transfer of electrons from water to NADP + .",
  "Lamellae consist of about equal amounts of lipids and proteins . About one-fourth of the lipid portion of the lamellae consists of pigments and coenzymes; the remainder consists of various lipids, including polar compounds such as phospholipids and galactolipids. These polar lipid molecules have “head” groups that attract water (i.e., are hydrophilic) and fatty acid “tails” that are oil soluble and repel water (i.e., are hydrophobic). When polar lipids are placed in an aqueous environment, they can line up with the fatty acid tails side by side. A second layer of phospholipids forms tail-to-tail with the first, establishing a lipid bilayer in which the hydrophilic heads are in contact with the aqueous solution on each side of the bilayer. Sandwiched between the heads are the hydrophobic tails, creating a hydrophobic environment from which water is excluded. This lipid bilayer is an essential feature of all biological membranes ( see  cell: The cell membrane ). The hydrophobic parts of proteins and lipid-soluble cofactors and pigments are dissolved or embedded in the lipid bilayer. Lamellar membranes can function as electrical insulating material and permit a charge, or potential difference, to develop across the membrane. Such a charge can be a source of chemical or electrical energy.",
  "Approximately one-fifth of the lamellar lipids are chlorophyll molecules; one type, chlorophyll a , is more abundant than the second type, chlorophyll b . The chlorophyll molecules are specifically bound to small protein molecules. Most of these chlorophyll-proteins are “light-harvesting” pigments. These absorb light and pass its energy on to special chlorophyll a molecules that are directly involved in the conversion of light energy to chemical energy. When one of these special chlorophyll a molecules is excited by light energy (as described later), it gives up an electron. There are two types of these special chlorophyll a molecules: one, called P 680 , has an absorption spectrum that peaks at 684 nm; the other, called P 700 , shows an absorption peak at 700 nm.",
  "Although chlorophylls are the main light-absorbing molecules in green plants, there are other pigments such as carotenes and carotenoids (which are responsible for the yellow-orange colour of carrots). Carotenes can also absorb light and may supplement chlorophyll as the light-absorbing molecules in some plant cells. The light energy absorbed by carotenes must be passed to chlorophyll before conversion to chemical energy can occur. Carotenoids are part of a cycle that renders excess energy beyond the level of light saturation harmless, effectively serving as “ lightning rods ” in the process.",
  "Many of the lamellar proteins are components of the chlorophyll–protein complexes described above. Other proteins include enzymes and protein-containing coenzymes. Enzymes are required as organic catalysts for specific reactions within the lamellae. Protein coenzymes, also called cofactors , include important electron carrier molecules called cytochromes, which are iron-containing pigments with the pigment portions attached to protein molecules. During electron transfer, an electron is accepted by an iron atom in the pigment portion of a cytochrome molecule, which thus is reduced; then the electron is transferred to the iron atom in the next cytochrome carrier in the electron transfer chain, thus oxidizing the first cytochrome and reducing the next one in the chain.",
  "In addition to the metal atoms found in the pigment portions of cytochrome molecules, metal atoms also are found in other protein molecules of the lamellae. In proteins with a total molecular weight of 900,000 (based on the weight of hydrogen as one), there are 2 atoms of manganese, 10 atoms of iron, and 6 atoms of copper. These metal atoms are required for the catalytic activity of some of the enzymes important in photosynthesis. The manganese atoms are involved in water-splitting and oxygen formation. Both copper- and iron-containing proteins function in electron transport between water and the final electron-acceptor molecule of the light stage of photosynthesis, an iron-containing protein called ferredoxin. Ferredoxin is a soluble component in the chloroplasts. In its reduced form, it gives electrons directly to the systems that reduce nitrate and sulfate and via NADPH to the system that reduces carbon dioxide. A copper-containing protein called plastocyanin (PC) carries electrons at one point in the electron transport chain. PC molecules are water soluble and can move through the inner space of the thylakoids, carrying electrons from one place to another.",
  "Small molecules called plastoquinones are found in substantial numbers in the lamellae. Like the cytochromes, quinones have important roles in carrying electrons between the components of the light reactions. Since they are lipid soluble, they can diffuse through the membrane. They can carry one or two electrons, and, in their reduced form (with added electrons), they carry hydrogen atoms that can be released as hydrogen ions when the added electrons are passed on, for example, to a cytochrome.",
  " 2  The light energy absorbed by a chlorophyll molecule excites some electrons within the structure of the molecule to higher energy levels, or excited states. Light of shorter wavelength (such as blue) has more energy than light of longer wavelength (such as red), so absorption of blue light creates an excited state of higher energy. A molecule raised to this higher energy state quickly gives up the “extra” energy as heat and falls to its lowest excited state. This lowest excited state is similar to that of a molecule that has just absorbed the longest wavelength light capable of exciting it. In the case of chlorophyll a , this lowest excited state corresponds to that of a molecule that has absorbed red light of about 680 nm.",
  "The return of a chlorophyll a molecule from its lowest excited state to its original low-energy state (ground state) requires the release of the extra energy of the excited state. This can occur in one of several ways. In photosynthesis, most of this energy is conserved as chemical energy by the transfer of an electron from a special chlorophyll a molecule (P 680 or P 700 ) to an electron acceptor. When this electron transfer is blocked by inhibitors, such as the herbicide dichlorophenylmethylurea (DCMU), or by low temperature, the energy can be released as red light. Such reemission of light is called fluorescence . The examination of fluorescence from photosynthetic material in which electron transfer has been blocked has proved to be a valuable tool for scientists studying the light reactions.",
  "  The general features of a widely accepted mechanism for photoelectron transfer, in which two light reactions (light reaction I and light reaction II) occur during the transfer of electrons from water to carbon dioxide, were proposed by Robert Hill and Fay Bendall in 1960. This mechanism is based on the relative potential (in volts) of various cofactors of the electron-transfer chain to be oxidized or reduced. Molecules that in their oxidized form have the strongest affinity for electrons (i.e., are strong oxidizing agents) have a low relative potential. In contrast, molecules that in their oxidized form are difficult to reduce have a high relative potential once they have accepted electrons. The molecules with a low relative potential are considered to be strong oxidizing agents, and those with a high relative potential are considered to be strong reducing agents.",
  "In diagrams that describe the light reaction stage of photosynthesis, the actual photochemical steps are typically represented by two vertical arrows. These arrows signify that the special pigments P 680 and P 700 receive light energy from the light-harvesting chlorophyll-protein molecules and are raised in energy from their ground state to excited states. In their excited state, these pigments are extremely strong reducing agents that quickly transfer electrons to the first acceptor. These first acceptors also are strong reducing agents and rapidly pass electrons to more stable carriers. In light reaction II, the first acceptor may be pheophytin, which is a molecule similar to chlorophyll that also has a strong reducing potential and quickly transfers electrons to the next acceptor. Special quinones are next in the series. These molecules are similar to plastoquinone; they receive electrons from pheophytin and pass them to the intermediate electron carriers, which include the plastoquinone pool and the cytochromes b and f associated in a complex with an iron-sulfur protein.",
  "In light reaction I, electrons are passed on to iron-sulfur proteins in the lamellar membrane, after which the electrons flow to ferredoxin, a small water-soluble iron-sulfur protein. When NADP + and a suitable enzyme are present, two ferredoxin molecules, carrying one electron each, transfer two electrons to NADP + , which picks up a proton (i.e., a hydrogen ion) and becomes NADPH.",
  "Each time a P 680 or P 700 molecule gives up an electron, it returns to its ground (unexcited) state, but with a positive charge due to the loss of the electron. These positively charged ions are extremely strong oxidizing agents that remove an electron from a suitable donor. The P 680  + of light reaction II is capable of taking electrons from water in the presence of appropriate catalysts. There is good evidence that two or more manganese atoms complexed with protein are involved in this catalysis, taking four electrons from two water molecules (with release of four hydrogen ions). The manganese-protein complex gives up these electrons one at a time via an unidentified carrier to P 680  + , reducing it to P 680 . When manganese is selectively removed by chemical treatment, the thylakoids lose the capacity to oxidize water, but all other parts of the electron pathway remain intact.",
  "In light reaction I, P 700  + recovers electrons from plastocyanin, which in turn receives them from intermediate carriers, including the plastoquinone pool and cytochrome b and cytochrome f molecules. The pool of intermediate carriers may receive electrons from water via light reaction II and the quinones. Transfer of electrons from water to ferredoxin via the two light reactions and intermediate carriers is called noncyclic electron flow. Alternatively, electrons may be transferred only by light reaction I, in which case they are recycled from ferredoxin back to the intermediate carriers. This process is called cyclic electron flow.",
  "Many lines of evidence support the concept of electron flow via two light reactions. An early study by American biochemist Robert Emerson employed the algae  Chlorella  , which was illuminated with red light alone, with blue light alone, and with red and blue light at the same time. Oxygen evolution was measured in each case. It was substantial with blue light alone but not with red light alone. With both red and blue light together, the amount of oxygen evolved far exceeded the sum of that seen with blue and red light alone. These experimental data pointed to the existence of two types of light reactions that, when operating in tandem, would yield the highest rate of oxygen evolution. It is now known that light reaction I can use light of a slightly longer wavelength than red (λ = 680 nm), while light reaction II requires light with a wavelength of 680 nm or shorter.",
  "Since those early studies, the two light reactions have been separated in many ways, including separation of the membrane particles in which each reaction occurs. As discussed previously, lamellae can be disrupted mechanically into fragments that absorb light energy and break the bonds of water molecules (i.e., oxidize water) to produce oxygen, hydrogen ions, and electrons. These electrons can be transferred to ferredoxin, the final electron acceptor of the light stage. No transfer of electrons from water to ferredoxin occurs if the herbicide DCMU is present. The subsequent addition of certain reduced dyes (i.e., electron donors) restores the light reduction of NADP + but without oxygen production, suggesting that light reaction I but not light reaction II is functioning. It is now known that DCMU blocks the transfer of electrons between the first quinone and the plastoquinone pool in light reaction II.",
  "When treated with certain detergents , lamellae can be broken down into smaller particles capable of carrying out single light reactions. One type of particle can absorb light energy, oxidize water, and produce oxygen (light reaction II), but a special dye molecule must be supplied to accept the electrons. In the presence of electron donors, such as a reduced dye, a second type of lamellar particle can absorb light and transfer electrons from the electron donor to ferredoxin (light reaction I).",
  "The structural and photochemical properties of the minimum particles capable of performing light reactions I and II have received much study. Treatment of lamellar fragments with neutral detergents releases these particles, designated photosystem I and photosystem II, respectively. Subsequent harsher treatment (with charged detergents) and separation of the individual polypeptides with electrophoretic techniques have helped identify the components of the photosystems. Each photosystem consists of a light-harvesting complex and a core complex. Each core complex contains a reaction centre with the pigment (either P 700 or P 680 ) that can be photochemically oxidized, together with electron acceptors and electron donors. In addition, the core complex has some 40 to 60 chlorophyll molecules bound to proteins. In addition to the light absorbed by the chlorophyll molecules in the core complex, the reaction centres receive a major part of their excitation from the pigments of the light-harvesting complex.",
  "The quantum requirements of the individual light reactions of photosynthesis are defined as the number of light photons absorbed for the transfer of one electron. The quantum requirement for each light reaction has been found to be approximately one photon. The total number of quanta required, therefore, to transfer the four electrons that result in the formation of one molecule of oxygen via the two light reactions should be four times two, or eight. It appears, however, that additional light is absorbed and used to form ATP by a cyclic photophosphorylation pathway. (The cyclic photophosphorylation pathway is an ATP-forming process in which the excited electron returns to the reaction centre.) The actual quantum requirement, therefore, probably is 9 to 10.",
  "  The electron transfers of the light reactions provide the energy for the synthesis of two compounds vital to the dark reactions: NADPH and ATP. The previous section explained how noncyclic electron flow results in the reduction of NADP + to NADPH. In this section, the synthesis of the energy-rich compound ATP is described.",
  "ATP is formed by the addition of a phosphate group to a molecule of adenosine diphosphate (ADP)—or to state it in chemical terms, by the phosphorylation of ADP. This reaction requires a substantial input of energy, much of which is captured in the bond that links the added phosphate group to ADP. Because light energy powers this reaction in the chloroplasts, the production of ATP during photosynthesis is referred to as photophosphorylation, as opposed to oxidative phosphorylation in the electron-transport chain in the mitochondrion .",
  "Unlike the production of NADPH, the photophosphorylation of ADP occurs in conjunction with both cyclic and noncyclic electron flow. In fact, researchers speculate that the sole purpose of cyclic electron flow may be for photophosphorylation, since this process involves no net transfer of electrons to reducing agents. The relative amounts of cyclic and noncyclic flow may be adjusted in accordance with changing physiological needs for ATP and reduced ferredoxin and NADPH in chloroplasts. In contrast to electron transfer in light reactions I and II, which can occur in membrane fragments, intact thylakoids are required for efficient photophosphorylation. This requirement stems from the special nature of the mechanism linking photophosphorylation to electron flow in the lamellae.",
  "The theory relating the formation of ATP to electron flow in the membranes of both chloroplasts and mitochondria (the organelles responsible for ATP formation during cellular respiration) was first proposed by English biochemist Peter Dennis Mitchell , who received the 1978 Nobel Prize for Chemistry. This chemiosmotic theory has been somewhat modified to fit later experimental facts. The general features are now widely accepted. A central feature is the formation of a hydrogen ion (proton) concentration gradient and an electrical charge across intact lamellae. The potential energy stored by the proton gradient and electrical charge is then used to drive the energetically unfavourable conversion of ADP and inorganic phosphate (P i ) to ATP and water.",
  "The manganese-protein complex associated with light reaction II is exposed to the interior of the thylakoid. Consequently, the oxidation of water during light reaction II leads to release of hydrogen ions (protons) into the inner thylakoid space. Furthermore, it is likely that photoreaction II entails the transfer of electrons across the lamella toward its outer face, so that when plastoquinone molecules are reduced, they can receive protons from the outside of the thylakoid. When these reduced plastoquinone molecules are oxidized, giving up electrons to the cytochrome-iron-sulfur complex, protons are released inside the thylakoid. Because the lamella is impermeable to them, the release of protons inside the thylakoid by oxidation of both water and plastoquinone leads to a higher concentration of protons inside the thylakoid than outside it. In other words, a proton gradient is established across the lamella. Since protons are positively charged, the movement of protons across the thylakoid lamella during both light reactions results in the establishment of an electrical charge across the lamella.",
  "  An enzyme complex located partly in and on the lamellae catalyzes the reaction in which ATP is formed from ADP and inorganic phosphate. The reverse of this reaction is catalyzed by an enzyme called ATP-ase; hence, the enzyme complex is sometimes called an ATP-ase complex. It is also called the coupling factor. It consists of hydrophilic polypeptides (F 1 ), which project from the outer surface of the lamellae, and hydrophobic polypeptides (F 0 ), which are embedded inside the lamellae. F 0 forms a channel that permits protons to flow through the lamellar membrane to F 1 . The enzymes in F 1 then catalyze ATP formation, using both the proton supply and the lamellar transmembrane charge.",
  "In summary, the use of light energy for ATP formation occurs indirectly: a proton gradient and electrical charge—built up in or across the lamellae as a consequence of electron flow in the light reactions—provide the energy to drive the synthesis of ATP from ADP and P i .",
  " 3  The assimilation of carbon into organic compounds is the result of a complex series of enzymatically regulated chemical reactions—the dark reactions. This term is something of a misnomer, for these reactions can take place in either light or darkness. Furthermore, some of the enzymes involved in the so-called dark reactions become inactive in prolonged darkness; however, they are activated when the leaves that contain them are exposed to light.",
  " Radioactive isotopes of carbon ( 14 C) and phosphorus ( 32 P) have been valuable in identifying the intermediate compounds formed during carbon assimilation. A photosynthesizing plant does not strongly discriminate between the most abundant natural carbon isotope ( 12 C) and 14 C. During photosynthesis in the presence of 14 CO 2 , the compounds formed become labeled with the radioisotope. During very short exposures, only the first intermediates in the carbon-fixing pathway become labeled. Early investigations showed that some radioactive products were formed even when the light was turned off and the 14 CO 2 was added just afterward in the dark, confirming the nature of the carbon fixation as a “dark” reaction.",
  "American biochemist Melvin Calvin , a Nobel Prize recipient for his work on the carbon-reduction cycle, allowed green plants to photosynthesize in the presence of radioactive carbon dioxide for a few seconds under various experimental conditions. Products that became labeled with radioactive carbon during Calvin’s experiments included a three-carbon compound called 3-phosphoglycerate (abbreviated PGA), sugar phosphates, amino acids, sucrose, and carboxylic acids. When photosynthesis was stopped after two seconds, the principal radioactive product was PGA, which therefore was identified as the first stable compound formed during carbon dioxide fixation in green plants. PGA is a three-carbon compound, and the mode of photosynthesis is thus referred to as C 3 . In the two other known pathways, C 4 and CAM (crassulacean acid metabolism), the C 3 pathway follows the fixation of CO 2 into oxaloacetate, a four-carbon acid, and its reduction to malate. PGA is formed from 2-carboxy-3-keto-D-arabinitol 1,5-bisphosphate, which is a highly unstable six-carbon compound formed from the carboxylation of ribulose-1,5-bisphosphate, a five-carbon compound.",
  "Further studies with 14 C as well as with inorganic phosphate labeled with 32 P led to the mapping of the carbon fixation and reduction pathway called the reductive pentose phosphate (RPP) cycle, or the Calvin-Benson cycle. An additional pathway for carbon transport in certain plants was later discovered in other laboratories ( see below  Carbon fixation in C 4 plants ). All the steps in these pathways can be carried out in the laboratory by isolated enzymes in the dark. Several steps require the ATP or NADPH generated by the light reactions. In addition, some of the enzymes are fully active only when conditions simulate those in green cells exposed to light. In living plants, these enzymes are active during photosynthesis but not in the dark.",
  "The Calvin-Benson cycle, in which carbon is fixed, reduced, and utilized, involves the formation of intermediate sugar phosphates in a cyclic sequence. One complete cycle incorporates three molecules of carbon dioxide and produces one molecule of the three-carbon compound glyceraldehyde-3-phosphate (Gal3P). This three-carbon sugar phosphate usually is either exported from the chloroplasts or converted to starch inside the chloroplast.",
  "ATP and NADPH formed during the light reactions are utilized for key steps in this pathway and provide the energy and reducing equivalents (i.e., electrons) to drive the sequence in the direction shown. For each molecule of carbon dioxide that is fixed, two molecules of NADPH and three molecules of ATP from the light reactions are required. The overall reaction can be represented as follows:   ",
  "The cycle is composed of four stages: (1) carboxylation, (2) reduction, (3) isomerization/condensation/dismutation, and (4) phosphorylation.",
  "The initial incorporation of carbon dioxide, which is catalyzed by the enzyme ribulose 1,5-bisphosphate carboxylase (Rubisco), proceeds by the addition of carbon dioxide to the five-carbon compound ribulose 1,5-bisphosphate (RuBP) and the splitting of the resulting six-carbon compound into two molecules of PGA. This reaction occurs three times during each complete turn of the cycle; thus, six molecules of PGA are produced.",
  "The six molecules of PGA are first phosphorylated with ATP by the enzyme PGA-kinase, yielding six molecules of 1,3-diphosphoglycerate (DPGA). These molecules are subsequently reduced with NADPH and the enzyme glyceraldehyde-3-phosphate dehydrogenase to give six molecules of Gal3P. These reactions are the reverse of two steps of the process glycolysis in cellular respiration ( see also  metabolism: Glycolysis  ).",
  "For each complete Calvin-Benson cycle, one of the Gal3P molecules, with its three carbon atoms, is the net product and may be transferred out of the chloroplast or converted to starch inside the chloroplast. For the cycle to regenerate, the other five Gal3P molecules (with a total of 15 carbon atoms) must be converted back to three molecules of five-carbon RuBP. The conversion of Gal3P to RuBP begins with a complex series of enzymatically regulated reactions that lead to the synthesis of the five-carbon compound ribulose-5-phosphate (Ru5P).",
  "The three molecules of Ru5P are converted to the carboxylation substrate, RuBP, by the enzyme phosphoribulokinase, using ATP. This reaction, shown below, completes the cycle.   ",
  "Photosynthesis cannot occur at night, but the respiratory process of glycolysis —which uses some of the same reactions as the Calvin-Benson cycle, except in the reverse—does take place. Thus, some steps in this cycle would be wasteful if allowed to occur in the dark, because they would counteract the reactions of glycolysis. For this reason, some enzymes of the Calvin-Benson cycle are “turned off” (i.e., become inactive) in the dark.",
  "Even in the presence of light, changes in physiological conditions frequently necessitate adjustments in the relative rates of reactions of the Calvin-Benson cycle, so that enzymes for some reactions change in their catalytic activity. These alterations in enzyme activity typically are brought about by changes in levels of such chloroplast components as reduced ferredoxin, acids, and soluble components (e.g., P i and magnesium ions).",
  "The most important use of Gal3P is its export from the chloroplasts to the cytosol of green cells, where it is used for biosynthesis of products needed by the plant. In land plants, a principal product is sucrose , which is translocated from the green cells of the leaves to other parts of the plant. Other key products include the carbon skeletons of certain primary amino acids, such as alanine , glutamate, and aspartate. To complete the synthesis of these compounds, amino groups are added to the appropriate carbon skeletons made from Gal3P. Sulfur amino acids such as cysteine are formed by adding sulfhydryl groups and amino groups. Other biosynthesis pathways lead from Gal3P to lipids, pigments, and most of the constituents of green cells.",
  "Starch synthesis and accumulation in the chloroplasts occur particularly when photosynthetic carbon fixation exceeds the needs of the plant. Under such circumstances, sugar phosphates accumulate in the cytosol, binding cytosolic P i . The export of Gal3P from the chloroplasts is tied to a one-for-one exchange of P i for Gal3P, so less cytosolic P i results in decreased export of Gal3P and decreased P i in the chloroplast. These changes trigger alterations in the activities of regulated enzymes, leading in turn to increased starch synthesis. This starch can be broken down at night and used as a source of reduced carbon and energy for the physiological needs of the plant. Too much starch in the chloroplasts leads to diminished rates of photosynthesis, however. In addition, high levels of sugars in the cytosol lead to the suppression of the normal activities of the genes involved in photosynthesis. Thus, under what would seem to be the ideal photosynthetic conditions of a bright warm day, many plants in fact have-slower-than expected rates of photosynthesis.",
  "Under conditions of high light intensity, hot weather, and water limitation, the productivity of the Calvin-Benson cycle is limited in many plants by the occurrence of photorespiration. This process converts sugar phosphates back to carbon dioxide; it is initiated by the oxygenation of RuBP (i.e., the combination of gaseous oxygen [O 2 ] with RuBP). This oxygenation reaction yields only one molecule of PGA and one molecule of a two-carbon acid, phosphoglycolate, which is subsequently converted in part to carbon dioxide. The reaction of oxygen with RuBP is in direct competition with the carboxylation reaction (CO 2 + RuBP) that initiates the Calvin-Benson cycle and is, in fact, catalyzed by the same protein, ribulose 1,5-bisphosphate carboxylase. The relative concentrations of oxygen and carbon dioxide within the chloroplasts as well as leaf temperature determine whether oxygenation or carboxylation is favoured. The concentration of oxygen inside the chloroplasts may be higher than atmospheric (20 percent) because of photosynthetic oxygen evolution, whereas the internal carbon dioxide concentration may be lower than atmospheric (0.039 percent) because of photosynthetic uptake. Any increase in the internal carbon dioxide pressure tends to help the carboxylation reaction compete more effectively with oxygenation.",
  " Zea mays  Certain plants—including the important crops sugarcane and corn (maize), as well as other diverse species that are thought to have expanded their geographic ranges into tropical areas—have developed a special mechanism of carbon fixation that largely prevents photorespiration. The leaves of these plants have special anatomy and biochemistry. In particular, photosynthetic functions are divided between mesophyll and bundle-sheath leaf cells. The carbon-fixation pathway begins in the mesophyll cells, where carbon dioxide is converted into bicarbonate, which is then added to the three-carbon acid phosphoenolpyruvate (PEP) by an enzyme called phosphoenolpyruvate carboxylase. The product of this reaction is the four-carbon acid oxaloacetate, which is reduced to malate, another four-carbon acid, in one form of the C 4 pathway. Malate then is transported to bundle-sheath cells, which are located near the vascular system of the leaf. There, malate enters the chloroplasts and is oxidized and decarboxylated (i.e., loses CO 2 ) by malic enzyme. This yields high concentrations of carbon dioxide, which is fed into the Calvin-Benson cycle of the bundle sheath cells, and pyruvate, a three-carbon acid that is translocated back to the mesophyll cells. In the mesophyll chloroplasts, the enzyme pyruvate orthophosphate dikinase (PPDK) uses ATP and P i to convert pyruvate back to PEP, completing the C 4 cycle. There are several variations of this pathway in different species. For example, the amino acids aspartate and alanine can substitute for malate and pyruvate in some species.",
  "The C 4 pathway acts as a mechanism to build up high concentrations of carbon dioxide in the chloroplasts of the bundle sheath cells. The resulting higher level of internal carbon dioxide in these chloroplasts serves to increase the ratio of carboxylation to oxygenation, thus minimizing photorespiration. Although the plant must expend extra energy to drive this mechanism, the energy loss is more than compensated by the near elimination of photorespiration under conditions where it would otherwise occur. Sugarcane and certain other plants that employ this pathway have the highest annual yields of biomass of all species. In cool climates, where photorespiration is insignificant, C 4 plants are rare. Carbon dioxide is also used efficiently in carbohydrate synthesis in the bundle sheath.",
  "PEP carboxylase, which is located in the mesophyll cells, is an essential enzyme in C 4 plants. In hot and dry environments, carbon dioxide concentrations inside the leaf fall when the plant closes or partially closes its stomata to reduce water loss from the leaves. Under these conditions, photorespiration is likely to occur in plants that use Rubisco as the primary carboxylating enzyme, since Rubisco adds oxygen to RuBP when carbon dioxide concentrations are low. PEP carboxylase, however, does not use oxygen as a substrate, and it has a greater affinity for carbon dioxide than Rubisco does. Thus, it has the ability to fix carbon dioxide in reduced carbon dioxide conditions, such as when the stomata on the leaves are only partially open. As a consequence, at similar rates of photosynthesis, C 4 plants lose less water when compared with C 3 plants. This explains why C 4 plants are favoured in dry and warm environments.",
  " Opuntia  In addition to C 3 and C 4 species, there are many succulent plants that make use of a third photosynthetic pathway: crassulacean acid metabolism (CAM). This pathway is named after the Crassulaceae , a family in which many species display this type of metabolism, but it also occurs commonly in other families, such as the Cactaceae , the Euphorbiaceae , the Orchidaceae , and the Bromeliaceae . CAM species number more than 20,000 and span 34 families. Almost all CAM plants are angiosperms ; however, quillworts and ferns also use the CAM pathway. In addition, some scientists note that CAM might be used by Welwitschia , a gymnosperm . CAM plants are often characterized by their succulence, but this quality is not pronounced in epiphytes that use the CAM pathway.",
  "CAM plants are known for their capacity to fix carbon dioxide at night, using PEP carboxylase as the primary carboxylating enzyme and the accumulation of malate (which is made by the enzyme malate dehydrogenase) in the large vacuoles of their cells. Deacidification occurs during the day, when carbon dioxide is released from malate and fixed in the Calvin-Benson cycle, using Rubisco. During daylight hours, the stomata are closed to prevent water loss. The stomata are open at night when the air is cooler and more humid, and this setting allows the leaves of the plant to assimilate carbon dioxide. Since their stomata are closed during the day, CAM plants require considerably less water than both C 3 and C 4 plants that fix the same amount of carbon dioxide in photosynthesis.",
  "The productivity of most CAM plants is fairly low, however. This is not an inherent trait of CAM species, because some cultivated CAM plants (e.g., Agave mapisaga and A. salmiana ) can achieve a high aboveground productivity. In fact, some cultivated species that are irrigated, fertilized, and carefully pruned are highly productive. For example, prickly pear ( Opuntia ficus-indica ) and its thornless variety, O. amyclea , produce 4.6 kg per square metre (0.9 pound per square foot) of new growth per year. Such productivity is among the highest of any plant species. Thus, the rates of photosynthesis of CAM plants may be as high as those of C 3 plants, if morphologically similar plants adapted to the similar habitats are compared.",
  "The unusual capacity of CAM plants to fix carbon dioxide into organic acids in the dark, causing nocturnal acidification, with deacidification occurring during the day, has been known to science since the 19th century. (There is evidence, however, that the Romans noticed the difference between the morning acid taste of some of the house plants they cultivated.) On the other hand, the C 4 pathway was discovered during the middle of the 20th century. A full appreciation of CAM as a photosynthetic pathway was greatly stimulated by analogies with C 4 species.",
  "A comparison of the differences between the various carbon pathways is provided in the table.",
  "Oxygenic photosynthesis occurs in the prokaryotic cells called cyanobacteria and in eukaryotic plant cells ( algae and higher plants ). In eukaryotic plant cells, which contain chloroplasts and a nucleus , the genetic information needed for the reproduction of the photosynthetic apparatus is contained partly in the chloroplast chromosome and partly in chromosomes of the nucleus. For example, the carboxylation enzyme ribulose 1,5-bisphosphate carboxylase is a large protein molecule comprising a complex of eight large polypeptide subunits and eight small polypeptide subunits. The gene for the large subunits is located in the chloroplast chromosome, whereas the gene for the small subunits is in the nucleus. Transcription of the DNA of the nuclear gene yields messenger RNA (mRNA) that encodes the information for the synthesis of the small polypeptides. During this synthesis, which occurs on the cytosolic ribosomes , some extra amino acid residues are added to form a recognition leader on the end of the polypeptide chain. This leader is recognized by special receptor sites on the outer chloroplast membrane; these receptor sites then allow the polypeptide to penetrate the membrane and enter the chloroplast. The leader is removed, and the small subunits combine with the large subunits, which have been synthesized on chloroplast ribosomes according to mRNA transcribed from the chloroplast DNA. The expression of nuclear genes that code for proteins needed in the chloroplasts appears to be under control of events in the chloroplasts in some cases; for example, the synthesis of some nuclear-encoded chloroplast enzymes may occur only when light is absorbed by chloroplasts.",
  "Photosynthesis is discussed in David W. Lawlor , Photosynthesis , 3rd ed. (2001); Hans Lambers , F. Stuart Chapin III , and Thijs L. Pons (eds.), Plant Physiological Ecology , 2nd ed. (2008); and Lincoln Taiz and Eduardo Zeiger (eds.), Plant Physiology , 6th ed. (2014). Technical treatments that consider the biochemistry of photosynthesis include Robert E. Blankenship , Molecular Mechanisms of Photosynthesis , 2nd ed. (2008); David L. Nelson and Michael M. Cox (eds.), Lehninger Principles of Biochemistry , 5th ed. (2009); and Philip Stewart and Sabine Globig (eds.), Photosynthesis: Genetic, Environmental and Evolutionary Aspects (2011). Photosynthesis in algae and other aquatic plants is considered in Paul G. Falkowski and John A. Raven , Aquatic Photosynthesis , 2nd ed. (2007); and John T.O. Kirk , Light and Photosynthesis in Aquatic Ecosystems , 3rd ed. (2011)."
]