[
  " personality , a characteristic way of thinking, feeling, and behaving. Personality embraces moods, attitudes, and opinions and is most clearly expressed in interactions with other people. It includes behavioral characteristics, both inherent and acquired, that distinguish one person from another and that can be observed in people’s relations to the environment and to the social group.",
  "The term personality has been defined in many ways, but as a psychological concept two main meanings have evolved. The first pertains to the consistent differences that exist between people: in this sense, the study of personality focuses on classifying and explaining relatively stable human psychological characteristics. The second meaning emphasizes those qualities that make all people alike and that distinguish psychological man from other species; it directs the personality theorist to search for those regularities among all people that define the nature of man as well as the factors that influence the course of lives. This duality may help explain the two directions that personality studies have taken: on the one hand, the study of ever more specific qualities in people, and, on the other, the search for the organized totality of psychological functions that emphasizes the interplay between organic and psychological events within people and those social and biological events that surround them. The dual definition of personality is interwoven in most of the topics discussed below. It should be emphasized, however, that no definition of personality has found universal acceptance within the field.",
  "The study of personality can be said to have its origins in the fundamental idea that people are distinguished by their characteristic individual patterns of behaviour—the distinctive ways in which they walk, talk, furnish their living quarters, or express their urges. Whatever the behaviour, personologists—as those who systematically study personality are called—examine how people differ in the ways they express themselves and attempt to determine the causes of these differences. Although other fields of psychology examine many of the same functions and processes, such as attention, thinking, or motivation, the personologist places emphasis on how these different processes fit together and become integrated so as to give each person a distinctive identity, or personality. The systematic psychological study of personality has emerged from a number of different sources, including psychiatric case studies that focused on lives in distress, from philosophy, which explores the nature of man, and from physiology, anthropology, and social psychology.",
  "The systematic study of personality as a recognizable and separate discipline within psychology may be said to have begun in the 1930s with the publication in the United States of two textbooks, Psychology of Personality (1937) by Ross Stagner and Personality: A Psychological Interpretation (1937) by Gordon W. Allport , followed by Henry A. Murray’s Explorations in Personality (1938), which contained a set of experimental and clinical studies, and by Gardner Murphy’s integrative and comprehensive text, Personality: A Biosocial Approach to Origins and Structure (1947). Yet personology can trace its ancestry to the ancient Greeks, who proposed a kind of biochemical theory of personality.",
  "The idea that people fall into certain personality type categories in relation to bodily characteristics has intrigued numerous modern psychologists as well as their counterparts among the ancients. The idea that people must fall into one or another rigid personality class, however, has been largely dismissed. Two general sets of theories are considered here, the humoral and the morphological.",
  "Perhaps the oldest personality theory known is contained in the cosmological writings of the Greek philosopher and physiologist Empedocles and in related speculations of the physician Hippocrates. Empedocles’ cosmic elements—air (with its associated qualities, warm and moist), earth (cold and dry), fire (warm and dry), and water (cold and moist)—were related to health and corresponded (in the above order) to Hippocrates’ physical humours, which were associated with variations in temperament: blood (sanguine temperament), black bile (melancholic), yellow bile (choleric), and phlegm (phlegmatic). This theory, with its view that body chemistry determines temperament, has survived in some form for more than 2,500 years. According to these early theorists, emotional stability as well as general health depend on an appropriate balance among the four bodily humours; an excess of one may produce a particular bodily illness or an exaggerated personality trait. Thus, a person with an excess of blood would be expected to have a sanguine temperament—that is, to be optimistic, enthusiastic, and excitable. Too much black bile (dark blood perhaps mixed with other secretions) was believed to produce a melancholic temperament. An oversupply of yellow bile (secreted by the liver) would result in anger, irritability, and a “jaundiced” view of life. An abundance of phlegm (secreted in the respiratory passages) was alleged to make people stolid, apathetic, and undemonstrative. As biological science has progressed, these primitive ideas about body chemistry have been replaced by more complex ideas and by contemporary studies of hormones, neurotransmitters, and substances produced within the central nervous system, such as endorphins.",
  "Related to the biochemical theories are those that distinguish types of personalities on the basis of body shape (somatotype). Such a morphological theory was developed by the German psychiatrist Ernst Kretschmer. In his book Physique and Character , first published in 1921, he wrote that among his patients a frail, rather weak (asthenic) body build as well as a muscular (athletic) physique were frequently characteristic of schizophrenic patients, while a short, rotund (pyknic) build was often found among manic-depressive patients. Kretschmer extended his findings and assertions in a theory that related body build and personality in all people and wrote that slim and delicate physiques are associated with introversion, while those with rounded heavier and shorter bodies tend to be cyclothymic—that is, moody but often extroverted and jovial.",
  "Despite early hopes that body types might be useful in classifying personality characteristics or in identifying psychiatric syndromes, the relations observed by Kretschmer were not found to be strongly supported by empirical studies. In the 1930s more elaborate studies by William H. Sheldon in the United States developed a system for assigning a three-digit somatotype number to people, each digit with a range from 1 to 7. Each of the three digits applies to one of Sheldon’s three components of body build: the first to the soft, round endomorph, the second to the square, muscular mesomorph; and the third to the linear, fine-boned ectomorph. Thus, an extreme endomorph would be 711, an extreme ectomorph 117, and an average person 444. Sheldon then developed a 20-item list of traits that differentiated three separate categories of behaviours or temperaments. The three-digit temperament scale appeared to be significantly related to the somatotype profile, an association that failed to excite personologists.",
  "      Also during the 1930s, personality studies began to consider the broader social context in which a person lived. The American anthropologist Margaret Mead studied the patterns of cooperation and competition in 13 primitive societies and was able to document wide variations in those behaviours in different societies. In her book Sex and Temperament in Three Primitive Societies (1935), she showed that masculinity is not necessarily expressed through aggressiveness and that femininity is not necessarily expressed through passivity and acquiescence. These demonstrated variations raised questions about the relative roles of biology, learning, and cultural pressures in personality characteristics.",
  "Perhaps the most influential integrative theory of personality is that of psychoanalysis, which was largely promulgated during the first four decades of the 20th century by the Austrian neurologist Sigmund Freud. Although its beginnings were based in studies of psychopathology, psychoanalysis became a more general perspective on normal personality development and functioning. The field of investigation began with case studies of so-called neurotic conditions, which included hysteria, obsessive-compulsive disorders, and phobic conditions. Patients with hysterical symptoms complained of acute shortness of breath, paralyses, and contractures of limbs for which no physical cause could be found. In the course of interviews, Freud and his early coworker and mentor, the Austrian physician Josef Breuer, noted that many of their patients were unsure of how or when their symptoms developed and even seemed indifferent to the enormous inconvenience the symptoms caused them. It was as if the ideas associated with the symptoms were quarantined from the consciousness and lay neglected by normal curiosity. To explain this strange pattern Breuer and Freud made two assumptions. The first was based on the general scientific position of determinism, which was quite prevalent in 19th-century science: although no apparent physical causes could be implicated, these neurotic symptoms were nevertheless caused, or determined, perhaps not by one but by multiple factors, some of which were psychologically motivated. The second assumption entailed unconscious psychological processes; that is, ideas continue to be active, to change, and to influence behaviour even when they are outside of awareness. One source for this assumption was the observation of posthypnotic suggestion, which seemed to imply that past experiences, surviving outside of consciousness as latent memories, could be activated by a signal from the environment and could then influence behaviour even though the hypnotized person was unaware of the reasons for his behaviour.",
  "Breuer and Freud believed that the specific motivation for these neurotic symptoms lay in the patient’s desire to obliterate from memory profoundly distressing events that were incompatible with the patient’s moral standards and therefore in conflict with them. These events were considered to have been sexual in nature, and further exploration convinced Freud that his patients had had even earlier troublesome sexual experiences—usually seductions—the memories of which had lain dormant until awakened by a more recent sexual encounter. Freud reasoned that the earlier seduction experience imparted to the later one its pathogenic force. Freud at first accepted many of the experiences reported by his young, impressionable patients as actual seductions. He later came to believe that many, though not all, of the narrations were fantasies. Based upon this conviction Freud formulated a theory indicating that personality is shaped by such experiences as well as by other traumatic or frustrating events. He postulated that the fantasies about sexual traumas were expressions of a sexual drive. Thereafter in Freud’s therapeutic method, the search for actual sexual trauma was replaced by an exploration of the ways in which patients’ sexual inclinations, already present in childhood, were expressed in behaviour. Neurosis and personality in general came to be viewed as outcomes of conflict between sexual motivations and defenses against them, the conflict being rooted in early child development.",
  "Freud assumed that his patients were motivated to ward off those fantasies that had an exciting as well as a repelling quality about them. Freud described various psychological devices (defense mechanisms) by which people tried to make the fantasies bearable. For example, in the obsessive-compulsive condition, which refers to persistent unwelcome ideas or recurrent irresistible urges to perform certain acts, such as incessant hand washing, the defense maneuvers are called isolation and displacement. They consist in separating (isolating) a fantasy from its corresponding emotion, and then attaching (displacing) the emotion to another, previously trivial idea; for instance, to the hand washer it is the hands that are dirty rather than the desires. Freud also noted that people who rely on isolation and displacement are otherwise characterized by nonpathological personality qualities such as perfectionism, indecisiveness, and formality in interpersonal contacts. To Freud the fantasies were the mental representations of basic drives, among which sex, aggression, and self-preservation were paramount. These drives, moreover, required taming as the child matured into an adult, and the taming process involved blocking out of consciousness some of the ideas associated with the expression of those drives. Other methods of defense include repression, a kind of withholding of conflicting ideas from recall; projection, the attribution to others of one’s own rejected tendencies; and reaction formation, turning into its opposite a tendency rejected in oneself—as in excessive generosity as a defense against avarice. The basic conflict between drives and control processes, which Freud believed to be the basis of several neuroses, was also invoked to explain both dream content and the “psychopathology of everyday life”—the ordinary slips of the tongue (sometimes called Freudian slips) and errors such as forgetting intentions or misplacing objects.",
  "These primary human drives, moreover, were seen to undergo transformations as part of psychological and physical growth. This formulation widened the realm of sexuality beyond reproduction, by proposing that genital activity does not encompass all of sexuality, because sexual activity can be observed long before biological maturity and can occur without leading to reproduction. The theory further proposed that sexual maturation develops in a sequence of stages as parts of the body successively yield sensual pleasure to the child, beginning with the mouth, followed by the anus, and then the genitals. Social demands for inhibition and control of the drives centre about the functions of these zones, and it is from this process of socialization that personality is said to emerge. For example, the extent to which the personality expresses power, responsibility, compliance, and defiance seems to coincide with anal expressions of the sexual drive and is related to the process of obtaining control over anal functions.",
  "The conflict between the drives—conceptualized as a wholly unconscious structure called the id—and the drive control processes—conceptualized as a largely unconscious structure called the ego—results in the creation of a characteristic style for mediating conflicts, which is assumed to be formed prior to adolescence. While learning and experience are recognized as conspicuous factors in the shaping of these behaviours, the theory also gives prominence to possibly inborn differences in the strength of drives and of the control processes.",
  "Among the controlling functions of the ego are identifications and defenses. Children are inclined to behave like the significant adult models in their environment, Freud postulated. These identifications give identity and individuality to the maturing child. Moreover, the process of self-criticism is part of the ego controls (Freud called it the superego) and acts as an internal and often unconscious conscience that influences moral values.",
  "The Swiss psychiatrist Carl Gustav Jung, an early adherent of Freud’s theories, questioned the degree of emphasis that Freud gave to sexual motivations in personality development. Jung accepted the significant effect of the unconscious processes, but unlike Freud he preferred to emphasize that behaviour is motivated more by abstract, even spiritual, processes than by sexual drives. Jung also focused more on individual differences; in particular he developed a typology of reaction styles, distinguishing between two basic means of modulating basic drives, introversion and extroversion. Introversion was defined as preoccupation with one’s inner world at the expense of social interactions and extroversion as a preference for social interplay for living out inner drives (collectively termed libido). The existence of these two types receives empirical support from most studies of traits ( see below  Trait theories ).",
  "The Austrian psychiatrist Alfred Adler, another of Freud’s early followers, also disputed the importance of sexual motives. Adler described a coping strategy that he called compensation, which he felt was an important influence on behaviour. In his view people compensated for a behavioral deficiency by exaggerating some other behaviour: a process analogous to organic processes called hypertrophy, in which, for example, if one eye is injured, the other eye may compensate by becoming more acute. In Adler’s view, a person with a feeling of inferiority related to a physical or mental inadequacy would also develop compensating behaviours or symptoms. Shortness of stature, for example, could lead to the development of domineering, controlling behaviours. Adler assigned a prominent place to family dynamics in personality development. Children’s position in their family—their birth order—was seen as determining significant character traits.",
  "Freud’s emphasis on the developmental unfolding of the sexual, aggressive, and self-preservative motives in personality was modified by the American psychoanalyst Erik H. Erikson, who integrated psychological, social, and biological factors. Erikson’s scheme proposed eight stages of the development of drives, which continue past Freud’s five stages of childhood (oral, anal, phallic, latency, and genital) and through three stages of adulthood. The stages proceed in leaps according to what is called an epigenetic process. The term epigenesis, borrowed from embryology, refers to the predetermined developmental sequence of parts of an organism. Each part has a special time for its emergence and for its progressive integration within the functioning whole. Each phase of emergence depends upon the successful completion of the preceding phase. According to Erikson, environmental forces exercise their greatest effect on development at the earliest stages of growth, because anything that disturbs one stage affects all of the following stages. As if controlled by a biological timetable, each given stage must be superseded by a new one, receding in significance as the new stage assumes dominance. A constant interleaving at critical periods—in which some parts emerge while others are suppressed—must proceed smoothly if personality problems are to be avoided.",
  "The Freudian theory of development with Erikson’s modifications provides for a succession of drive-control (inner and environmental) interactions. These can be fit into a schema of polar attitudes that develop in progressive stages of a person’s life, creating a conflict at each stage which should be resolved to avoid extremes of personality development. Erikson thus evolved his eight stages of development, which he described as: (1) infancy: trust versus mistrust; (2) early childhood: autonomy versus shame and doubt; (3) preschool: initiative versus guilt; (4) school age: industry versus inferiority; (5) puberty: identity versus identity confusion; (6) young adulthood: intimacy versus isolation; (7) middle adulthood: generativity versus stagnation; and (8) late adulthood: integrity versus despair.",
  "There is little doubt that psychoanalysis had a profound influence on personality theory during the 20th century. It turned attention from mere description of types of people to an interest in how people become what they are. Psychoanalytic theory emphasizes that the human organism is constantly, though slowly, changing through perpetual interactions, and that, therefore, the human personality can be conceived of as a locus of change with fragile and indefinite boundaries. It suggests that research should focus not only on studies of traits, attitudes, and motives but also on studies that reflect the psychoanalytic view that personality never ceases to develop and that even the rate of personality modification changes during the course of a life. Although the theory holds that conflict and such basic drives as sex and aggression figure prominently in personality development and functioning, their presence may be neither recognizable nor comprehensible to persons untrained to look for those motives. However, personality characteristics are relatively stable over time and across situations, so that a person remains recognizable despite change. Another feature of psychoanalytic theory is the insistence that personality is affected by both biological and psychosocial forces that operate principally within the family, with the major foundations being laid early in life.",
  "The data on which psychoanalytic theory rests came from the psychoanalysts’ consulting rooms, where patients in conflict told their life stories to their analysts. No provision is made in that setting for experimental manipulation, for independent observation, or for testing the generality of the formulations. As a consequence, although much of the theory has found its way into accepted doctrine, psychoanalysis cannot claim a body of experimentally tested evidence. Nevertheless, psychoanalytic theory provides at least a preliminary framework for much of personality research involving motives and development.",
  "Contemporary personality studies are generally empirical and based on experiments. While they are more precise, and thus may be more valid than much of psychoanalytic theory, experiments perforce have a narrower scope than the grand sweep of psychoanalysis. In the 1940s many investigators focused on intensive studies of individual traits and of combinations of traits that seemed to define personality types, such as the “authoritarian personality.” Others, like the American psychologists David C. McClelland and John W. Atkinson, studied the characteristic presence of certain needs identified by Murray, such as the need for achievement or affiliation. The method used to measure these needs was to examine the fantasy productions of Murray’s Thematic Apperception Test (TAT) and to relate the motive score to other behavioral indexes such as personal history, occupational choice, speed of learning, and persistence of behaviour following failure.",
  "Traits such as sociability, impulsiveness, meticulousness, truthfulness, and deceit are assumed to be more or less stable over time and across situations. Traits refer not to single instances of a behaviour, such as lying, but to persistent although not unvarying behaviour that, according to some personologists, implies a disposition to respond in a particular, identifiable way. According to Allport’s 1937 textbook, traits represent structures or habits within a person and are not the construction of observers; they are the product of both genetic predispositions and experience. It can be generally stated that traits are merely names for observed regularities in behaviour, but do not explain them. Nevertheless, the study of how traits arise and are integrated within a person forms a major area of personality studies.",
  "In the English language there are several thousand words representing traits, many of them close in meaning to others (for example, meticulous, careful, conscientious). Most of the measurement studies employ self-report (personality) inventories that require people to describe themselves by checking relevant adjectives or answering questions about typical behaviours that they are conscious of displaying. In some measurements, observers rate the behaviour of others. Psychologists such as Hans J. Eysenck in the United Kingdom and Raymond B. Cattell in the United States have attempted to reduce the list to what they could consider to be the smallest possible number of trait clusters. The statistical technique of factor analysis has been favoured for this task, since it explores the correlations among all of the trait names and identifies clusters of correlations among traits that appear to be independent of (uncorrelated with) each other. Common to almost all the trait systems are variables related to emotional stability, energy level, dominance, and sociability, although different investigators choose different names for these factors. Eysenck, for example, has reduced the trait names to but three higher-order factors—introversion–extroversion, neuroticism, and psychoticism—and has attempted to explore the biological roots of each factor.",
  "The idea that traits represent relatively stable behaviours has received criticism from psychologists who point out that behavioral consistency across situations and across time is not the rule. For example, in a study of children’s moral development, the American psychologists Hugh Hartshorne and Mark A. May in 1928 placed 10- to 13-year-old children in situations that gave them the opportunity to lie, steal, or cheat; to spend money on themselves or on other children; and to yield to or resist distractions. The predictive power of personal and educational background was low, and children were not found consistently honest or dishonest, distractible, or altruistic. The most powerful predictor of children’s behaviour was what other children around them were doing.",
  "In the 1960s and ’70s some psychologists, including Walter Mischel and Albert Bandura in the United States, recalled the Hartshorne and May study and variations of it to support their view that behaviour is controlled not by hypothetical traits but according to the degree of regularity of external stimuli. That is, they believe that personality traits are only consistent if the situation is consistent and that they vary once the situation changes. In their view, behavioral consistency does not reflect stable personality traits. Rather, it is the environment that evokes and shapes the illusion of such traits. This would be in keeping with the view of social learning theorists that personality, like other elements of a person’s psychological makeup, is largely a learning phenomenon related to such factors as the imitation of role models. Social learning theory would also contend that personality is more susceptible to change than would trait theory.",
  "Although it has been demonstrated that behaviour is seldom entirely consistent, it also has been shown that it reflects considerable consistency. Even in the Hartshorne and May study some children showed consistently honest or dishonest behaviour, and behavioral consistency was found to increase with age.",
  "Support for personal consistency is bolstered by studies of what has been called the fundamental attribution error. The investigators, most of them social psychologists, report that, in observing the behaviour of others, people exaggerate the role of internal causes and invoke traits as a primary cause (e.g., “John acted the way he did because he is honest”). In assigning cause to their own behaviour, however, people more often cite external causes such as the particular situation. These tendencies are accompanied by another discovered regularity: in seeking sources for their own behaviour, people are likely to favour internal causes (and thus agree with an observer’s judgment) when they consider a behaviour to be desirable (e.g., success, as in “I was successful because I am skillful”), and they invoke external, situational causes in judging a behaviour they deem undesirable (e.g., failure, as in “I failed because the test was unfair”). There are, of course, limits to the regularity with which these generalizations hold. Because people tend to know their own characteristics better than observers do, they are generally more aware than observers are of any divergences from their usual behaviour.",
  "Although people may assume the existence of traits in themselves, they do not, in analyzing a specific situation, see themselves as a mere collection of trait names. Consequently, they are not for the most part perplexed by, and often do not recognize, cross-situational inconsistency in their own behaviour. But in observing another person’s behaviour, most people attribute high consistency to that person, as if many positive traits could be inferred from the attribution or observation of one positive trait. For example, the American social psychologist Solomon Asch has shown that a physically attractive person will tend to be judged as having many other desirable qualities. Asch also demonstrated that, in forming impressions of the personal characteristics of others, observers are most influenced by their first impression. The reason first impressions seem to be almost indelible is that they carry an excessive amount of new information, which has a high degree of unpredictability. That is, the more new information contained in an event, the more attention it attracts. Since impressions about a person tend to be integrated into a single characterization, an observer may be jarred by recognizing an undesirable fact about an attractive person and may try either to ignore that fact or to mitigate (rationalize) it. These propensities make up a “common sense psychology,” in the words of Fritz Heider, an American psychologist. This “naive” psychology, as he called it, consists of a set of rules that guide most people’s impressions of other people and of social situations. These rules are used constantly to interpret one’s own and other people’s behaviour and to predict behaviour under certain conditions. The psychoanalytic view, however, seriously challenges this common sense psychology. Psychoanalysis has no problem explaining that those who put to death countless people in the Nazi death chambers, for example, could also be devoted parents, whereas common sense psychology would have difficulty with this. For the psychoanalyst, a personality may be integrated, but it is rarely seamless and regular. People generally make two types of errors in judging personality: they impute more personality consistency to others than the actors themselves would allow, and they often ignore the operation of unconscious psychological processes that can explain at least some of the inconsistencies.",
  "Much work on trait structure and impression formation has concerned adjectival words that describe traits, and the fact that these studies have been carried out principally in the United States and western Europe has led some anthropologists, such as the American Robert LeVine, to remark that modern personality trait theory is ethnocentric. For example, the folk-psychological concepts and the trait matrices derived from factor analyses include culture-specific assumptions about personal experiences, such as the distinctions between mind and body, natural and supernatural, and intellect and morality, which do not exist in the folk traditions of many non-Western peoples. Unlike most other cultures, Western thought assumes that a high degree of personal autonomy is desirable and that the most important emotional and personal relations are with a marital partner. For some psychologists these cultural differences point to the need for a less culture-bound approach to personality trait theory.",
  "Despite the physical differences between males and females the finding of behavioral differences between the sexes is controversial. Behaviours associated with sex roles depend heavily on the social and cultural context, and studies of stereotypic male and female roles are therefore understandably ambiguous. Yet some findings indicate small but consistent differences. While there are no differences in measured IQ, itself regarded as a culture-bound assessment, females do better than males on verbal tasks. Girls generally begin to speak earlier than boys and have fewer language problems in school and in the course of maturation. Males generally exhibit greater skill in understanding spatial relations and in solving problems that involve mathematical reasoning. Beginning at the toddler stage, the activity level of males is generally higher than that of females. A related finding is that boys are more likely to be irritable and aggressive than girls and more often behave like bullies. Men usually outscore women in antisocial personality disorders, which consist of persistent lying, stealing, vandalism, and fighting, although these differences do not appear until after about the age of three. A study by the American anthropologists Beatrice B. Whiting and Carolyn P. Edwards found that males were consistently more aggressive than females in seven cultures, suggesting that there is a predisposition in males to respond aggressively to provocative situations, although how and whether the attacking response occurs depends on the social and cultural setting.",
  "Humans are perhaps the only species of animal that does not have an internal inhibition against slaughtering other members of the species. It has been theorized that man, like other animals, is motivated by an aggressive drive, which has significant survival value, but lacks internal inhibitions against killing his fellow men. Inhibitions, therefore, must be imposed externally by society. Social learning theorists emphasize the decisive effects of situations in triggering and controlling aggression. They account for the poor predictability of aggressive behaviour in man by noting that the environmental context is generally unpredictable. Yet research has shown that an aggressive act is most likely to be produced by a person with a history of aggressive behaviour.",
  "While social learning theorists emphasize the active shaping of personality by external social influences, experimental evidence has accumulated that genetic factors play a prominent role, if not in the transmission of specific behaviour patterns, then in the readiness of people to respond to environmental pressures in particular ways. In observations of animals, it is commonplace to find in different breeds of dogs wide divergences in behaviour that are attributed to genetic differences: some are friendly, others aggressive; some are timid, others bold (of course there may also be wide variations within a given breed). Among human infants observed in a neonatal nursery, there are also clearly observable differences in activity, passivity, fussiness, cuddliness, and responsiveness. These patterns, which some authorities say may be genetically influenced, shape the ways in which the infant will interact with the environment and can be considered an expression of personality.",
  "In systematic studies of humans, studies of twins and adopted children have been used to try to evaluate environmental and genetic factors as determinants of a number of behaviour patterns. These studies have shown that genetic factors account for about 50 percent of the range of differences found in a given population. Most of the remaining differences are attributable not to the environment that is common to members of a family but to the environment that is unique to each member of the family or that results from interactions of family members with one another. In the United States, behaviour geneticists such as Robert Plomin report that, in behaviours describable as sociability, impulsiveness, altruism, aggression, and emotional sensitivity, the similarities among monozygotic (identical) twins is twice that among dizygotic (fraternal) twins, with the common environment contributing practically nothing to the similarities. Similar findings are reported for twins reared together or separately.",
  "The study of the genetic aspects of personality is a relatively new undertaking. Almost all populations studied have been from industrialized Western nations whose rearing environments are more nearly alike than different. It is known that the more homogeneous the environment, the stronger the genetic contribution will appear. As with the psychology of traits, cross-cultural studies are required to test the validity of the claims of behaviour genetics.",
  "Psychologists have long been aware that people differ in the consistent way in which they receive and respond to information. Some make careful distinctions between stimuli, whereas others blur distinctions, and some may typically prefer to make broad categories, whereas others prefer narrow ones for grouping objects. These consistencies in an individual seem to be fairly stable across time and even across situations. They have been referred to as cognitive controls. Combinations of several cognitive controls within a person have been referred to as cognitive style, of which there can be numerous variations.",
  "Cognitive control studies explore constraints within a person that limit the influence of both environment and motivation, and as such they are expressions of personality. In the 1940s and ’50s several studies explored the extent to which personal needs or drives determine what one perceives. In one study, children from rich and poor families were asked to adjust a circle of light to the size of several coins of increasing value and to the size of cardboard disks. All of the children overestimated the size of the coins, although not of the neutral disks, but the poor children overestimated the sizes more than did the rich children. The assumption that need influences such judgments has been widely held. Even Shakespeare, in A Midsummer Night’s Dream , noted, “Or in the night, imagining some fear, / how easy is a bush supposed a bear.” But there are limits to the distorting power of drives, and the experimental demonstration of the influence of motives has been difficult to confirm, perhaps because the formal components of cognition—the workings, for example, of attention, judgment, or perception—and individual difference in their expression have been neglected by personologists. Investigators of cognitive controls examine the psychological limits on the distorting effects of needs and of external reality. For example, in estimating the size of a disk, some people are more exact than others, and the extent to which a need can distort size judgments will consequently be limited by the perceiver’s preference for strict or relaxed standards of comparison.",
  "The American psychologists George S. Klein and Herman Witkin in the 1940s and ’50s were able to show that several cognitive controls were relatively stable over a class of situations and intentions. For example, the psychologists found a stable tendency in some people to blur distinctions between successively appearing stimuli so that elements tended to lose their individuality (leveling) and an equally stable tendency in other individuals to highlight differences (sharpening). This organizing principle is apparent in judgments of the size of a series of objects, as well as in memory, where it may manifest itself in a blurring of elements in the recall of a story.",
  "Another much studied cognitive control is called field dependence-field independence. It pertains to the extent to which people are influenced by inner (field-independent) or environmental (field-dependent) cues in orienting themselves in space and the extent to which they make fine differentiations in the environment. The more field-independent people are, the greater is their ability to articulate a field. There are no general intellectual capacity differences between field-dependent and field-independent people, but there is a tendency for field-dependent people to favour careers that include working with other people, such as teaching or social work. Field-independent people are more often found in careers that involve abstract issues such as mathematics. Cultural differences have also been found. Some Eskimo live and hunt in an environment with little variation, and a high degree of articulation of the field (field independence) would favour survival; some farmers of Sierra Leone, however, who inhabit an area of lush vegetation and many varieties of shape, require less differentiation of the field.",
  "In general, information about human personality has come from three different sources of study. The first is biological, conceived to have genetic as well as environmental origins. The second is that of the social realm, including the impact of social forces on the growing child that shape such personal responses as motives, traits, behaviours, and attitudes. The third is the examination of clinical contacts with people who have suffered adaptive and adjustive failures. Some authorities have suggested that a greater degree of integration of all three sources of information and the methods derived from them would accelerate the growth of valid information about personality.",
  "Definitions of personality as a psychological concept, with treatment of related issues, are found in the following reference works: Rom Harré and Roger Lamb (eds.), The Dictionary of Personality and Social Psychology (1986); Richard L. Gregory (ed.), The Oxford Companion to the Mind (1987); Raymond J. Corsini  et al. (eds.), Concise Encyclopedia of Psychology (1987); and Jonathan L. Freedman , Introductory Psychology , 2nd ed. (1982).",
  "Major theories of personality are surveyed in Calvin S. Hall and Gardner Lindzey , Theories of Personality , 3rd ed. (1978); and in Nathan Brody , Personality: In Search of Individuality (1988). Roger Brown , Social Psychology, the Second Edition (1986); and Irwin G. Sarason , Personality: An Objective Approach , 2nd ed. (1972), review and evaluate contemporary personality studies and research methods. The best presentation of psychoanalytic ideas remains Freud’s own, available in many translated selections. The following two, edited and translated by James Strachey , can be recommended: Sigmund Freud , Introductory Lectures on Psychoanalysis (1977; originally published in German, 1916–17), and New Introductory Lectures on Psychoanalysis (1974; originally published in German, 1933). Gardner Murphy , Personality: A Biosocial Approach to Origins and Structure (1947, reissued 1966), integrates views and data that reach across historical epochs and many intellectual disciplines. The theory of cognitive controls and styles is carefully analyzed in George S. Klein , Perception, Motives, and Personality (1970).",
  "Discussions of the variety of currently held views on personality, demonstrating a broad interdisciplinary approach, include James F. Masterson , The Search for the Real Self: Unmasking the Personality Disorders of Our Age (1988); and Arthur Peacocke and Grant Gillett (eds.), Persons and Personality: Contemporary Inquiry (1987). Adaptation of personality in social interaction is explored in Joel Aronoff and John P. Wilson , Personality in the Social Process (1985); Alan S. Waterman , The Psychology of Individualism (1984); Robert A. Levine , Culture, Behavior, and Personality: An Introduction to the Comparative Study of Psychosocial Adaptation , 2nd ed. (1982); Nancy Cantor and John F. Kihlstrom , Personality, Cognition, and Social Interaction (1981); and Nancy Cantor and John F. Kihlstrom (eds.), Personality and Social Intelligence (1987). Issues of personality development from childhood through adulthood are interpreted in Robert L. Leahy (ed.), The Development of the Self (1985); Laurence R. Simon , Cognition and Affect: A Developmental Psychology of the Individual (1986); Lawrence S. Wrightsman , Personality Development in Adulthood (1988); and Erik H. Erikson , Childhood and Society , new anniversary ed. (1985)."
]