[
  "  ocean , continuous body of salt water that is contained in enormous basins on Earth’s surface.",
  "    When viewed from space, the predominance of Earth’s oceans is readily apparent. The oceans and their marginal seas cover nearly 71 percent of Earth’s surface, with an average depth of 3,688 metres (12,100 feet). The exposed land occupies the remaining 29 percent of the planetary surface and has a mean elevation of about 840 metres (approximately 2,755 feet). Actually, all the elevated land could be hidden under the oceans and Earth reduced to a smooth sphere that would be completely covered by a continuous layer of seawater more than 2,600 metres (8,530 feet) deep. This is known as the sphere depth of the oceans and serves to underscore the abundance of water on Earth’s surface.",
  "Earth is unique in the solar system because of its distance from the Sun and its period of rotation. These combine to subject Earth to a solar radiation level that maintains the planet at a mean surface temperature of about 14–15 °C (57.2–59 °F). Mean surface temperature varies little over annual and night-day cycles. This mean temperature allows water to exist on Earth in all three of its phases— solid , liquid , and gaseous . No other planet in the solar system has this feature. The liquid phase predominates on Earth. By volume, 97.957 percent of the water on the planet exists as oceanic water and associated sea ice . The gaseous phase and droplet water in the atmosphere constitute 0.001 percent. Fresh water in lakes and streams makes up 0.036 percent, while groundwater is 10 times more abundant at 0.365 percent. Glaciers and ice caps constitute 1.641 percent of Earth’s total water volume.",
  "  Each of the above is considered to be a reservoir of water. Water continuously circulates between these reservoirs in what is called the hydrologic cycle , which is driven by energy from the Sun. Evaporation , precipitation , movement of the atmosphere, and the downhill flow of river water, glaciers, and groundwater keep water in motion between the reservoirs and maintain the hydrologic cycle.",
  "The large range of volumes in these reservoirs and the rates at which water cycles between them combine to create important conditions on Earth. If small changes occur in the rate at which water is cycled into or out of a reservoir, the volume of a reservoir changes. These volume changes may be relatively large and rapid in a small reservoir or small and slow in a large reservoir. A small percentage change in the volume of the oceans may produce a large proportional change in the land-ice reservoir, thereby promoting glacial and interglacial stages. The rate at which water enters or leaves a reservoir divided into the reservoir volume determines the residence time of water in the reservoir. The residence time of water in a reservoir, in turn, governs many of the properties of that reservoir.",
  "This article provides an overview of the world’s oceanic reservoir, including its major subdivisions and its origins. For a full description of the water in the oceans, see  seawater . For information on the forces that move water through the ocean, see  ocean current . For a description of the different kinds of waves that traverse the ocean, see  wave . See also  marine ecosystem for coverage of the life-forms that populate the marine environment.",
  "  Earth possesses one “world ocean.” However, those conducting oceanic research generally recognize the existence of five major oceans: the Pacific , Atlantic , Indian , Southern , and Arctic oceans. Arbitrary boundaries separate these bodies of water, but they are largely defined by the continents that frame them. In the Southern Hemisphere, however, 60° S latitude, which corresponds to the approximate position of the Antarctic Circumpolar Current , separates the Southern Ocean from the southern portions of the Pacific, Atlantic, and Indian oceans. Many subdivisions can be made to distinguish the limits of seas and gulfs that have historical, political, and sometimes ecological significance. However, water properties, ocean currents , and biological populations are not constrained by these boundaries. Indeed, many researchers do not recognize them either.",
  "If area-volume analyses of the oceans are to be made, then boundaries must be established to separate individual regions. In 1921 Erwin Kossina, a German geographer, published tables giving the distribution of oceanic water with depth for the oceans and adjacent seas. This work was updated in 1966 by American geologist H.W. Menard and American oceanographer S.M. Smith. The latter only slightly changed the numbers derived by Kossina. This was remarkable, since the original effort relied entirely on the sparse depth measurements accumulated by individual wire soundings, while the more recent work had the benefit of acoustic depth soundings collected since the 1920s. This type of analysis, called hypsometry , allows quantification of the surface area distribution of the oceans and their marginal seas with depth.",
  "The distribution of oceanic surface area with 5° increments of latitude shows that the distribution of land and water on Earth’s surface is markedly different in the Northern and Southern hemispheres. The Southern Hemisphere may be called the water hemisphere, while the Northern Hemisphere is the land hemisphere. This is especially true in the temperate latitudes.",
  "This asymmetry of land and water distribution between the Northern and Southern hemispheres makes the two hemispheres behave very differently in response to the annual variation in solar radiation received by Earth. The Southern Hemisphere shows only a small change in surface temperature from summer to winter at temperate latitudes. This variation is controlled primarily by the ocean’s response to seasonal changes in heating and cooling. The Northern Hemisphere has one change in surface temperature controlled by its oceanic area and another controlled by its land area. In the temperate latitudes of the Northern Hemisphere, the land is much warmer than the oceanic area in summer and much colder in winter. This situation creates large-scale seasonal changes in atmospheric circulation and climate in the Northern Hemisphere that are not found in the Southern Hemisphere.",
  "If the volume of an ocean is divided by its surface area, the mean depth is obtained. Even without including its marginal seas, the Pacific is the largest ocean in both surface area and volume, the Atlantic is next, and the Arctic is the smallest. The Atlantic exhibits the largest change in surface area and volume when its marginal seas are subtracted. This indicates that the Atlantic has the greatest area of bordering seas, many of which are shallow.",
  "  Hypsometry can show how the area of each ocean or marginal sea changes as depth changes. A special curve known as a hypsometric, or hypsographic, curve can be drawn that portrays how the surface area of Earth is distributed with elevation and depth. This curve has been drawn to represent the total Earth and all of its oceans; likewise, curves can be constructed for each individual ocean and sea. The average depth of the world’s oceans, 3,688 metres (12,100 feet), and the average elevation of the land, 840 metres (2,756 feet), are indicated. The highest point on land, Mount Everest (8,850 metres [29,035 feet]), and the deepest point in the ocean, located in the Mariana Trench (11,034 metres [36,201 feet]), mark the upper and lower limits of the curve, respectively. Since this curve is drawn on a grid of elevation versus Earth’s area, the area under the curve covering the 29.2 percent of Earth’s surface that is above sea level is the volume of land above sea level. Similarly, the area between sea level and the curve depicting the remaining 70.8 percent of Earth’s surface below sea level represents the volume of water contained in the oceans.",
  "Portions of this curve describe the area of Earth’s surface that exists between elevation or depth increments. On land, little of Earth’s total area—only about 4 percent—is at elevations above 2,000 metres (about 6,560 feet). Most of the land, 25.3 percent of the total Earth, is between 0 and 2,000 metres. About 13.6 percent of the total land area is at higher elevations, with 86.4 percent between 0 and 2,000 metres when the areas are determined relative to land area only. In the oceans the percentages of the area devoted to depth increments yield information about the typical structure and shape of the oceanic basins. The small depth increment of 0–200 metres (656 feet) occupies about 5.4 percent of Earth’s total area or 7.6 percent of the oceans’ area. This approximates the world’s area of continental shelves , the shallow flat borderlands of the continents that have been alternately covered by the oceans during interglacial stages and uncovered during glacial periods ( see  continental margin ).",
  "At depths between 200 and 2,000 metres, an area only slightly larger—6.02 percent of Earth’s total area or 8.5 percent of the oceans’ area—is found. These depths are related to the regions of the oceans that have very steep slopes where depth increases rapidly. These are the continental slope regions that mark the true edge of the continental landmasses. Marginal seas of moderate depths and the tops of seamounts , however, add their area to these depth zones when all the oceans are considered. The majority of the oceanic area lies between 4,000 and 5,000 metres (about 13,100 and 16,400 feet).",
  "  The continental shelf region varies immensely from place to place. The seaward boundary of the continental shelf historically is determined by the 100-fathom, or 200-metre, depth contour. However, 85 fathoms, or 170 metres [about 560 feet], is a closer approximation. The true boundary at any given location is marked by a rapid change in slope of the seafloor known as the shelf break . This change in slope may be nearly at the coastline in areas where crustal plates converge, as along the west coast of North and South America, or it may be located more than 1,000 km (about 620 miles) seaward of the coast, as off the north coast of Siberia . The average width of the shelf is about 75 km (about 45 miles), and the shelf has an average slope of about 0.01°, a slope that is barely discernible to the human eye. Seaward of the shelf break, the continental slope is inclined by about 4°.",
  "The huge volume of water contained in the oceans (and seas), 137 × 10 7 cubic km (about 33 × 10 7 cubic miles), has been produced during Earth’s geologic history. There is little information on the early history of Earth’s waters. However, fossils dated from the Precambrian some 3.3 billion years ago show that bacteria and cyanobacteria ( blue-green algae ) existed then, indicating the presence of water during that period. Carbonate  sedimentary rocks , obviously laid down in an aquatic environment, have been dated to 1 billion years ago. Also, there is fossil evidence of primitive marine algae and invertebrates from the Ediacaran Period (635 million to 541 million years ago).",
  "The presence of water on Earth at even earlier times is not documented by physical evidence. It has been suggested, however, that the early hydrosphere formed in response to condensation from the early atmosphere . The ratios of certain chemical elements on Earth indicate that the planet formed by the accumulation of cosmic dust and was slowly warmed by radioactive and compressional heating. This heating led to the gradual separation and migration of materials to form Earth’s core, mantle, and crust. The early atmosphere is thought to have been highly reducing and rich in gases, notably in hydrogen , and to include water vapour.",
  "Earth’s surface temperature and the partial pressures of the individual gases in the early atmosphere affected the atmosphere’s equilibration with the terrestrial surface. As time progressed and the planetary interior continued to warm, the composition of the gases escaping from within Earth gradually changed the properties of its atmosphere, producing a gaseous mixture rich in carbon dioxide (CO 2 ), carbon monoxide (CO), and molecular nitrogen (N 2 ). Photodissociation (i.e., separation due to the energy of light) of water vapour into molecular hydrogen (H 2 ) and molecular oxygen (O 2 ) in the upper atmosphere allowed the hydrogen to escape and led to a progressive increase of the partial pressure of oxygen at Earth’s surface. The reaction of this oxygen with the materials of the surface gradually caused the vapour pressure of water vapour to increase to a level at which liquid water could form. This water in liquid form accumulated in isolated depressions of Earth’s surface, forming the nascent oceans. The high carbon dioxide content of the atmosphere at this time would have allowed a buildup of dissolved carbon dioxide in the water and made these early oceans acidic and capable of dissolving surface rocks that would add to the water’s salt content. Water must have evaporated and condensed rapidly and accumulated slowly at first. The required buildup of atmospheric oxygen was slow because much of this gas was used to oxidize methane , ammonia , and exposed rocks high in iron . Gradually, the partial pressure of the oxygen gas in the atmosphere rose as photosynthesis by bacteria and photodissociation continued to supply oxygen. Biological processes involving algae increased, and they gradually decreased the carbon dioxide content and increased the oxygen content of the atmosphere until the oxygen produced by biological processes outweighed that produced by photodissociation. This, in turn, accelerated the formation of surface water and the development of the oceans.",
  "Broad overviews of the oceans are provided by Alan P. Trujillo and Harold V. Thurman , Essentials of Oceanography, 10th ed. (2011); Keith A. Sverdrup , Alison B. Duxbury , and Alyn C. Duxbury , Fundamentals of Oceanography, 5th ed. (2006); and M. Grant Gross and Elizabeth Gross , Oceanography, a View of the Earth , 7th ed. (1996). Sylvia A. Earle , National Geographic Atlas of the Ocean: The Deep Frontier (2001), provides a graphic look at all aspects of the ocean."
]