[
  " Salix babylonica   plant , (kingdom Plantae),  any multicellular eukaryotic life-form characterized by (1) photosynthetic nutrition (a characteristic possessed by all plants except some parasitic plants and underground orchids ), in which chemical energy is produced from water , minerals , and carbon dioxide with the aid of pigments and the radiant energy of the Sun, (2) essentially unlimited growth at localized regions, (3) cells that contain cellulose in their walls and are therefore to some extent rigid, (4) the absence of organs of locomotion , resulting in a more or less stationary existence, (5) the absence of nervous systems , and (6) life histories that show an alteration of haploid and diploid generations, with the dominance of one over the other being taxonomically significant.",
  " Lemna minor    Plants range in size from diminutive duckweeds only a few millimetres in length to the giant sequoias of California that reach 90 metres (300 feet) or more in height. There are an estimated 390,900 different species of plants known to science, and new species are continually being described, particularly from previously unexplored tropical areas of the world. Plants evolved from aquatic ancestors and have subsequently migrated over the entire surface of Earth , inhabiting tropical, Arctic, desert, and Alpine regions. Some plants have returned to an aquatic habitat in either fresh or salt water.",
  "  Plants play a vital role in the maintenance of life on Earth. All energy used by living organisms depends on the complex process of photosynthesis, which is mostly carried out by green plants. Radiant energy from the Sun is transformed into organic chemical energy in the form of sugars through the fundamental series of chemical reactions constituting photosynthesis. In nature all food chains begin with photosynthetic autotrophs (primary producers), including green plants and algae . Primary producers, represented by trees , shrubs , and herbs, are a prolific source of energy in the form of carbohydrates (sugars) stored in the leaves . These carbohydrates, produced in photosynthesis, are broken down in a process called respiration; the smaller units of the sugar molecule and its products fuel numerous metabolic processes. Various parts of the plant (e.g., leaves) are the energy sources that support animal life in different community habitats . A by-product of photosynthesis, oxygen , is essential to animals.",
  "The daily existence of human beings is also directly influenced by plants. Plants furnish food and flavourings; raw materials for industry, such as wood , resins , oils , and rubber ; fibres for the manufacture of fabrics and cordage; medicines; insecticides ; and fuels. More than half of Earth’s population relies on the grasses  rice , corn (maize), and wheat as their primary source of food. Apart from their commercial and aesthetic value, plants conserve other natural resources by protecting soils from erosion , by controlling water levels and quality, and by producing a favourable atmosphere .",
  "The following article summarizes the morphological, physiological, and ecological features of plants. The principal focus is on structure and function, physiology, life histories, and ecology , and on how the various plant groups have evolved , dispersed, and become adapted to life on land. The features that define each major plant group and the role they play in the wider ecosystem also are discussed.",
  "    The kingdom Plantae includes organisms that range in size from tiny mosses to giant trees. Despite this enormous variation, all plants are multicellular and eukaryotic (i.e., each cell possesses a membrane-bound nucleus that contains the chromosomes ). They generally possess pigments ( chlorophylls  a and b and carotenoids ), which play a central role in converting the energy of sunlight into chemical energy by means of photosynthesis. Most plants, therefore, are independent in their nutritional needs ( autotrophic ) and store their excess food in the form of macromolecules of starch . The relatively few plants that are not autotrophic have lost pigments and are dependent on other organisms for nutrients. Although plants are nonmotile organisms, some produce motile cells ( gametes ) propelled by whiplike flagella . Plant cells are surrounded by a more or less rigid cell wall composed of the carbohydrate cellulose, and adjacent cells are interconnected by microscopic strands of cytoplasm called plasmodesmata, which traverse the cell walls. Many plants have the capacity for unlimited growth at localized regions of cell division, called meristems . Plants, unlike animals, can use inorganic forms of the element nitrogen (N), such as nitrate and ammonia —which are made available to plants through the activities of microorganisms or through the industrial production of fertilizers —and the element sulfur (S); thus, they do not require an external source of protein (in which nitrogen is a major constituent) to survive.",
  " n n  The life histories of plants include two phases, or generations, one of which is diploid (the nuclei of the cells contain two sets of chromosomes), whereas the other is haploid (with one set of chromosomes). The diploid generation is known as the sporophyte , which literally means spore -producing plant. The haploid generation, called the gametophyte , produces the sex cells, or gametes . The complete life cycle of a plant thus involves an alternation of generations . The sporophyte and gametophyte generations of plants are structurally quite dissimilar.",
  "The concept of what constitutes a plant has undergone significant change over time. For example, at one time the photosynthetic aquatic organisms commonly referred to as algae were considered members of the plant kingdom. The various major algal groups, such as the green algae , brown algae , and red algae , are now placed in the kingdom Protista because they lack one or more of the features that are characteristic of plants. The organisms known as fungi also were once considered to be plants because they reproduce by spores and possess a cell wall. The fungi, however, uniformly lack chlorophyll, and they are heterotrophic and chemically distinct from the plants; thus, they are placed in a separate kingdom, Fungi.",
  "No definition of the kingdom completely excludes all nonplant organisms or even includes all plants. There are plants, for example, that do not produce their food by photosynthesis but rather are parasitic on other living plants. Some animals possess plantlike characteristics, such as the lack of mobility (e.g., sponges ) or the presence of a plantlike growth form (e.g., some corals and bryozoans ), but in general such animals lack the other characteristics of plants cited here.",
  "Despite such differences, plants share the following features common to all living things. Their cells undergo complex metabolic reactions that result in the production of chemical energy, nutrients, and new structural components. They respond to internal and external stimuli in a self-preserving manner. They reproduce by passing their genetic information to descendants that resemble them. They have evolved over geological time scales (hundreds of millions of years) by the process of natural selection into a wide array of forms and life-history strategies.",
  "    The earliest plants undoubtedly evolved from an aquatic green algal ancestor (as evidenced by similarities in pigmentation, cell-wall chemistry, biochemistry, and method of cell division), and different plant groups have become adapted to terrestrial life to varying degrees. Land plants face severe environmental threats or difficulties, such as desiccation, drastic changes in temperature, support, nutrient availability to each of the cells of the plant, regulation of gas exchange between the plant and the atmosphere, and successful reproduction. Thus, many adaptations to land existence have evolved in the plant kingdom and are reflected among the different major plant groups. An example is the development of a waxy covering (the cuticle ) that covers the plant body, preventing excess water loss. Specialized tissues and cells (vascular tissue) enabled early land plants to absorb and transport water and nutrients to distant parts of the body more effectively and, eventually, to develop a more complex body composed of organs called stems , leaves, and roots . The evolution and incorporation of the substance lignin into the cell walls of plants provided strength and support. Details of the life history are often a reflection of a plant’s adaptation to a terrestrial mode of life and may characterize a particular group; for example, the most highly evolved plants reproduce by means of seeds , and, in the most advanced of all plants ( angiosperms ), a reproductive organ called a flower is formed.",
  " Bryoerythrophyllum columbianum    Informally known as bryophytes , nonvascular plants lack specialized vascular tissue ( xylem and phloem ) for internal water and food conduction and support. They also do not possess true roots , stems , or leaves . Some larger mosses , however, contain a central core of elongated thick-walled cells called hydroids that are involved in water conduction and that have been compared to the xylem elements of other plants. Bryophytes are second in diversity only to the flowering plants ( angiosperms ) and are generally regarded as composed of three divisions: Bryophtya (the mosses ), Marchantiophyta (the liverworts ), and Anthocerotophyta (the hornworts ).",
  "Because bryophytes generally lack conducting cells and a well-developed cuticle that would limit dehydration, they depend on their immediate surroundings for an adequate supply of moisture. As a result, most bryophytes live in moist or wet shady locations, growing on rocks, trees, and soil. Some, however, have become adapted to totally aquatic habitats; others have become adapted to alternately wet and dry environments by growing during wet periods and becoming dormant during dry intervals. Although bryophytes are widely distributed, occurring in practically all parts of the world, none are found in salt water. Ecologically, some mosses are considered pioneer plants because they can invade bare areas.",
  " Marchantia polymorpha  Bryophytes are typically land plants but seldom attain a height of more than a few centimetres. They possess the photosynthetic pigment chlorophyll (both a and b forms) and carotenoids in cell organelles called chloroplasts . The life histories of these plants show a well-defined alternation of generations , with the independent and free-living gametophyte as the dominant photosynthetic phase in the life cycle. (This is in contrast to the vascular plants , in which the dominant photosynthetic phase is the sporophyte .) The sporophyte generation develops from, and is almost entirely parasitic on, the gametophyte. The gametophyte produces multicellular sex organs (gametangia). Female gametangia are called archegonia ; male gametangia, antheridia. At maturity, archegonia each contain one egg , and antheridia produce many sperm cells. Because the egg is retained and fertilized within the archegonium, the early stages of the developing sporophyte are protected and nourished by the gametophytic tissue. The young undifferentiated sporophyte is called an embryo . Although bryophytes have become adapted to life on land, an apparent vestige of their aquatic ancestry is that the motile (flagellated) sperm depend on water to allow gamete transport and fertilization .",
  "Bryophytes are widely believed to have evolved from complex green algae that invaded land around 500 million years ago. Bryophytes share some traits with green algae, such as motile sperm, similar photosynthetic pigments, and the general absence of vascular tissue. However, bryophytes have multicellular reproductive structures, whereas those of green algae are unicellular, and bryophytes are mostly terrestrial and have complex plant bodies, whereas the green algae are primarily aquatic and have less-complex forms.",
  " Sphagnum flexuosum   Moss is a term erroneously applied to many different plants ( Spanish moss , a flowering plant; Irish moss , a red alga; pond moss, filamentous algae; and reindeer moss , a lichen ). True mosses are classified as the division Bryophyta .",
  "  The moss gametophyte possesses leaflike structures (phyllids) that usually are a single cell layer thick, have a costa (midrib), and are spirally arranged on a stemlike axis (caulid). The moss gametophyte is an independent plant and is the familiar, erect “leafy” shoot. Multicellular rhizoids anchor the gametophyte to the substrate. The sporophyte plant develops from the tip of the fertile leafy shoot. After repeated cell divisions, the young sporophyte (embryo) transforms into a mature sporophyte consisting of foot, elongate seta, and capsule. The capsule is often covered by a calyptra, which is the enlarged remains of the archegonium. The capsule is capped by an operculum (lid), which falls off, exposing a ring of teeth (the peristome) that regulates the dispersal of spores.",
  " Marchantia     Liverworts , the second major division of nonvascular plants, are found in the same types of habitat as mosses, and species of the two classes are often intermingled on the same site. The curious name liverwort is a relic of the medieval belief in the “doctrine of signatures,” which held that the external form of a plant provided a clue to which diseased body organ could be cured by a preparation made from that particular plant. There are two types of liverworts (also called hepatics) based on reproductive features and thallus structure. The more numerous “leafy” liverworts superficially resemble mosses, but most notably differ in having lobed or divided leaves that are without a midrib and are positioned in three rows. Thalloid (thallose) liverworts have a ribbonlike, or strap-shaped, body that grows flat on the ground. They have a high degree of internal structural differentiation into photosynthetic and storage zones. Liverwort gametophytes have unicellular rhizoids. Liverworts have an alternation of generations similar to that of mosses, and, as with mosses, the gametophyte generation is dominant. The sporophytes, however, are not microscopic and are often borne on specialized structures. They sometimes resemble small umbrellas and are called antheridiophores and archegoniophores.",
  " Dendroceros  The third division of bryophytes comprises the hornworts , a minor group numbering fewer than 100 species. The gametophyte is a small ribbonlike thallus that resembles a thallose liverwort. The name hornwort is derived from the unique slender, upright sporophytes, which are about 3–4 cm (1.2–1.6 inches) long at maturity and dehisce longitudinally into two valves that twist in response to changing humidity, thereby releasing spores in small numbers over a fairly long period of time.",
  " Hyacinthoides nonscripta Fagus sylvatica Quercus  Vascular plants ( tracheophytes ) differ from the nonvascular bryophytes in that they possess specialized supporting and water-conducting tissue, called xylem , and food-conducting tissue, called phloem . The xylem is composed of nonliving cells ( tracheids and vessel elements ) that are stiffened by the presence of lignin , a hardening substance that reinforces the cellulose cell wall. The living sieve elements that comprise the phloem are not lignified. Xylem and phloem are collectively called vascular tissue and form a central column (stele) through the plant axis. The ferns , gymnosperms , and flowering plants are all vascular plants. Because they possess vascular tissues, these plants have true stems, leaves, and roots. Before the development of vascular tissues, the only plants of considerable size existed in aquatic environments where support and water conduction were not necessary. A second major difference between the vascular plants and bryophytes is that the larger, more conspicuous generation among vascular plants is the sporophytic phase of the life cycle.",
  "The vegetative body of vascular plants is adapted to terrestrial life in various ways. In addition to vascular tissue, the aerial body is covered with a well-developed waxy layer (cuticle) that decreases water loss. Gases are exchanged through numerous pores ( stomata ) in the outer cell layer ( epidermis ). The root system is involved in the uptake from the soil of water and minerals that are used by the root system as well as the stem and leaves. Roots also anchor the plant and store food. The stem conducts water and minerals absorbed by the root system upward to various parts of the stem and leaves; stems also conduct carbohydrates manufactured through the process of photosynthesis from the leaves to various parts of the stem and root system. Leaves are supported by the stem and are oriented in a manner conducive to maximizing the amount of leaf area involved in trapping sunlight for use in photosynthesis.",
  "Modifications of roots, stems, and leaves have enabled species of vascular plants to survive in a variety of habitats encompassing diverse and even extreme environmental conditions. The ability of vascular plants to flourish in so many different habitats is a key factor in their having become the dominant group of terrestrial plants.",
  "The vascular plants are divisible into the nonseed plants ( lower vascular plants , or cryptogams) and those that reproduce by seeds (higher vascular plants, or phanerogams). The ferns (Polypodiopsida) are a group of the lower vascular plants; other groups include the whisk ferns (Psilotophyta), club and spike mosses (Lycophyta), and horsetails (Sphenophyta, or Arthrophyta). Collectively, the latter four groups are sometimes referred to as pteridophytes, because each reproduces by spores liberated from dehiscent sporangia (free sporing). Although the lower vascular plants have adapted to terrestrial life, they are similar to bryophytes in that, as an apparent vestige of their aquatic ancestry, all produce motile (flagellated) male gametes (antherozoids, or sperm) and must rely on water for fertilization to take place.",
  " Selaginella  This class is represented by three living orders, the principal genera being Lycopodium ( club mosses ), Selaginella ( spike mosses ), and Isoetes ( quillworts ). Extant members of Lycopodiopsida occur in both temperate and tropical regions and represent the survivors of a group of vascular plants that was extremely diverse and numerous. As a group, the lycophytes were prominent in the great coal-forming swamp forests of the Carboniferous Period (358.9 million to 298.9 million years ago). Although all living lycophytes are small herbaceous plants, some extinct types were large trees. Lycophytes are differentiated into stem, root, and leaf (microphylls). Sporangia are positioned on the upper (adaxial) surface of the leaf (sporophyll). Some species form distinct cones or strobili, whereas others do not.",
  " Dryopteris dilatata    Ferns are a diverse group of plants. Although they have a worldwide distribution, ferns are more common in tropical and subtropical regions. They range in size and complexity from small floating aquatic plants less than 2 cm (0.8 inch) long to tall tree ferns 20 metres (65 feet) high. Tropical tree ferns possess erect columnar trunks and large compound (divided) leaves more than 5 metres (about 16 feet) long. As a group, ferns are either terrestrial or epiphytic (growing upon another plant). Fern stems never become woody (composed of secondary tissue containing lignin), because all tissues of the plant body originate at the stem apex.",
  "  Ferns of the subclass Polypodiidae, known as leptosporangiate ferns, typically possess a rhizome (horizontal stem) that grows partially underground; the deeply divided fronds (leaves) and the roots grow out of the rhizome. Fronds are characteristically coiled in the bud (fiddleheads) and uncurl in a type of leaf development called circinate vernation. Fern leaves are either whole or variously divided. The leaf types are differentiated into rachis (axis of a compound leaf), pinnae (primary divisions), and pinnules (ultimate segments of a pinna). Fern leaves often have prominent epidermal hairs and large chaffy scales. Venation of fern leaves is usually open dichotomous (forking into two equal parts).",
  "Each frond is a potential sporophyll (spore-bearing leaf) and as such can bear structures that are associated with reproduction. When growth conditions are favourable, a series of brown patches appear on the undersurface of the sporophylls. Each one of the patches (called a sorus ) is composed of many sporangia, or spore cases, which are joined by a stalk to the sporophyll. The spore case is flattened, with a layer of sterile, or nonfertile, cells surrounding the spore mother cells. Each spore mother cell divides by reduction division ( meiosis ) to produce haploid spores, which are shed in a way characteristic to the ferns.",
  "Each fern spore has the potential to grow into a green heart-shaped independent gametophyte plant (prothallus) capable of photosynthesis. In contrast to bryophytes , in which the sporophyte is nutritionally dependent on the gametophyte during its entire existence, the fern sporophyte is dependent on the gametophyte for nutrition only during the early phase of its development; thereafter, the fern sporophyte is free-living. In some ferns the sexes are separate, meaning a gametophyte will bear only male or female sex organs. Other species have gametophytes bearing both sex organs. Features important in the identification of ferns include such aspects of the mature sporophyte plant as differences in the stem, frond, sporophyll, sporangium, and position of the sporangium and the absence or presence, as well as the shape, of the indusium (a membranous outgrowth of the leaf) covering the sporangia.",
  " Psilotum nudum  Psilotales ( whisk ferns ) is an order represented by two living genera ( Psilotum and Tmesipteris ) and several species that are restricted to the subtropics. This unusual group of small herbaceous plants is characterized by a leafless and rootless body possessing a stem that exhibits a primitive dichotomous type of branching: it forks into equal halves. The photosynthetic function is assumed by the stem, and the underground rhizome anchors the plant. The vascular tissue is organized into a poorly developed central cylinder in the stem.",
  "Equisetales (also called horsetails and scouring rushes) is an order represented by a single living genus (  Equisetum  ). It has a worldwide distribution but occurs in greater variety in the Northern Hemisphere. Like the lycophytes, this group was a diverse and prominent group of vascular plants during the Carboniferous Period , when some genera attained great size in the coal-forming swamp forests. Known as sphenophytes, these plants are differentiated into stem, leaf (microphylls), and root. Green aerial stems have longitudinal ridges and furrows extending the length of the internodes, and stems are jointed (articulated). Surface cells are characteristically filled with silica. Branches, when they occur, are borne in whorls at the node, as are the scale leaves. Sporangia are borne in terminal strobili. Equisetales had its origin in the Devonian Period (419.2 million to 358.9 million years ago).",
  "Known as giant ferns, the order Marattiales comprises a single extant family with six genera and some 150 species of large tropical and subtropical ferns with stout erect stems. The leaves (fronds) may be very large, some reaching 4.5 metres (15 feet) or more in length. The Marattiaceae generally are considered to be one of the most primitive families of ferns still living.",
  "     Gymnosperms and angiosperms (flowering plants) share with ferns a dominant, independent sporophyte generation; the presence of vascular tissue; differentiation of the plant body into root, stem, and leaf derived from a bipolar embryo (having stem and root-growing apices); and similar photosynthetic pigments. Unlike ferns, however, the seed plants have stems that branch laterally and vascular tissue that is arranged in strands (bundles) around the pith (eustele). Among seed plants, as in ferns, the stem tissues that arise directly from the shoot apex are called primary tissues. Primary tissues contribute to the longitudinal growth of the stem, or primary growth. Secondary growth, resulting in an increase in the width of the axis, is produced by meristematic tissue between the primary xylem and phloem called vascular cambium. This meristem consists of a narrow zone of cells that form new secondary xylem (wood) and secondary phloem (secondary vascular tissues).",
  "  Major evolutionary advancements of these plants are demonstrated by the generally more complex plant body and by reproduction via seeds . Seeds represent an important evolutionary innovation within the plant kingdom. Each seed has an embryonic plant (sporophyte), food-storage tissue, and hardened protective covering (seed coat). The seed thus contains and protects the embryonic plant and, as the primary dispersal unit of the seed plants, represents a significant improvement over the spore, with its limited capacity for survival.",
  " In comparing ferns and seed plants and their life histories, certain significant differences are seen. The gametophyte in seed plants has been reduced in size, usually consisting of a few to a dozen cells. Thus, it is no longer itself a plant body, as in the bryophytes and ferns. The gametophyte is not free-living but is embedded in the sporophyte and thus less vulnerable to environmental stress than the gametophytes of bryophytes and ferns. Finally, the spores of seed plants are male and female, as are the sporangia that contain them. The spores are not dispersed as in the bryophytes and ferns but develop into gametophytes within the sporangia. In the most advanced seed plants, the male gametes (sperm) are carried to the egg by a later extension of the pollen grain called the pollen tube. The advantage of this system is that the nonflagellated sperm are no longer dependent on water to reach the egg.",
  " Festuca pratensis  Eurema proterpia Machaeranthera tephrodes   Another terrestrial adaptation of the seed plants not found in ferns is pollen dispersed by wind or animals. Pollen is a unit of genetic material as well as part of the seed-formation process. The dispersal of pollen by wind or animals, in addition to dispersal of seeds, promotes genetic recombination and distribution of the species over a wide geographic area.",
  " Pseudotsuga  The term  gymnosperm  (“naked seeds”) represents four extant divisions of vascular plants whose ovules (seeds) are exposed on the surface of cone scales. The cone-bearing gymnosperms are among the largest and oldest living organisms in the world. They dominated the landscape about 200 million years ago. Today gymnosperms are of great economic value as major sources of lumber products, pulpwood, turpentine, and resins.",
  " Conifer stems are composed of a woody axis containing primitive water- and mineral-conducting cells called tracheids . Tracheids are interconnected by passages called bordered pits. Leaves are often needlelike or scalelike and typically contain canals filled with resin . The leaves of pine are borne in bundles (fascicles), and the number of leaves per fascicle is an important distinguishing feature. Most gymnosperms are evergreen, but some, such as larch and bald cypress, are deciduous (the leaves fall after one growing season). The leaves of many gymnosperms have a thick cuticle and stomata below the leaf surface.",
  "The tree or shrub is the sporophyte generation. In conifers, the male and female sporangia are produced on separate structures called cones or strobili. Individual trees are typically monoecious (male and female cones are borne on the same tree). A cone is a modified shoot with a single axis, on which is borne a spirally arranged series of pollen- or ovule-bearing scales or bracts. The male cone, or microstrobilus, is usually smaller than the female cone (megastrobilus) and is essentially an aggregation of many small structures (microsporophylls) that encase the pollen in microsporangia.",
  " Cycas revoluta  The extant cycads (division Cycadophyta) are a group of ancient seed plants that are survivors of a complex that has existed since the Mesozoic Era (251.9 million to 66 million years ago). They are presently distributed in the tropics and subtropics of both hemispheres. Cycads are palmlike in general appearance, with an unbranched columnar trunk and a crown of large pinnately compound (divided) leaves. The sexes are always separate, resulting in male and female plants (i.e., cycads are dioecious). Most species produce conspicuous cones (strobili) on both male and female plants, and the seeds are very large.",
  " Ginkgo biloba  The ginkgophytes (division Ginkgophyta), although abundant, diverse, and widely distributed in the past, are represented now by a sole surviving species,  Ginkgo biloba  (maidenhair tree). The species was formerly restricted to southeastern China, but it is now likely extinct in the wild. The plant is commonly cultivated worldwide, however, and is particularly resistant to disease and air pollution . The ginkgo is multibranched, with stems that are differentiated into long shoots and dwarf (spur) shoots. A cluster of fan-shaped deciduous leaves with open dichotomous venation occurs at the end of each lateral spur shoot. Sexes are separate, and distinct cones are not produced. Female trees produce plumlike seeds with a fleshy outer layer and are noted for their foul smell when mature.",
  " Ephedra fragilis  The gnetophytes (division Gnetophyta) comprise a group of three unusual genera.  Ephedra  occurs as a shrub in dry regions in tropical and temperate North and South America and in Asia, from the Mediterranean Sea to China. Species of Gnetum occur as woody shrubs, vines, or broad-leaved trees and grow in moist tropical forests of South America, Africa, and Asia. Welwitschia , restricted to extreme deserts (less than 25 mm [1 inch] of rain per year) in a narrow belt about 1,000 km (600 miles) long in southwestern Africa, is an unusual plant composed of an enormous underground stem and a pair of long strap-shaped leaves that lie along the ground. The three genera differ from all other gymnosperms in possessing vessel elements (as compared with tracheids) in the xylem and in specializations in reproductive morphology. The gnetophytes have figured prominently in the theories about gymnospermous origins of the angiosperms.",
  " Nelumbo nucifera  Corypha umbraculifera     Approximately 130 million years ago, flowering plants (angiosperms) evolved from gymnosperms, although the identity of the specific gymnospermous ancestral group remains unresolved. The primary distinction between gymnosperms and angiosperms is that angiosperms reproduce by means of flowers . Flowers are modified shoots bearing a series of leaflike modified appendages and containing ovules (immature seeds) surrounded and protected by the female reproductive structure, the carpel or pistil . Along with other features, angiospermy, the enclosed condition of the seed, gave the flowering plants a competitive advantage and enabled them to come to dominate the extant flora. Flowering plants have also fully exploited the use of insects and other animals as agents of pollination (the transfer of pollen from male to female floral structures). In addition, the water-conducting cells and food-conducting tissue are more complex and efficient in flowering plants than in other land plants. Finally, flowering plants possess a specialized type of nutritive tissue in the seed, endosperm . Endosperm is the chief storage tissue in the seeds of grasses; hence, it is the primary source of nutrition in corn (maize), rice , wheat , and other cereals that have been utilized as major food sources by humans and other animals.",
  "  Many of the flowering plants are commonly represented by two basic groups, the monocotyledons and the dicotyledons, distinguished by the number of embryonic seed leaves ( cotyledons ), number of flower parts, arrangement of vascular tissue in the stem, leaf venation, and manner of leaf attachment to the stem. However, one of the major changes in the understanding of the evolution of the angiosperms was the realization that the basic distinction among flowering plants is not between monocotyledon groups (monocots) and dicotyledon groups (dicots). Rather, plants thought of as being “typical dicots” have evolved from within another group that includes the more-basal dicots and the monocots together. This group of typical dicots is now known as the eudicots, and molecular-based evidence supports their having a single evolutionary lineage (monophyletic). Other angiosperm groups, such as the Magnoliids , do not fit the traditional paradigm of monocot and dicot and are considered to have more-ancient lineages.",
  "  The plant body of angiosperms consists of a central axis of two parts, the shoot and the root . Shoots have two kinds of organs, the stem and the leaves , while roots have one type of organ, the root itself. Systems of classification are often based upon the longevity of the portions of plant aboveground. Woody plants are trees and shrubs whose shoots are durable and survive over a period of years. They are further classified into deciduous and evergreen plants. Deciduous plants drop their leaves at the end of every growing season, whereas evergreens keep their leaves for up to several years. Herbaceous plants have soft, flexible aerial portions and commonly die back each year.",
  "Another system of classification, based on the duration of the life history, is particularly applicable to angiosperms of the temperate region. Annuals are plants that complete the entire life history ( germinate from seeds, mature, flower, and produce seed) in one growing season. Examples of annuals are corn , wheat , and peas . Biennials complete their life history in two seasons, blooming during the second season. Beets , celery , cabbage , carrots , and turnips are biennials, but their flowers are rarely seen because they are harvested during the first season. Annuals and biennials are both generally herbaceous plants. Perennials are plants that live from year to year. Trees and shrubs are perennials, but some herbaceous plants are also perennials.",
  " Solanum tuberosum  Allium cepa  Trifolium repens    A number of modifications of the stem occur in angiosperms, and many of these modifications provide a means for herbs to become dormant and survive for a period of years. Rhizomes are horizontally growing underground stems that serve as organs of asexual reproduction and food storage. Similar to rhizomes, tubers are thickened underground stem portions that primarily serve as food storage (for example, potato ). Corms are short upright underground stems surrounded by a few thin scale leaves (as in  Crocus  and  Gladiolus  ). Bulbs have a greatly reduced stem with thick fleshy scale leaves surrounding it (as in the onion ). Runners and stolons are surface stems characteristic of such plants as strawberries ; new plants may form on the runner or stolon as it spreads along the ground. Many of the most prolific weeds have runners or stolons by which they propagate asexually.",
  "    In herbaceous dicotyledonous stems, the vascular conducting tissue ( xylem and phloem ) is organized into discrete strands or vascular bundles, each containing both xylem and phloem. The cells between the vascular bundles are thin-walled and often store starch . The peripheral region of cells in the stem is called the cortex; cells of the central portion make up the pith. The outermost cells of the stem compose the epidermis. No bark is formed on the herbaceous stem. In contrast, woody dicot stems develop an outer layer of dead thick-walled cells called cork cells, which together with the underlying phloem compose the bark of the tree. The major portion of the woody stem’s diameter is a cylinder of xylem (wood) that originates from a region of cell division called the vascular cambium . The water-conducting cells that make up the xylem are nonliving. The accumulated xylem often forms annual rings composed of two zones: a relatively wide zone of spring wood (made up of large cells, characteristic of rapid growth) and a narrower zone of summer wood (smaller cells). Such rings may be absent in tropical trees that grow all year round. Xylem rays, radiating like spokes of a wagon wheel, are formed in the xylem and connect with the peripheral phloem. Stems of monocotyledons are composed of numerous vascular bundles that are arranged in a seemingly scattered manner within the ground tissue. Monocot vascular bundles lack a vascular cambium, and monocot stems thus do not become woody in a manner similar to dicots.",
  "  Leaves are the other plant organ that, along with stems, constitutes the shoot of the vascular plant body. Their principal function is to act as the primary site of photosynthesis in the plant. Leaves of dicots possess a network of interconnecting veins and minor veins between the larger veins of the leaf (a pattern called net venation). Leaves of monocots possess major veins that extend parallel to the long axis of the leaf (parallel venation). Leaves are classified on the basis of leaf arrangement and whether they are simple or compound. A leaf may be deeply lobed but still simple; a compound leaf is composed of two or more distinctly separate leaflets.",
  "  Structurally, leaves are composed of an outermost layer of cells called the epidermis. Epidermal cells secrete a waxy substance (cutin) that forms a cuticle impermeable to water. The pores (stomata) in the epidermis that allow for gas exchange are formed between specialized epidermal cells called guard cells. Vascular bundles (veins) are embedded in the mesophyll, the tissue that includes all of the cells between the upper and lower epidermis. The cells of the mesophyll contain the photosynthetic pigments.",
  "  The root system begins its development from the embryonic root (radicle), which grows out of the seed after the seed has absorbed water. This is the primary root of a new plant. The tip of the root is covered by a mass of loose cells called the root cap. Just beneath the root cap is the region of cell division of the root. Epidermal outgrowths just above the root tip are root hairs that are active in water and mineral absorption. Two types of root systems are commonly distinguished, fibrous roots and taproots . Fibrous root systems are composed of large numbers of roots nearly equal in size; root systems of this type are found, for example, in the grasses. A taproot system is one in which the primary root remains the largest, and a number of smaller secondary roots are formed from it; taproots are found in such plants as carrots and dandelions. Roots that arise other than by branching from the primary roots are called adventitious roots. The prop roots of corn, for example, are adventitious.",
  "  As noted above, a primary distinction between the gymnosperms and the angiosperms is that the latter have flowers . Flowers represent modified shoots that have become differentiated for reproduction. The flower bears whorls of floral organs attached to a receptacle, the expanded end of a flower stalk on which the flower parts are borne. Sepals (collectively called the calyx) are modified leaves that encase the developing flower. They are sterile floral parts and may be either green or leaflike or composed of petal-like tissue. Petals (collectively called the corolla) are also sterile floral parts that usually function as visually conspicuous elements serving to attract specific pollinators to the flower. The calyx and the corolla together are referred to as the perianth. Flowers that lack one or both of the above perianth parts are called incomplete. Stamens (collectively called the androecium) are the male parts of the flower. Stamens are composed of saclike anthers (microsporangia) and filaments, which are stalks that support the anthers. Anthers are usually compartmentalized and contain the pollen grains (microgametophytes). The pistil , or female part of the flower, is composed of one or a number of carpels (collectively called the gynoecium) that fuse to form an essentially enclosed chamber. The three regions of the pistil (from the base up) are the ovary , which contains the ovules; the style, a stalked structure atop the ovary that elevates the stigma; and the stigma, a sticky knob whose surface receives the pollen during pollination.",
  "Flowers may contain both male and female parts (a condition called perfect) or parts related to just one sex (imperfect), or they may have no sexual parts (sterile). Female and male flowers may be located on separate plants (dioecious) or on the same plant (monoecious). Flowers can also be borne singly or in aggregations called inflorescences.",
  "Primitive flowers are radially symmetrical (actinomorphic) and are characterized by numerous spirally arranged floral parts. Floral parts are free (unfused) and are borne on an elongated floral axis. Sepals, petals, and stamens are attached below the ovary. Advanced flowers are bilaterally symmetrical and are characterized by a reduction in the number of floral parts. Floral parts are fused (often forming a long floral tube). Sepals, petals, and stamens are attached to the floral tube above the ovary.",
  "   Pollination is the transfer of pollen to the stigma of the same or another flower. Agents of pollination encompass a vast and diverse array of animals, including insects , birds , bats , honey possums, and slugs . Flowers exhibit various adaptations to pollinators, such as showy corollas, the production of nectar (a sugary liquid), and even visual cues visible only to insects that can perceive ultraviolet wavelengths of light. Flowers pollinated by wind generally are small and lack petals. The stigma is the pollen receptor site and must be chemically compatible with any pollen that lands on it for the pollen grain to germinate. This ensures that only genetically compatible sperm are transferred to the egg.",
  " Carica papaya  Triticum aestivum   In flowering plants, ovules are enclosed and protected in an ovary. As the ovule develops into a seed, the ovary matures into a fruit . The formation of fruits is a characteristic feature of the flowering plants. Fruits are extremely variable. In some fruits, the ovary wall (pericarp) is thick and fleshy; in others, it is thin and dry.",
  " Ceiba pentandra  Rhizophora mangle   Angiosperms have evolved many adaptations for seed dispersal involving such agents as wind, water, and animals. Adaptations to wind dispersal include wings or plumules attached to the seed or as part of the fruit or simply very minute seeds that are easily windborne. Adaptations to water dispersal are seeds that float or fruits that float and carry the seeds with them. Some seeds are a source of food to animals, which bury the seeds in the ground, where they later germinate. Other plants produce a fleshy fruit that is eaten along with the seeds inside it by animals, which pass the seeds through their digestive tracts unharmed. Another adaptation for animal dispersal is the development of barbed fruits or seeds that stick to the coats or skins of wandering animals. Some plants, such as witch hazels or jewelweed, can project their seeds through the air some distance from the parent plant.",
  "Seeds have many adaptations that enable them to survive long periods of harsh conditions. Seeds can remain viable in a dormant condition for a few days or, in some species, for hundreds of years. (For further information on seeds and fruits, see  Reproductive system, plant .)",
  "Each organism from inception to death goes through a sequence of genetically programmed developmental events constituting a life history. In eukaryotic organisms , development involves cellular events such as mitosis , meiosis , and syngamy ( fertilization ), which variously proceed by nuclear division (karyokinesis), cytoplasmic division ( cytokinesis ), cytoplasmic fusion without the union of nuclei (plasmogamy), or nuclear fusion (karyogamy).",
  "This discussion focuses on the life histories of land plants—that is, nonvascular ( bryophytes ) and vascular plants , the latter comprising nonseed vascular plants ( pteridophytes ) and seed plants ( gymnosperms and angiosperms ). Although algae and fungi were traditionally regarded as plants, fungi are now universally considered as constituting the kingdom Fungi, whereas algae are included in the kingdom Protista .",
  "The chromosome number in cells may be haploid, with one set of chromosomes per cell (written 1 n ); diploid, with two sets (2 n ); polyploid , with three or more sets; or dikaryotic, with a pair of nuclei in a cell ( n + n ), a condition that occurs mainly in fungi. Three types of sexual life histories have been recognized for the eukaryotic organisms: 1 n , or haplontic; 2 n , or diplontic; and 1 n -2 n (2 n -1 n ). The former two types have collectively been called haplobiontic or monobiontic, because the life histories include only one phase; the third type has been called haplodiplontic, diplohaplontic, diplobiontic, dibiontic, or sporic, because the life history involves two alternating multicellular phases, or generations. Algae and fungi have many variants of all three types, especially the first, whereas land plants have the third type exclusively. In addition, all land plants are strictly oogamous, having motile sperm and nonmotile eggs. (In contrast, the algae and fungi may be oogamous or, frequently, isogamous or anisogamous, the latter conditions characterized by morphologically similar gametes that are either of the same size or with the female gametes of a larger size, respectively.)",
  "The 1 n -2 n life history of bryophytes and vascular plants comprises the entire sequence of developmental events from zygote formation via syngamy (fertilization) to spore formation via meiosis . Syngamy and meiosis are successive events in a sexual life history. Syngamy involves the union of two 1 n  gametes to form a 2 n  zygote , which eventually develops into a 2 n  sporophyte . Meiosis involves the division of a 2 n sporocyte (meiocyte, spore mother cell, pollen mother cell) to produce four 1 n spores. These four spores constitute a tetrad. Gametes are 1 n cells that fuse to form a zygote, whereas spores are 1 n cells that develop into gametophytes without uniting with another cell.",
  " Syngamy and meiosis are generally inseparable and alternate; consequently, the sporophyte develops from a zygote formed via syngamy, whereas the haploid gametophyte results after the sporophyte has undergone meiosis to form spores. These two phases, or generations, are multicellular in land plants. This type of life history involves an alternation of generations , a phenomenon not occurring in haplobiontic (1 n or 2 n ) life histories. In the latter, such alternation is evident in both the morphological and the nuclear (chromosomal) changes that occur.",
  "Meiosis and syngamy (fertilization) are the critical events that separate the sporophytic and gametophytic generations. (All nonmeiotic cell divisions involved in development are mitotic , in which chromosomes replicate, giving each daughter cell a full complement.) The zygote is the first stage and the sporocyte the last stage of the sporophytic generation, whereas the spore is the first stage and the gametes (eggs, sperm) the last stage of the gametophytic generation. The sporocytes of the multicellular 2 n sporophyte divide meiotically to form 1 n spores (sporogenesis). Each meiotic division results in a tetrad of four spores. (The land plants produce only sexual spores resulting from meiosis.) Each spore divides mitotically to form a multicellular 1 n gametophyte, which eventually produces gametes mitotically (gametogenesis). The gametes (an egg and a sperm) fuse in the process of syngamy to form a 2 n zygote. The zygote divides mitotically to form a multicellular embryo (embryogenesis), which is protected by either gametophytic tissues (such as remnants of archegonia in the nonseed land plants) or sporophytic tissues (the seed in the seed plants). An embryo, which is actually an immature sporophyte, is universally found among the land plants and often becomes dormant but eventually grows into the mature sporophyte. During organogenesis in vascular plants, the embryo develops into the mature sporophyte, with its vegetative organs ( root and shoot, the latter consisting of stem and leaves ) and reproductive structures ( cones or strobili, flowers , etc.).",
  "In all land plants, the two alternating generations are morphologically dissimilar. In all bryophytes , the gametophyte remains dominant, and the sporophyte is physiologically dependent on it. A homosporous life history, in which only one morphological type of spore is produced, is found in most bryophytes, although a few (e.g., Macromitrium ) exhibit an anisosporous life history, in which the same sporangium produces morphologically similar spores of two different sizes.",
  "In vascular plants , the sporophyte ultimately becomes physiologically independent of the gametophyte. A homosporous life history occurs in  Psilotum  (Psilotophyta), Lycopodium ( Lycophyta ), Equisetum (Sphenophyta), and most ferns (Pteridophyta). A functionally heterosporous life history, in which the same sporangium produces morphologically similar but physiologically different spores, has been reported in a few pteridophytes—e.g., Equisetum . Finally, a heterosporous life history, in which different sporangia produce morphologically different types of spores, occurs in Selaginella , Isoetes (Lycophyta), a few aquatic ferns (Filicophyta), and all seed plants.",
  "A homosporous life history occurs in nearly all bryophytes and in most pteridophytes (lower vascular plants). It is characterized by morphologically identical spores that germinate to produce bisexual (both male and female) gametophytes in pteridophytes but either bisexual or, more usually, unisexual (either male or female) gametophytes in bryophytes. Each mature gametophyte bears gametangia (sex organs) that produce gametes. Each antheridium (male gametangium) forms many motile flagellate sperm, and each archegonium (female gametangium) forms one nonmotile egg. Fusion of an egg and a sperm (syngamy) creates a zygote and restores the 2 n ploidy level. Various mechanisms prevent the fusion of eggs and sperm from a bisexual gametophyte ( inbreeding ). For example, the sex organs may mature at different times (usually antheridia mature first), or inbreeding may be chemically or genetically inhibited. The zygote divides mitotically to form the embryo, which then develops into the sporophyte. This eventually produces sporangia, which bear meiocytes (sporocytes) that divide meiotically to form spores. The number of spores produced per sporangium ranges from 16 or 32 in some pteridophytes to more than 65 million in some mosses . The sporangia may be borne in specialized structures, such as sori in ferns or as cones (strobili) in many other pteridophytes. The leaflike structures that bear sporangia are called sporophylls.",
  "In most homosporous life histories of pteridophytes, the spores are both morphologically and physiologically identical and produce bisexual gametophytes. In some species of horsetail ( Equisetum ), the spores may be physiologically different and produce male or female gametophytes. This uncommon situation is called functional heterospory and may represent the means by which the heterosporous condition in vascular plants evolved from the homosporous condition.",
  "In anisosporous life histories, an unusual phenomenon in bryophytes, there is a size difference between spores produced in the same sporangium. Each meiotic division results in a tetrad of two small spores that produce male gametophytes and two larger spores that produce female gametophytes.",
  "A heterosporous life history occurs in some pteridophytes and in all seed plants. It is characterized by morphologically dissimilar spores produced from two types of sporangia: microspores, or male spores, and megaspores (macrospores), or female spores. In pteridophytes, megaspores are typically larger than microspores, but the opposite is true in most seed plants.",
  " Picea  The spores produce two types of gametophytes: each microspore develops into a microgametophyte (male gametophyte), which ultimately produces male gametes (sperm), and each megaspore produces a megagametophyte (female gametophyte), which ultimately produces female gametes (eggs). Fusion of an egg and a sperm creates a zygote and restores the 2 n ploidy level. The zygote divides mitotically to form the embryo, which then develops into the sporophyte. Eventually the sporophyte produces sporangia, which bear sporocytes (meiocytes) that undergo meiosis to form spores. Microsporangia (male sporangia) produce microsporocytes (micromeiocytes) that yield microspores. Megasporangia (female sporangia) produce megasporocytes (megameiocytes) that yield megaspores. The sporangia may be borne in specialized structures such as sori in ferns, cones (strobili) in some pteridophytes and most gymnosperms , or flowers in angiosperms . The leaflike structures bearing microsporangia and megasporangia are called, respectively, microsporophylls and megasporophylls. In angiosperms these sporophylls represent, respectively, the stamens and the carpels of the flower; in gymnosperms these sporophylls may constitute parts of, respectively, microstrobili (male cones, or pollen cones) and megastrobili (female cones, ovule cones, or seed cones).",
  "The essential difference between the homosporous and heterosporous life history is the presence in the latter of two spore types (microspores and megaspores) and their concomitant precursory structures (microsporocytes and megasporocytes; microsporangia and megasporangia; etc.) and subsequent structures (microgametophytes and megagametophytes).",
  "The gymnosperms and angiosperms not only lack some reproductive structures found in the homosporous and heterosporous pteridophytes but also have certain reproductive structures peculiar to the seed plants. Heterosporous pteridophytes, like their homosporous counterparts, have archegonia, antheridia, and motile flagellate sperm. The seed plants completely lack antheridia, and of the extant groups only the ginkgo and the cycads have flagellate sperm. Archegonia occur in most gymnosperms except  Gnetum  and  Welwitschia  , but they are lacking in all angiosperms.",
  "   Pollen grains and pollen tubes (male reproductive structures), ovules and seeds (female reproductive structures), and seedlings are structures unique to all seed plants. The ovule is a single megasporangium (in seed plants, this is called the nucellus) surrounded by one or two integuments (in rare cases, none or three) and containing inside the nucellus a single megasporocyte (spore mother cell). The megasporocyte undergoes meiosis to form four megaspores, three of which typically degenerate, the remaining one developing into the megagametophyte (female gametophyte). Ovules never dehisce (split open) to release their megaspores, unlike the megasporangia of most pteridophytes. The pollen grain is the partly or completely developed microgametophyte (male gametophyte). It is usually multicellular, consisting of two or three cells in angiosperms and usually two to five cells in gymnosperms, although in conifers it is occasionally one cell (for example, the families Taxaceae and some Cupressaceae ) or 6 to 43 cells (the families Araucariaceae and some Podocarpaceae ).",
  "  During pollination , pollen is transferred from its source to a receptive surface: in gymnosperms from the microsporangium to the integument or, especially, the pollination droplet of the ovule (rarely to the cone scale); in angiosperms from the microsporangium (pollen sac) of the anther to the stigma of the carpel. Once pollen has reached the appropriate receptive source, it germinates to form the pollen tube, a structure that grows toward the megagametophyte and in so doing conveys the sperm directly to the egg. All angiosperms and most gymnosperms, except ginkgo, cycads, and some fossil seed plants, lack swimming sperm. The presence of swimming sperm apparently represents a more primitive transitional evolutionary condition. After fertilization, the ovule transforms into a seed. The integument or integuments become modified into the seed coat. The seed typically becomes dormant for a period of time before it germinates to produce a seedling.",
  "Double fertilization is a phenomenon unique to angiosperms. Each pollen grain produces two sperm; one fuses with an egg to form the zygote, and the other fuses with one or more polar nuclei in the female gametophyte (megagametophyte, or also “embryo sac”) to form an endosperm, which has a ploidy level that varies from 2 n to 15 n . In approximately 70 percent of the known cases, the second sperm fuses with two endosperm nuclei to produce a 3 n (triploid) endosperm. The endosperm is a special nutritive tissue for the embryo and, after seed germination , for the seedling. In contrast, the megagametophyte is the comparable nutritive tissue in the gymnosperms.",
  "  Both homosporous and heterosporous life histories may exhibit various types of asexual reproduction (vegetative reproduction, somatic reproduction). Asexual reproduction is any reproductive process that does not involve meiosis or the union of nuclei, sex cells, or sex organs. Depending on the type of life history, asexual reproduction can involve the 1 n or 2 n generation.",
  "The significance of sexual reproduction is that it is responsible for the genetic variation arising in a population as a result of the segregation and recombination of genetic material via meiosis and syngamy, respectively (the cells that result from sexual reproduction are genetically different from their parent cells). The significance of asexual reproduction is that it is a means for a rapid and significant increase in the numbers of individuals. (Many weeds and invasive species , for instance, are successful partly because of their great capacity for vegetative reproduction.) The cells that result from asexual reproduction are genetically identical to their parent cells. In addition, vegetative reproduction in the bryophytes and pteridophytes is a means of bypassing the somewhat lengthy and moisture-dependent sexual process; that is, the motile swimming sperm characteristic of these groups require the presence of water, which may be a limiting factor in drier times.",
  "In most life histories, a 2 n  sporophyte typically alternates with a 1 n  gametophyte , but there are significant deviations. Apospory is the development of 2 n gametophytes, without meiosis and spores, from vegetative, or nonreproductive, cells of the sporophyte. In contrast, apogamy is the development of 1 n sporophytes without gametes and syngamy from vegetative cells of the gametophyte. The 2 n aposporous gametophytes and the 1 n apogamous sporophytes are usually infertile under natural conditions because of disruption of cytological events. Various compensating genetic mechanisms, however, may occur to complete the life history. Parthenogenesis is the formation of a 1 n embryo directly from an unfertilized egg. Apospory and apogamy occur in bryophytes, pteridophytes, and angiosperms, whereas parthenogenesis occurs in ferns and angiosperms. Apogamy is more common in pteridophytes, but apospory is more common in bryophytes.",
  "Some ferns (certain species of Trichomanes and Vittaria ) have lost the ability to produce sporophytes. The species exist as gametophytes that spread by gemmae (units of asexual reproduction); although gametangia are produced, no sporophytes result.",
  "  Plant nutrition includes the nutrients necessary for the growth, maintenance, and reproduction of individual plants; the mechanisms by which plants acquire such nutrients; and the structural, physiological, and biochemical roles those nutrients play in metabolism .",
  "All organisms obtain their nutrients from the environment, but not all organisms require the same nutrients, nor do they assimilate these nutrients in the same way. There are two basic nutritional types, autotrophs and heterotrophs . Heterotrophs require both inorganic and organic ( carbon -containing) compounds as nutrient sources. Autotrophs obtain their nutrients from inorganic compounds, and their source of carbon is carbon dioxide (CO 2 ). An autotroph is photoautotrophic if light energy is required to assimilate CO 2 into the organic constituents of the cell . Furthermore, a photoautotroph that also uses water and liberates oxygen in the energy-trapping process of photosynthesis is an oxygenic photoautotroph. Earth’s first such organisms are believed to have been the major sources of the present-day oxygen content of the atmosphere (approximately 21 percent). Almost all plants, as well as many prokaryotes and protists , are characteristically oxygenic photoautotrophs.",
  "Plants, as autotrophic organisms, use light energy to photosynthesize sugars from CO 2 and water. They also synthesize amino acids and vitamins from carbon fixed in photosynthesis and from inorganic elements garnered from the environment. ( Animals , as heterotrophic organisms, cannot synthesize many nutrients, including certain amino acids and vitamins, and so must take them from the environment.)",
  "Certain key elements are required, or essential, for the complex processes of metabolism to take place in plants. Plant physiologists generally consider an element to be essential if (1) the plant is unable to complete its life cycle (i.e., grow and reproduce) in its absence; (2) the particular structural, physiological, or biochemical roles of the element cannot be satisfied by any other element; and (3) the element is directly involved in the plant’s metabolism (e.g., as part of an enzyme or other essential organic cellular constituent). Beneficial elements are those that stimulate plant growth by ameliorating the toxic effects of other elements or by substituting for an element in a less-essential role (e.g., as a nonspecific osmotic solute). Some elements are beneficial in that they are necessary for the growth of some, but not all, plant species.",
  "The required concentrations of each essential and beneficial element vary over a wide range. The essential elements required in relatively large quantities for adequate growth are called macroelements. Nine minerals make up this group: carbon (C), hydrogen (H), oxygen (O), nitrogen (N), potassium (K), calcium (Ca), magnesium (Mg), phosphorus (P), and sulfur (S). Eight other essential mineral elements are required in smaller amounts (0.01 percent or less) and are called microelements. These are iron (Fe), chlorine (Cl), manganese (Mn), boron (B), copper (Cu), molybdenum (Mo), zinc (Zn), and nickel (Ni). The specific required percentages may vary considerably with species, genotype (or variety), age of the plant, and environmental conditions of growth.",
  "A macronutrient is the actual chemical form or compound in which the macroelement enters the root system of a plant. The macronutrient source of the macroelement nitrogen, for example, is the nitrate ion (NO 3  − ); alternatively, nitrogen is taken up as the ammonium ion (NH 4  + ) or as amino acids. Carnivorous plants use nitrogen from the proteins and nucleic acids of the prey they catch. Carbon dioxide from the atmosphere provides the carbon and oxygen atoms. Water taken from the soil provides much of the hydrogen. Soil provides macroelements and microelements from mineral complexes, parent rock, and decaying organisms. Factors that determine plant root uptake include the solubility and mobility of the chemical in question, the adsorptive properties of the charged soil surfaces, and the surface area and uptake capacity of the roots of the individual plant.",
  "The macroelements carbon, hydrogen, oxygen, and nitrogen constitute more than 96 percent of the dry weight of plants. Thus, they are the major constituents of the structural and metabolic compounds of the plant. Their presence and that of potassium within cells also helps regulate osmotic pressure. In addition, phosphate is a constituent of nucleic acids, including DNA , and membranes ; it also plays a role in various metabolic pathways. Microelements are generally either activators or components of enzymes, although the macroelements potassium, calcium, and magnesium also serve these roles.",
  "Metabolism denotes the sum of the chemical reactions in the cell that provide the energy and synthesized materials required for growth, reproduction, and maintenance of structure and function. In plants the ultimate source of all organic chemicals and the energy stored in their chemical bonds is the conversion of CO 2 into organic compounds (CO 2 fixation) by either photosynthesis or chemosynthesis. The general and specific features of plant metabolism ultimately derive from oxygenic photosynthesis, which underlies the autotrophic nutrition of plants.",
  "Chemical reactions in the cell occur in a sequence of stages called a metabolic pathway. Each stage is catalyzed by an enzyme , a protein that changes (usually increases) the rate at which the reaction proceeds but does not alter the reactants or end products. Certain thermodynamic conditions must be met for a reaction to proceed, even in the presence of enzymes. If the end product of the reaction is also the reactant (or substrate) that starts the pathway, then the sequence of reactions is called a metabolic cycle. The intermediate chemicals that are formed and used in the various stages of the sequence are called intermediary metabolites.",
  "  Metabolic pathways and cycles are either catabolic (energy-releasing) or anabolic (energy-consuming). Catabolic reactions break down complex metabolites into simpler ones, whereas anabolic reactions build up (biosynthesize) new molecules. When chemical bonds are broken, energy is released, which drives anabolic reactions to form new bonds. The energy released generally has been stored in high-energy bonds of an intermediate energy carrier molecule, such as the terminal phosphate bond of adenosine triphosphate (ATP). (When the terminal phosphate is split from the ATP molecule, adenosine diphosphate, or ADP, is formed and inorganic phosphate is released, along with energy.) The simpler metabolites formed via catabolic reactions are often the building-block metabolites used in anabolic reactions to synthesize more complex molecules (e.g., starch , proteins, or lipids ).",
  "The cells of all plants are eukaryotic , because they possess a nucleus and membrane-bound organelles , such as chloroplasts , mitochondria , glyoxysomes, peroxisomes , and vacuoles . The thousands of metabolic reactions that take place in the cell are regulated within these organelles and their subcompartments. When compared with cells of other eukaryotic organisms, plant cells have a high degree of metabolic compartmentalization.",
  "The primary mechanism of metabolic control, however, remains the enzymes themselves. Although all enzymes of the pathway help determine the net and directional flow of carbon, certain key stages are controlled by regulatory enzymes. Regulatory enzymes may either catalyze the first stage in the metabolic pathway or catalyze reactions in which key branch points occur. The activity of such enzymes, in turn, may be controlled by the amount synthesized (coarse control by gene expression)—in that further action by the enzyme is inhibited when some critical concentration of the reaction product is reached—or by special metabolites, called effectors, that interact directly with the enzyme (fine control). The latter metabolites may be either part of or totally unrelated to the metabolites of the pathway.",
  "Another mechanism by which metabolic reactions are regulated is through transport systems in the membranes of organelles. These systems control the nature, direction, and amount of metabolites entering the metabolic pathways and are often uniquely related to the autotrophic nutrition of plants.",
  "  The 6-carbon sugar glucose , a product of photosynthesis, is mostly translocated in the form of sucrose (a 12-carbon sugar) to nourish nonphotosynthesizing parts of the plant, or it may be polymerized into starch for storage. (Trehalose, another 12-carbon sugar, replaces sucrose in some vascular plants; others transport even larger sugars or sugar alcohols.) When required, sucrose and starch are hydrolyzed to glucose and then enter glycolysis or the pentose phosphate pathway. The reactions of both pathways take place in the cytoplasm of the cell.",
  "  The net result of glycolysis is the metabolism of glucose into two molecules of the four-carbon organic acid malate. This metabolic pathway involves phosphate-containing intermediates and is regulated by two enzymes, which catalyze those reactions that contain the substrates fructose phosphate and phosphoenolpyruvate (PEP). Glycolysis yields ATP molecules and hydrogen; the latter is accepted by the coenzyme (coenzymes are smaller, nonprotein participants associated with certain enzymes) nicotinamide adenine dinucleotide (NAD) to form NADH. The hydrogen on NADH then reacts either with molecular oxygen (O 2 ) to capture the energy (and transfer it to the high-energy bonds of ATP) or with another metabolite to reduce the molecule by the addition of hydrogen. Some intermediates are used in the biosyntheses of fat or certain amino acids.",
  " 3  The pentose phosphate pathway is an alternative pathway for the catabolism of glucose, producing end products that are used in the biosynthesis of nucleic acids, some vitamins, and key metabolites. It also furnishes reducing power (i.e., it accepts hydrogen atoms and carries them on the coenzyme nicotinamide adenine dinucleotide phosphate [NADP]) for use in the synthesis of substances such as fat. It is regulated by the rate at which the product of the pentose pathway, NADPH, is oxidized.",
  "  Malate produced in glycolysis is transported into the mitochondria , where it enters a sequence of 10 reactions called the tricarboxylic acid (TCA) cycle , or Krebs cycle. Malate is converted into pyruvate, which is then metabolized into the two-carbon intermediate, acetyl coenzyme A (CoA), which combines with a four-carbon acid, oxaloacetate. The product, citrate, has three carboxylic acid groups—hence the name tricarboxylic acid cycle. Citrate is systematically catabolized (broken down) with progressive losses of successive carbon atoms as CO 2 into five-carbon and, finally, four-carbon, acids. The latter acid, oxaloacetate, begins the cycle again. With each oxidation reaction, a hydrogen atom is transferred to the coenzyme NAD or, in one reaction, the coenzyme flavin adenine dinucleotide (FAD) to form NADH and FADH, respectively. The reduced coenzymes NADH and FADH enter into a sequence of reactions called the respiratory chain on the inner membrane of the mitochondrion. This chain is a series of carriers (ubiquinone and several iron-containing chemicals called cytochromes ) that ultimately transfer the hydrogen and electrons of these coenzymes to molecular oxygen, forming water. The energy generated from the oxidation by the respiratory chain is trapped in three ATP molecules formed per NADH molecule oxidized. The mechanism is chemiosmotic in that it involves building a hydrogen ion (proton) gradient on one side of the mitochondrial membrane.",
  "A net of 36 ATP molecules are gained from all hydrogen-carrying coenzymes formed in glycolysis and the TCA cycle, and they represent the principal energy source for most anabolic (biosynthetic) reactions in plants. In addition, the TCA cycle furnishes metabolites for the biosynthesis of important organic molecules of the cell.",
  "Another metabolic cycle, the isoprenoid pathway, produces essential oils , carotenoid pigments , certain plant hormones , and rubber. These metabolites are unique to plants and serve such functions as attracting pollinating insects , providing defense against herbivores, and producing photosynthetic pigments and phytohormones. Plant seedlings use the glyoxylic acid cycle to convert fats (principally from seeds ) into glucose. This occurs initially in the glyoxysome and subsequently in the mitochondria and cytosol (the fluid mass that surrounds the various organelles).",
  "The pathways outlined above exist in essentially the same form in all organisms, but metabolism in plants does have certain unique features. Plant mitochondria, for example, have specific transport systems for the NADH produced in glycolysis and for the oxaloacetate produced from a direct fixation of CO 2 into PEP. Unlike animal mitochondria, plant mitochondria metabolize malate and the amino acid glycine . A special enzyme converts malate to pyruvate, thereby allowing an alternative to the glycolytic pathway that is common in other organisms. Glycine is a product of the unique plant pathway of photorespiration ( see below  Photosynthesis ).",
  "Plant mitochondria possess a cyanide -resistant alternative respiratory chain in addition to the cyanide-sensitive cytochrome chain also found in other organisms. Oxidation of NADH through this alternative pathway produces energy in the form of heat but no ATP. Some physiologists suggest that this pathway is a mechanism to prevent overreduction of the respiratory pathway, which would lead to the production of toxic free radicals. Others believe that this pathway allows the TCA cycle to continue at times of decreased need for ATP, to produce more than the usual amount of metabolites, which, in the presence of ATP, could not normally be produced. This system functions at a high rate in the flowers of a range of species, including the arum lily (Araceae). Temperatures of this organ may reach 40 °C (104 °F), which also contributes to the attraction of pollinators.",
  "The autotrophic mode of nutrition of plants, is derived from oxygenic photosynthesis . Energy-rich organic compounds are synthesized from low-energy atmospheric CO 2 , using the energy of absorbed sunlight . (Some bacteria are nonoxygenic photosynthesizers, utilizing hydrogen sulfide, H 2 S, rather than water.) The resultant organic compounds initiate the flow of energy and carbon through the food chains of managed and natural ecosystems , intrinsically linking plants with the heterotrophic life-forms of the remaining kingdoms of organisms. The oxygen liberated by plants (and certain photosynthetic protists and prokaryotes) over geologic time has oxygenated Earth’s atmosphere and has produced fossil fuels such as coal , gas , and oil .",
  "The following sections describe the basic mechanisms of photosynthesis—the acquisition of energy and the fixation of carbon dioxide—used by plants of diverse evolutionary lines.",
  " Electromagnetic radiation having wavelengths between approximately 400 and 700 nanometres can be seen as light by the eye and constitutes the range absorbed by plants for photosynthesis. Blue light has a wavelength around 450 nanometres, and red light, a wavelength of 650–700 nanometres.",
  "  Double-membraned cell organelles called chloroplasts contain the photosynthetic apparatus: light-absorbing pigments, other electron-carrying chemicals (cytochromes and quinones ), and enzymes. (Pigments absorb light of a particular wavelength; those wavelengths that are not absorbed are reflected and may be perceived as colour—hence, for example, the green colour of many plants.) The inner membrane of the chloroplast is folded into flat tubes, the edges of which are joined to hollow sacklike disks called thylakoids. Stacks of thylakoids embedded with pigment molecules are called grana. The inner matrix of the chloroplast is called the stroma.",
  "Photosynthesis consists of two interdependent series of reactions, the light, or light-harvesting, reactions and the dark, or carbon-assimilating, reactions; the former are dependent on light, the latter on temperature. Light reactions occur in the grana and dark reactions in the stroma. The overall formula for photosynthesis is:",
  "6CO 2 + 12H 2 O → C 6 H 12 O 6 + 6O 2 + 6H 2 O.",
  " 2  The light reactions, the first stage of photosynthesis, convert light energy into chemical energy (ATP and NADPH). Light reactions comprise two interdependent systems, called photosystems I and II. The dark reactions, the second stage of photosynthesis, use the chemical energy products of the light reactions to convert carbon from carbon dioxide to simple sugars.",
  "Light reactions consist of several hundred light-absorbing pigment molecules arranged so as to maximize the gathering of light energy. These “antennae” are coupled to a mini-circuit of electron-carrying chemicals. The pigments are two types of chlorophyll —chlorophyll a and chlorophyll b —and various carotenoids . Absorbed light energy is transferred to specialized chlorophyll molecules called P 700 and P 680 in photosystems I and II, respectively. Once these specialized chlorophyll molecules have acquired sufficient energy, electrons are given up to the electron carriers within their photosystems, initiating an electron flow. (The carrier molecules include plastoquinones and cytochromes.) The effect of this, when photosystems I and II function synchronously, is the formation of a chemiosmotic gradient of protons that phosphorylates (adds a phosphate group to) ADP, resulting in ATP. Those electrons also lead to the formation of NADPH from NADP. The P 680 chlorophyll, upon loss of its electron, becomes a strong oxidizing agent that subsequently causes the water molecule to dissociate into protons and oxygen gas.",
  "  The dark reactions are responsible for the conversion of carbon dioxide to glucose . The essential reaction involves the combining of CO 2 with the five-carbon sugar ribulose 1,5-bisphosphate (RuBP) in a series of reactions called the Calvin-Benson cycle. This reaction yields an unstable six-carbon intermediate, which immediately breaks down into two molecules of phosphoglycerate (PGA), a three-carbon acid. Each reaction is catalyzed by a specific enzyme. Six revolutions of the cycle means that 6 CO 2 molecules react with 6 RuBP molecules to produce 12 molecules of PGA; 2 three-carbon PGA molecules combine to form the six-carbon glucose, and 10 PGAs are recycled to regenerate 6 molecules of RuBP. The ATP and NADPH from light reactions provide the energy and reducing power to form glucose and refurbish the CO 2 acceptor, RuBP. For further information about Melvin Calvin’s work, see  photosynthesis .",
  "Chlorophylls a and b (bound to proteins) and carotenoids constitute the principal light-absorbing complex of most plants. Differences in chloroplast structure, though not major, occur among phylogenetically diverse plant groups. All such variations, however, represent evolutionary adaptations to more efficiently utilize the light energy that drives the reactions common to all oxygenic photosynthesizers (i.e., photosystems I and II) or to avoid damage due to excessive light.",
  "The enzyme ribulose 1,5-bisphosphate carboxylase/oxygenase (Rubisco) catalyzes the formation of organic molecules from CO 2 . As the major enzyme of all photosynthetic cells, Rubisco is the most abundant protein on Earth. There is, however, a major catalytic flaw in the ability of this enzyme to convert CO 2 to sugars. In the presence of molecular oxygen, Rubisco also catalyzes a reaction in which oxygen is introduced (i.e., it acts as an oxygenase), and CO 2 is formed rather than converted.",
  "Rubisco evolved in photosynthetic organisms that lived in the atmosphere of primitive Earth, an atmosphere that contained only traces of molecular oxygen and plenty of carbon dioxide. As photosynthesis in the cyanobacteria of Precambrian times (about 4.6 billion years ago to 541 million years ago) oxygenated the atmosphere, the ratio of carbon dioxide to oxygen fell drastically, and Rubisco began to function more and more as an oxygenase. This greatly reduced the net fixation of CO 2 into sugars and, therefore, photosynthetic efficiency. Rubisco as an oxygenase splits RuBP into one PGA and a two-carbon acid phosphoglycolate, which initiates the photorespiratory carbon-oxidation cycle, or photorespiration. (This cycle probably evolved to recycle PGA back into the photosynthetic pathway, thereby preventing an even greater loss of carbon.) Photorespiration involves three organelles ( chloroplasts , peroxisomes , and mitochondria ), each with unique transport mechanisms for the cycle’s intermediates.",
  "All plants are classified as C 3 (plants that use only the Calvin-Benson cycle), C 4 (plants that use an additional CO 2 -fixation mechanism and the Calvin-Benson cycle), C 3 -C 4 (plants intermediate between C 3 and C 4 ), and CAM (plants that have a nocturnal variant of the C 4 pathway).",
  "The majority of plants fix CO 2 directly into RuBP, and their first stable product is the three-carbon acid PGA—hence the designation C 3 . Those plants have an active photorespiratory cycle, especially at high temperatures.",
  "Sometime during the Oligocene Epoch (33.9 million to 23 million years ago), certain of the angiosperms ( grasses and dicotyledonous plants) of mainly tropical climates evolved a CO 2 -fixation system that acted ahead of the Calvin-Benson cycle. The first fixation is into the three-carbon acid phosphoenolpyruvate (PEP) by PEP carboxylase (an enzyme that has no oxygenase function) in the outer mesophyll cells of the leaf. The first stable fixation product is the four-carbon acid oxaloacetate—hence the designation C 4 plants. Oxaloacetate is reduced to malate, which is transferred to a thick-walled bundle sheath cell. Malate is decarboxylated, giving rise to high CO 2 concentrations in the bundle sheath. Here, Rubisco of the Calvin-Benson cycle functions more efficiently because oxygenation is suppressed. There is thus a spatial separation of initial CO 2 fixation and the Calvin-Benson cycle. This efficiency is not without cost, however, as additional ATP is required to recycle PEP. For this reason, C 3 plants may be more efficient in cold climates, where photorespiration is insignificant; under conditions where there is less available light, the higher ATP requirement would become a penalty.",
  "The C 4 pathway is effective at fixing CO 2 under drought conditions or under conditions where CO 2 is limited. C 4 plants do not need to open their stomata as wide as C 3 plants, because their primary carboxylating enzyme is saturated at much lower CO 2 concentrations. As a result, they lose less water during photosynthesis, and they are better able to cope in regions with arid climates. As humans continue to burn fossil fuels and thus increase the CO 2 concentration in the atmosphere, the relative advantage C 4 plants enjoy in Earth’s warm regions at present will diminish.",
  "There are also plants with enzymatic and leaf anatomical characteristics intermediate between C 3 and C 4 plants, called C 3 -C 4 intermediate species. Those plants are thought to be in the pathway of evolution to full C 4 photosynthetic status.",
  " Astrophytum myriostigma   Succulent plants of the desert regions (e.g., cacti ) also initially fix CO 2 into oxaloacetate. This occurs only at night when conditions are cooler, however. Normally, the stomata in leaves or stems , through which plants lose water and acquire carbon dioxide, are open in the day and closed at night; however, the stomates of succulent plants that use the C 4 pathway do the opposite and hence prevent loss of water during the hot days. The resultant oxaloacetate is converted into malate, stored in the vacuole as malic acid, and released during the day when the stomates are closed. Malate is decarboxylated, and the CO 2 that is released is fixed by Rubisco in the usual Calvin-Benson cycle. Both the C 4 and C 3 processes take place in the same cell. This process is called crassulacean acid metabolism (hence CAM plants), after a family of succulent plants ( Crassulaceae ).",
  "  Plants occur over Earth’s surface in well-defined patterns that are closely correlated with both climate and the history of the planet. Forests are the most important of these natural communities from the standpoint of area, carbon content, annual carbon fixation, the cycling of nutrient elements, and influence on energy and water budgets, as well as being the principal reservoir of biodiversity on land. The most extensive forests are the boreal coniferous forests of North America, Scandinavia, northern Europe, and northern Asia. The moist forests of the tropics are the most diverse, often containing as many as 100 species of trees per hectare (1 hectare = 2.47 acres) and occasionally many more.",
  "  Forests are commonly distinguished from woodlands and savannas in having a closed canopy of trees that may be 10 metres (about 33 feet) to more than 50 metres (about 165 feet) in height. At their wetter and cooler limits, forests are replaced by tundra , a community of low-growing trees and shrubs with a ground cover of  Sphagnum  and other mosses , dwarfed shrubs, and perennial herbs. The transition from forest to tundra occurs at high latitudes and elevations and may extend over a considerable distance, throughout which trees are scattered, restricted to sheltered areas, and stunted in growth. Such taiga stands are common at the northern limit of trees throughout the Northern Hemisphere. The alpine transition tends to be more abrupt. Both are often determined locally by the distribution of snow.",
  "    Forests yield at their warmer and drier margins to grassland (called prairie in North America and steppe in Asia). In North America the rich grasslands of the eastern mid-continent, which is affected by moisture moving northward from the Gulf of Mexico , once supported a diversity of herbaceous plants, including grasses that might reach several metres in height, and were known as tall-grass prairie. Westward, where water was less abundant, the grasses diminished in diversity and size to form the short-grass plains. Southward and westward the plains yielded under increasing aridity to desert , as old as any other zone in an evolutionary sense and very diverse in species. Similar patterns of vegetation occur across the broad waist of Asia.",
  "  The distinction between grassland and forest is blurred in many places, especially in the semiarid subtropics and in other regions where fires may be common. This transitional zone is savanna, an open grassed woodland. The southeastern coastal plain of North America was originally such a region, a pine savanna that produced plants adapted to, in fact dependent on, burning for survival. The long-leaf pine ( Pinus palustris ), for instance, has a “grass” stage, which lasts for several years of early growth, with the bud protected at the very surface of the ground by a thick tuft of long grasslike leaves that shield it from the heat of a fire . Once sufficient energy has been stored in the taproot and short stem , the tree virtually explodes into growth and passes rapidly through a period of vulnerability to fire. As a tree of 3 metres (10 feet) or more in height, it is safe from all but the hottest of fires. Oaks and other species are replacing pines as savannas disappear from the southeastern United States because of the continuing division of land ownership and protection from fire.",
  " Acacia  In contrast, the extensive savannas of eastern Africa have been maintained through climate, fires, and grazing and support an extraordinary diversity of migratory animals that have evolved to use different parts of the ecosystem . The patterns of use are complex and phased in time, and they work to maintain both the diversity and the productivity of the savanna. Those African populations are the last of the large and diverse mammalian and avian populations that once also grazed similar areas of North America, Europe, and Asia.",
  "    The forests of the moist tropics are among the most complex and fascinating of terrestrial ecosystems. They extend from mountain slopes to river swamps and occurred throughout the tropics wherever precipitation allowed trees to survive. Human activities have virtually eliminated forests from vast areas of the tropics and threaten to destroy the residual forests globally. The largest areas of tropical forest occur now in the Amazon basin of South America and in the Congo basin of west-central Africa. The extensive tropical forests of Southeast Asia have been reduced to fragments of the area they occupied as recently as 1950.",
  "The rainforests of the Amazon basin have evolved as a part of a river system whose water level fluctuates annually by as much as 15 metres (50 feet) or more along the middle and lower Amazon . There are substantial further differences in the quality of water. The Negro River , for example, drains an area of sands low in nutrient elements, where organic matter has accumulated sufficiently in soils to produce the humic acids that give the river its dark colour and sufficient acidity to affect the plant and animal life it can support. The areas flooded in the annual cycle are forested and are known by the Portuguese word várzea . Trees in this zone survive flooding for several weeks annually and provide the basis of a food web that includes fish adapted for grazing on tree fruits and seeds . The grazing fish possess large flat molars adapted for masticating seeds and other coarse organic matter, and they compete for seeds dropped from pods in várzea trees on the river.",
  "  The distribution of the various zones of vegetation over Earth’s surface has changed with climates throughout time. The greatest changes in the recent past have been due to the periods of glacial advance and retreat over the last several hundred thousand years. As recently as 15,000 years ago, glacial ice covered much of eastern North America as far south as the present Hudson estuary and covered all of Scandinavia and northern Europe as well. Sea level was tens to hundreds of feet lower at various times, and extensive coastal areas now flooded were exposed. Such drastic changes in climate have sorted and resorted plant species, allowed the establishment of a diversity of forest types over time, and worked against the establishment or preservation of the mutual dependencies among species so common in the tropics. These higher-latitude forests, while similar in form and genera and sometimes in species around the world, are apparently highly mutable, the antithesis of the stable and self-perpetuating “organism” they were once thought to be. Nonetheless, the concept of the plant community as an organism remains viable and useful in ecology and is the basis of much of the most progressive analysis of how to manage Earth for the successful support of large numbers of people.",
  "    It is known from studies of plant residues and pollen preserved in the highly acidic sediments of bogs and from observations of contemporary glaciers that the vegetation southward from the glacial front in the Northern Hemisphere was banded in much the same way the vegetation is zoned today: tundra occurred in a zone closest to the ice; coniferous forests occurred in a warmer and drier zone southward; and deciduous forests occurred still farther southward. As the habitat changed—that is, as the glacial ice melted and the glacial front retreated—the vegetation migrated onto the new landscape: first the pioneer species of the tundra—a few hardy low-growing or crustose lichens and mosses of small stature—followed by dwarfed willows and birch and, ultimately, the full panoply of tundra plants. As the climate ameliorated further, the forest followed, always according to pattern, with a few pioneers followed by the full array of species characteristic of the forest.",
  "The process of invasion of a new landscape not previously occupied by plants has long been called  primary succession  . In this case the succession was in response to both the availability of a new habitat and a climatic warming that allowed the replacement of tundra by forest and of the coniferous forest ultimately by deciduous forest as the warming continued. Further warming might result in the replacement of deciduous forest by grassland , as has occurred worldwide at the steppe- or prairie-forest border in response to climatic changes over recent centuries. This boundary is strongly influenced by the fires that have swept grasslands throughout time. Disturbances such as clearings for agriculture , wildfires , diseases , and storms severe enough to open gaps in a forest may start secondary successional changes that also reestablish the normal vegetation for that climatic zone.",
  "Throughout much of the tropics, where forests have been destroyed over large areas to make pastures, conditions appropriate for what might be a normal succession within disturbance-caused gaps in an otherwise intact forest do not exist, and the sites are permanently impoverished. The process generates grasslands, shrublands, or sometimes bare earth. More than one-third of the land area of India has been impoverished in this way and is lost to agriculture, forests, or forestry .",
  "  The thin mantle of the Earth that supports life extends not more than a few feet into the sediments of the abyssal depths of the oceans and to a few tens of thousands of metres into the atmosphere , where pollen grains or other spores may survive. It is this thin layer at Earth’s surface that is the biosphere , the place where life occurs. Human activity has changed Earth irreversibly to form the present biosphere, and humans are now a force for further irreversible change.",
  "The methods by which plants are distributed over Earth’s surface are as diverse and complex as the plants themselves. The most widely occurring plants are the small-bodied rapidly reproducing forms whose spores can be carried by wind and water and by birds and other animals.",
  "Among the seed plants, whose propagules are less mobile, explanations for the current distribution of plants become more complicated and include such profound changes over evolutionary time as the breakup of Pangea some 300 million years ago, the opening of the Atlantic Ocean , and the isolation of North and South America , Australia , and Madagascar from larger continental landmasses. Progressive isolation produced endemism , evolutionary divergence sufficient to generate whole floras peculiar to a particular region, with many species, even genera, not known elsewhere. Volcanic islands are much younger than the continents and support floras derived from chance invaders carried by wind, sea, or animals, including humans. Island floras also come to exhibit endemism. English naturalist Charles Darwin ’s observations of the fauna and flora of the Galapagos Islands off the western coast of South America led him to recognize the general process of biotic evolution . The islands are diverse in form and climate, isolated in varying degrees from each other and from the continent, and support a highly diversified flora and fauna clearly derived from South America but modified over the time of isolation to contain forms peculiar to the islands.",
  "Diverse mechanisms exist for dispersing spores and seeds at appropriate times and in appropriate habitats to ensure the survival of the new plant. In forests adapted to fire, pinecones may remain closed until a fire occurs. The heat of the fire opens the cones and releases the seeds into a fire-seared habitat, where the seeds germinate , probably stimulated by karrikins, growth regulators in smoke. The seedlings find soil with an abundance of nutrients left by the burning of organic matter and reduced competition from other plants. Seeds of trees frequently have “wings” that permit wider distribution by wind. Other plants, such as thistles and burdock , have awns or other appendages that catch on animals and obtain a wide distribution in areas frequented by them. Still others have elaborate mechanisms for spreading via rhizomes , stems, or other vegetative propagules. Some plants have no significant dispersal mechanisms, and seeds thus end up close to the mother plant.",
  "Especially during the past two centuries, human activities have both deliberately and inadvertently spread the higher plants, and many of their bacterial, fungal, and insect plagues, around Earth’s surface. Examples among the higher plants are numerous; while many of the transfers of such plants have been benign and some clearly advantageous, others have been disastrous. Tree species have been moved freely around the world, sometimes with remarkable effectiveness. The Monterey pine ( Pinus radiata ), for instance, is a diminutive and unproductive tree on the coast of California, but it has become a major timber tree as a result of rapid growth in plantations in New Zealand . The rubber tree ( Hevea ) was carried in the 19th century from the moist tropics of Brazil to Java and elsewhere in the South Pacific, where its excellent growth, free of the diseases and competitors that affect it in its native American habitat, nearly destroyed the market for Brazilian rubber. Other inadvertent introductions have been far from benign; some have severely impoverished the landscape. Cheatgrass , or downy brome ( Bromus tectorum ), for example, is an annual grass introduced from Europe and the Transcaspian steppes to the arid intermontane west in North America, probably as a contaminant in fodder in the latter part of the 19th century. It is an aggressive invasive species and spreads rapidly, becoming a continuous ground cover over extensive areas. The plant completes its life cycle early in the season, sets seeds, and stands through the rest of the year as a continuous cover of dry grass not useful for fodder. It does, however, carry fire, which changes and can even destroy the native vegetation.",
  " Plant diseases and pests have been inadvertently spread around the world by human activities. Such diseases continue to exact a high cost in that they progressively impoverish the vegetation. One of the most profound changes in any forested region was produced by the introduction of the chestnut blight ( Cryphonectria parasitica , formerly Endothia parasitica ) to North America. The fungus , introduced from Asia, found a home in the Fagaceae of eastern North America but was lethal to the American chestnut ( Castanea dentata ), the dominant species of extensive stands in the southern Appalachians and elsewhere. Once a common and popular shade tree and a source of smooth-grained, easily worked wood and of the abundant mast that was one of the principal foods of indigenous wild turkeys and other animals, the American chestnut never developed resistance to this now widely distributed fungus, which has several hosts in the Fagaceae and which produces wind-borne spores.",
  "The American elm ( Ulmus americana ), a magnificent tree of the moist forests of lowlands throughout eastern North America, has suffered a similar but less-comprehensive loss through the ravages of another exotic fungus, Dutch elm disease ( Ceratocystis ulmi ), which was imported from Europe on infected wood probably early in the 1900s. The fungus is spread by two elm bark beetles . Individual trees sometimes escape the fungus for many years but ultimately succumb before reaching the large sizes that were common throughout its range early in the 20th century.",
  "  Humans have influenced the structure and development of natural communities for many thousands of years. The major influence has been through fire, which has been used deliberately in herding game , in rejuvenating plants used for fodder, in opening forested plots for agriculture, in maintaining savannas and grasslands, and in keeping forests open for easy passage for hunting . With the rapid expansion of human populations globally in recent decades, however, the changes in vegetation have been profound. Forests have morphed into grasslands and savannas. Succession has replaced pine forests with deciduous forests, as in the southeastern coastal plain and Piedmont regions of North America. In many instances temporary protection from fire has resulted in the accumulation of a large mass of flammable vegetation that, when burning, makes a hot fire, which kills the overstory trees and many species that normally survived the more frequent and less-severe fires of the past. In such circumstances the vegetation may be impoverished, a condition that may prevail indefinitely once established.",
  " Manihot esculenta  The origins of domesticated plants and agriculture are buried in a dim and unrecorded past of 10,000 years and more. Recent experience with Stone Age cultures of the Amazon basin and elsewhere has shown that such cultures have a sophisticated knowledge of plants for such purposes as food, medicine , and the tools and poisons used for hunting and fishing . Amerindian cultures improved a wide range of species by deliberate selection of the more productive and useful forms. Manioc ( Manihot utilissima ) remains a staple of large sections of Latin America, especially Brazil and the Amazon basin. A woody tuberous plant whose origin in the savannas of South America has long been lost, it is propagated vegetatively by planting a piece of tuber or a segment of stem. The tuber is ground to make a flour that must be washed to remove toxic quantities of hydrocyanic acid before being eaten directly or baked into a flat bread called cazabi (cassava).",
  " Corn , or maize ( Zea mays ), was domesticated about 10,000 years ago either from teosinte (a perennial Zea that exists today) or from a lost ancestor that existed in the highlands of what is now central Mexico . Its culture had spread as far north as southern Maine by the time of European settlement of North America. Corn is now the third largest plant-based food source in the world. Other plants domesticated from the region include the common bean , squash , chili , tomato , avocado , papaya , guava , sapodilla , cotton , sisal , and vanilla .",
  "The process of domestication appears to have involved selection and cultivation of the most promising and productive of plants long harvested in the wild. Continued selection brought drastic shifts in the population, shifts in the frequency of genes , and the development of new races totally dependent on humans to maintain them. Races developed in this way have been called cultigens to emphasize their dependence on cultivation. Such is the case with corn: the original stock has probably been lost, although teosinte may offer clues as to the source.",
  "Major crop plants have been domesticated over the last several thousand years from sources identified by the Russian botanist N.I. Vavilov . Common wheat ( Triticum vulgare ) and rye ( Secale cereale ) probably were first domesticated from the grasses of Central Asia. Various millets ( Panicum ) and barley ( Hordeum hexastichum ) originated in the mountainous regions of central and western China, rice ( Oryza sativa ) probably in the Indian region.",
  "There is no plant community anywhere on Earth that has not felt the direct influence of the expansion of the human enterprise. The influence has had the form of direct intrusion through hunting and gathering, cultivation, or extensive harvest of trees or other plants or has had indirect effects through the harvest of fish or other animals or through changes in the chemistry of the environment. The latter changes are now pervasive and range from the introduction of pesticides , such as DDT , and other industrial toxins, such as the PCBs , and acid rain , with substantial modification of the sulfur , nitrogen , and hydrogen ion budgets of ecosystems over large areas. Widespread destruction of forest tree species occurred during the 1980s in eastern North America and throughout Europe because of the combined effects of acid rain and other air pollutants.",
  "Symptoms of incipient damage from air pollution and other chronic disturbances are now common in forests and other types of vegetation around the world, although symptoms may be subtle and difficult to assign as being caused by a particular pollutant. They range from such changes as the elimination of populations of leafy lichens from the bark of trees to the mortality of the trees themselves. Under extreme circumstances, such as in regions around smelters in Sudbury , Ontario, Canada, virtually all higher plants have been eliminated from an area of hundreds of square miles.",
  "One of the most spectacular and informative examples of the patterns of impoverishment of forests exposed to chronic disturbance was induced experimentally in an oak-pine forest at Brookhaven National Laboratory in central Long Island , New York, U.S., using ionizing radiation. A single radiation source was used in the centre of the forest. The exposure, begun in the fall of 1961, was sufficient within months to eliminate all plants from a central area within a few metres of the source and to produce a systematic zonation of the forest at lower exposures. The zones ranged through a lichen and moss community, followed at lower exposures by a continuous ground cover of a single species of sedge ( Carex pensylvanica ). At slightly lower exposures a community of low shrubs occurred, then high shrubs at still lower exposures. An impoverished forest of hardy oaks well within the normal range of variability of the oak-pine forest of the region occurred down the gradient of exposure and beyond that zone; at exposures of one roentgen or less daily, the pines survived and the forest appeared intact and normal. Effects could, however, be detected by careful measurements of growth down to exposures on the order of 0.1 roentgen per day. The experiment offered a specific example of the progressive impoverishment of vegetation where both cause and effect could be measured, something not possible in most instances of pollution. Such experience is useful not only in defining the effects of exposure to ionizing radiation but also in identifying stages in the impoverishment of natural communities as effects accumulate. Similar zonation can be found around the areas contaminated by the 1986 Chernobyl disaster .",
  "Similar changes occur in aquatic systems in response to chronic pollution . The early stages of pollution in bodies of water usually involve enrichment with nutrient elements, especially nitrogen and phosphorus , a process known as eutrophication . This can lead to water blooms (the rapid growth of algae or cyanobacteria), which deplete the water of oxygen and choke aquatic life.",
  "The effects of pollution on land and in water are to favour small-bodied rapidly reproducing organisms that do not depend on complex food webs. The process of simplification and impoverishment is now global, and it affects terrestrial and aquatic communities alike. It is the continuously expanding result of chronic intrusions on natural systems by human influences. The impoverishment threatens all life because it systematically reduces the capacity of Earth to support plants.",
  " 2 2  One of the most serious threats to life is the climate change and the possibility of a rapid warming of Earth’s lower atmosphere from the accumulation of heat-trapping gases. The most important of the gases is carbon dioxide , but methane , nitrous oxide , and the chlorofluorocarbon compounds (CFCs) also contribute significantly. The largest sources of carbon dioxide are the combustion of fossil fuels , the destruction of forests, changes in land-use patterns, and, probably, the warming itself. Methane is a product of the use of fossil fuels and of the decay of organic matter in soils and swamps, rice paddies, and bogs. Its rate of evolution is accelerated by warming.",
  "The effects of the warming are expected to be profound: if global warming has occurred as rapidly as some climatologists have suggested, the mean temperature of Earth’s lower atmosphere will increase by 1.8 to 4 °C (3.2 to 7.2 °F) by 2100 over baseline temperatures established in 2000. A change of 1 °C in temperature is equivalent to 96.5–160 km (60–100 miles) of latitudinal change in the middle latitudes. Such high rates of change in climatic zones would not only disrupt agriculture across large areas (e.g., northern India) but also destroy forests and other natural communities at their warmer and drier margins more rapidly than they could be regenerated elsewhere. One of the effects would be to speed the decay of organic matter in soils and accelerate the accumulation of carbon dioxide and methane in the atmosphere, an effect that would further accelerate the warming. Avoiding such change will require abandoning fossil fuels as the major source of energy for industrial societies and replacing these energy sources with renewables, such as solar and wind energy.",
  "Classical approaches to conservation involve specific efforts at preserving species that are endangered . By far the most desirable approach to the preservation of Earth’s 5 million–30 million or more species is through management of natural ecosystems . Studies of tropical forests have emphasized that the area required to ensure the habitat of bird populations as well as populations of other animals and plants is very large indeed, on the order of 10,000 hectares (25,000 acres). There is evidence to support earlier experience that the best way to ensure the preservation of the indigenous biota is to maintain a matrix of the indigenous vegetation with more than 50 percent of the land area undisturbed and an additional 25 to 50 percent in successional stages. This type of land-use planning exists in very few places around the world but offers the advantage of a landscape that maintains itself with stable near-maximum flows of energy through living systems and offers, regionally, maximum sustainable support for people at low cost. The difficulty is that the apparently high stocks of land under light use—the forests, the water, and energy in various forms—are an open invitation to immediate short-term exploitation, and their existence may suggest that the landscape can be more intensively occupied.",
  "The evolutionary history of plants is recorded in fossils preserved in lowland or marine sediments. Some fossils preserve the external form of plant parts; others show cellular features; and still others consist of microfossils such as pollen and spores . In rare instances, fossils may even display the ultrastructural or chemical features of the plants they represent. The fossil record reveals a pattern of accelerating rates of evolution coupled with increasing diversity and complexity of biological communities that began with the invasion of land and continued with the progressive colonization of the continents . At present, fossil evidence of land plants dates to the Ordovician Period (about 485.4 million to 443.8 million years ago) of the Paleozoic Era . However, research using “molecular clock” methodology, which uses genetics to estimate how long species have been separated from a common ancestor, suggests that plants started to colonize terrestrial environments around 500 million years ago, about the middle of the Cambrian Period .",
  "By far the most diverse and conspicuous living members of the plant kingdom are vascular plants ( tracheophytes ), in which the sporophyte phase of the life history is dominant. ( See above  Life histories .) Fossil remains of vascular plants provide evidence for evolutionary changes in the structure of the plant body (sporophyte and gametophyte ), in the variety of plant forms, in the complexity of the life history, in the tolerance for ecological conditions, and in systematic diversity. Nonvascular plants, or bryophytes ( mosses , liverworts , and hornworts ), are much smaller and less diverse than vascular plants. The first evidence for liverworts occurs in rocks laid down between 473 million and 471 million years ago, during the Ordovician Period, whereas the earliest moss fossils are from the Permian Period (298.9 million to 251.9 million years ago). In contrast to tracheophytes, most fossil bryophytes are relatively similar to living forms. Understanding of the evolution of nonvascular plants is, therefore, less complete than for tracheophytes.",
  " Lepidodendron Lepidodendron  Botanists now believe that plants evolved from the algae ; the development of the plant kingdom may have resulted from evolutionary changes that occurred when photosynthetic multicellular organisms invaded the continents. The earliest fossil evidence for land plants consists of isolated spores, tracheid-like tubes, and sheets of cells found in Ordovician rocks. The abundance and diversity of these fossils increase into the Silurian Period (about 443.8 million to 419.2 million years ago), where the first macroscopic (megafossil) evidence for land plants has been found. These megafossils consist of slender forking axes that are only a few centimetres long. Some of the axes terminate in sporangia that bear trilete spores (i.e., spores that divide meiotically to form a tetrad). Because a trilete mark indicates that the spores are the product of meiosis , the fertile axes may be interpreted as the sporophyte phase of the life cycle .",
  "Fossils of this type could represent either vascular plants or bryophytes. Another possibility is that they are neither but include ancestors of vascular plants, bryophytes, or both. The earliest fossils also include at least one or more additional plant groups that became extinct early in the colonization of the land and therefore have no living descendants. By the early Devonian Period (about 419.2 million to 393.3 million years ago), some of the fossils that consist of forking axes with terminal sporangia also produced a central strand of tracheids , the specialized water-conducting cells of the xylem . Tracheids are a diagnostic feature of vascular plants and are the basis for the division name, Tracheophyta.",
  "The simplest and presumably most primitive vascular plants from the late Silurian and early Devonian periods (about 419.2 million to 393.3 million years ago) were the Rhyniopsida . They included plants such as Cooksonia and Rhynia , which were herbaceous colonizers of moist habitats. Most were less than 30 cm (12 inches) tall. The plant body was not differentiated into stems , leaves , and roots ; rather, the forking aboveground axes bore terminal sporangia and produced stomata , which demonstrate that the plants were green and photosynthetic . Surface or underground axes served to root the plant and were anchored by rhizoids . Because such plants produced only one type of spore, they were nonseed plants with a homosporous life cycle and free-living gametophytes. A small number of such gametophytes have been described from Devonian deposits.",
  "Some plants of the early Devonian had multicellular emergences of tissue along their aboveground axes, which are thought to have increased the light-capturing surface of the photosynthetic tissue. Such emergences (enations) gave rise to the leaves (microphylls) of the Lycopsida, thus producing an aboveground shoot system that consisted of branching stems with leaves. Underground axes that lacked leaves would have become the roots . Lycophytes were the first plants with well-differentiated shoot systems, and they are the most ancient groups of vascular plants with living representatives.",
  " Neuropteris ovata  The leaves of several other plant groups were derived from modifications of the forking axes. There was a variety in structure among Devonian plants. The axes of some plants forked equally, whereas other plants—e.g., Drepanophycus —were more specialized, comprising a large centrally located axis as well as smaller axes borne laterally. In plants where the lateral systems branched in only one plane, the side branches were flat like leaves. Filling in (webbing) of the spaces between forks of the laterals with photosynthetic tissue produced leaves called megaphylls. There is evidence for the evolution of megaphylls in several plant groups of the late Devonian Period (about 382.7 million to 358.9 million years ago) and early Carboniferous Period (about 358.9 million to 323.2 million years ago). Although most of these groups have no living representatives, by the Carboniferous Period they had given rise to homosporous ferns , sphenopsids ( horsetails ), and seed plants ( gymnosperms ).",
  "As Devonian plants with microphylls and those with specialized branching systems diversified, many grew to the size of shrubs . By the middle Devonian Period (about 393.3 million to 382.7 million years ago), there were shrub-size representatives of several lineages, but a further increase in the size of herbaceous plants was restricted by the limited diameter that aboveground stems and rooting systems could achieve. The development of lateral (secondary) growth overcame this size restriction. The ability to produce secondary growth evolved independently in several groups. In the lycophytes , much of this secondary growth occurred in cortical tissues; in the ancestors of seed plants and several other lineages, however, the production of wood accounted for most of the growth in stem diameter. About the same time, downward-growing central rooting systems evolved independently in lycophytes and other plant groups. As a result, there were forests with a canopy of giant lycophyte and gymnosperm trees near the beginning of the Carboniferous Period.",
  "As plants developed more complex growth forms, they also underwent systematic diversification and evolved more specialized modes of sexual reproduction. The most primitive vascular plants had a homosporous life cycle, in which reproduction and dispersal involved a single type of spore . Extant homosporous plants include most ferns and many lycophytes. The homosporous life cycle is an effective means for long-distance dispersal of species. Although it permits the fertilization of an egg by a sperm from the same gametophyte plant, genetic recombination , considered important for more rapid evolution, is not possible. Moreover, because the gametophytes of homosporous plants are exposed to the environment for an extended period of time, mortality is relatively high.",
  "By the middle Devonian Period, the heterosporous life cycle had evolved independently in several groups, including lycophytes and the ancestors of seed plants. In heterosporous plants, there are two sizes of spores; the smaller (a microspore) produces a male gametophyte, and the larger (a megaspore) produces a female gametophyte. The incidence of genetic recombination is increased by this obligate cross-fertilization. Both types of gametophytes develop quickly within the protective spore wall. Compared with homosporous plants, reproduction is more rapid and mortality is reduced in heterosporous plants. By the end of the Devonian, heterosporous plants had become the dominant species in most wetland environments; however, the need for an abundant source of water from the environment to allow fertilization prevented the heterosporous plants from establishing communities in drier habitats.",
  " Cycadeoidea Cycadeodia  A series of changes in the reproductive biology among some heterosporous plants during the late Devonian overcame this environmental restriction and allowed them to colonize a much wider range of habitats. These changes also led to the evolution of seed plants. In seed plants, the megaspore is retained in the megasporangium and the microspore is taken to a pollen chamber at the tip of this organ. The megasporangium is then sealed, and gametophyte development and fertilization occur within a protected environment. When such a megasporangium is enclosed in a seed coat, the structure with its enclosed embryo is called a seed . Seeds of the earliest such plants were exposed to the external environment; those “naked seed” plants are referred to as gymnosperms .",
  "From the late Devonian through the base of thelate Cretaceous Period (about 382.7 million to 66 million years ago), gymnosperms underwent dramatic evolutionary radiations and became the dominant group of vascular plants in most habitats. Extant gymnosperms include conifers , cycads , and  Ginkgo biloba  , but those represent only a small fraction of the gymnosperms that inhabited Earth during the Mesozoic Era (251.9 million to 66 million years ago). Among the Mesozoic forms were species with a wide variety of mechanisms for effecting pollination , protecting the seeds, dispersing the seeds, and increasing the natural selection of the most successful varieties.",
  " Primitive forms of the flowering plants ( angiosperms ) arose from among this diverse array of complex gymnosperms. From their earliest diversification in the Cretaceous Period (145 million to 66 million years ago), angiosperms rapidly came to dominate the land flora. Today there are more than 300,000 species of flowering plants, which account for more than 90 percent of the diversity of vascular plants. Among the many structures that contribute to this success are flowers , fruits , complex vein patterns in the leaves, and highly specialized cells of the conducting system.",
  "Just as an ecological succession of plant forms can transform bare ground into a complex plant community, so an evolutionary succession can be thought of as having transformed bare continents into rich terrestrial biotas. In ecological succession, herbaceous plants colonize bare earth and modify the environment for the development of more complete ground cover. This further modifies the environment for the successive establishment of larger herbs, perennial shrubs, fast-growing trees, and, finally, slower-growing trees, vines , and epiphytes (plants that grow on other plants rather than in soil).",
  "As discussed above, primitive land plants of the late Silurian and early Devonian periods were primarily small herbs that inhabited the moist lowlands near oceans, lakes, and streams. The first of these grew on bare ground because there would have been little or no organic soil , because plants had yet to produce the organic matter that gave rise to organic soils. They may be thought of as the evolutionary equivalent of primary colonizing “weeds,” and their establishment on land was responsible for the first of three dramatic increases in the diversity of land plants.",
  "After the initial production of organic soils by these evolutionary colonizers, communities of larger herbs and shrubs were able to develop, and they became common in the middle Devonian. In the late Devonian, these communities were themselves succeeded by communities dominated by heterosporous tree-sized plants. During the early Carboniferous Period, nonseed plants continued to dominate many wetland habitats, whereas communities dominated by gymnosperm trees colonized drier habitats than had been previously available to the heterosporous forms.",
  "Communities dominated by trees were the first to provide suitable habitats for vines and for epiphytes. Such communities also provided habitats for herbivorous animals . As a result, biological communities of considerable complexity had evolved by the late Carboniferous Period (about 323.2 million to 298.9 million years ago), giving rise to a second dramatic increase in the diversity of land plants.",
  "With the rapid diversification of the gymnosperms and an increasing complexity of interactions between plants and animals, there was a significant evolutionary turnover among land plants during the Permian , Triassic , and Jurassic periods (298.9 million to 145 million years ago). New groups of gymnosperms replaced some of the primitive gymnosperms as well as the most prominent nonseed plants from earlier periods. Among the most successful gymnosperms of those periods were conifers , cycads ,  Ginkgo  , and several major groups with no extant representatives.",
  "Flowering plants probably also originated during this time, but they did not become a significant part of the fossil flora until the middle of the Cretaceous Period. The fossil evidence provides a clear picture of the rapid diversification and spectacular rise to dominance of the angiosperms during the late Cretaceous Period. This was accompanied by a dramatic increase in the complexity of plant community structure, produced at least in part by an expanding array of interactions between plants and animals. Improved pollination and seed dispersal were among the benefits of such interactions to plants. That animals equally benefited is evidenced by the coevolution of several groups of animals (particularly insects ) and angiosperms during the late Cretaceous and Paleogene periods (about 100.5 million to 23 million years ago). Such interactions contributed significantly to a third rapid increase in global plant diversity and helped angiosperms achieve the overwhelming dominance of the land flora characteristic of modern vegetation.",
  "In the classification above, only the major divisions and classes of living plants are listed, and a number of entirely extinct divisions are omitted. The classification outlined is somewhat conservative but is one that best conforms to available data and has gained wide acceptance.",
  "Biological classifications were initially mechanical or “artificial”; that is to say, they had no basis in evolution . This was followed by a period of “natural system” construction, whereby plants were grouped together on the basis of their overall similarities or differences, using as many characteristics as possible. Contemporary systems of biological classification are phylogenetic , which means that various plants are arranged together because they are thought to be related by descent from a common ancestor. As additional molecular evidence has become available, classifications have changed to accommodate the new information.",
  "At the turn of the 19th century, the plant kingdom was frequently divided into two major groups, the cryptogamia ( algae , fungi , bryophytes , and ferns ) and the phanerogamia ( gymnosperms and angiosperms ). Subsequently, it was common practice among systematic botanists to group all vascular plants together under a single division, Tracheophyta . More modern taxonomies, such as those of the Angiosperm Phylogeny Group (APG), do not formally recognize groupings at the division level but use more informal groups known as clades, a view that interprets the individual major groups to be less closely related to one another than was previously believed. Difficult and complex questions still exist in the definition and circumscription of certain groups. The phylogenetic relationships, if any, of the bryophytic plants with primitive vascular plants remain unclear.",
  "General surveys providing definitions of the kingdom and characterizations of major groups of plants include D.J. Mabberley , Mabberley’s Plant-Book: A Portable Dictionary of Plants , 4th ed. (2017) ; and Petra Marschner (ed.), Marschner’s Mineral Nutrition of Higher Plants , 3rd ed. (2012) . Peter H. Raven , Ray F. Evert , and Susan E. Eichhorn , Biology of Plants , 8th ed. (2011), is an excellent introductory text. Another introductory treatment is Jane B. Reece et al., Campbell Biology , 11th ed. (2016) .",
  " Hans Lambers , F. Stuart Chapin III , and Thijs L. Pons , Plant Physiological Ecology , 2nd ed. (2008) ; and Emanuel Epstein and Arnold J. Bloom , Mineral Nutrition of Plants: Principles and Perspectives , 2nd ed. (2005), consider the physiological aspects of the plant kingdom. Michael Begon , Colin R. Townsend , and John L. Harper , Ecology: From Individuals to Ecosystems , 4th ed. (2009) ; and F.S. Chapin III , Pamela A. Matson , and H.A. Mooney , Principles of Terrestrial Ecosystem Ecology , 2nd ed. (2011), consider the roles plants play in the environment. Taxonomic references include Lynn Margulis and Michael J. Chapman , Kingdoms and Domains: An Illustrated Guide to the Phyla of Life on Earth , 4th ed. (2009) ; and Vernon H. Heywood et al., Flowering Plant Families of the World (2007) ."
]