[
  " topology , branch of mathematics, sometimes referred to as “rubber sheet geometry,” in which two objects are considered equivalent if they can be continuously deformed into one another through such motions in space as bending, twisting, stretching, and shrinking while disallowing tearing apart or gluing together parts. The main topics of interest in topology are the properties that remain unchanged by such continuous deformations. Topology, while similar to geometry , differs from geometry in that geometrically equivalent objects often share numerically measured quantities, such as lengths or angles, while topologically equivalent objects resemble each other in a more qualitative sense.",
  "The area of topology dealing with abstract objects is referred to as general, or point-set, topology. General topology overlaps with another important area of topology called algebraic topology. These areas of specialization form the two major subdisciplines of topology that developed during its relatively modern history.",
  " c a b In some cases, the objects considered in topology are ordinary objects residing in three- (or lower-) dimensional space. For example, a simple loop in a plane and the boundary edge of a square in a plane are topologically equivalent, as may be observed by imagining the loop as a rubber band that can be stretched to fit tightly around the square. On the other hand, the surface of a sphere is not topologically equivalent to a torus, the surface of a solid doughnut ring. To see this, note that any small loop lying on a fixed sphere may be continuously shrunk, while being kept on the sphere, to any arbitrarily small diameter. An object possessing this property is said to be simply connected, and the property of being simply connected is indeed a property retained under a continuous deformation. However, some loops on a torus cannot be shrunk, as shown in the figure .",
  "Many results of topology involve objects as simple as those mentioned above. The importance of topology as a branch of mathematics, however, arises from its more general consideration of objects contained in higher-dimensional spaces or even abstract objects that are sets of elements of a very general nature. To facilitate this generalization, the notion of topological equivalence must be clarified.",
  "The motions associated with a continuous deformation from one object to another occur in the context of some surrounding space, called the ambient space of the deformation. When a continuous deformation from one object to another can be performed in a particular ambient space, the two objects are said to be isotopic with respect to that space. For example, consider an object that consists of a circle and an isolated point inside the circle. Let a second object consist of a circle and an isolated point outside the circle, but in the same plane as the circle. In a two-dimensional ambient space these two objects cannot be continuously deformed into each other because it would require cutting the circles open to allow the isolated points to pass through. However, if three-dimensional space serves as the ambient space, a continuous deformation can be performed—simply lift the isolated point out of the plane and reinsert it on the other side of the circle to accomplish the task. Thus, these two objects are isotopic with respect to three-dimensional space, but they are not isotopic with respect to two-dimensional space.",
  " The notion of objects being isotopic with respect to a larger ambient space provides a definition of extrinsic topological equivalence, in the sense that the space in which the objects are embedded plays a role. The example above motivates some interesting and entertaining extensions. One might imagine a pebble trapped inside a spherical shell. In three-dimensional space the pebble cannot be removed without cutting a hole through the shell, but by adding an abstract fourth dimension it can be removed without any such surgery. Similarly, a closed loop of rope that is tied as a trefoil, or overhand, knot ( see  figure ) in three-dimensional space can be untied in an abstract four-dimensional space.",
  "An intrinsic definition of topological equivalence (independent of any larger ambient space) involves a special type of function known as a homeomorphism . A function h is a homeomorphism, and objects X and Y are said to be homeomorphic, if and only if the function satisfies the following conditions.",
  "The notion of two objects being homeomorphic provides the definition of intrinsic topological equivalence and is the generally accepted meaning of topological equivalence. Two objects that are isotopic in some ambient space must also be homeomorphic. Thus, extrinsic topological equivalence implies intrinsic topological equivalence.",
  "In its most general setting, topology involves objects that are abstract sets of elements. To discuss properties such as continuity of functions between such abstract sets, some additional structure must be imposed on them.",
  "One of the most basic structural concepts in topology is to turn a set X into a topological space by specifying a collection of subsets T of X . Such a collection must satisfy three axioms: (1) the set X itself and the empty set are members of T , (2) the intersection of any finite number of sets in T is in T , and (3) the union of any collection of sets in T is in T . The sets in T are called open sets and T is called a topology on X . For example, the real number line becomes a topological space when its topology is specified as the collection of all possible unions of open intervals—such as (−5, 2), (1/2, π), (0, 2 ), …. (An analogous process produces a topology on a metric space .) Other examples of topologies on sets occur purely in terms of set theory . For example, the collection of all subsets of a set X is called the discrete topology on X , and the collection consisting only of the empty set and X itself forms the indiscrete, or trivial, topology on X . A given topological space gives rise to other related topological spaces. For example, a subset A of a topological space X inherits a topology, called the relative topology, from X when the open sets of A are taken to be the intersections of A with open sets of X . The tremendous variety of topological spaces provides a rich source of examples to motivate general theorems, as well as counterexamples to demonstrate false conjectures. Moreover, the generality of the axioms for a topological space permit mathematicians to view many sorts of mathematical structures, such as collections of functions in analysis , as topological spaces and thereby explain associated phenomena in new ways.",
  "A topological space may also be defined by an alternative set of axioms involving closed sets, which are complements of open sets. In early consideration of topological ideas, especially for objects in n -dimensional Euclidean space, closed sets had arisen naturally in the investigation of convergence of infinite sequences ( see  infinite series ). It is often convenient or useful to assume extra axioms for a topology in order to establish results that hold for a significant class of topological spaces but not for all topological spaces. One such axiom requires that two distinct points should belong to disjoint open sets. A topological space satisfying this axiom has come to be called a Hausdorff space .",
  " f X Y p X V f p U p f U V An important attribute of general topological spaces is the ease of defining continuity of functions. A function f  mapping a topological space X into a topological space Y is defined to be continuous if, for each open set V of Y , the subset of X consisting of all points p for which f ( p ) belongs to V is an open set of X . Another version of this definition is easier to visualize, as shown in the figure . A function f from a topological space X to a topological space Y is continuous at p ∊ X if, for any neighbourhood V of f ( p ), there exists a neighbourhood U of p such that f ( U ) ⊆ V . These definitions provide important generalizations of the usual notion of continuity studied in analysis and also allow for a straightforward generalization of the notion of homeomorphism to the case of general topological spaces. Thus, for general topological spaces, invariant properties are those preserved by homeomorphisms.",
  "The idea of associating algebraic objects or structures with topological spaces arose early in the history of topology. The basic incentive in this regard was to find topological invariants associated with different structures. The simplest example is the Euler characteristic, which is a number associated with a surface. In 1750 the Swiss mathematician Leonhard Euler proved the polyhedral formula V – E + F = 2, or Euler characteristic, which relates the numbers V and E of vertices and edges, respectively, of a network that divides the surface of a polyhedron (being topologically equivalent to a sphere) into F simply connected faces. This simple formula motivated many topological results once it was generalized to the analogous Euler-Poincaré characteristic χ = V – E + F = 2 – 2 g for similar networks on the surface of a g -holed torus. Two homeomorphic surfaces will have the same Euler-Poincaré characteristic, and so two surfaces with different Euler-Poincaré characteristics cannot be topologically equivalent. However, the primary algebraic objects used in algebraic topology are more intricate and include such structures as abstract groups , vector spaces , and sequences of groups. Moreover, the language of algebraic topology has been enhanced by the introduction of category theory , in which very general mappings translate topological spaces and continuous functions between them to the associated algebraic objects and their natural mappings, which are called homomorphisms .",
  "A very basic algebraic structure called the fundamental group of a topological space was among the algebraic ideas studied by the French mathematician Henri Poincaré in the late 19th century. This group essentially consists of curves in the space that are combined by an operation arising in a geometric way. While this group was well understood even in the early days of algebraic topology for compact two-dimensional surfaces, some questions related to it still remain unanswered, especially for certain compact manifolds , which generalize surfaces to higher dimensions.",
  "The most famous of these questions, called the Poincaré conjecture, asks if a compact three-dimensional manifold with trivial fundamental group is necessarily homeomorphic to the three-dimensional sphere (the set of points in four-dimensional space that are equidistant from the origin), as is known to be true for the two-dimensional case. Much research in algebraic topology has been related in some way to this conjecture since it was posed by Poincaré in 1904. One such research effort concerned a conjecture on the geometrization of three-dimensional manifolds that was posed in the 1970s by the American mathematician William Thurston . Thurston’s conjecture implies the Poincaré conjecture, and in recognition of his work toward proving these conjectures, the Russian mathematician Grigori Perelman was awarded a Fields Medal at the 2006 International Congress of Mathematicians.",
  "The fundamental group is the first of what are known as the homotopy groups of a topological space. These groups, as well as another class of groups called homology groups, are actually invariant under mappings called homotopy retracts, which include homeomorphisms. Homotopy theory and homology theory are among the many specializations within algebraic topology.",
  "Many tools of algebraic topology are well-suited to the study of manifolds. In the field of differential topology an additional structure involving “smoothness,” in the sense of differentiability ( see  analysis: Formal definition of the derivative ), is imposed on manifolds. Since early investigation in topology grew from problems in analysis, many of the first ideas of algebraic topology involved notions of smoothness. Results from differential topology and geometry have found application in modern physics.",
  "  Another branch of algebraic topology that is involved in the study of three-dimensional manifolds is knot theory , the study of the ways in which knotted copies of a circle can be embedded in three-dimensional space. Knot theory, which dates back to the late 19th century, gained increased attention in the last two decades of the 20th century when its potential applications in physics, chemistry, and biomedical engineering were recognized.",
  "Mathematicians associate the emergence of topology as a distinct field of mathematics with the 1895 publication of Analysis Situs by the Frenchman Henri Poincaré , although many topological ideas had found their way into mathematics during the previous century and a half. The Latin phrase analysis situs may be translated as “analysis of position” and is similar to the phrase geometria situs , meaning “geometry of position,” used in 1735 by the Swiss mathematician Leonhard Euler to describe his solution to the Königsberg bridge problem . Euler’s work on this problem also is cited as the beginning of graph theory , the study of networks of vertices connected by edges, which shares many ideas with topology.",
  "During the 19th century two distinct movements developed that would ultimately produce the sibling specializations of algebraic topology and general topology. The first was characterized by attempts to understand the topological aspects of surfacelike objects that arise by combining elementary shapes, such as polygons or polyhedra. One early contributor to combinatorial topology, as this subject was eventually called, was the German mathematician Johann Listing, who published Vorstudien zur Topologie (1847; “Introductory Studies in Topology”), which is often cited as the first print occurrence of the term topology . In 1851 the German mathematician Bernhard Riemann considered surfaces related to complex number theory and, hence, utilized combinatorial topology as a tool for analyzing functions. The German geometers August Möbius and Felix Klein published works on “one-sided” surfaces in 1858 and 1882, respectively. Möbius’s example, now known as the Möbius strip , may be constructed by gluing together the ends of a long rectangular strip of paper that has been given a half twist. Surfaces containing subsets homeomorphic to the Möbius strip are called nonorientable surfaces and play an important role in the classification of two-dimensional surfaces. Klein provided an example of a one-sided surface that is closed, that is, without any one-dimensional boundaries. This example, now called the Klein bottle , cannot exist in three-dimensional space without intersecting itself and, thus, was of interest to mathematicians who previously had considered surfaces only in three-dimensional space.",
  "Work by many mathematicians, including the four mentioned above, preceded the 1895 publication of Analysis Situs , in which Poincaré established a basic context for using algebraic ideas in combinatorial topology. Combinatorial topology continued to be developed, especially by the German-born American mathematician Max Dehn and the Danish mathematician Poul Heegaard, who jointly presented one of the first classification theorems for two-dimensional surfaces in 1907. Soon thereafter the importance of associating algebraic structures with topological objects was clearly established by, for example, the Dutch mathematician L.E.J. Brouwer and his fixed point theorem . Although the phrase algebraic topology was first used somewhat later in 1936 by the Russian-born American mathematician Solomon Lefschetz, research in this major area of topology was well under way much earlier in the 20th century.",
  "Simultaneous with the early development of combinatorial topology, 19th-century analysts, such as the French mathematician Augustin Cauchy and the German mathematician Karl Weierstrass , investigated Fourier series, in which sequences of functions converged to other functions in a sense similar to convergence of sequences of points in space. From another point of view, mathematicians such as the German Georg Cantor and the French Émile Borel studied the relationship between Fourier series and set theory . Two initiatives arose from these efforts: establishing a rigorous mathematical setting for major problems of analysis and providing a general setting for mathematical ideas related to convergence of sequences. In 1899 the German mathematician David Hilbert proposed an axiomatic setting for general geometry beyond what the ancient Greeks had considered. In 1905 the French mathematician Maurice Fréchet proposed a consistent scheme of axioms for convergence in an abstract set and also axioms for a metric space , which is a set supplied with a distance function (or “metric”). In 1910 Hilbert suggested axioms for neighbourhoods of points in an abstract set, thereby generalizing properties of small disks centred at points in the plane. Finally, the German mathematician Felix Hausdorff in his Grundzüge der Mengenlehre (1914; “Elements of Set Theory”) proposed the foundational axiomatic relationships among the metric, limit, and neighbourhood approaches for general spaces ( see  Hausdorff space ). Although it was not until 1925 that the Russian mathematician Pavel Alexandrov introduced the modern axioms for a topology on an abstract set, the field of general topology was born in Hausdorff’s work.",
  "During the period up to the 1960s, research in the field of general topology flourished and settled many important questions. The notion of dimension and its meaning for general topological spaces was satisfactorily addressed with the introduction of an inductive theory of dimension. Compactness , a property that generalizes closed and bounded subsets of n -dimensional Euclidean space, was successfully extended to topological spaces through a definition involving “covers” of a space by collections of open sets, and many problems involving compactness were solved during this period. The metrization problem, which sought a topological description of the spaces for which the topology could be induced by a metric, was settled following considerable work on the notion of paracompactness, a property that generalizes compactness.",
  " Since the 1960s, research in general topology has moved into several new areas that involve intricate mathematical tools, including set theoretic methods. In the late 1960s researchers worked to generalize some of the topological properties of infinite-dimensional Hilbert space . These efforts foreshadowed a new area of topology now referred to as infinite-dimensional topology. Another major area of modern interest is set theoretic topology, in which the connection between topological spaces and notions from set theory and logic is studied. Some of the problems in this area involve topological propositions that are independent of and yet consistent with the usually assumed axioms of set theory ( see the table ). The resulting arguments, referred to as forcing theory, have yielded provisional truth of some major longstanding topological conjectures.",
  " Colin C. Adams , The Knot Book: An Elementary Introduction to the Mathematical Theory of Knots (1994, reissued 2001), is an accessible, entertaining, and wonderfully illustrated introduction to topological ideas and the modern methods of knot theory. Stephan C. Carlson , Topology of Surfaces, Knots, and Manifolds: A First Undergraduate Course (2001), provides a reader-friendly textbook covering elementary combinatorial topology, graph theory, and knot theory. Jeffrey R. Weeks , The Shape of Space , 2nd ed. (2002), is an intriguing mind-stretching dose of two- and three-dimensional geometry and topology that includes applications of topology to cosmology. I.M. James (ed.), History of Topology (1999), contains 40 informative articles, some written by well-known topologists of the past and others by current experts. The articles span topology from its beginnings to the modern day, highlighting the individuals involved, and include extensive bibliographies. Stephen Willard , General Topology (1970, reissued 2004), while dated, is a lively introduction to point-set topology and contains thorough historical notes. William S. Massey , Algebraic Topology: An Introduction (1967, reissued with corrections 1989), provides a well-balanced first course in algebraic topology, with good use of geometric motivation. James R. Munkres , Topology , 2nd ed. (2000), offers a well-designed two-part topology text covering both point-set and algebraic topology. Lynn A. Steen and J. Arthur Seebach, Jr. , Counterexamples in Topology , 2nd ed. (1978, reissued 1995), is the perfect companion to any book on topology, offering nearly 150 categorized examples."
]