[
  " materialism , also called physicalism , in philosophy, the view that all facts (including facts about the human mind and will and the course of human history) are causally dependent upon physical processes, or even reducible to them.",
  "The word materialism has been used in modern times to refer to a family of metaphysical theories (i.e., theories of the nature of reality) that can best be defined by saying that a theory tends to be called materialist if it is felt sufficiently to resemble a paradigmatic theory that will here be called mechanical materialism. This article covers the various types of materialism and the ways by which they are distinguished and traces the history of materialism from the Greeks and Romans to modern forms of materialism.",
  "Mechanical materialism is the theory that the world consists entirely of hard, massy material objects, which, though perhaps imperceptibly small, are otherwise like such things as stones. (A slight modification is to allow the void—or empty space—to exist also in its own right.) These objects interact in the sort of way that stones do: by impact and possibly also by gravitational attraction. The theory denies that immaterial or apparently immaterial things (such as minds) exist or else explains them away as being material things or motions of material things.",
  "In modern physics (if interpreted realistically), however, matter is conceived as made up of such things as electrons , protons , and mesons , which are very unlike the hard, massy, stonelike particles of mechanical materialism. In it the distinction between matter and energy has also broken down. It is therefore natural to extend the word materialist beyond the above paradigm case (of mechanical materialism) to cover anyone who bases his theory on whatever it is that physics asserts ultimately to exist. This sort may be called physicalistic materialism. Such a materialist allows the concept of material thing to be extended so as to include all of the elementary particles and other things that are postulated in fundamental physical theory—perhaps even continuous fields and points of space-time . Inasmuch as some cosmologists even try to define the elementary particles themselves in terms of the curvature of space-time, there is no reason why a philosophy based on such a geometricized cosmology should not be counted as materialist, provided that it does not give an independent existence to nonphysical things such as minds.",
  "Still another departure from the paradigm is the theory that holds that everything is composed of material particles (or physical entities generally) but also holds that there are special laws applying to complexes of physical entities, such as living cells or brains , that are not reducible to the laws that apply to the fundamental physical entities. (To avoid inconsistency, such a theory may have to allow that the ordinary laws of physics do not wholly apply within such complex entities.) Such a theory, which could be called “emergent materialism,” can shade off, however, into theories that one would not wish to call materialist, such as hylozoism , which ascribes vital characteristics to all matter, and panpsychism , which attributes a mindlike character to all constituents of material things.",
  "Another common relaxation of the paradigm is that which allows as compatible with materialism such a theory as epiphenomenalism, according to which sensations and thoughts do exist in addition to material processes but are nonetheless wholly dependent on material processes and without causal efficacy of their own. They are related to material things somewhat in the way that a thing’s shadow is related to the thing. A similar departure from the paradigm is a form of what might be called “double-aspect materialism,” according to which in inner experience one is acquainted with nonphysical properties of material processes, though these properties are not causally effective. A form of double-aspect theory in which these properties were allowed to be causally effective would be a species of emergent materialism.",
  "Of course, more than one of these qualifications might be made at the same time. If no other qualifications are intended, it is convenient to use the word extreme and to speak, for example, of “extreme physicalist materialism”—which is probably the type most discussed among professional philosophers in English-speaking countries.",
  "In the wider world, however, the word materialism may bring to mind dialectical materialism , which was the orthodox philosophy of communist countries. This is most importantly a theory of how changes arise in human history, though a general metaphysical theory lies in the background. Dialectical materialists contrast their view with what they call “vulgar” materialism; and it does, indeed, appear that their theory is not an extreme materialism, whether mechanical or physicalist. They seem to hold merely that mental processes are dependent on or have evolved from material ones. Though they might be akin to emergent materialists, it is hard to be sure; their assertion that something new emerges at higher levels of organization might refer only to such things as that a computer is different from a mere heap of its components. And if so, even an extreme physicalistic materialist could acquiesce in this view. The distinctive features of dialectical materialism would thus seem to lie as much in its being dialectical as in its being materialist. Its dialectical side may be epitomized in three laws: (1) that of the transformation of quantity into quality, (2) that of the interpenetration of opposites, and (3) that of the negation of the negation. Nondialectical philosophers find it hard, however, to interpret these laws in a way that does not make them into either platitudes or falsehoods.",
  "Perhaps because of the historical determinism implicit in dialectical materialism, and perhaps because of memories of the mechanical materialist theories of the 18th and 19th centuries, when physics was deterministic, it is popularly supposed that materialism and determinism must go together. This is not so. As indicated below, even some ancient materialists were indeterminists, and a modern physicalist materialism must be indeterministic because of the indeterminism that is built into modern physics. Modern physics does imply, however, that macroscopic bodies behave in a way that is effectively deterministic, and, because even a single neuron (nerve fibre) is a macroscopic object by quantum-mechanical standards, a physicalistic materialist may still regard the human brain as coming near to being a mechanism that behaves in a deterministic way.",
  "A rather different way of classifying materialist theories, which to some extent cuts across the classifications already made, emerges when the theories are divided according to the way in which a materialist accounts for minds. A central-state materialist identifies mental processes with processes in the brain. An analytical behaviourist, on the other hand, argues that, in talking about the mind, one is not talking about an actual entity, whether material (e.g., the brain) or immaterial (e.g., the soul ); rather, one is somehow talking about the way in which people would behave in various circumstances. According to the analytical behaviourist, there is no more of a problem for the materialist in having to identify mind with something material than there is in identifying such an abstraction as the average plumber with some concrete entity. Analytical behaviourism differs from psychological behaviourism , which is merely a methodological program to base theories on behavioral evidence and to eschew introspective reports. The analytical behaviourist usually has a theory of introspective reports according to which they are what are sometimes called “avowals”: roughly, he contends that to say “I have a pain” is to engage in a verbal surrogate for a wince. Epistemic materialism is a theory that can be developed either in the direction of central-state materialism or in that of analytical behaviourism and that rests on the contention that the only statements that are intersubjectively testable are either observation reports about macroscopic physical objects or statements that imply such observation reports (or are otherwise logically related to them).",
  "Before leaving this survey of the family of materialistic theories, a quite different sense of the word materialism should be noted in which it denotes not a metaphysical theory but an ethical attitude. A person is a materialist in this sense if he is interested mainly in sensuous pleasures and bodily comforts and hence in the material possessions that bring these about. A person might be a materialist in this ethical and pejorative sense without being a metaphysical materialist, and conversely. An extreme physicalistic materialist, for example, might prefer a Beethoven recording to a comfortable mattress for his bed; and a person who believes in immaterial spirits might opt for the mattress.",
  "Though Thales of Miletus (c. 580 bce ) and some of the other pre-Socratic philosophers have some claims to being regarded as materialists, the materialist tradition in Western philosophy really begins with Leucippus and Democritus , Greek philosophers who were born in the 5th century bce . Leucippus is known only through his influence on Democritus. According to Democritus, the world consists of nothing but atoms (indivisible chunks of matter) in empty space (which he seems to have thought of as an entity in its own right). These atoms can be imperceptibly small, and they interact either by impact or by hooking together, depending on their shapes. The great beauty of atomism was its ability to explain the changes in things as due to changes in the configurations of unchanging atoms. The view may be contrasted with that of the earlier philosopher Anaxagoras , who thought that when, for example, the bread that a person eats is transformed into human flesh, this must occur because bread itself already contains hidden within itself the characteristics of flesh. Democritus thought that the soul consists of smooth, round atoms and that perceptions consist of motions caused in the soul atoms by the atoms in the perceived thing.",
  " bce  Because Epicurus ’s philosophy was expounded in a lengthy poem by Lucretius , a Roman philosopher of the 1st century bce , Epicurus (died 270 bce ) was easily the most influential Greek materialist. He differed from Democritus in that he postulated an absolute up-down direction in space, so that all atoms fall in roughly parallel paths. To explain their impacts with one another, he then held that the atoms are subject to chance swerves—a doctrine that was also used to explain free will. Epicurus’s materialism therefore differed from that of Democritus in being an indeterministic one. Epicurus’s philosophy contained an important ethical part, which was a sort of enlightened egoistic hedonism. His ethics, however, was not materialistic in the pejorative sense of the word.",
  "  Materialism languished throughout the medieval period , but the Epicurean tradition was revived in the first half of the 17th century in the atomistic materialism of the French Roman Catholic philosopher Pierre Gassendi . In putting forward his system as a hypothesis to explain the facts of experience, Gassendi showed that he understood the method characteristic of modern science, and he may well have helped to pave the way for corpuscular hypotheses in physics. Gassendi was not thoroughgoing in his materialism inasmuch as he accepted on faith the Christian doctrine that people have immortal souls. His contemporary, the English philosopher Thomas Hobbes , also propounded an atomistic materialism and was a pioneer in trying to work out a mechanistic and physiological psychology . Holding that sensations are corporeal motions in the brain, Hobbes skirted, rather than solved, the philosophical problems about consciousness that had been raised by another contemporary, the great French philosopher René Descartes . Descartes’s philosophy was dualistic , making a complete split between mind and matter. In his theory of the physical world, however, and especially in his doctrine that animals are automata , Descartes’s own system had a mechanistic side to it that was taken up by 18th-century materialists, such as Julien de La Mettrie , the French physician whose appropriately titled L’Homme machine (1747; Man a Machine, applied Descartes’s view about animals to human beings. Denis Diderot , chief editor of the 18th-century Encyclopédie , supported a broadly materialist outlook by considerations drawn from physiology , embryology , and the study of heredity ; and his friend Paul, baron d’Holbach , published his Système de la nature (1770; System of Nature ), which expounded a deterministic type of materialism in the light of evidence from contemporary science , reducing everything to matter and to the energy inherent in matter. He also propounded a hedonistic ethics as well as an uncompromising atheism , which provoked a reply even from the Deist  Voltaire .",
  "The 18th-century French materialists had been reacting against orthodox Christianity . In the early part of the 19th century, however, certain writers in Germany—usually with a biological or medical background—reacted against a different orthodoxy, the Hegelian and Neo-Hegelian tradition in philosophy—named for the German idealist philosopher Georg Wilhelm Friedrich Hegel Among these were Ludwig Büchner and Karl Vogt. The latter is notorious for his assertion that the brain secretes thought just as the liver secretes bile . This metaphor of secretion, previously used by P.-J.-G. Cabanis , a late 18th-century French materialist, is no longer taken seriously, because to most philosophers it does not make sense to think of thought as a stuff. The Hobbesian view, also espoused by Büchner, that thought is a motion in the brain, has been viewed as more promising.",
  "The synthesis of urea (the chief nitrogenous end product of protein  metabolism ), discovered in 1828, broke down the discontinuity between the organic and the inorganic in chemistry , which had been a mainstay of nonmaterialistic biology. Materialist ways of thinking were later strengthened enormously by the Charles Darwin ’s theory of evolution , which not only showed the continuity between humans and other living things back to the simplest organisms but also showed how the apparent evidences of design in natural history could be explained on a purely causal basis. There still seemed to be a gap, however, between the living and the nonliving, though E.H. Haeckel , a 19th-century German zoologist, thought that certain simple organisms could have been generated from inorganic matter and, indeed, that a certain simple sea creature may well be in process of generation in this way even now. Though Haeckel was wrong, 20th-century biologists proposed much more sophisticated and more plausible theories of the evolution of life from inorganic matter. Haeckel and his contemporary, the British zoologist T.H. Huxley , did much to popularize philosophical accounts of the world that were consonant with the scientific thought of their time, but neither could be regarded as an extreme materialist.",
  "Perhaps because modern developments in biochemistry and in physiological psychology greatly increased the plausibility of materialism, there was in the mid-20th century a resurgence of interest in the philosophical defense of central-state materialism. Central-state materialists proposed their theories partly because of dissatisfaction with the analytical behaviourism of the Oxford philosopher Gilbert Ryle . Ryle himself was reluctant to call himself a materialist, partly because of his dislike of all “isms” and partly because he thought that the notion of matter has meaning only by contrast with that of mind, which he thought to be an illegitimate sort of contrast. Nevertheless, it would seem that analytical behaviourism could be used to support a physicalist materialism that would go on to explain human behaviour by means of neural mechanisms. (Ryle himself was suspicious of mechanistic accounts of biology and psychology.) Analytical behaviourism was felt to be unsatisfactory, however, chiefly because of its account of introspective reports as avowals ( see above  Types distinguished by their account of mind ), which most philosophers found to be unconvincing.",
  "Philosophers distinguished two forms of central-state materialism, namely, the translation form and the disappearance form. The translation form is the view that mentalistic discourse can be translated into discourse that is neutral between physicalism and dualism, so that the truth of a person’s introspective reports is compatible with the objects of these reports being physical processes. The disappearance form is the view that such a translation cannot be done and that this fact, however, does not refute physicalism but shows only that ordinary introspective reports are contaminated by false theories.",
  "Among the philosophers who advocated the translation form was the American philosopher Herbert Feigl, earlier a member of the Vienna Circle , who, in an influential monograph ( see  Bibliography: Materialism ), did the most to get contemporary philosophers to treat central-state materialism as a serious philosophical theory. Against the objection that, for example, “visual sensation” does not mean “process in the visual cortex ,” advocates of the translation form pointed out that “the morning star” does not mean the same as “the evening star,” and yet the morning star as a matter of fact is the evening star (both terms refer to the planet  Venus ). The objection confuses meaning and reference. Against the objection that a purely physical process (a dance of electrons, protons, and so on) cannot have the sensory quality of greenness that is observed in a visual experience of seeing grass, say, they replied that to talk of the sensory experience of something looking green (or having a green mental image) is not to talk of anything that is literally green, but is simply to report that some internal process is of the sort that normally goes with seeing something, such as a lawn, which really is green. Though some immaterialists might say that the sort of process in question is “spiritual,” the materialist might equally claim that it is a material process in the brain. The analysis of the introspective report is neutral between these two contentions; the materialist, however, opts for his contention on various grounds. The British materialist U.T. Place did so on the ground of normal scientific methodology; and the Australian materialist J.J.C. Smart did so with a metaphysical application of the principle (called “ Ockham’s razor ”) that entities should not be multiplied beyond necessity. A physicalistic materialist has, of course, an obligation to go on to give a suitable account of such apparently nonphysicalist qualities as the greenness of grass. At one time Smart analyzed colours in terms of the discriminatory behaviour of human beings. Another Australian materialist, D.M. Armstrong, held, on the other hand, that colours are as a matter of fact properties of objects, such properties being of the sort describable in the theoretical terms of physics. Feigl, in turn, was to some extent (and rather reluctantly) a double-aspect theorist. He qualified the position taken by the other translation theorists, conceding that the translations do leave something out—viz., the immediately introspectable properties of “raw feels,” such as that of hearing the tone of middle C. He held, however, that such properties are irrelevant to causal explanations of phenomena.",
  "    The translation form of central-state materialism thus had some affinities with the earlier epistemic materialism of the logical positivist philosophers Rudolf Carnap and Hans Reichenbach . Thus, Carnap suggested that mental predicates be treated as applying to material entities: for example, “Carnap sees green” could be taken as meaning “the body Carnap is in the state of green-seeing,” the state of green-seeing being a purely physical state that explains the behavioral facts that led one to ascribe the predicate “sees green” to Carnap in the first place. David K. Lewis , an American philosopher of science and language, developed a translation form of central-state materialism on the basis of a theory regarding the definition of theoretical terms in science. According to this theory, entities such as electrons, protons, and neutrons are defined in terms of the causal roles that they play in relation to observational phenomena—e.g., phenomena in cloud chambers —but the method of definition is able to do justice to the causal and other interrelations between the theoretical entities themselves. Lewis applied this account to commonsense psychology. Since mental entities, such as pains, are defined in commonsense psychology in terms of their causal roles (in relation to observable behaviour) and since there is empirical reason to ascribe the same causal roles to brain processes, Lewis identified mental events, processes, and states with brain events, processes, and states.",
  "The disappearance form of central-state materialism was held by P.K. Feyerabend, an American philosopher, who denied that the materialist can give a neutral analysis of introspective reports. In Feyerabend’s view, commonsense introspective reports are irreducibly immaterialist in content. He argued, however, that this admission does not show the untenability of materialism. Ordinary mentalistic discourse, he held, is comparable to the medieval discourse about epileptics as being “possessed by the devil.” If one now “identified” demon possession with a certain medical condition of the brain, this would really be an assertion that there is no such thing as a demon-possessed state: the medieval way of looking at the matter is thus rejected. It is in this sort of way that Feyerabend wanted to “identify” the mind with the brain: he simply rejected the ordinary mentalistic conceptual scheme and so felt no obligation to show its compatibility with materialism.",
  "The influential American philosophers W.V. Quine and Wilfrid Sellars also held theories that could be regarded as disappearance forms of physicalistic materialism, though there is a Kantian twist to Sellars’s philosophy that makes it hard to classify. Sellars held that mentalistic concepts cannot be eliminated from the commonsense picture of the world, which he called “the manifest image.” In a way reminiscent of the German Enlightenment philosopher Immanuel Kant , he held that, although the manifest image is inescapable, it does not give metaphysical truth about the world as it really is in itself. This truth is given, instead, by “the scientific image”—i.e., by theoretical science, which is physicalist. In the case of Quine, there is a certain Platonism in that he believes in the objective reality of some abstract , or nonspatiotemporal, entities—viz., those that are the subject matter of pure mathematics . Because he held that the reason for believing mathematics is that it is needed as part of physical theory, his reasons for believing in numbers and the like are not in principle different from those for believing in electrons; thus, Quine’s Platonism does not really compromise his physicalism.",
  "The Austrian philosopher Ludwig Wittgenstein , who was for part of his career professor of philosophy at the University of Cambridge , has sometimes been interpreted as a behaviourist, though his insistence that “an ‘inner process’ stands in need of outward criteria” could possibly be interpreted as a sort of epistemic and central-state materialism. Nevertheless, to count Wittgenstein as a materialist would be to take considerable liberties with him; for, while displaying at times a certain mystical attitude, he also held very strongly that the business of a philosopher is not to put forward any metaphysical theory but to clear up conceptual confusions—as he put it, “to shew the fly out of the fly bottle.”",
  "This historical survey has been concerned with materialism in Western philosophy. On the whole, materialism is contrary to the spirit of both Indian and traditional Chinese philosophy , though the Carvaka school of materialists flourished from the 6th century bce until medieval times in India. Mention should also be made of the strong naturalistic tendency in Theravada  Buddhism , as also in certain schools of Chinese philosophy that exalt qi (life force; literally, “vital breath”) above principle and mind.",
  "The main attraction of materialism is the way in which it fits in with a unified picture of science—a picture that has become very plausible. Thus, chemistry is reducible to physics inasmuch as there is a quantum-mechanical theory of the chemical bond . Biology is mainly an application of physics and chemistry to the structures described in natural history (including the natural history that one can explore through powerful microscopes ). Increasingly, biological explanations resemble explanations in engineering , in which material structures are described and then the laws of physics and chemistry are used to explain the behaviour of these structures. (In the biological case, of course, these structures are often dynamic in the sense that their molecules are continually being replaced.) Through the influence of neurophysiology and also cybernetics (the science of information and control, which can be applied also to automata), scientific psychology is also fitting well into the same mechanistic scheme.",
  "There is a recalcitrant residue, however, in the phenomena of consciousness. Here mental events seem, indeed, to be correlated with physical events; but, if the mental events are not the very same as the physical events, one is left with apparently ultimate (or irreducible) physical-mental laws that do not fit happily into unified science, and one is thus faced with a situation unlike that of the rest of science. Looking at science generally, one expects ultimate laws to relate simple entities, such as fundamental particles. A physical-mental law, however, would have to refer to something very complex—a brain process involving perhaps millions of neurons, with each neuron being itself an almost fantastically complex entity. There would be a multitude of physical-mental laws, which would look like excrescences on the face of science. Because they would not fit into the network of scientific laws, Feigl called them “nomological danglers.” To get rid of the need for these danglers is one of the chief goals of materialism. Of course, an immaterialist might assert that mental entities exist and also that there are no physical-mental laws. But it might be hard for him to reconcile this position with the empirical evidence; and in any case he would be faced with the problem of how to distinguish the free exercise of such anomalous physical-mental interaction from mere chance behaviour.",
  "The development of computers and other devices to take over much of the more routine sort of human behaviour led to attempts on the part of scientists and technologists, such as the American Marvin Minsky , to develop real artificial intelligence (AI). So far, the success that these scientists hoped for has not been achieved. The American theoretical linguist Noam Chomsky has argued on the basis of his theories of the mental structures underlying language learning and use that the brain is quite unlike any already-understood type of mechanism. Indeed, any physicalistic materialist must certainly concede that there are very deep problems about the brain, which can no longer be thought of as a bundle of conditioned reflex mechanisms or the like, as it often seemed to be to many psychologists until Chomsky’s theories gained wider acceptance in the 1960s and ’70s. The physicalist can stress, however, that the investigator’s ignorance need not lead him to assume that he will never be able to find an explanation of intelligence and of linguistic abilities in terms consonant with his present notion of a physical mechanism. (There is also the possibility that physical laws not yet discovered might be needed to explain the workings of the brain. So long as these turned out to be basic laws of physics, such discoveries would not imply a shift to emergentist materialism.)",
  "Some philosophers, such as the British philosopher J.R. Lucas, tried to produce positive arguments against a mechanistic theory of mind by employing certain discoveries in mathematical logic , especially Kurt Gödel ’s first incompleteness theorem , which implies that no axiomatic theory could possibly capture all arithmetical truths. In general, however, philosophers have not found such attempts to extract an antimaterialist philosophy from mathematical logic to be convincing. Nevertheless, the problems of mechanizing intelligence, including the mathematical abilities of human beings, do pose unsolved problems that the materialist is obliged to take seriously.",
  "Perhaps the most common challenge to materialism has come from philosophers who hold that it cannot do justice to the concept of intentionality , which the German philosopher Franz Brentano made the distinguishing mark between the mental and the nonmental. (A related objection is that materialism cannot do justice to the distinction between behaviour and mere bodily movements.) Brentano held that mental events and states somehow point toward objects beyond themselves (or have a “content”). Many contemporary philosophers agree with Brentano that purely physical entities cannot have this property. If it is said, for example, that magnetized spots on a hard disk can refer beyond themselves in the way that thoughts do, then it is commonly replied that, in themselves, the spots on the disk have no reference or content—for this belongs only to the thoughts in the mind of a person who reads the disk. The materialist reply may be to argue, however, that there is a fundamental unclarity in the very notion of intentionality (this is roughly Quine’s position) or else to argue that purely physical systems can, after all, possess intentionality.",
  "Finally, the alleged spiritualistic and other phenomena reported in psychical research are sometimes adduced against materialism. The materialist, however, can well afford to postpone discussion of these phenomena until such time as they are accepted by the general scientific community, which on the whole still remains skeptical of them.",
  "The period up through the mid-19th century is covered in F.A. Lange , Geschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart, 2 vol. (1902; Eng. trans., History of Materialism and Criticism of Its Present Importance, 3rd ed., 3 vol. (1925). Ancient materialism is treated in George Novack , The Origins of Materialism: The Evolution of a Scientific View of the World (1965). The later period through the mid-20th century is discussed in John Passmore , A Hundred Years of Philosophy, 2nd ed. (1966). There are excellent articles by Keith Campbell and H.B. Acton on “Materialism” and “Dialectical Materialism” in the Encyclopedia of Philosophy, vol. 5, pp. 179–188 and vol. 2, pp. 389–397 (1967). Examples of work by most of the contemporary writers are given in John O’Connor (ed.), Modern Materialism: Readings on Mind-Body Identity (1969); and C.V. Borst (ed.), The Mind-Brain Identity Theory (1970). Herbert Feigl , The “Mental” and the “Physical”: The Essay and a Postscript (1967); J.J.C. Smart , Philosophy and Scientific Realism (1963); D.M. Armstrong , A Materialist Theory of the Mind (1968); and Wilfrid Sellars , Science, Perception and Reality (1963), especially chapter 1, are also useful. A rather difficult book defending materialism from the difficulties about intentionality is D.C. Dennett , Content and Consciousness (1969). Two very different styles of antimaterialist argument are presented in J.R. Lucas , The Freedom of the Will (1970); and Norman Malcolm , Problems of Mind (1971). Another interesting critique of materialism is John Beloff , The Existence of Mind (1962). A mainly mechanistic philosophy of biology presented bya German biologist is B. Rensch , Biophilosophie auf erkenntnistheoretischer Grundlage (Panpsychistischer Identismus) (1968; Eng. trans., Biophilosophy, 1971), though Rensch’s philosophy is also panpsychist.",
  "Some classic materialist works are Lucretius , On the Nature of the Universe, trans. by R.E. Latham (1951); Thomas Hobbes , Body, Mind and Citizen: Selections, ed. by R.S. Peters (1962); René Descartes , Philosophical Writings, trans. and ed. by Elizabeth Anscombe and P.T. Geach (1954); and A. Vartanian , La Mettrie’s “L’Homme machine”  A Study in the Origins of an Idea (1960), which is a critical edition with introductory monograph and notes.",
  "Epistemic materialism is exemplified in Rudolf Carnap , “Psychology in Physical Language,” in A.J. Ayer (ed.), Logical Positivism (1959); Carnap’s replies to Herbert Feigl and A.J. Ayer in P.A. Schilpp (ed.), The Philosophy of Rudolf Carnap (1964); and H. Reichenbach , Experience and Prediction (1938). The most relevant and important works by Ryle and Wittgenstein are: Gilbert Ryle , The Concept of Mind (1949); and Ludwig Wittgenstein , Philosophical Investigations (1953). A materialist critique of Ryle is Brian Medlin , “Ryle and the Mechanical Hypothesis,” in C.F. Presley (ed.), The Identity Theory of Mind, 2nd ed. (1971)."
]