[
  " teacher education , any of the formal programs that have been established for the preparation of teachers at the elementary - and secondary -school levels.",
  "  (Read Arne Duncan’s Britannica essay on “Education: The Great Equalizer.”)  ",
  "While arrangements of one kind or another for the education of the young have existed at all times and in all societies, it is only recently that schools have emerged as distinctive institutions for this purpose on a mass scale, and teachers as a distinctive occupational category. Parents, elders, priests, and wise men have traditionally seen it as their duty to pass on their knowledge and skills to the next generation. As Aristotle put it, the surest sign of wisdom is a man’s ability to teach what he knows. Knowing, doing, teaching, and learning were for many centuries—and in some societies are still today—indistinguishable from one another. For the most part the induction of the young into the ways of acting, feeling, thinking, and believing that are characteristic of their society has been an informal—if serious and important—process, accomplished chiefly by means of personal contact with full-fledged adults, by sharing in common activities, and by acquiring the myths, legends, and folk beliefs of the culture. Formal ceremonies, such as the puberty rite, marked the point at which it was assumed that a certain range of knowledge and skill had been mastered and that the individual could be admitted to full participation in tribal life. (Residual elements of such ceremonies remain in some modern arrangements; it has been seriously contended that the study of the Latin language in the Renaissance and post-Renaissance school can be interpreted as a form of puberty rite.) Even in the formally established schools of the Greek city-states and of the medieval world there was little separation between, on the one hand, the processes of organizing and setting down knowledge and, on the other, those of teaching this knowledge to others.",
  "This does not mean, however, that prior to the 19th century little attention was given to a training in teaching methods as distinct from “subjects.” The great works of medieval scholasticism were essentially textbooks that were designed to be used for the purpose of teaching. Today, as in the medieval world, methods of teaching and the organization of knowledge continue to be reciprocally influential. Nor are the problems that today surround the qualifications and certification of teachers wholly new. State, church, and local authorities everywhere have long recognized the importance of the teacher’s work in maintaining or establishing particular patterns of social organization and systems of belief, just as radical and reformist politicians and thinkers have looked to the schools to disseminate their particular brands of truth. In medieval and post-Reformation Europe, for example, there was considerable concern with the qualifications and background of teachers, mainly but not entirely with reference to their religious beliefs. In 1559 Queen Elizabeth I of England issued an injunction that prohibited anyone from teaching without a license from his bishop. The license was granted only after an examination of the applicant’s “learning and dexterity in teaching,” “sober and honest conversation,” and “right understanding of God’s true religion.” Thus the certification of teachers and concern for their character and personal qualities are by no means new issues.",
  "What is new for most societies—European, American, African, and Asian—is the attempt to provide a substantial period of formal education for everyone and not just for the small proportion of the population who will become political, social, and religious leaders or for those few who possess surplus time and money for the purpose. Universal literacy, already achieved in most European and American and many Asian societies, has become the goal of all. In an increasing proportion of countries every child now proceeds automatically to secondary education; many remain at school until 16 or 18 years of age, and large numbers go on to some form of postsecondary education and training. The scale and variety of educational provision that all this requires makes the supply, education, training, and certification of an adequate number of teachers a worldwide issue of education policy and practice. In developed and developing countries alike, no factor is of greater importance in relation to the quantity and quality of education; it is significant that a substantial proportion of the budget of the United Nations Educational, Scientific and Cultural Organization (UNESCO) is devoted to the improvement of teacher preparation.",
  "The term “teacher” in this article is used to mean those who work in schools providing education for pupils up to the age of 18. Thus, “teacher education” refers to the structures, institutions, and processes by means of which men and women are prepared for work in elementary and secondary schools. This includes preschool, kindergarten, elementary, and secondary institutions for children from the age of two or three to 18.",
  "Teacher education, as it exists today, can be divided into two stages, preservice and in-service. Preservice education includes all the stages of education and training that precede the teacher’s entry to paid employment in a school. In-service training is the education and training that the teacher receives after the beginning of his career.",
  "The earliest formal arrangements for teacher preparation, introduced in some of the German states during the early part of the 18th century, included both preservice and in-service training. A seminary or normal school for “young men who had already passed through an elementary, or even a superior school, and who were preparing to be teachers, by making additional attainments, and acquiring a knowledge of the human mind, and the principles of education as a science, and of its methods as an art” was set up in Halle in 1706. By the end of the century there were 30 such institutions in operation in Germany.",
  "Systematic training was linked to an equally systematic process of certification, control of teaching conditions, and in-service study. All public teachers were required to attend a series of meetings to extend their practical knowledge. Parochial conferences took place monthly in the winter, district conferences bimonthly in the summer, a circle conference twice a year, and a departmental conference annually. Each seminary was responsible for maintaining contact with all the teachers working within a six-mile radius, and some established “repetition courses” for experienced teachers who wanted to refresh and add to their knowledge.",
  "Nineteenth-century developments in education in the United States, Britain, France, Belgium, and Japan owed much to the pattern that had been established in Germany. In France at the time of the French Revolution efforts were made to set up a system of normal schools. The École Normale (later the École Normale Supérieure), founded in 1794, closed after a few months; but it was reestablished by Napoleon in 1808 to train teachers for the lycées . After 1833 a uniform system of écoles normales (initially only for male students) was created, and the normal-school systems of several countries date from the third decade of the century.",
  "During the first 30 years of the 19th century, teacher preparation in the United States, Britain, and elsewhere was dominated by the monitorial methods introduced by Andrew Bell and Joseph Lancaster. In the simplest terms, the method involved a master instructing a number of senior pupils or “monitors,” who then passed on their newly acquired knowledge to a larger number of pupils. Such methods were cheap, simple, and, it was widely believed, effective. They required a necessary emphasis upon facts, drill, repetition, mechanical learning, and ease of teaching. By 1820 there were 20 Lancastrian schools in the state of New York, where the system had official status until the middle of the century.",
  "With hindsight one can easily condemn the monitorial system. At the time, however, the supply of educated persons available and willing to teach in the elementary schools was severely limited, and the public funds to employ them were in short supply. The monitorial system, although faulted, enabled a large number of children to achieve the minimum level of literacy on which future development could build. Just as the organization of knowledge that prevailed during medieval times implied its own pedagogical methodology, so the Lancastrian system embodied a distinctive approach to the process of teaching; one of the attractions of such systems is that they provide a built-in solution to the problem of reconciling what the teacher needs to know and the pedagogical methods he should learn.",
  "Among those who were unimpressed by the claims of the Lancastrian system was David Stow, who in 1834 founded the Glasgow Normal Seminary from which “trainers,” as his graduates came to be called, went to schools in Scotland and many of the British colonial territories. In the United States, after an uncertain start, the Massachusetts Normal Schools founded by Horace Mann in the 1830s became a model for similar developments in Connecticut, Michigan, Rhode Island, Iowa, New Jersey, and Illinois. In England, churches and voluntary foundations were in process of establishing the first of the teacher-training colleges. Australia began the organized preparation of teachers in the early 1850s. At this early stage certain issues were already emerging that were to remain alive for the next hundred years and that are to some extent still relevant today.",
  "The needs of pupils and schools were beginning to advance beyond basic literacy. Human knowledge was becoming more diverse and scientific and was being organized into new disciplinary systems. Secondary education was expanding. The early inclusive pedagogic systems were falling into disfavour. The problem arose of reconciling the teacher’s personal need for education with his professional need for classroom technique. There were other than purely pedagogic considerations involved; the inhibitions of class society in England, the demand for practicality in the United States, a fear of liberal agitation in France, the patriotic missionary role of the teacher in Japan—all tended to maintain an emphasis upon the practical techniques of school management and to limit the range and level of the elementary teacher’s intellectual accomplishments to mastery of only such subject knowledge as was needed at the school level.",
  "Some educators asserted that the curriculum of the normal school should be academic, on the ground that the future teacher needed nothing more than experience of conventional subjects soundly taught. Others argued that training should have a purely professional function, including only such subject knowledge as the teacher would need in his classroom work. Some advocates claimed that the liberal and professional elements could readily be harmonized or integrated. The work of Derwent Coleridge, principal of St. Mark’s College, London, who admitted that he took his models not from the pedagogical seminaries of Germany but from the universities of Oxford and Cambridge, exemplified the attempt to introduce a larger element of general education into teacher preparation. Sir James Kay-Shuttleworth, founder of another London college, emphasized basic subject matter; he held that",
  "not merely the subjects of instruction, but also the methods of teaching the candidates, should be so ordered as to be in itself a preparation for their future vocation as teachers. On this account the oral instruction of classes in a Normal school is greatly to be preferred to any other mode.",
  "In the United States, Horace Mann supported the value of a training in the “common branches” of knowledge, as a means of mental discipline. But the views of Derwent Coleridge, Kay-Shuttleworth, and Horace Mann, in common with those of many other educators of the time, reflected social as well as pedagogical considerations. Mann, it has been suggested, failed to recognize that the Prussian system that so impressed him was one that took lower class pupils and trained them as teachers of the lower classes—a system already under fire from German educators at the time that it was being used as a model for developments abroad.",
  "Between 1870 and 1890, legislation was enacted in a number of countries to systematize and broaden the work of the normal schools. In Japan an ordinance of 1886 established higher normal schools providing a four-year course for boys and girls who had completed eight years of elementary education. A French law of 1879 established a nationwide system of colleges for training women primary teachers ( écoles normales d’institutrices ). In Russia a statute on teachers’ seminaries was promulgated in 1870; within five years there were 34 such institutions, with nearly 2,000 students. A further statute in 1872 provided for institutes to train teachers for the new higher grade schools that were beginning to appear in the larger towns. In Scotland, the universities of Edinburgh and St. Andrews established chairs in education in 1876. In the United States a large number of universities had by 1895 set up education departments, and in some of them the preparation of teachers for work in the schools was beginning to be combined with systematic study and research in education processes.",
  "Developments in American universities owed a great deal to the efforts of men such as Henry Barnard, who, as schools commissioner in Rhode Island from 1845 to 1849, stimulated a local interest in education that led to the creation of a department of education at Brown University. Barnard wrote an influential series of books on pedagogy and teacher education and later, as president of Columbia University, inspired Nicholas Murray Butler and others to found Teachers College in 1888. This soon became the foremost university school of education in the United States. It incorporated two schools as teaching laboratories, enrolling children from kindergarten to college age. As its “Announcement” of 1901 made clear, it was not restricted to any one level of professional preparation:",
  "The purpose of Teachers College is to afford opportunity, both theoretical and practical, for the training of teachers of both sexes for kindergartens and elementary and secondary schools, of principals, supervisors and superintendents of schools, and of specialists in various branches of school work, including normal schools and colleges.",
  "Until about 1890 the “theoretical” elements in teacher preparation were of two kinds: the study of certain principles of teaching and school management, exemplified in the textbooks written by experienced schoolmen that were published in many countries during the second half of the 19th century; and instruction in “mental and moral philosophy,” history of education, psychology, and pedagogics. Some of the most popular and influential works, such as Rosencrantz’ Philosophy of Education , which was translated into English in the 1870s, made little distinction between philosophical and psychological data. But after 1890 psychology and sociology began to crystallize as more or less distinctive areas of study; students of education had a wider and more clearly structured range of disciplines to draw upon for their data and perspectives and to provide a “scientific” basis for their pedagogic principles.",
  "In the middle years of the 19th century the ideas of the Swiss educator J.H. Pestalozzi and of the German Friedrich Froebel inspired the use of object teaching, defined in 1878 by Alexander Bain in his widely studied Education as a Science as the attempt",
  "to range over all the utilities of life, and all the processes of nature. It begins upon things familiar to the pupils, and enlarges the conceptions of these, by filling in unnoticed qualities. It proceeds to things that have to be learnt even in their primary aspect by description or diagram; and ends with the more abstruse operations of natural forces.",
  "The work of these pioneers also led to a clearer recognition of the developmental needs and character of childhood. Later contributors to the corpus of ideas that underlie the processes of teacher education continued to provide philosophical, sociological, and psychological justification for particular views of the nature of education and of teaching, and also had a greater or lesser influence on the methods to be employed in classroom and school.",
  "The work of the German philosopher Johann Friedrich Herbart (1776–1841) was of particular importance in this latter respect. Herbart wrote a number of pedagogical works during his teaching career at the universities of Göttingen and Königsberg. In the latter part of the 19th century, the study of education along Herbartian lines became established in every European country, in America, and in Japan. Herbartianism offered a complete system—a philosophical theory, a set of educational aims, a rational psychology, and a pedagogy. Teaching, it held, should build on what the child already knows and should seek to inculcate, by the choice of appropriate materials, the highest moral character. It should be organized in accordance with the “five formal steps” of preparation, presentation, comparison, generalization, and application. The Herbartian doctrine rested as much upon the interpretation of his followers as upon the master’s own works, and its influence was of relatively limited duration. Other ideas were coming to the fore, less direct and comprehensive than Herbart’s but having greater impact upon the educational consciousness of the next half-century.",
  "The influence of Darwinian evolutionary ideas upon pedagogy was very marked. To the extent that the evolutionary viewpoint emphasized the processes by which individuals become adapted to their environment, as in the teachings of the English philosopher Herbert Spencer, their influence was profoundly conservative. But evolutionary ideas were also embodied within the child development theories of the American psychologist G. Stanley Hall, who argued that the stages of individual growth recapitulated those of social evolution and therefore that the distinctive character and status of childhood must be respected. The American philosopher William James also included evolutionary notions in his psychology. James’s emphasis, however, was not so much upon the processes by which individuals adapt as upon those through which they react creatively and positively with their circumstances, helping to shape and change these to meet their needs. James’s formulation of associationism, the building up of useful habit systems, had implications for the study of learning that teacher educators were quick to recognize and that were made more significant by the later experiments of the American psychologist Edward L. Thorndike (1874–1949). Thorndike’s work with animals stands at the beginning of a tradition that continues to the present day. The laws of learning that he formulated have for long been a staple of teacher-training courses in many countries. Thorndike saw psychology as the basis of a genuinely scientific pedagogy and claimed that “just as the science and art of agriculture depend upon chemistry and botany, so the art of education depends upon physiology and psychology.” He went on to argue, with a degree of confidence that rings strangely today, that",
  "A complete science of psychology would tell every fact about everyone’s intellect and character and behavior, would tell the cause of every change in human nature, would tell the result which every educational force—every act of every person that changed any other or the agent himself—would have.",
  "The greatest influence on teacher-training curricula in the United States and many other countries was exercised not by the experimental psychologists but by the pragmatist philosopher John Dewey. Dewey began with a conception of the nature of scientific method that he generalized into a specific pedagogical approach (popularized by others as the “project” method and, more recently, as inquiry-based learning). This he combined with a consideration of the nature of the child’s interests and capacities for learning and life experience, the nature and claims of different types of subject matter, and the importance of democratic values in the social context of the school. Just as James’s psychology gave back to the teacher and the school some of the influence on individual development that the interpreters of evolutionary adaptation had seemed to deny, so Dewey’s notion of the school as the embodiment of community ideals and the spearhead of social reform lent a new importance to the processes of teacher education.",
  "It is tempting to categorize these various perspectives as “conservative” or “progressive.” The former stress the importance of subject matter and of standard methods of effective instruction: the need for regularity and order in the classroom and for means that will encourage children to apply themselves diligently to learning, the importance of the teacher as a subject-matter expert and as an exemplar of accepted morality, and the existence of objective standards of scholarship and achievement to which teachers and students alike should aspire. The progressives, on the other hand, emphasize a more child-centred approach, designed to build upon the natural interests and curiosity of the child: a flexible pattern of teaching and classroom organization recognizing individual differences in motivation, capacity, and learning style; a conception of the teacher as an organizer of children’s learning rather than as an instructor; and the need to integrate the subject matter of different disciplines into topics and projects that have meaning in terms of the pupil’s own experience.",
  "Such conservative and progressive ideas have their roots in differing conceptions of the nature of man and society, of knowledge, and of the learning process. The differences are not new. The fortunes of the two perspectives tend to wax and wane in accordance with the times. Thus, in the United States, fears of a loss of technological supremacy in the late 1950s encouraged conservative critics to point to the weaknesses of “child-centred” education. In the same way, anxieties about the meaninglessness of the education experienced by the poor, coupled with evidences of widespread alienation among the young, encouraged a revival of interest in progressive ideas in the early 1970s. Many educators, of course, do not fall into either the conservative or the progressive category but draw their ideas from various sources. There has been a tendency in many countries, however, for the curricula of teacher-preparing institutions to be identified with progressive educational ideas.",
  "Many other ideas also influenced the curriculum and organization of teacher preparation during the last decade of the 19th and the first half of the 20th centuries. The dynamic psychology of Sigmund Freud and his early associates, the work of the Gestalt psychologists, the methods of measuring human abilities that were being developed in France, Great Britain, and the United States, the development of religious ideas in the Roman Catholic countries, the imposition of Marxist and Leninist ideologies in the former Soviet Union—all of these affected the normal schools, teachers’ colleges and seminaries, and university departments of education. Such new ideas and systems of thought had their impact at three main levels.",
  "First, they influenced the nature of the social commitment that teacher-preparing institutions strove to instill in their students: commitment to the values of democracy and of opportunity in the United States, as exemplified in the writings of Dewey; to a sense of national purpose or patriotism, as in France, Germany, and Japan; to the pursuit of the socialist revolution, as in the post-tsarist Soviet Union; or to a religious outlook as manifested by Catholic doctrine in Italy, Spain, and Latin America.",
  "Second, the philosophers, psychologists, and sociologists helped to redefine the teacher-pupil relationship. Whatever their differences of view, clear continuities are visible among them on such issues as the significance of the child’s needs and interests, the weaknesses of the formal academic curriculum, and the nature of individual development.",
  "Third, the new contributions affected the organization of learning through the measurement and assessment of abilities, the diagnosis of special learning problems, the placing of children in homogeneous age and ability groups by means of “tracking” and “streaming,” the emphasis on problem solving, and the project method. These changes, reflected both in the way in which teachers were trained and in the architecture and equipment of schools, transformed education for younger children in many countries during the first half of the 20th century.",
  "The educational doctrines that inspired, conceptualized, and legitimated this transformation themselves reflected other social, political, economic, demographic, and technological changes. Urbanization, the reduction of infant mortality, improvements in child health, the fact that families, individuals, and whole societies could afford longer and better schooling, growth in the size of populations, greater capacity for control by central and local government, the availability of new kinds of educational apparatus and teaching aids—all these did much to shape the progress of teacher education during the decades after 1900.",
  "Among the countries of the world the arrangements for the preparation of teachers vary widely. In some countries “monitors” still receive short courses of training as their preparation to teach large classes of young children. In North America, and to an increasing extent in other developed countries, most teachers are university graduates who begin their teacher preparation after completing four to six years of secondary education. Between these extremes many other arrangements exist. At one level, which for present purposes might be called Normal School A, entry is prior to the usual age of completion of secondary education. Training is limited to the achievement of competence in teaching a range of the subjects taught at the primary level and does not last more than five years.",
  "The second level, which may be called Normal School B, also begins prior to the age of completing secondary education but usually after the “first certificate” at approximately age 16 or at the end of the period of compulsory schooling. This level provides combined courses of education and professional training, the former not necessarily limited to subjects taught at the primary level and extending beyond the usual age of completion of secondary education.",
  "A third level, the college level, requires a full secondary education, usually ending at 18 but not necessarily with the same qualifications as are demanded of university entrants. Two- or three-year concurrent courses of general and professional education lead to the award of a teaching certificate, often valid for work in primary, intermediate, and lower secondary schools.",
  "Finally, there is the university level, in which, after completing a full period of secondary education, the future teacher enters a multipurpose institution of higher education to follow three- to five-year courses of combined general education and professional training, the latter being either concurrent or consecutive, that lead to the award of a university degree and teaching qualification. Such qualification is considered valid for work at primary or secondary levels, or at both, according to the nature of the course followed.",
  "Until the middle 1960s the normal-school pattern applied to students preparing for primary work in many European countries (Austria, Belgium, Spain, France, Italy, Iceland, the Netherlands, Switzerland, and Turkey), in Latin America, and in a number of Asian countries, although in many places there was more than one route to the attainment of qualified teacher status. The education and training of secondary school teachers was complicated by the general growth of secondary education for all. This encouraged the tendency to educate and train both primary and secondary teachers alongside one another in postsecondary colleges or in multipurpose universities. More recently there has been a widespread movement away from the types of training described here as Normal School A and B to the college and university patterns. But the fact that a country has adopted what has been called here the university pattern of training should not be taken to mean that all the institutions in which teachers are prepared are comparable to the pre-existing universities; some are devoted mainly to teacher preparation.",
  "In nearly all countries, courses of the Normal School B, college, and university categories contain three main elements. The first element is the study of one or more academic, cultural, or aesthetic subjects for the purpose both of continuing the student’s own education and of providing him with knowledge to use in his subsequent teaching career. A second element is the study of educational principles, increasingly organized in terms of social science disciplines such as psychology, sociology, philosophy, and history. A third element consists of professional courses and school experience. Primary teachers may also receive instruction in the content and methods of subjects other than their own specialties that figure in the primary curriculum. In normal schools and colleges, and some universities, the three elements run parallel to one another, and the student is professionally committed from the outset of his course. Elsewhere, the study of educational processes and professional work (including school experience) may follow the completion of a period of academic study that the student has begun without any prior commitment to teaching as a career. There are still advanced countries where the possession of a university degree, without any qualification in education as such, is sufficient basis for the award of qualified teacher status. In England and Wales, for example, compulsory training for graduates, generally comprising two terms (six months) of professional and theoretical studies and a further three-month period of school experience, was scheduled to come into effect only in 1973.",
  "The sequencing, balance, content, and organization of general and specialist academic work, courses in education, and professional studies and teaching experience has been a subject of discussion since the earliest days of organized teacher education. The importance of the element of general education has been defended on various grounds. Sometimes such academic work may be highly specialized. Students in many colleges of education in England study only one principal subject, to which they devote about one-third of their total time, and teachers who graduate from universities have often pursued three-year courses for single-subject honours degrees. In the United States and elsewhere the academic element is broader, and the first two years of college or university work may embody a wide range of elective subjects from diverse disciplinary fields. Both patterns have their critics, the first because it produces narrow intellectual specialists, the second because it encourages dilettantism and inadequate depth. Where a pattern of electives is combined with a units/credits system, as in some universities in Japan and the United States, it is claimed that one result is an undesirable fragmentation of study and effort. In his influential Education of American Teachers (1963), James B. Conant recommended that half the course requirements of the four-year program of preparation for elementary teachers should be given over to general courses, a further quarter to an “area of concentration,” and the remaining quarter to professional studies, including school experience. Prospective secondary teachers would spend still more time on the subjects they were preparing to teach, with less than 10 percent of their time devoted to practice teaching and special methods. Such a subject emphasis for secondary teachers can be found in many countries. In France the École Normale Supérieure still places freedom of study and the nurture of intellectual curiosity above questions of professional teacher training. Generally speaking, wherever there is a stress upon academic excellence and the achievement of high standards of scholarship, there is likely to be skepticism as to the claims of professional training for teaching. Oxford University had still not appointed a professor of education by the beginning of the 1970s.",
  "In countries where technical or vocational education forms an important part of secondary school provision, there have sometimes been specialist institutions for the training of teachers for this work. Such teachers tend to have lower status than the secondary school staff who teach academic subjects, and efforts have been made to upgrade the position of the teacher of agricultural and industrial arts, home economics, and handicrafts. Nearly all the universities in England and Wales that now offer the bachelor of education degree for college of education students include technical subjects within their list of approved options.",
  "The element of educational courses in the teacher preparation program has been the object of criticism from academic specialists, defenders of liberal culture, and practical-minded professional educators. The growing range of speculation and empirical data generated by the burgeoning social sciences, philosophy, and history, have provided a rich ore from which those responsible for teacher preparation mined the materials they needed for the construction and legitimation of their pedagogic systems and principles. But such borrowing has done little to establish any very coherent system of educational ideas, or to provide the basis for a systematic theory of teaching adequate to sustain the variety and complexity of teacher preparation programs. In his Evolution of American Educational Theory (1964), C.J. Brauner was forced to conclude that",
  "middleman theorists, inexpert as scholars, had naïvely striven for some impossible synthesis that would be at once faithful to scholarship, useful to the practitioner, intelligible to the populace and thus comprehensive as a discipline, workable as a general method, and defensible as a social institution.",
  "There has been much dispute as to whether the study of educational principles is to be seen as part of the liberal element in the course, contributing to the teacher’s general education and personal development, or whether it is properly an adjunct to the professional sequence, serving to illuminate and enrich students’ method courses and practical work. Where it was well done, the study of the philosophy, sociology, and history of education and of educational psychology clearly served both ends and also provided an introduction to a systematic exploration of human conduct and affairs that was both educationally defensible and important in its own right. But all too often it was not well done. As the field of the social sciences grew, it became increasingly difficult for those employed in teacher-preparing institutions to keep pace. In some places, student teachers could follow courses in psychology, sociology, and so on given by recognized authorities in their respective disciplines, and in all countries there were some prominent social scientists who themselves took a close and direct interest in educational matters. But, given the large number of institutions responsible for teacher preparation and the fact that the majority of their staff were necessarily recruited for their teaching competence rather than for their high academic qualifications, much of the teaching of educational principles tended to become out-of-date and secondhand.",
  "In recent years there has been a revival of interest in the social sciences as an integral feature of teacher-education programs. This is partly a recognition of the popularity of studies of this kind among students, partly a reflection of their relevance in a time of rapid social and educational change, and partly a function of the larger supply of qualified social scientists available to teach them. There is now also becoming available a substantial volume of research material on problems such as the dynamics and correlates of children’s learning, language development, differences in individual educability and response to teaching, and social class and educational opportunity. In his 1929 lecture, “The Sources of a Science of Education,” John Dewey saw the elements of such a science being drawn out of other natural and social sciences, organized in relation to problems defined by the educational process. These hopes are now closer to realization.",
  "Professional and practical studies constitute the third major element in the teacher-preparation program. “Teaching practice” has always been important, initially carried out in the model or demonstration school attached to the normal school or college, later in the schools of the neighbourhood, and more recently in a variety of school, college, and community settings. The model and demonstration school was frequently criticized for the unreality of its teaching settings; some model schools attached to universities tended to become academically oriented and ceased to play an experimental role. But if there are advantages in practicing in more typical schools, there are also difficulties in relating the variety of experience thus attained to the purpose and content of the college course, particularly when there are discrepancies between the methods and approaches taught in the colleges and those that the student encounters in the school. In some countries, experienced teachers view the work of teacher-preparing institutions with a certain amount of disdain. It is sometimes claimed that college and university staff lack the recent, firsthand experience of schools that is needed if training is to be fully effective. Efforts have been made to reduce the separation between school and college; these include the transfer of college staff to periods of classroom teaching and of experienced teachers to college work, dual appointment to a college and to a school where the “teacher-tutor” assumes responsibility for supervision of the student’s school-based work, the involvement of teachers’ organizations in the determination of national policy on teacher education, the involvement of individual teachers in the government and committee work of teacher-preparing institutions, and the use of periods of school-based teacher education in which a tutor and group of student teachers are attached to a school or a number of schools for an extended period of observation, practical teaching, and theoretical study. Courses are also being devised in which periods of education, training, and paid employment in schools alternate with one another to make up a four- or five-year program.",
  "Generally speaking, in federal countries such as the United States, Canada, and Australia, each state or province sets its own requirements for certification, which inevitably do much to shape the content and organization of the teacher-education programs. The variety of such regulations often means that teachers who have received their education and training in one province or state are not qualified to teach in schools elsewhere without satisfying additional requirements. In other countries, such as England and France, requirements are determined on a national basis. Responsibility for recommending the granting of qualified teacher status may, however, be delegated. In England this responsibility is exercised by regional consortia of colleges, local educational authorities, universities, and teacher interests known as area training organizations that were established after 1944.",
  "There are likewise considerable variations among countries in the way in which teachers are appointed to their first posts after graduation from college or university. In a small number of countries, students have a completely free choice among all the schools of the type in which their training qualifies them to teach, and they make their applications directly to the school in which they wish to serve. A more common pattern is that of appointment to the service of a local, state, or provincial authority, which then places the teacher in a school where a suitable vacancy exists. In some places there is a tendency for beginning teachers to be placed in schools in more remote or less desirable areas. In countries that have universal military service, such as Israel, it is sometimes possible for trained teachers to satisfy military requirements by being drafted to a school of the government’s choice.",
  "Another aspect of the diversity of certification requirements is the extent to which teachers are permitted to undertake work in subjects other than those they specialized in at college or university. Generally speaking, where national and state rules exist they tend to be interpreted liberally during periods of teacher shortage and more stringently as the supply of teachers improves; it is often possible for a teacher to secure the additional qualifications required to undertake a greater variety of work by taking university summer sessions or other kinds of in-service courses.",
  "Training on the job involves more than courses, conferences, and other organized study programs. Such efforts belong to a much broader system of communication whereby all those who are involved in the educational enterprise—teachers, administrators, research workers, curriculum-development specialists, teacher trainers—keep in touch with one another and with developments in their respective fields. One must therefore consider the media that are available for in-service education as well as institutional arrangements by means of which such training is provided.",
  "Printed matter forms the most obvious kind of communication medium among teachers. In all countries there are both general and specialist educational journals and newspapers; educational bodies of various kinds issue their own newsletters, broadsheets, and bulletins. The volume of material published in this form has increased enormously. In some countries books, journal articles, and research reports are systematically abstracted and distributed, and some schools have their own library and information services.",
  "A second group of media for in-service training includes lectures and related types of face-to-face instruction and discussion. Greater use is now being made of seminars, working parties, discussions, and other group activities that require a higher level of individual participation. Alongside these methods, a beginning has been made with the use of case studies and simulation materials. Among the advantages of such techniques are the high degree of personal involvement they encourage, the “realism” of the problems dealt with, a reduction in the didactic element (especially important in work with senior staff), and the opportunities for questions of theory and principle to arise in the discussion of actual teaching and administrative incidents.",
  "Multimedia approaches to in-service studies are encouraged by closed-circuit and broadcast television facilities within individual school systems and local areas. The work that professional and specialist associations have long performed in bringing teachers together for the discussion of issues of mutual concern is now being extended by such developments as the establishment of teachers’ centres in Britain. These help to disseminate a wide range of new educational practices and ideas, including those that derive from the teacher-controlled Schools Council for Curriculum and Examinations. In North America, Australia, the United Kingdom, Germany, and some other European countries, credit-bearing courses are now available for teachers through broadcast television, radio, and correspondence tuition.",
  "The use of a wider range of media has diversified the institutional settings in which in-service teacher education is provided. Universities, colleges, teachers’ centres, and teachers’ homes are now among the places where the teacher can pursue his education and seek to improve his qualifications. Given the larger number of teachers on the staffs of many schools, there is also scope for school-based in-service education. A new idea or principle may find more ready acceptance within a group of like-minded people than when it must make its way against the organizational conservatism of a particular school. Department discussions, staff working parties, and other forms of school-based meetings enable matters of curriculum and organization to be discussed in depth, facilitate the induction of younger members of the profession, and help to limit the isolation of the teacher within the classroom. School-based in-service education has the important merit of recognizing that there is a gap between the ideas, techniques, and approaches that teachers acquire as a result of their training and the application of these ideas and approaches within the social system of the school. With the growth of team teaching and interdisciplinary work, and the reinterpretation of the teacher’s role as an organizer and manager of learning resources rather than a solo performer on the classroom stage, the importance of bridging this gap will become increasingly important.",
  "Coming decades are likely to see continuing development and change in teacher education. Post-secondary and higher education may soon reach between a third and a half of the population in many advanced countries. The teacher must adjust to new developments in educational technology, the growth of human knowledge, and the problem of creating a relevant and appropriate curriculum from the enormous range of material available. There will be new understanding of how children develop and learn. The patterns of authority in society will continue to change, and it is likely that there will be a greater recognition of the importance of moral and personal education in a world of pluralistic values and goals. All these factors will affect the ways in which teachers are educated and trained.",
  "In all countries, whether or not any fundamental institutional changes are contemplated, there are evidences of radical change in the structure of ideas and assumptions that underlie the preparation of teachers. But it is unlikely that coming decades will see the introduction of any comprehensive pedagogical system resembling those of the 19th century. No single theory of learning or teaching is likely to satisfy the diversity of individual needs and societal arrangements.",
  "Reviews of teacher education in the United States include classics like Walter Scott Monroe , Teaching-Learning Theory and Teacher Education, 1890 to 1950 (1952, reissued 1969); and Harold Ordway Rugg , The Teacher of Teachers: Frontiers of Theory and Practice in Teacher Education (1952, reissued 1970). James Bryant Conant , The Education of American Teachers (1963); and James D. Koerner , The Miseducation of American Teachers (1963), provide contrasting mid-century perspectives on teacher education. More recent works are Thomas S. Popkewitz (ed.), Critical Studies in Teacher Education: Its Folklore, Theory, and Practice (1987); Landon E. Beyer  et al., Preparing Teachers as Professionals (1989); Kenneth R. Howey and Nancy L. Zimpher , Profiles of Preservice Teacher Education (1989); and Richard Wisniewski and Edward R. Ducharme (eds.), The Professors of Teaching: An Inquiry (1989). Teacher education reform has been promoted by a consortium of American research universities called the Holmes Group : Tomorrow’s Teachers (1986), and Tomorrow’s Schools: Principles for the Design of Professional Development Schools (1990).",
  "On a comparative and international scale, an early perspective was provided in George Z.F. Bereday and Joseph A. Lauwerys (eds.), The Education and Training of Teachers (1963). Historical developments in England are surveyed in R.W. Rich , The Training of Teachers in England and Wales During the Nineteenth Century (1933, reissued 1972). European provision for teacher education is reviewed in Joseph Majault , Teacher Training (1965; originally published in French, 1965). Teacher education in developing countries is discussed in C.E. Beeby , The Quality of Education in Developing Countries (1966); and Philip H. Coombs , The World Educational Crisis (1967). Of broad use for international reference are James Lynch and H. Dudley Plunkett , Teacher Education and Cultural Change: England, France, West Germany (1973); Richard Goodings , Michael Bryam , and Michael McPartland (eds.), Changing Priorities in Teacher Education (1982); Richard P. Tisher and Marvin F. Wideen (eds.), Research in Teacher Education: International Perspectives (1990); and Howard B. Leavitt (ed.), Issues and Problems in Teacher Education: An International Handbook (1992). The individually titled volumes of the World Yearbook of Education regularly deal with topics relevant to teacher education, e.g.,  Eric Hoyle and Jacquetta Megarry (eds.), Professional Development of Teachers (1980)."
]