[
  "  navigation , science of directing a craft by determining its position, course, and distance traveled. Navigation is concerned with finding the way to the desired destination, avoiding collisions, conserving fuel, and meeting schedules.",
  " Navigation is derived from the Latin navis (“ship”) and agere (“to drive”). Early mariners who embarked on voyages of exploration gradually developed systematic methods of observing and recording their position, the distances and directions they traveled, the currents of wind and water, and the hazards and havens they encountered. The facts accumulated in their journals made it possible for them to find their way home and for them or their successors to repeat and extend their exploits. Each successful landfall became a signpost along a route that could be retraced and integrated into a growing body of reliable information.",
  "For these pathfinders, the danger of running into another vessel was negligible, but, as traffic expanded along established routes, collision avoidance became a concern. Emphasis shifted from finding the way to maintaining safe distances between craft moving in various directions at different speeds. Larger ships are easier to see but require more time to change speed or direction. When many ships are in a small area, an evasive action taken to avoid a collision may endanger other ships. This problem has been alleviated near busy seaports by confining incoming and outgoing ships to separate lanes, which are clearly marked and divided by the greatest practical distance. Airplanes travel so fast that, even though two pilots may see one another in time to initiate evasive action, their maneuvers may be nullified if either one incorrectly predicts the other’s move. Ground-based air traffic controllers are charged with the responsibility for assigning aircraft to selected paths that minimize the likelihood of collision. Civil air navigation is profoundly influenced by the requirements of following the instructions of these controllers.",
  "The advent of steam-powered ships during the first half of the 19th century added the problem of minimizing fuel consumption to the navigator’s duties. In particular, beyond a certain safety factor, carrying excess fuel needlessly reduces cargo capacity.",
  "Adherence to a predetermined schedule, a matter of vital importance in space navigation in connection with fuel consumption, has become important in sea and air navigation for a different reason. Today each voyage or flight is a single link in a coordinated network of transport that carries people and goods from any starting place to any chosen destination. The efficient operation of the whole system depends upon assurance that each journey will begin and end at the specified times.",
  "Modern navigation, in short, has to do with a globally integrated transportation system in which each voyage from start to finish is concerned with four basic objectives: staying on course, avoiding collisions, minimizing fuel consumption, and conforming to an established timetable.",
  "The earliest navigators probably learned to steer their ships between distant ports by familiarizing themselves with the sequences of intervening landmarks. This everyday visual approach to navigation is called piloting. Keeping these reference points in view required that they stay quite close to shore, but they made the transition to ocean voyages well out of sight of land thousands of years ago in various parts of the world. Regular trade was carried on between the island of Crete and Egypt, a distance of approximately 300 miles (500 km), more than 25 centuries before the Christian era. A passage in the Odyssey describes such a voyage from Crete: running before a north wind, sailing ships reached the mouth of the Nile in five days. Longer and longer routes became established by later sailors. By 600 bc the Phoenicians were routinely importing tin from Cornwall in the British Isles. Well before the 10th century ad , Irish seafarers successively reached the Shetland Islands, the Faeroe Islands, and Iceland, crossing 200 to 300 miles (300 to 500 km) of the North Atlantic at each stage. The Vikings repeated those passages and ventured even farther, settling Greenland and visiting North America. By about ad 400, Polynesian navigators had reached Hawaii from the Marquesas Islands, 2,300 miles (3,700 km) across the open Pacific.",
  "The details of how these voyagers found their way are not known, but the use of the Sun and stars as guides is mentioned in many sources, including the works of Homer and Herodotus , the Bible, and the Norse sagas.",
  "East and west are traditionally synonymous with the directions of sunrise and sunset; north and south are determined by the directions of shadows cast by the noonday Sun. By night the stars rise in the east and set in the west, and in the Northern Hemisphere their apparent rotation around the Pole Star due to the Earth’s rotation has long been a fact of the navigator’s life.",
  "For many centuries practical navigators oriented themselves by relying just as strongly on meteorological clues (the directions from which steady winds blew) as on astronomical ones (the positions and apparent motions of the Sun and stars). The Mediterranean sailor could confidently distinguish the cold north wind from the warm south wind. Names were assigned to eight principal winds, and the directions of these winds became the eight equally spaced points of the wind rose ( rosa ventorum ) of the Classical mariner. The wind rose may have been devised by the Etruscans, whose power reached its peak around the 6th century bc ; it certainly antedates the octagonal Tower of the Winds built in Athens by Andronicus of Cyrrhus about 100 bc . From Roman times through the Middle Ages, an alternative 12-point wind rose was used by some navigators, but it was discarded in the 15th century when the Portuguese, at the opening of the great age of discovery, subdivided the eight points of the ancients and introduced a 16-point system.",
  " bc  The first written aid to coastal navigation was the pilot book, or periplus, in which the courses to be steered between ports were set forth in terms of wind directions. These books, of which examples survive from the 4th century bc , described routes, headlands, landmarks, anchorages, currents, and port entrances. No doubt the same information had formerly been passed along by word of mouth, as it still is in some parts of the world. It seems improbable that any sort of sea chart was used with these sailing guides, even though Herodotus’s map of the known world, drawn in the 5th century bc , delineated the Mediterranean shoreline quite accurately. Reliable sea charts were not introduced until the advent of the magnetic compass and of methods for determining latitude and longitude.",
  "Distances were cited in the early pilot books in units of a day’s sail. Later, distances were deduced from estimates of the ship’s speed and the lengths of time over which these speeds were maintained. Probably the oldest method of determining the speed is the so-called Dutchman’s log, in which a floating object, the log, was dropped overboard from the bow of the ship; the time elapsing before it passed the stern was counted off by the navigator, who kept it in sight while walking the length of the vessel. This technique was eventually replaced by that in which the log, attached to a reel of light line, was dropped from the stern; as the ship moved away from the log, the length of line paid out during the emptying of a sandglass was the measure of the speed.",
  "In Seaman’s Practice (1637) the English navigator Richard Norwood recommended the use of a line knotted at intervals of 50 feet (15 metres) and a 30-second sandglass; knotted intervals of 47 to 48 feet (14.3 to 14.6 metres) and a 28-second sandglass were later adopted to accord with nautical miles of slightly different lengths. In the United Kingdom a nautical mile is defined as 6,080 feet (1,853 metres). In 1953 the United States switched from the English standard to the metric, or international, standard of 1,852 metres (6,076 feet). With the international standard nautical mile, knots were spaced about 14.4 metres (approximately 47.25 feet) along the rope. If the first knot appeared as the sand ran out, the ship’s speed was 1,852 metres per hour—one nautical mile per hour, or one knot .",
  "As early as 1688 an English instrument maker, Humphry Cole, invented the so-called patent log, in which a vaned rotor was towed from the stern, and its revolutions were counted on a register. Logs of this kind did not become common until the mid-19th century, when the register was mounted on the aft rail, where it could be read at any time; another Englishman, Thomas Walker, introduced successive refinements of the patent log beginning in 1861. This form of log is still in use.",
  "It is not known where or when it was discovered that the lodestone (a magnetized mineral composed of an iron oxide) aligns itself in a north-south direction, as does a piece of iron that has been magnetized by contact with a lodestone. Neither is it known where or when marine navigators first availed themselves of these discoveries. Plausible records indicate that the Chinese were using the magnetic compass around ad 1100, western Europeans by 1187, Arabs by 1220, and Scandinavians by 1300. The device could have originated in each of these groups, or it could have been passed from one to the others. All of them had been making long voyages, relying on steady winds to guide them and sightings of the Sun or a familiar star to inform them of any change. When the magnetic compass was introduced, it probably was used merely to check the direction of the wind when clouds obscured the sky.",
  "  The first mariner’s compass may have consisted of a magnetized needle attached to a wooden splinter or a reed floating on water in a bowl. In a later version the needle was pivoted near its centre on a pin fixed to the bottom of the bowl. By the 13th century a card bearing a painted wind rose was mounted on the needle; the navigator could then simply read his heading from the card. So familiar has this combination become that it is called the compass, although that word originally signified the division of the horizon. The suspension of the compass bowl in gimbals (originally used to keep lamps upright on tossing ships) was first mentioned in 1537.",
  "On early compass cards the north point was emphasized by a broad spearhead and the letter T for tramontana , the name given to the north wind. About 1490 a combination of these evolved into the fleur-de-lis , still almost universally used. The east point, pointing toward the Holy Land, was marked with a cross; the ornament into which this cross developed continued on British compass cards well into the 19th century. The use of 32 points by sailors of northern Europe, usually attributed to Flemish compass makers, is mentioned by Geoffrey Chaucer in his Treatise on the Astrolabe (1391). It also has been said that the navigators of Amalfi, Italy, first expanded the number of compass points to 32, and they may have been the first to attach the card to the needle.",
  "During the 15th century it became apparent that the compass needle did not point true north from all locations but made an angle with the local meridian. This phenomenon was originally called by seamen the northeasting of the needle but is now called the variation or declination . For a time, compass makers in northern countries mounted the needle askew on the card so that the fleur-de-lis indicated true north when the needle pointed to magnetic north. This practice died out about 1700 because it succeeded only for short voyages near the place where the compass was made; it caused confusion and difficulty on longer trips, especially in crossing the Atlantic to the American coast, where the declination was west instead of east as in Europe. The declination in a given location varies over time. For example, in northern Europe in the 16th century the magnetic north pole was east of true geographic north; in subsequent centuries it has drifted to the west.",
  "Despite its acknowledged value, the magnetic compass long remained a fragile, troublesome, and unreliable instrument, subject to mysterious disturbances. The introduction of iron and then steel for hulls and engines in the 19th century caused further concern because it was well known that nearby ironwork would deflect the compass needle. In 1837 the British Admiralty set up a committee to seek rational methods of ensuring the accuracy of compasses installed on iron ships. In 1840 the committee introduced a new design that proved so successful that it was promptly adopted by all the principal navies of the world. Further refinements, aimed at reducing the effects of engine vibration and the shock of gunfire, continued throughout the century.",
  "The liquid magnetic compass, now almost universally used, is commonly accompanied by an azimuth instrument for taking bearings of distant objects. The compass consists of a set of steel needles with a compass card, attached to a float, in a bowl of water and alcohol. In modern instruments, the magnetic element is often in the form of a ring magnet, fitted within the float. The card is usually of mica or plastic with photographically printed graduations; metal cards with perforated graduations also are used. Cards are usually graduated clockwise from 0° at north to 359°, with the eight principal points indicated.",
  "A jewel is fitted at the centre of the float to bear on an iridium-tipped pivot attached to the bowl of the compass. The liquid in which the directional system is placed serves two purposes: to reduce the weight on the pivot point, and thereby to minimize friction; and to damp out oscillations from the ship’s motion. The bowl is closed on the top and bottom by glass, the bottom glass permitting illumination from below, and is mounted in gimbals. A flexible diaphragm or bellows attached to the bowl accommodates the change in volume of the liquid caused by temperature changes. The ship’s heading is read with the aid of the lubber’s line, which is oriented toward the forward part of the compass to indicate the direction of the ship’s centre line.",
  "When the ship alters course, liquid at the side of the bowl tends to displace slightly, deflecting the card and causing what is known as swirl error. To minimize swirl error, the card is often made considerably smaller in diameter than the bowl. The directional system is made sufficiently bottom-heavy (pendulous) to counteract the downward pull of the vertical component of the Earth’s magnetic field, which would otherwise cause the system to tilt.",
  "The simplest, and probably earliest, azimuth instrument consists of two sights on opposite sides of the compass bowl connected by a thread. The assembly can be rotated to permit sighting on the distant object. Because it is impossible to sight through the instrument and look at the compass card simultaneously, a prism (mirror) is positioned to reflect an image of the card, which is given a second set of graduations with reversed figures. Modern azimuth instruments embody a number of refinements, but the principle remains unchanged.",
  "The binnacle, formerly called the bittacle, is the receptacle in which the compass is mounted. Originally constructed in the form of a cupboard, it is now usually a cylindrical pedestal with provision for illuminating the compass card, usually from below. It contains various correctors to reduce the deviations of the compass caused by the magnetism of the ship. These usually consist of properly placed magnets, a pair of soft iron spheres (or small strips close to the compass), and a vertical soft iron bar called the Flinders bar, which originated in recommendations made by the English navigator Matthew Flinders .",
  "Binnacles are sometimes constructed so that an image of part of the compass card can be projected or reflected through a tube onto a viewing screen on the deck below. This arrangement can make it unnecessary to provide a second compass for the helmsman and may allow the binnacle to be placed in a position less susceptible to magnetic disturbances.",
  "During the course of 15 centuries or more, the coastal pilot book of Classical times evolved into the portolano, or portolan chart , the harbour-finding manual of the Middle Ages. An early portolano for the whole Mediterranean Sea, Lo compasso da navigare (1296), gives directions in terms of half points—that is, halves of the angles defined by the 32-point compass. From such works, accumulated over generations and collected during the 13th century into a single volume for the entire Mediterranean, the first marine charts were drawn. On these charts, most of which were compiled in Genoa, Venice, and Majorca, north was at the top, rather than east, as was the practice on most land maps of the time. They carried a scale of distances and a colour-coded pattern of rhumb lines, or loxodromes (with lines of the same colour crossing the Earth’s meridians at a constant angle, so that following each rhumb line maintains a constant bearing). To set a course between two ports, the pilot would join the corresponding points on the chart with a straight line, find the rhumb line most nearly parallel to it, and trace the rhumb line back to its parent wind rose, from which he obtained the required heading. As long as the ship’s location was to be found by dead reckoning (keeping a running record of the distances and directions traveled), the Mediterranean chart was entirely adequate. Questions of latitude, longitude, compass variation, and curvature of the Earth’s surface could be safely ignored.",
  "When the Portuguese, under the leadership of Prince Henry the Navigator , ventured farther south along the west coast of Africa, they encountered navigational difficulties by assuming that the charts used in the Mediterranean could simply be extended. Over long distances the rhumb lines could not be taken as straight, and the charts bore no relation to the new methods of checking the dead reckoning that Portuguese astronomers and mathematicians had devised. These methods required a chart on which positions were expressed as latitudes and longitudes rather than bearings and distances. Such a chart had to embody a practical method of representing the curved meridians and parallels on a flat surface. Even for an area as large as the Mediterranean, this can be done without grossly falsifying either distances or directions, but for larger regions some distortions are inevitable, and a choice has to be made between alternative mapping techniques. On certain types of charts, distances can be shown accurately, but directions cannot; on other types, directions are reliably presented, but the scale of distance varies greatly between different parts of the chart. The navigator accepts the second type because the risk of lengthening the voyage is preferable to that of missing the target.",
  "  In 1569 the Flemish cartographer Gerardus Mercator published a world map that he had composed using a “projection suitable for navigation,” the details of which he did not disclose. (The Mercator and other projections are treated in the article map .) On a Mercator chart the meridians of longitude are represented by equally spaced vertical lines, and the parallels of latitude are represented by horizontal lines that are closer together near the Equator than near the poles. The uneven spacing of the parallels compensates for the increasing exaggeration of the east-west distance between adjacent meridians at higher latitudes; this distance decreases on the Earth but remains the same on the chart. In 1599 the English mathematician Edward Wright supplied a rational explanation of Mercator’s projection and provided tables by which the distorted distances could be corrected.",
  "Portuguese seamen determined latitude by observing the elevation angle of the polestar —that is, the angle between its direction and the horizontal. They knew from astronomical studies that the star does not lie exactly on the extension of the Earth’s axis, so that it appears to move daily in a small circle around the celestial pole, but the necessary correction (as much as 3  1  2  ° in the 15th century) could be applied by noting the position of the nearby star Kochab. When the navigators got close to the Equator , these stars fell below the horizon; there it became necessary to rely on observing the altitude of the noonday Sun and calculating latitude with the aid of an almanac.",
  " The first instruments used at sea for elevation angle measurements seem to have been the quadrant and the astrolabe , long known to astronomers. For both devices the reference direction was actually the vertical, rather than the horizontal, but conversion of the readings was an elementary matter. The mariner’s astrolabe, however, was less widely used than its 16th-century successor, the cross-staff, a simple device consisting of a staff about 3 feet (1 metre) long fitted with a sliding crosspiece ( see ). The navigator, holding the staff to one eye, would move the crosspiece until its lower end coincided with the horizon and its upper end with the polestar ( see  figure ). The desired elevation could then be read from the intersection of the crosspiece with the staff, on which a scale was marked in degrees. The cross-staff remained in use until the 18th century despite several drawbacks, the most serious being that it required the observer to look directly into the Sun. Coloured shades were fitted to the crosspiece, but the decisive improvement was made in 1594 by the English navigator John Davis . His instrument, called the backstaff because it was used with the observer’s back to the Sun, remained common even after 1731 when the octant (an early form of the modern sextant ) was demonstrated independently by John Hadley of England ( see ) and Thomas Godfrey of Philadelphia. In the octant and the sextant, two mirrors—one fixed, the other movable—bring the image of the Sun into coincidence with the horizon. In the hands of the practiced observer, the modern sextant can be used to measure elevation angles with an accuracy of 10 seconds of arc—that is, close enough to determine a ship’s north-south position within a few hundred metres.",
  "One of the earliest tabulations of the day-to-day positions of the heavenly bodies was Ephemerides , compiled by the German astronomer Regiomontanus and published by him in Nürnberg in 1474. This work also set forth the principle of determining longitude by the method of lunar distances—that is, the angular displacement of the Moon from other celestial objects. This method, which was destined to become the standard for a time during the 19th century, remained impracticable for more than three centuries because of the inaccuracy of existing lunar tables and because special knowledge and tedious computations were necessary in its use. Meanwhile, during the 16th and 17th centuries, working from translations of Portuguese and Spanish manuals, a flourishing school of instrument makers, chart makers, and teachers grew in England. This group rapidly improved the theory of navigation and compiled tables of increasing accuracy. In 1675 the Royal Observatory was established at Greenwich with the specific object of providing sailors with astronomical data of the required precision. At Paris the Connaissance des temps , the first national almanac , was founded in 1679; it contained tables for the crude determination of longitude from observations of the occultation or eclipses of Jupiter’s moons by Jupiter, first seen by Galileo in 1610. (Galileo himself had advocated the preparation of such tables for this purpose, but the method, though sound in principle, could not be made practical aboard sailing ships.) In 1755 Johann Tobias Mayer , a German astronomer, published remarkably accurate tables of the motion of the Moon. To make them useful to navigators, however, it was necessary to prepare from them an ephemeris of the Moon for every noon and midnight. The English astronomer royal, Nevil Maskelyne , supervised this task; the results were published in the annual Nautical Almanac , which was inaugurated in 1766.",
  "Latitude could be determined by measuring the altitude of the Sun at noon or the altitude of any tabulated star when it crossed the local meridian, but the determination of longitude at sea remained a serious problem. By the Middle Ages, astronomers knew that the local time of an eclipse depended on the longitude, and in the 16th century they pointed out the principle of determining longitude by comparing the local time with the reading of a clock that reliably kept the time of a known meridian; because the Earth revolves 360° in 24 hours, or  1  4  ° every minute, it was possible to ascertain how far east or west a ship had traveled by comparing a marine timekeeper set to keep time with the location of the ship’s point of departure and the ship’s local time as measured by the Sun and stars. But no accurate marine timekeeper was then available. Even on dry land, the best 17th-century clocks were capable of keeping time to an accuracy of only one or two seconds over an interval of several days. Placed on board a ship, clocks became even more unreliable. After being subjected to bouncing waves, corrosive salt sprays, and unpredictable variations in temperature, pressure, and humidity, most shipboard clocks either stopped running or became too unstable to permit accurate navigation. Finally, in 1714, the British Board of Longitude offered a prize of £20,000 to anyone who could discover a method of finding the longitude within 30 miles during a sea voyage. After more than 40 years of disciplined labour, a barely educated British cabinetmaker named John Harrison won the prize by constructing the first practical marine chronometer, an oversized jeweled pocket watch that was nearly twice as accurate as the finest land-based clocks of his day. At last mariners had a way to determine both latitude and longitude. For decades thereafter the precise timing measurements obtained from marine chronometers, coupled with sextant sightings of the celestial bodies, allowed explorers to journey with dependable precision throughout the world.",
  "An Egyptian temple decoration dating from about 1600 bc shows a ship on which a member of the crew is measuring the depth of the water with a long pole. The Viking sailor took soundings with a lead weight on a line, hauling in the line and measuring it by the span of his arms. Today depths are still cited in 6-foot (1.8-metre) intervals called fathoms , from the Old Norse word fathmr (“outstretched arms”). The weight was commonly given a hollow bottom filled with tallow to pick up a sample of the seabed for comparison with the composition indicated on the chart. Distance from a cliff could be estimated by timing the echoes of shouts or drumbeats.",
  "To reduce the risk of collision and to allow other ships to follow, a ship under way at night displayed running lights by which sailors on nearby vessels could judge its course and speed. The traditional coloured lights, red to port (left) and green to starboard (right), were augmented on steamships with a white light at the head of the foremast. In foggy weather, gongs, bells, or explosives were used to produce loud warning sounds; eventually these devices were replaced by foghorns. Rules that specified what lights must be shown, what signals must be given, and how ships must navigate in respect of each other were formulated for British mariners in 1862. These rules formed the basis of the International Regulations for Preventing Collisions at Sea, which were adopted by nearly all maritime nations after a conference held in 1889. Collision avoidance also was fostered by general acceptance of the recommendation—separate lanes for eastbound and westbound steamers in the heavily traveled North Atlantic—appearing in Sailing Directions (1855), prepared by the U.S. naval officer Matthew F. Maury , who also mapped ocean currents worldwide. The danger of running aground was lessened by a worldwide system of lighthouses, lightships, buoys, bells, and channel markers; the development of these aids to navigation is treated in the article lighthouse .",
  "By the end of the 19th century, marine navigation had evolved into a fully systematic technique, combining the simplicity and reliability required by its practitioners with the rigour and accuracy founded in the skills and knowledge of astronomers, mathematicians, cartographers, and instrument makers. Accurate and detailed sea charts and books of sailing directions were available for the planning of any proposed voyage. At any stage during the voyage, dependable almanacs, sextants, and chronometers made it possible to ascertain the ship’s position with great precision through observation of the altitudes and azimuths of a few familiar stars. Routine trigonometric procedures for making the needed computations had been introduced by Thomas H. Sumner of the United States in 1837 and Marcq Saint-Hilaire of France in 1875. These astronomical determinations were supplemented by dead reckoning, which had been made more trustworthy by the continued development of compasses and logs.",
  "The navigational principles, techniques, and devices in use about 1900 formed a secure foundation upon which immense changes were superimposed during the 20th century. The advent of air travel and then space travel made it necessary to modify some of the concepts that had been developed for the period in which voyages had been restricted to the surface of the Earth. Many of the new problems were solved by the application of technological innovations, notably radio communication and radio navigation, electronic instruments, and high-speed digital computers.",
  "The classical methods of measuring the speed of vessels through water are described in the section Distance and speed measurements . In the mid-18th century the French hydraulic engineer Henri Pitot , studying the flow of water in rivers and canals, invented a device—now called the Pitot tube—for measuring the speed of the flow past a given point. The Pitot tube has been applied to the measurement of wind speed, and it is equally useful as a log for ships or aircraft. A typical Pitot marine log consists of a pair of thin-walled tubes projecting through the bottom of the ship and bent so as to face the direction of motion. One tube is open at the forward end; the opening is referred to as the dynamic-pressure orifice. The second tube is closed at the end but has openings at right angles to its length; these openings are the static-pressure orifices. When the ship is dead in the water, the pressure is the same in the dynamic and static connections, but when the vessel moves ahead, the dynamic pressure exceeds the static pressure by an amount that varies as the square of the ship’s speed. Another part of the log consists of a centrifugal water pump driven by a variable-speed electric motor. The dynamic pressure that is produced by such a pump varies as the square of the speed of the motor. The pressure produced by the motion of the ship is exerted against one face of a diaphragm; that produced by the pump is exerted against the other. Movement of the diaphragm operates the speed control of the motor so as to equalize the two pressures and thereby make the speed of the motor directly proportional to the speed of the ship. A magneto attached to the shaft of the motor generates a voltage proportional to the speed, and on the ship’s bridge a voltmeter calibrated in knots provides a continuous indication of the progress of the vessel. Analogous Pitot logs, with less bulky attachments for translating air pressure differentials to speed readings, are almost universally installed in aircraft.",
  "In ships, a modern form of log incorporates a pair of electroacoustic transducers. One of these launches a sound wave from a point close to the keel; the second, a few metres ahead or astern, detects this wave and measures the time required for it to traverse the known distance. Motion of the ship relative to the water changes this interval in a way directly related to the speed of the ship. The speed of sound through water is slightly affected by temperature and salinity; even so, the electroacoustic log is much more accurate than its mechanical forerunners, and it is much less susceptible to malfunction caused by fouling by barnacles or weeds.",
  "The Doppler effect —the familiar shift in the pitch of the sound of an automobile engine as it passes a stationary listener—also can be exploited to measure the speed of a vessel or an aircraft. Such an effect can be accurately measured in either sound waves or electromagnetic waves emitted from a moving craft and reflected from a fixed object such as a nearby cliff or the ground below.",
  "Starting from a known point, the mariner with a compass could draw a line on the chart to represent a vessel’s course, then mark off the distance given by the log. The calculation of a new position was known as dead reckoning. In addition to errors in the compass and in the log, dead reckoning suffered from errors due to the drift of the water. When ocean currents were first marked on charts of the open sea and when tidal streams appeared on coastal charts, navigators could make allowance for drift. Fortunately, the currents were seldom fast and, on long voyages, often tended to cancel each other out.",
  " The situation in the air, however, was quite different. Early airplanes flew at speeds of about 100 knots, and the air that supported them was blown over the ground by the wind at up to 40 knots. It was therefore necessary to determine the velocity of the aircraft through the air and the velocity of the air over the ground in order to find the true velocity of the aircraft with respect to the ground. This was achieved by the triangle of velocities as shown in the figure . A line was drawn to show the direction in which the aircraft was heading, the length of the line representing the distance that the aircraft would travel through still air in one hour—in other words, the true airspeed. Such a velocity line represents a vector , a quantity that embodies both magnitude and direction. From the end of this velocity vector a second velocity vector was drawn in the direction toward which the wind was blowing, its length being proportional to the wind speed. A third vector drawn from the starting point of the first vector to the end of the second vector showed the path that the aircraft was following over the ground, the length of this vector representing the true ground speed. Stated mathematically, the true ground speed was the vector sum of the craft’s air velocity and the wind velocity.",
  "The angle between the heading of the aircraft and its track along the ground was known as the drift angle because it resulted from the drifting effect of the wind. Early aircraft were fitted with drift sights through which the aviator visually aligned a grid with the moving ground below and so determined the drift. The plotting of velocity vectors and their sums was simplified by using graphic instruments called computers before that term was appropriated for much more complex devices.",
  "Paradoxically, higher aircraft speeds failed to eliminate the problem of wind drift, because jet aircraft fly higher as well as faster and, above 20,000 feet (6,100 metres), very narrow belts of wind—known as jet streams , which travel at speeds of 100 or 200 knots—occur under certain meteorological conditions.",
  "Sea navigators did not follow the practice of air navigators and allow for ocean currents and tidal drifts in their initial calculations. Dead reckoning, long established as a navigational technique, continued to be used; an estimate for ocean current or tidal drift was added afterward. This practice continues today. When using dead reckoning, the navigator can sometimes find a position that can be checked by a landmark. On the other hand, the errors that are inherent in dead reckoning accumulate; when a position has been checked, the reckoning is therefore generally restarted from that position. This process is called reinitialization.",
  "Dead reckoning enables the navigator to plot not only where the craft is but also where it will be at any future time, provided the planned course and speed are maintained. It also makes it possible for the navigator to plan the journey in its entirety, including the time of arrival at the destination. Planning is a part of all navigation; the preparation of a complete flight plan is mandatory before taking off in a civil aircraft. Space navigation is based even more completely on flight planning, and the time of landing is calculated to within minutes many weeks before liftoff.",
  "By established principles of mathematical physics, the velocity of an object is defined as the rate of change of its position, and the acceleration is defined as the rate of change of the velocity. These relations can be applied to the navigational problem of position finding if an instrument can be devised to measure acceleration and then to convert it successively to velocity and to position. In the terminology of calculus, acceleration is integrated (summed a little at a time) to get velocity, then velocity is integrated to get position.",
  "In one form of accelerometer , a reference mass is suspended on springs within a housing firmly attached to the craft. The inertia of the mass causes it to tend to remain stationary, but any acceleration of the craft tends to displace the housing relative to the mass. The forces required to nullify relative motion of the mass and the housing—in three directions fixed by gyroscopes—can be measured electrically. The electrical signals are directly related to the forces and, by Newton’s second law of motion , to the accelerations. Standard electronic circuitry performs the necessary integrations of the accelerations to provide the distances and directions, in three dimensions, through which the craft has moved from its original position.",
  "Such combinations of accelerometers coupled with integrators are called inertial guidance systems; in the context of navigation, they amount to sophisticated dead-reckoning devices. Since their introduction, starting in 1950, they have proved extremely valuable in controlling trajectories of submarines, booster rockets, and spacecraft. Their errors, like those of any other dead-reckoning system, are cumulative with time, but nuclear-powered submarines have traveled under the north polar ice cap, guided solely by inertial systems, with errors of less than a mile per week.",
  "In modern inertial navigation systems, computers have proved well-suited to processing the streams of data—directions, speeds, and times—involved in keeping track of position. In military land vehicles, computers are fed by compasses and wheel-mounted sensors. Navigators aboard ships depend on the gyrocompass and the log; those in aircraft rely on the gyromagnetic compass and Doppler-effect speed measurements. The computers can be programmed to display or print periodically updated positional information. Inertial guidance systems may provide dead-reckoning information only, though compass and Doppler data can be combined with inertial outputs. Information from radio navigation systems, such as loran or the global positioning system (GPS), can be added to the dead reckoning.",
  "Radio navigation systems that can provide continuous indication of position are eliminating the distinction between position fixing and dead reckoning. Navigation accuracies are improving by supplying both the classical dead-reckoning data (speed, direction, altitude rates, and angles) and the continuously updated position to a computer, which determines the speed, heading, and rate of climb or descent that must be maintained to execute the flight plan. Many computers apply the technique called Kalman filtering, which weights each of the several supplied data according to its expected quality and uses previous position and velocity solutions in determining the current best estimate of position and other desired quantities.",
  "Originally, analog computers were used in navigation systems, and calculations of a relatively simple nature involving inputs from various electrical sources were continuously performed. Today, digital computers are employed for performing virtually all the necessary calculations. The digital computer works so fast that for navigational purposes it can be considered virtually instantaneous and can therefore provide continuous information for control purposes. It has a memory to store information for use when needed. It is built from electronic modules that are mass-produced at low cost. It has only one disadvantage. Conversion of analog information into digital form can be costly. Hence, although far superior to the analog computer, it is less economical whenever a large number of electrical signals must be combined in relatively simple ways without any need for memory. Such situations still apply to control systems in many craft.",
  " To avoid any navigation hazards marked on the charts, a mariner needs to know the vessel’s exact position. By means of a sight fitted to the compass, the direction of any visible landmark or buoy can be measured. This direction, called a bearing, can be marked on the chart as a line passing through the identified reference point. A similar line corresponding to a second bearing will intersect the first and fix the position of the vessel relative to the navigation hazard, as shown in the figure .",
  "The invention of radio transmission and reception led to an improvement in this navigational technique, making it possible to obtain bearings from reference points obscured by fog or darkness. The signals picked up by a loop antenna are weakest when the plane of the loop is perpendicular to the direction in which the radio waves are traveling. If the receiver is tuned to the frequency of a particular transmitter and the loop is rotated for minimum signal pickup, the direction to the transmitter can be found and plotted. When the procedure is repeated with another transmitter, the second bearing will intersect the first, thus fixing the navigator’s position, as before.",
  "Soon after ships were first equipped with radio, direction-finding stations were placed on shore at strategic points along navigational routes and near harbour approaches. Upon receiving a request by radio from a ship, two or more shore stations determined the directions from which the ship’s signal arrived and transmitted this information to the vessel. This allowed the navigator to fix the ship’s position. The limitation of this service to one vessel at a time, however, was a serious drawback in bad weather, when demands were heavy. Beginning in 1921, continuously operating transmitters were placed ashore and the direction finder placed on the ship to eliminate the possibility of overloading the system and to give the navigator two further advantages: that of taking continuous or frequent bearings on any shore beacon and that of taking bearings of any receivable signal, such as transmissions from commercial broadcasting stations and from other vessels. This change in the system was roughly coincident with the initial growth of aviation, and the airborne direction finder immediately became a valuable aid to air navigation.",
  "Under ideal conditions a well-designed direction finder will provide bearings within 1° or 2° of the true value. The uncertainty can be considerably increased, however, if the direction of the radio waves is altered by reflections from the ionosphere or refraction in the atmosphere.",
  "The loop-antenna radio direction finder, almost as old as radio itself, developed into a device in which a motor turned the loop, and electronic circuitry identified the direction of the source of the signals. This instrument, originally called a radio compass, could guide the navigator toward any detectable transmitter. It was often linked to a compass so as to display not merely the direction of the radio station compared to the heading of the craft but the actual direction as plotted on a chart.",
  "The directional selectivity of loop antennas when they are used as receivers is duplicated when they are used as transmitters. Such an antenna can be oriented so that it radiates strong signals to the north and south but practically none to the east or west. Pathway-defining ground stations for aircraft were developed during the 1920s and ’30s. They were equipped with loop antennas in pairs at right angles, arranged so that one antenna broadcast the International Morse Code character A (· —) and the other broadcast the character N (— ·). Midway between the directions in which only A or only N could be heard, the characters interleaved to produce a steady tone; these four intermediate directions were the preferred courses, called beams. Only a slight deviation of the receiver from a beam disrupted the steady tone, and the direction in which the craft was off the beam was indicated by the predominance of one Morse character or the other. The pilot flew in one of the four directions toward or away from the transmitting beacon, which was called a four-course beacon or a radio range .",
  "The distance at which the signals could be detected was limited, and the four-course beacons were replaced by VOR (very-high-frequency omnidirectional range), the beacons of which operated on an entirely different principle. At each beacon, one antenna sent out waves that had the same intensity in all directions. A second antenna rotated and sent out a narrow beam of waves that, when directed north, coincided in phase with those of the first antenna; that is, the peaks of the waves from the two antennas reached the receiver at the same instant. When the rotating beam pointed east, the two sets of waves were out of phase by 90° (one quarter of a wavelength); when the beam pointed south, the phase difference was 180°; and so on. A receiver in the aircraft measured the phase difference and displayed the bearing of the VOR beacon along with the heading of the aircraft.",
  "From the radio range, with its so-called beams, true beam systems have developed. In these the loops are replaced by improved antennas that concentrate the radio waves into narrow beams a few degrees wide; the dots and dashes are replaced by more sophisticated patterns or modulations. In the instrument landing system (ILS), used to help aircraft approach and land on an airfield, the two antennas transmit waves about 10 feet (3 metres) long. These waves, though shorter than those employed in earlier systems, necessitate antenna structures about 100 feet (30 metres) long on the ground. Some such installations make it possible for suitably equipped aircraft to land in conditions of practically zero visibility. The beams point in almost the same direction, and, once the aircraft has entered the beams, an ILS receiver on the airplane can measure the angular displacement from the centre line and display this displacement on an instrument or use it to guide the aircraft along a line toward the point of landing. In addition to the steering beams, which make up the localizer element of the ILS, there are two similar but even narrower beams transmitted in the vertical plane that guide the aircraft down the correct slope toward the point of touchdown.",
  "The microwave landing system (MLS) uses modulated wavelengths that are only about a half inch (one centimetre) long. One beam sweeps side-to-side while the other sweeps up-and-down. Unlike the ILS, the MLS, with its dynamic beam geometry, allows airplanes to follow various descent angles and travel along curved or segmented trajectories. Several microwave landing systems have been installed at commercial airports around the world.",
  "Electroacoustic transducers, mentioned in the section Speed measurement , measure the time that elapses between the transmission of a sharp acoustic “ping” from the keel of a ship and the return of the echo from the sea bottom. A radar altimeter similarly measures the distance between an aircraft and the ground by timing the reflection of short pulses of radio waves. A more common form of radio altimeter, better suited for measuring rate of change of altitude, transmits waves continuously and derives the height from the phase difference between the transmitted signal and that reflected from the ground. An observed phase difference is, in fact, consistent with a large set of discrete altitudes, but in practice such radio altimeters are used in connection with instrument landing systems for measuring altitude and rate of descent during the last few seconds before touchdown. At this stage, the lowest altitude consistent with the observed phase difference is the correct one. When the aircraft reaches a height of about 65 feet (20 metres), the landing system initiates a programmed reduction in rate of descent to ensure a firm but safe touchdown.",
  "In the usage of navigation, distance-measuring equipment (DME) denotes a specific system, defined by internationally accepted standards. Aircraft fitted with DME transmit radio pulses at one of 126 designated frequencies; arrival of these pulses at a DME beacon on the ground causes the beacon—after a 50-microsecond delay—to transmit responding pulses at another frequency. The time elapsing between the aircraft’s transmission and its reception of the response is measured by a clock accurate to a few nanoseconds and converted into the distance, which is displayed in digital form. The position of the aircraft can be determined by combining the distance indicated by the DME with the direction from a VOR beacon at the same site as the DME beacon. Alternatively, position can be established by triangulation, using the distances between the airplane and two well-separated DME beacons.",
  " M S A B M S M S If a gun at position M in the figure were fired, a listener 1,100 feet (335 metres) away in any direction—that is, anywhere on the smallest circle centred at M —would hear the sound one second later; a listener 2,200 feet (670 metres) away, on the second circle, two seconds later; and so on. If guns at M and S were fired simultaneously, a listener anywhere on A  B , equidistant from M and S , would hear them at the same time. On a craft closer to one gun than the other, the sound of the nearer gun would be detected first. If gun M were heard one second before gun S , the craft would lie on C  D , one of the two branches of a hyperbola; at a craft on C ′ D ′, the other branch of the same hyperbola, gun S would be heard one second earlier than gun M . At a craft 2,200 feet closer to gun M , that gun would be heard two seconds before gun S , and the craft would lie on E  F . Hence, by timing the interval to the nearest second, it is possible to determine on which hyperbola the observer is located; knowledge of which gun was fired first makes it possible to choose between the two branches.",
  "In some radio navigation systems, such as loran, the firing of guns is replaced by radio transmissions. A family of hyperbolas as shown in the figure may be printed on a chart. A second family of hyperbolas, referring to a second pair of stations, can be printed on the same chart; the position of a craft is determined by the unique intersection of two curves. In radio systems, one of the two stations in a pair (the primary) controls the other (the secondary) to ensure accurate synchronization of the signals. In some systems, two or three secondaries are distributed around a single primary station, and two or three families of hyperbolas are printed on the appropriate chart.",
  "Loran in its original form (now called Loran-A) was introduced during World War II; it operated at frequencies near 2 megahertz, but interference with and by other services and unreliable performance at night and over land led to its replacement by Loran-C. Loran-C transmitters operate at frequencies of 90 to 110 kilohertz, and the signals are useful at distances of 1,800 nautical miles or more.",
  "Decca, named for the British company that introduced it in 1946, is a hyperbolic system related to loran. Its primary and secondary transmitters broadcast different harmonics of a common frequency as continuous waves, rather than pulses. The hyperbolic position lines for any pair of transmitters are determined by the phase difference between the signals received, rather than the difference in arrival times of pulses. This arrangement provides a remarkably accurate and reliable system covering a range of 100–300 miles (160–480 km) from the primary station. Decca equipment is widely installed on ships and enjoys particular favour among fishermen, who can use it to return to specific shoals with great precision. Aircraft installations are less common than those of VOR/DME, the internationally accepted system for position finding. Decca is very well suited to navigation of helicopters, however, which usually operate at altitudes well below those at which VOR/DME is most effective.",
  "In the early days of aviation, it was soon learned that a liquid-filled mariner’s compass could not operate satisfactorily in a rapidly accelerating and sharply turning aircraft. Spring-mounted bowls and cards of extremely small diameter alleviated the problem, but tilting still occurred, bringing the system frequently under the influence of the vertical component of the Earth’s magnetic field and causing erroneous readings. The most important of such effects, called northerly turning error, caused the compass to indicate a greater or smaller angle than was actually being turned through. Other problems were the difficulty of obtaining stable magnetic conditions in the cockpit, with its array of metal and electrical equipment, and the need for the compass reading to be fed to other navigational aids. In the end, the direct-reading magnetic compass was reduced to a secondary role, its place being taken for most purposes by the gyromagnetic compass ( see below ).",
  "The errors that occur in aircraft and small, fast vessels during alterations of course or speed can be avoided by mounting the compass on a platform kept horizontal by a gyroscope. The directive element must be nonpendulous. The vertical pin supporting the compass needle can be pivoted at both ends, or an inductor element can be employed. In one such arrangement, a saturable-inductor compass (so named because of its use of materials that can be readily induced to carry a maximum magnetic flow, or magnetic saturation) is mounted on a gyroscope, but this is not always convenient from the point of view of size and weight.",
  "Another system has a means of comparison between the gyroscope heading and that of the magnetic element. The gyroscope maintains a specific directional line in space with a possible error caused by drift of two or three degrees in each half hour that the gyroscope is left free. The utility of this instrument may appear to be very limited, but it happens to complement the magnetic compass very well. By itself, neither is satisfactory as a directional reference, but a combination of the directional gyroscope with a magnetic compass gives the pilot complete and stable directional information. The relatively slow drift of the directional gyroscope from its heading may be corrected manually from time to time when the airplane is in level and straight flight.",
  "   The direction a gyrocompass points is independent of the magnetic field of the Earth and depends upon the properties of the gyroscope and upon the rotation of the Earth. The axis of a free gyroscope will describe a circle around the pole of the heavens. To convert it into a gyrocompass, a control must be introduced that, when the axis tilts, will operate to precess (turn) it toward the meridian. The case of the gyroscope is made pendulous, or a liquid is arranged to flow from side to side. Either will convert the path traced by the axis into an ellipse. By delaying the flow of the liquid or by making eccentric the point of action of the control, a damping factor is introduced that converts the ellipse into a spiral so that the gyrocompass eventually settles pointing true north ( see  figure ).",
  "The tactical management of a craft demands, for steering, continuous indication of heading and speed through the water or air and, for the propulsion system, information—either continuous or on demand—on engine speed, temperatures at critical regions, fuel flow, and fuel supply. In a modern aircraft, continuous monitoring by the crew of the numerous variables is impractical; instead, each instrument that indicates the value of a critical variable is designed so that any departure beyond specified limits is brought to the attention of the crew by warning lights, audible signals, or, in the particular case of airspeed, “stick shake”—that is, artificially induced vibration of the control column in the event that indicated airspeed falls close to stalling speed.",
  "Rate of climb and, particularly, rate of descent must be indicated continuously because of their vital safety connotations. Rate of turn also is important in aircraft, and it is sometimes indicated in ships.",
  "Airspeed is correctly indicated by the Pitot apparatus only if the air has the density typical at sea level at 59 °F (15 °C). Altitude has a major effect on air density, and temperature has a minor one; in modern aircraft, indicated airspeed, altitude, and temperature are combined by a computer that indicates true airspeed and Mach number . Similarly, the independently operating compass, artificial horizon (an instrument that shows the degree of pitch and roll), and other instruments have been integrated into a so-called attitude and heading reference system.",
  "The combination of daylight-visible optical displays with systems for storage and retrieval of digital data simplifies the design of aircraft cockpits and ship bridges by allowing the presentation of essential information on demand, relieving the navigator of the task of interpreting the readings of numerous separate indicators.",
  "The figure illustrates the calculation of an airplane’s true ground velocity. Similar techniques can be used to calculate the course an airplane must avoid to prevent collision with another aircraft. In the figure the wind is replaced by the course and speed of the other craft drawn in the opposite direction. What was track and ground speed in the figure becomes the line of sight to the craft to be intercepted and the speed at which the two planes are approaching each other. If both planes maintain the speeds and directions indicated in the figure, a collision will occur.",
  "Modern techniques are based on collision-avoidance theory, which states that, if a course is altered in a direction opposite to that in which the line of sight to another craft is changing, the miss distance will be increased. Thus, if a ship is apparently traveling across the bow to the left, the miss distance will be increased if the course is altered to the right. If the other ship is on the same course but moving ahead, the miss distance will be increased by slowing down. Traditional “rules of the road” at sea require two ships meeting head-on both to turn right. The turn has to be sharp to be effective and to make intentions clear. Aircraft, which are too small and fast for visual avoidance, depend on systematic separation of flight paths.",
  "Radio waves with wavelengths in the centimetre range can be beamed by a reflector, like light in an automobile headlamp, to make up a radar system. The narrowness of the beam depends on the length of the waves and on the width of the reflector. For ships and aircraft, radio waves of a very few centimetres in length are commonly used because longer waves would require reflectors too big to be mobile. Ground radars can have much bigger reflectors, and wavelengths of 10 cm or more are common. A radar antenna mounted on a ship is tall and narrow to produce a beam that is narrow in the horizontal plane and wide in the vertical plane. Narrowness in the vertical plane could cause the radio waves to miss the target when the ship rolls. As the radar antenna rotates, the transmitter sends out a series of very short pulses every degree or so. When the pulse strikes an object, it is reflected back to the radar antenna and thence passed to the radar receiver. The pulse can be displayed on a cathode-ray tube. Electronic lines are drawn from the centre outward, each starting as the pulse starts from the transmitter. When an echo returns, the image on the tube brightens. Thus, a spot of light appears on the cathode-ray tube at a distance from the centre proportional to the time the pulse takes to go out and back and in a direction the same as that in which the pulse was transmitted. Hence, on the cathode-ray tube a faint ray of light rotates around the screen like a searchlight, following the rotation of the antenna, and paints in the positions of any reflecting objects as if they were on a map. The face of the cathode-ray tube is coated with a persistent phosphor—that is, one that continues to glow for several seconds after it is excited—thus allowing the viewer time to study and analyze the image.",
  "The strength of the return signals will vary depending on the reflectivity of the surface of the reflecting object and on its distance. There will be little reflection from water unless it is very rough. From cliffs, ships at sea, and buildings, there will be strong reflections from the vertical surfaces. From the ground, there will be only scattered reflections, generally stronger in wooded country. Nevertheless, because the shortest radar waves are so much longer than light waves, the picture painted by radar shows little detail and requires careful interpretation.",
  "The main nonmilitary use of radar is in avoiding collision. Using radar, the navigator of a ship can see other vessels irrespective of light conditions. It is therefore safe for a craft to proceed—though slowly—even in thick fog, whereas without radar it would be necessary to heave to or anchor. Since the radar picture is imperfect, collision avoidance requires great skill in interpretation. In particular, it is not easy to see the direction in which other vessels are traveling, and the navigator has to make particularly bold alterations of course to make certain that other navigators do not misinterpret them.",
  "With radar, air traffic controllers can watch the progress of aircraft in a large area. As each aircraft approaches and lands, one radar follows it in the vertical plane and another in the horizontal plane. If necessary, the aircraft can be “talked down” (told exactly how to land) by the radar operator on the ground.",
  "For military purposes, infrared waves may be used to fix the position of distant objects. Infrared waves are midway in frequency between radio and light waves. An infrared detector can distinguish between objects of different temperatures and can identify a ship on the water or a man hidden in undergrowth. Infrared radiation needs only a very small transmitter or receiver and therefore has been used to guide small missiles launched from aircraft to strike at enemy planes. The detectors, however, are distracted by other sources of infrared radiation, including the Sun and the engines of friendly aircraft.",
  " Lasers can also be adapted to produce radarlike devices of extreme precision. In addition, there is increased interest in simple television cameras; when equipped with light intensifiers, they can “see” in almost total darkness. For underwater detection of either submarines or shoals of fish, sonar systems have been developed.",
  "Artificial satellites can be equipped to transmit electromagnetic radiation at precisely controlled times and frequencies. The frequencies are chosen to avoid interference with other services, to minimize attenuation or delay as the signals penetrate the ionosphere, and to minimize the power needed by the satellite for broadcasting the signals. The practical range of frequencies corresponds to wavelengths between 10 and 200 cm.",
  "During the early 1960s a series of satellites named Transit was launched by the U.S. Navy to provide a worldwide navigation system. These satellites circled the Earth about every 90 minutes, moving in polar orbits about 600 miles (1,000 km) above the Earth’s surface. They broadcast continuous electromagnetic signals carefully modulated to indicate departures from the nominal frequencies and orbits. A receiver on the surface or in a submarine near the surface could compare the frequency received with that known to be transmitted and identify its own location by measuring both the magnitude and the rate of change of the Doppler shift . The calculations, which were performed by a small digital computer, were accurate to about 180 yards (165 metres).",
  "Any sudden and unexpected change in the user’s velocity during the navigation interval modifies the Doppler shift trace, which in turn introduces positioning errors. An uncertainty of two knots (one metre per second) in the user’s velocity can cause an uncertainty of one-half nautical mile (about one kilometre) in the deduced position. Such an error is inconsequential for ships at sea, but it disqualifies the Transit system for the navigation of aircraft.",
  "  The global positioning system (GPS), which is suitable for aircraft and spacecraft navigation, was initiated by the U.S. Department of Defense in 1973. In 1978 the first two Navstar GPS satellites were launched into orbit. The latest versions of these radio-navigation satellites move in circular orbits inclined 55° to the equatorial plane at an altitude of about 12,500 miles (20,000 km). Their orbital period is 12 hours. More than 24 of these satellites (the number has varied) provide continuous worldwide coverage adequate for providing simply equipped users with their longitude, latitude, and altitude within about 30 feet (10 metres). Millions of users benefit from the use of the GPS satellite signals, including airplanes, ships, tanks, backpackers, and ordinary private cars.",
  "The Navstar GPS does not depend on Doppler shift to fix the position of the user. It does, however, use instantaneous Doppler-shift measurements from multiple satellites to obtain accurate velocities.",
  "The satellites transmit their pulses on a time schedule precisely controlled by atomic clocks . A GPS receiver automatically selects four or more favourably situated satellites. It then measures the signal travel time associated with each of these satellites and feeds this information into its processing circuits, which calculate the current position of the receiver by solving a set of algebraic equations. The variables in these equations are the desired position coordinates of the user and the exact time. A similar, but more complicated, set of equations provides the three mutually orthogonal velocity components and the drift rate of the receiver’s clock. Some specially designed GPS receivers can also determine attitude angles. Modern computer chips can provide updated position, velocity, and time as often as 40 times per second, if desired. Almost all GPS receivers provide at least one solution per second using signals from as many as a dozen satellites.",
  "A history of navigation is provided in J.E.D. Williams , From Sails to Satellites: The Origin and Development of Navigational Science (1992). Manuals and practical works include Alton B. Moody , Navigation Afloat: A Manual for the Seaman (1980); Malcolm C. Armstrong , Practical Ship-Handling (1980); Bruce Fraser , Weekend Navigator (1981), a good introduction; Tom Bottomley , Practical Piloting (1983), a useful training guide; Jeff Markell , Coastal Navigation for the Small Boat Sailor (1984), a manual for those with some sailing experience; Benjamin Dutton , Dutton’s Navigation & Piloting , 14th ed. by Elbert S. Maloney (1985), a standard text; and Richard R. Hobbs , Marine Navigation: Piloting and Celestial and Electronic Navigation , 3rd ed. (1990), an introduction. Celestial navigation is treated in Mary Blewitt , Celestial Navigation for Yachtsmen , 10th ed. (1990); and Charles H. Cotter , The Elements of Navigation and Nautical Astronomy , rev. 2nd ed. (1992). Works on guidance, including position finding and radar, are W. Denne , Magnetic Compass Deviation and Correction , 3rd ed. rev. by A.N. Cockcroft (1979); H.H. Shufeldt and G.D. Dunlap , Piloting & Dead Reckoning , 3rd ed. rev. by Bruce Allan Bauer (1991); and F.J. Wylie (ed.), The Use of Radar at Sea , 5th rev. ed. (1978). Electronic navigation is examined in L. Tetley and D. Calcutt , Electronic Aids to Navigation (1986); S.F. Appleyard , R.S. Linford , and P.J. Yarwood , Marine Electronic Navigation , rev. ed. (1988), for use in the merchant shipping industry; and G.J. Sonnenberg , Radar and Electronic Navigation , 6th ed. (1988)."
]