[
  " memory , the encoding, storage, and retrieval in the human mind of past experiences.",
  "The fact that experiences influence subsequent behaviour is evidence of an obvious but nevertheless remarkable activity called remembering. Memory is both a result of and an influence on perception, attention, and learning. The basic pattern of remembering consists of attention to an event followed by the representation of that event in the brain. Repeated attention, or practice, results in a cumulative effect on memory and enables activities such as a skillful performance on a musical instrument, the recitation of a poem, and reading and understanding words on a page. Learning could not occur without the function of memory. So-called intelligent behaviour demands memory, remembering being prerequisite to reasoning. The ability to solve any problem or even to recognize that a problem exists depends on memory. Routine action, such as the decision to cross a street, is based on remembering numerous earlier experiences. The act of remembering an experience and bringing it to consciousness at a later time requires an association, which is formed from the experience, and a “retrieval cue,” which elicits the memory of the experience.",
  "Practice (or review) tends to build and maintain memory for a task or for any learned material. During a period without practice, what has been learned tends to be forgotten. Although the adaptive value of forgetting may not be obvious, dramatic instances of sudden forgetting (as in amnesia ) can be seen to be adaptive. In this sense, the ability to forget can be interpreted as having been naturally selected in animals. Indeed, when one’s memory of an emotionally painful experience leads to severe anxiety, forgetting may produce relief. Nevertheless, an evolutionary interpretation might make it difficult to understand how the commonly gradual process of forgetting was selected for.",
  "In speculating about the evolution of memory, it is helpful to consider what would happen if memories failed to fade. Forgetting clearly aids orientation in time; since old memories weaken and new ones tend to be vivid, clues are provided for inferring duration. Without forgetting, adaptive ability would suffer; for example, learned behaviour that might have been correct a decade ago may no longer be appropriate or safe. Indeed, cases are recorded of people who (by ordinary standards) forget so little that their everyday activities are full of confusion. Thus, forgetting seems to serve the survival not only of the individual but of the entire human species.",
  "Additional speculation posits a memory-storage system of limited capacity that provides adaptive flexibility specifically through forgetting. According to this view, continual adjustments are made between learning or memory storage (input) and forgetting (output). There is evidence in fact that the rate at which individuals forget is directly related to how much they have learned. Such data offer gross support for models of memory that assume an input-output balance.",
  "Whatever its origins, forgetting has attracted considerable investigative attention. Much of this research has been aimed at discovering those factors that change the rate of forgetting. Efforts are made to study how information may be stored, or encoded in the human brain. Remembered experiences may be said to consist of encoded collections of interacting information, and interaction seems to be a prime factor in forgetting.",
  "Memory researchers have generally supposed that anything that influences the behaviour of an organism endowed with a central nervous system leaves—somewhere in that system—a “trace” or group of traces. So long as these traces endure, they can, in theory, be restimulated, causing the event or experience that established them to be remembered.",
  "Research by the American psychologist and philosopher William James (1842–1910) led him to distinguish two types of memory: primary, for handling immediate concerns, and secondary, for managing a storehouse of information accumulated over time. Memory researchers have since used the term short-term memory to refer to the primary or short-lived memory functions identified by James. Long-term memory refers to the relatively permanent information that is stored in and retrieved from the brain.",
  "Some aspects of memory can be likened to a system for storing and efficiently retrieving information. One system in particular—identified as “working memory” by the British psychologist Alan Baddeley—is essential for problem solving or the execution of complex cognitive tasks. It is characterized by two components: short-term memory and “executive attention.” Short-term memory comprises the extremely limited number of items that humans are capable of keeping in mind at one time, whereas executive attention is a function that regulates the quantity and type of information that is either accepted into or blocked from short-term memory. Baddeley likened working memory to a scratch pad in which essential pieces of information are inscribed and later discarded (or, as is more likely the case, replaced by more pertinent information).",
  "In its role of managing information in short-term memory, executive attention is highly effective in blocking potentially distracting information from the focus of attention. This is one way in which the brain is able to keep information active and in focus. Yet there are limits to the amount of information (“capacity”) that executive attention is capable of handling at any given time, and this capacity will differ from person to person. As a result, all people differ in their ability to bring attention to bear on the control of thought. Known as “working memory capacity,” this ability is measured most often through a test that requires people to commit a short list of items to memory while performing some other task. Thus, one form of the test might involve reading a series of sentences and then attempting to recall the letters at the end of each sentence. The capacity of working memory is measured by the number of items that a person recalls, so that if a person recalls five letters, the working memory capacity in this case is five. In most cases number of letters recalled will depend on each person’s ability to avoid the distraction of reading the sentences. Such tests of working-memory capacity can be used to predict an individual’s ability to perform tasks involved in reasoning. In fact, working memory capacity is strongly related to general intelligence.",
  "In terms of brain activity, executive attention seems to involve the frontal lobes. Thus, damage to the frontal lobes, which is associated with a condition called dysexecutive syndrome, can affect the role of executive attention in the control of thought, behaviour, and emotion. Evidenced by a notable reduction in the patient’s abilities to set goals, make plans, and initiate actions, dysexecutive syndrome is often accompanied by diminished social inhibitions and thereby leads to behaviour that is considered rude or inappropriate. Excessive use of alcohol and other drugs can lead to similar behavioral problems. ( See also  human nervous system: Executive functions of the frontal lobes .)",
  "In the course of a typical day, humans receive a continuous stream of information from the world around them as well as from their own thought processes and physical experiences. They manage this constant stimulation through a combination of conscious and unconscious effort. The majority of the information is processed (or ignored) unconsciously, because the brain is incapable of consciously attending to and filtering every bit of stimulation it receives. Other forms of information that are processed through unconscious effort, such as a loud sound or a sudden bright light, tend to capture attention in various ways. While events that elicit such attention are more likely to be remembered, especially if they need to be retrieved for possible use in the future, the more significant processes of conscious attention are volitional, occurring in everyday actions such as driving, reading a book, playing chess, watching a basketball game, and following a recipe in a cookbook. The level of attention given to an experience, and the way a person thinks about it, will influence how well the memory for the event is acquired and how well it will be recalled. Researchers also have determined that the techniques employed by the brain in acquiring information differ depending on whether the information is intended for short-term or long-term use.",
  "Most people are capable of storing a maximum of about seven separate units of information in short-term memory—e.g., the seven random letters F, L, I, X, T, Z, R. Thus, one may consult a directory for a 10-digit telephone number but forget some of the digits before one has finished dialing. However, if the units of information are grouped or “chunked” into meaningful patterns, it is possible to recall many more of them, as shown by the series of 24 letters F, R, A, N, C, E, G, E, R, M, A, N, Y, P, O, L, A, N, D, S, P, A, I, N. According to the American psychologist George A. Miller, such chunking of information is essential for short-term memory and plays an important role in learning.",
  "Short-term memory is restricted in both capacity and duration: a limited amount of information will remain active for a few seconds at best unless renewed attention to the information successfully reactivates it in working memory. Before such “renewal” occurs, most information arrives in working memory through sensory inputs, the two most prevalent being aural and visual. Baddeley posited that working memory is supported by two systems: the phonological loop, which processes aural information, and the visuospatial sketch pad, which processes visual and spatial information. When information is acquired aurally, the brain encodes the information according to the way it sounds. A person who hears a spoken telephone number and retains the information long enough to complete dialing is employing the phonological loop, a function of working memory involving, in effect, an inner voice and inner ear each person utilizes to rehearse and recall information. Children who are slow to learn this type of encoding are also generally delayed in learning to read.",
  "Visual and spatial encoding are an integral part of daily problem solving. A person solves a jigsaw puzzle by constructing an image of a missing piece and then seeking the piece that matches the constructed image. It would not make sense for this construct to be held in long-term memory, but its function as a short-term memory is essential to reaching a solution. Such short-term encoding of visual-spatial information is important in any number of tasks, such as packing suitcases in the trunk of a car or searching for a missing shoe in the bottom of a closet.",
  "Memories that endure outside of immediate consciousness are known as long-term memories . They may be about something that happened many years ago, such as who attended one’s fifth birthday party, or they may concern relatively recent experiences, such as the courses that were served at a luncheon earlier in the day.",
  "Accumulated evidence suggests that a long-term memory is a collection of information augmented by retrieval attributes that allow a person to distinguish one particular memory from all of the other memories stored in the brain. The items stored in long-term memory represent facts as well as impressions of people, objects, and actions. They can be classified as either “declarative” or “nondeclarative,” depending on whether their content is such that it can be expressed by a declarative sentence. Thus, declarative memories, like declarative sentences, contain information about facts and events. Nondeclarative memory, also known as procedural memory, is the repository of information about basic skills, motor (muscular) movement, verbal qualities, visual images, and emotions. A crosscutting distinction is made between memories that are tied to a particular place and time, known as “episodic” memories, and those that lack such an association, known as “semantic” memories. The latter category includes definitions and many kinds of factual knowledge, such as knowledge of the name of the current pope, which one might not recall having learned at any particular time or place.",
  "There are roughly three phases in the life of a long-term memory. It must be acquired or learned; it must be stored or retained over time; and, if it is to be of any value, it must be successfully retrieved. These three phases are known as acquisition, storage, and retrieval. Relatively little is known about the factors influencing the storage of memory over time, but a good deal is understood about the mechanisms by which memories are acquired and successfully retrieved.",
  "Memory researchers have identified specific techniques for improving one’s ability to remember information over a long period of time. One of the most powerful means involves scheduling regular practice sessions over a relatively long period. Consider, for example, two groups of people learning vocabulary words in a foreign language. One group studies for five hours on one day, and the other group studies for one hour per day for five days in a row. Although both groups practice for a total of five hours, they will differ in their ability to recall what they have learned. If the two groups are tested on the day after the first group studied for five hours, the first group will perform better than the second; if, on the other hand, the test occurs one week after the two groups completed their study, the second group will perform better and remember more of the words in the future. Such cases suggest that, while there may be some short-term benefit to “cramming” for a test, the most effective means of committing facts to long-term memory depends upon routine and repetitive study.",
  "Although the ability to commit information to memory is greatly enhanced through repetition or rehearsal, not all rehearsal techniques are effective in facilitating later recall. Simply saying something to oneself over and over again, a technique called “rote rehearsal,” helps to retain the information in short-term memory but does little to build a long-term memory of the event.",
  "Another form of rehearsal involves motor coordination, whereby movements or series of movements are “memorized” for greater efficiency or skill of execution in the future. A skilled touch typist who frequently inputs a short string of letters might thereby encode the movements involved in typing the full string, rather than relying on the separate movements he has already encoded for each letter. In this sense rehearsal occurs through repeated attention to each of several movements in a series. This form of rehearsal enables the performance of countless activities, such as riding a bicycle, dancing a particular step, or executing a competitive dive.",
  "More-effective types of rehearsal consist of reflection—thinking about the material one is trying to learn and discovering ways in which it is related to something one already knows. One traditional technique for committing a list of items to memory involves imagining that one is traveling a familiar route in one’s town while stopping to place an image of each item at specific landmarks on the route. This technique, called the method of loci, was used by Greek orators such as Cicero and Simonides as a means of organizing and remembering points in their speeches.",
  "The method of loci is based on the principle that encoding new information—such as items from the list to be memorized—to previously stored data—landmarks along a familiar route in one’s town—can be an effective means of improving memory function. When encoding techniques are formally applied, they are called mnemonic systems or devices. (The popular rhyme that begins “Thirty days hath September” is an example.) Verbal learning can be enhanced by an appropriate mnemonic system. Thus, paired associates (e.g., dog-chair) will be learned more rapidly if they are included in a simple sentence (e.g., The dog jumped over the chair). Imagery that can associate different words to be learned (even in a bizarre fashion) has been found beneficial. Indeed, some investigators hold that pure rote learning (in which no use is made of established memories except to directly perceive the stimuli) is rare or nonexistent. They suggest that all learning elaborates on memories already available.",
  "Factors that influence the rate of learning should be distinguished from those that affect the rate of forgetting. For example, nonsense syllables are learned more slowly than are an equal number of common words; if both are studied for the same length of time, the better-learned common words will be forgotten more slowly. But this does not mean that the rate of forgetting intrinsically differs for the two tasks. Degree of learning must be held constant before it may be judged whether there are differences in rate of forgetting; rates of forgetting can be compared only if tasks are learned to an equivalent degree. Indeed, when degree of learning is experimentally controlled, different kinds of information are forgotten at about the same rate. Nonsense syllables are not forgotten more rapidly than are ordinary words. In general, factors that seem to produce wide differences in rate of learning show little (if any) effect on rate of forgetting, though some studies of mnemonic systems have demonstrated that pictorial (visual) mnemonics are associated with longer-held memories.",
  "Investigators concerned with the physiological bases of memory seek a kind of neurochemical code with enough physical stability to produce a structural change or memory trace (engram) in the nervous system. Research suggests that these engrams, long considered theoretical, likely exist in the form of neural networks in the brain. Evidence from studies in animals indicates that engram cells link together and thereby create new neural connections, assisted by processes such as synaptic plasticity . Newly formed memories are retrieved via reactivation of the newly generated neural connections. Research efforts at the strict behavioral level similarly are directed toward describing encoding, decoding, and retrieval mechanisms as well as the content of the stored information.",
  "One way to characterize a memory (or memory trace) is to identify the information it encodes. A learner may encode far more information than is apparent in the task as presented. For example, if a subject is shown three words for a few seconds and, after 30 seconds of diversion or distraction, is asked to repeat the process of learning-delay-recall with three new word groups, poorer and poorer recall will be observed on successive trials in cases where all of the word groups share some common element (e.g., all are animal names). Such findings may be explained by assuming that the learner encodes this animal category as part of his memory for each word. Initially, the common category might be expected to aid recall by sharply delimiting the number of probable words. Successive triads, however, tend to be encoded in increasingly similar ways, blurring their unique characteristics for the subject. An additional step provides critical supporting evidence for such an interpretation. If a final triad of vegetable names is unexpectedly presented, recall recovers dramatically. The person being tested will tend to reproduce the vegetable names much better than he does those of the last animal triad, and recall will be roughly as efficient as it was for the first three animal names. This shift in word category seems to provide escape from earlier confusion or blurring, and it may be inferred that a common conceptual characteristic was encoded for each animal name.",
  "Any characteristic or attribute of a word may be investigated in this way to determine whether it is incorporated in memory. When recall does not recover, it may be inferred that the manipulated characteristic has little or no representation in memory. For example, grammatical class typically does not appear to be encoded; decrement in recall produced after a series of triads consisting of verbs tends to continue when a shift is made to adjectives. Such an experiment does not indicate what common encoding characteristic might be responsible for the decrement, suggesting only that it is not grammatical class.",
  "Encoding mechanisms also may be inferred from tests of recognition. In one kind of experiment, for example, subjects study a long list of words, being informed of a multiple-choice memory test to follow. Each word is made part of a test question that includes other carefully chosen new words, or “distractors.” Distractors are selected to represent the different types of encoding the investigator suspects may have occurred in learning. If the word selected for study is chosen by the subject, little can be inferred about the nature of the encoding. Any errors, however, can be most suggestive. Thus, if the word to be studied was table , the multiple-choice list of words might be table , chair , able , furniture , pencil , with table being the only correct answer. If chair is incorrectly selected, it may be suspected that this associatively related word occurred to the subject implicitly during learning and became so well encoded that the subject later could not determine whether it or table had been presented for memorization. If the wrong choice is able , acoustical resemblance to table may have contributed to the confusion. If furniture is erroneously chosen, it is likely that the conceptual category was prominent in the encoding. Finally, because it is not related in any obvious way to table , the word pencil may be intended as a control, unlikely to be a part of the memory for table . If this is the case, subjects will be more likely to select distractor words such as pencil (or any others that have been encoded along with table ).",
  "It is important to note the limitations on what may be inferred from experiments of this kind. Although a subject may have encoded in ways suggested by particular distractors, he still may be able to choose the correct word. Or, even if he chooses one of the distractor words, he still may have encoded in ways not represented by that word.",
  "The common experience of having a name or word on the tip of the tongue seems related to specific perceptual (e.g., visual or auditory) attributes. In particular, people who report a “tip-of-the-tongue” experience usually are able to identify the word’s first letter and the number of syllables with an accuracy that far exceeds mere guessing. There is evidence that memories may encode information about when they were established and about how often they have been experienced. Some seem to embrace spatial information—e.g., one remembers a particular news item to be on the lower right-hand side of the front page of a newspaper. Research indicates that the rate of forgetting varies for different attributes. For example, memories in which auditory attributes seem dominant tend to be more rapidly forgotten than those with minimal acoustic characteristics.",
  "The Canadian psychologist Endel Tulving has demonstrated that, while information may be retained over a long period of time, there is no guarantee it will be retrieved precisely when it is needed. Successful retrieval is much more likely if a person is tested in a physical setting (context) that is naturally associated with the event or fact. In cases where the context during the recall test differs from the setting in which the learning occurred, retrieval will be less likely. This is why the name of a colleague from school or work may be difficult to recall if one happens to encounter him at a shopping mall. In such cases, the new setting interferes with one’s ability to retrieve the person’s name from long-term memory.",
  "Memory can be aided by any number of cues, however. It would be far easier to recall the colleague’s name if one were asked to choose it from a list. In general, “recognition memory” (involved in choosing the correct answer from a list) is more reliable than recall memory (retrieving information without any clue or hint that could assist in the retrieval). For this reason most students prefer multiple-choice tests to essay tests.",
  "If a designated (target) memory consists of a collection of attributes, its recall or retrieval should be enhanced by any cue that represents or suggests one of the attributes. A person who fails to recall the word horse , for example, may suddenly remember it when he is told that there was an animal name on the list of words he studied. Or he may remember it when presented with an associated term such as barn or zebra . While recall can be enhanced somewhat by cues, failures are common even with cues that are highly relevant. In sum, if words were not encoded or stored in the brain with accompanying attributes at the time of learning, cuing of any kind would be ineffective.",
  "Retrieval is also influenced by the way in which information is organized in memory. Although it is possible to name all of the Canadian provinces and territories by randomly recalling the names that come to mind, a far more reliable means would be to recall the information systematically, say by geographic region or by alphabetical order.",
  "The passage of time is another phenomenon that influences the successful recall of stored information. If a person is asked to name the opponents his favourite football team played last season and the score of each game, his responses usually will be most accurate for the games played at the beginning and the end of the season. Similarly, a person asked to describe each day of an extended journey will best retrieve his memory of events that occurred during the beginning and the end of the trip. In a similar test, a person who is asked to recall the words on a list he has just viewed will recall the initial words in the list best (“primacy effects”) and those at the end next best (“recency effects”), while items from the middle are least likely to be recalled. This outcome will be consistent as long as recall begins immediately following presentation of the last word. If, however, a short interval follows that prevents the subject from rehearsing the contents of the list, the recency effect may disappear completely, causing words at the end of the list to be recalled no better than those appearing in the middle. Thus, while primacy effects remain essentially undisturbed, a delay as short as 15 seconds can abolish the recency phenomenon. Although some researchers have suggested that recency effects depend on a separate short-term memory system while primacy effects are mediated by a long-term system, it is possible that a single memory function influences these outcomes.",
  "The number of successive trials a subject takes to reach a specified level of proficiency may be compared with the number of trials he later needs to attain the same level. This yields a measure of retention by what is called the relearning method. The fewer trials needed to reach the original level of mastery, the better the subject seems to remember. The relearning measure sometimes is expressed as a so-called savings score. If 10 trials initially were required and 5 relearning trials later produce the same level of proficiency, then 5 trials have been saved; the savings score is 50 percent (that is, 50 percent of the original 10 trials). The more forgetting, the lower the savings score.",
  "Although it may seem paradoxical, relearning methods can yield both sensitive and insensitive measures of forgetting. Tasks have been devised that produce wide differences in recall but for which no differences in relearning are observed. (Some theorists attribute this to a form of heavy interference among learned data that has only momentary influence on retention.) Six months or a year after initial learning, some tests may give zero recall scores but can show savings in relearning. This suggests a cumulative effect, whereby previously acquired knowledge enhances future learning.",
  "As an aspect of episodic memory, autobiographical memories are unique to each individual. The study of autobiographical memory poses problems, because it is difficult to prove whether the events took place as reported. Using diary methods, researchers have found that people recall actions more accurately than thoughts—except in the case of emotionally charged thoughts, which are particularly well-remembered. Although very few errors are made by those undergoing tests of autobiographical memory, any errors typically involve mixing the details of separate events into one episode. Another method for testing autobiographical memory involves asking subjects to associate particular autobiographical memories with various cue words, such as window or rain .",
  "Conflicting accounts by eyewitnesses demonstrate that memory is not a perfect recording of events from the past; indeed, it is actually a reconstruction of past events. A particularly striking demonstration of the inaccuracy of eyewitness testimony comes from dozens of cases in which those convicted of serious crimes were freed from prison because DNA evidence proved they were not guilty. In most of these cases, the individuals had been convicted on the basis of eyewitness testimony.",
  "Many phenomena can degrade the accuracy of memories. For example, the memory of an eyewitness to a crime may be distorted if he reads news accounts of the crime that contain photographs of a person suspected of committing it. Later, the eyewitness may erroneously believe that the suspect in the news account is the person whom he saw commit the crime. In this case, memory of the crime and memory of the photograph blend to create a vivid—albeit incorrect—memory of an event that never occurred. Such inaccuracies are not uncommon. The American psychologist Elizabeth Loftus showed that even the manner in which people are questioned about an event can alter their memory of it. Other studies have shown that psychotherapists may inadvertently implant false memories in the minds of their clients. Such outcomes illustrate the degree to which imagination can have powerful effects on memory.",
  "False memories also can be created in laboratory experiments. Subjects who are asked to study a list of words that are related to a particular nonpresented word will claim to remember seeing the nonpresented word. For example, after studying the words bed , rest , wake , tired , awake , dream , doze , blanket , snooze , drowsy , snore , and nap , a large number of subjects will claim to recall seeing the word sleep , even though it was not on the list. Although false memories created in laboratory settings differ from false memories of real-world events, they cast light on the processes involved in the creation and maintenance of memory errors, as demonstrated in research by the American psychologists Henry Roediger and Kathleen McDermott.",
  "When a memory of a past experience is not activated for days or months, forgetting tends to occur. Yet it is erroneous to think that memories simply fade over time—the steps involved are far more complex. In seeking to understand forgetting in the context of memory, such auxiliary phenomena as differences in the rates of forgetting for different kinds of information also must be taken into account.",
  "It has been suggested that, as time passes, the physiological bases of memory tend to change. With disuse, according to this view, the neural engram (the memory trace in the brain) gradually decays or loses its clarity. While such a theory seems reasonable, it would, if left at this point, do little more than restate behavioral evidence of forgetting at the nervous-system level. Decay or deterioration does not seem attributable merely to the passage of time; some underlying physical process needs to be demonstrated. Until a neurochemical basis for memory can be more explicitly described, any decay theory of forgetting must await detailed development.",
  "A prominent theory of forgetting at the behavioral level is anchored in the phenomenon of interference, or inhibition, which can be either retroactive or proactive. In retroactive inhibition, new learning interferes with the retention of old memories; in proactive inhibition, old memories interfere with the retention of new learning. Both phenomena have great implications for all kinds of human learning.",
  "In a typical study of interference, subjects are asked to learn two successive verbal lists. The following day some are asked to recall the first list and others to recall the second. A third (control) group learns only one list and is asked to recall it a day later. People who learn two lists nearly always recall fewer words than those in the control group.",
  "Theorists attribute the loss produced by these procedures to interference between list-learning tasks. When lists are constructed to exhibit varying differences, the degree of interference seems to be related to the amount of similarity. Thus, loss in recall will be reduced when two successive lists have no identical terms. Maximum loss generally will occur when there appears to be heavy (but not complete) overlap in the memory attributes for the two lists. One may recall parts of the first list in trying to remember the second and vice versa. (This breakdown in discrimination may reflect the presence of dominant attributes that are appropriate for items in both lists.) Discrimination tends to deteriorate as the number of lists increases, retroactive and proactive inhibition increasing correspondingly, suggesting interference at the time of recall.",
  "In retroactive inhibition, however, not all of the loss need be attributed to competition at the moment of recall. Some of the first list may be lost to memory in learning the second; this is called unlearning. If one is asked to recall from both lists combined, first-list items are less likely to be remembered than if the second list had not been learned. Learning the second list seems to act backward in time (retroactively) to destroy some memory of the first. Much effort has been devoted to studying the conditions that affect unlearning, which has become a major topic in interference theory.",
  "Retroactive and proactive effects can be quite gross quantitatively. If one learns a list one day and tries to recall it the next, learns a second list and attempts recall for it the following day, learns a third, and so on, recall for each successive list tends to decline. Roughly 80 percent recall may be anticipated for the first list; this declines steeply to about 20 percent for the 10th list. Learning the earlier lists seems to act forward in time (proactively) to inhibit retention of later lists. These proactive phenomena indicate that the more one learns, the more rapidly one forgets. Similar effects can be demonstrated for retroactive inhibition within just one laboratory session.",
  "Such powerful effects have led some researchers to speculate that all forgetting is produced by interference. Any given memory is said to be subject to interference from others established earlier or subsequently. Interference, theoretically, may occur when memories conflict through any attributes. With a limited group of attributes and an enormous number of memories, it might seem that ordinary attempts at recall would be chaotic. Yet even if all of the memories shared some information, other attributes not held in common could still serve to distinguish them. For example, every memory theoretically is encoded at a different time, and temporal attributes might serve to discriminate otherwise conflicting memories. Indeed, when two apparently conflicting lists are learned several days apart, proactive inhibition is markedly reduced. Assuming that memories are multiply encoded, interference theory need not predict utter confusion in remembering.",
  "Sources of interference are quite pervasive and should not be considered narrowly. For example, all memories seem to be established in specific surroundings or contexts, and subsequent efforts to remember tend to be less effective when the circumstances differ from the original. Alcoholics, when sober, tend to have trouble finding bottles they have hidden while intoxicated; when they drink again, the task is much easier. Some contexts also may be associated with other memories that interfere with whatever it is that one is trying to remember.",
  "Each new memory tends to amalgamate information already in long-term storage. Encoding mechanisms invariably adapt or associate fresh data to information already present, to such an extent that what is encoded may not be a direct representation of incoming stimuli. This is particularly apparent when the input is relatively meaningless; the newly encoded memory comes to resemble those previously established—i.e., it accrues meaning. For example, a nonsense word such as lajor might be encoded as major .",
  "Although interference theory has attracted wide support as an account of forgetting, it must be placed in perspective. Interpretations that emphasize distinctions between short- and long-term memory and that posit control processes for handling information are potentially more comprehensive than interference theory, and the behavioral evidence for interference eventually may be explained within such systems.",
  "In addition, a number of predictions derived from interference theory have not been well supported by experiment. The focus of difficulty lies in the hypothesis that interference from established memories is a major source of proactive inhibition. The laboratory subject is asked to learn tasks with attributes that have varying degrees of conflict with memories established in daily life. Theoretically, the more conflict, the greater the proactive interference to produce forgetting. Yet a number of experiments have failed to provide much support for this prediction.",
  "Interference theory also fails to account for some pathological forms of forgetting. Repression as observed in psychiatric practice, for example, represents almost complete, highly selective forgetting, far beyond that anticipated by interference theorists. Attempts to study repression through laboratory procedures have failed to yield systematic data that could be used to test theoretical conclusions.",
  "If humans forgot everything, the consequences would be devastating to their daily lives. It would be impossible to do one’s job—much less find one’s way to work. Individuals who suffer damage to certain brain regions, particularly the hippocampus, experience this kind of significant memory loss, amnesia , which is marked by an inability to create new long-term memories. In addition, some amnesics lose their ability to recall events that occurred before the brain injury, a condition known as retrograde amnesia. Some amnesics do not experience deficits in short-term memory, and in many cases their memory deficits appear to be limited to the acquisition and recollection of new associations. If an amnesic is introduced to a new acquaintance who leaves the room and returns a few minutes later, the amnesic will not remember having met that person. However, amnesics are able to remember some types of new information, though they may be unaware that they are remembering. This was proved in the early 20th century by the French physician Édouard Claparède , who used a pin to prick an amnesic woman each time he shook her hand. Later the patient would not shake hands with Claparède, even though she could not readily explain why. In her case procedural memory effectively helped her avoid the physical pain that accompanied every act of shaking hands with the physician. Such studies demonstrate that procedural memory can function independently of conscious awareness.",
  "Another form of forgetting is associated with the earliest stages of human development: nearly all people lack the ability to retain memories of experiences they had before they were three years old. Known as infantile amnesia, this universal phenomenon implies that the brain systems required to encode and retrieve specific events are not adequately developed to support long-term memory before age three. Another theory points to developmental changes in the means by which memories are formed and retrieved after early childhood, suggesting that the more-developed brain lacks the ability to access such early memories. Sigmund Freud , in contrast, proposed that infantile amnesia was a form of repression—in other words, a defense mechanism against disagreeable or negative recollections.",
  "Researchers have concluded that the infant brain loses memories far more quickly than does the developed brain and that it lacks the ability to generalize to new events. Children under the age of five or six do not yet realize that learning is most effective when new information is associated meaningfully with other knowledge. Young children are similarly unaware that the intentional rehearsal or repetition of new information will enhance their ability to retain it in memory. As children age and develop language expertise, however, they begin to draw upon their semantic memory to help them remember words, facts, and events. They also grow increasingly aware of the ways in which memory serves them. This awareness of how memory works, known as “metamemory,” increases through much of adulthood.",
  "Older adults experience memory loss, but only for memories of certain types. Episodic memory (the ability to remember specific events) is typically the first type of memory to decline in old age; it is also the last to fully develop in children. Associative memory (the ability to learn, store, and retrieve associations between actions or things) also declines dramatically. In fact, a chief memory complaint among older adults is a decreasing ability to associate a person’s name with his face. Studies conducted separately by American psychologists Marcia K. Johnson and Larry L. Jacoby demonstrated that, whereas older adults are able to remember the gist of an action or event just as well as younger adults, they are unable to recollect the specific details that were involved. Older adults also have particular difficulty remembering the source of their memories, even in cases in which the information is familiar. Yet other types of memory are spared in old age—the most common among these being recognition. It is therefore common for an older adult to recognize a person’s face while failing to recall that person’s name. Jacoby’s work measured age-dependent distinctions between familiarity (recognition) and source memory (recollection) of a given event. His studies provided stronger confirmation that recognition abilities are similar in younger and older individuals, but as people age, they are less able to recall specific details of the events related to the familiar person or thing.",
  "Age-related memory deficiencies can stem from a number of causes. Research in the 1990s by the American psychologist Timothy A. Salthouse suggested that age-related declines in working memory, and in the speed by which information is processed, can reduce a person’s ability to remember specific details of previous events. Changes in the brains of older adults, especially in the frontal lobes and hippocampal area, also may result in age-related memory deficits. More severe and widespread changes in the brain are related to the massive declines in memory functioning seen in Alzheimer disease , also known as Senile Dementia of Alzheimer Type or SDAT ( see  memory abnormality ).",
  " Endel Tulving and Fergus I.M. Craik (eds.), The Oxford Handbook of Memory (2000), is an excellent reference work. Alan D. Baddeley , Essentials of Human Memory (1999), provides a reasonably comprehensive overview of the psychology of human memory; while Ian Neath and Aimée M. Surprenant , Human Memory: An Introduction to Research, Data, and Theory , 2nd ed. (2003), discusses methodologies of memory research. Two versions of formal models of memory are given in two essays found in Kenneth W. Spence and Janet Taylor Spence (eds.), The Psychology of Learning and Motivation : one by Gordon Bower , “Multicomponent Theory of the Memory Trace,” 1:229–325 (1967); and the other by R.C. Atkinson and R.M. Shiffrin , “Human Memory: A Proposed System and Its Control Processes,” 2:89–195 (1968). A comprehensive account of interference in long-term memory is provided by G. Keppel , “Retroactive and Proactive Inhibition,” in Theodore R. Dixon and David L. Horton (eds.), Verbal Behavior and General Behavior Theory (1968), pp. 172–183.",
  "In contrast to works derived largely from laboratory studies, Alan Baddeley , Human Memory: Theory and Practice (1990), harmonizes laboratory studies with actual data from brain-damaged patients and is of value to advanced researchers and undergraduates alike. A balanced examination of memory for traumatic events, including the repressed memory controversy, is provided in Richard J. McNally , Remembering Trauma (2003). Daniel L. Schacter , The Seven Sins of Memory: How the Mind Forgets and Remembers (2001; also published as How the Mind Forgets and Remembers: The Seven Sins of Memory , 2003), organizes a discussion of memory for the layperson around the fallibility of the memory system, with a focus on neuroscientific evidence."
]