[
  "  economics ,  social science that seeks to analyze and describe the production, distribution, and consumption of wealth. In the 19th century economics was the hobby of gentlemen of leisure and the vocation of a few academics; economists wrote about economic policy but were rarely consulted by legislators before decisions were made. Today there is hardly a government, international agency, or large commercial bank that does not have its own staff of economists. Many of the world’s economists devote their time to teaching economics in colleges and universities around the world, but most work in various research or advisory capacities, either for themselves (in economics consulting firms), in industry, or in government. Still others are employed in accounting , commerce, marketing , and business administration; although they are trained as economists, their occupational expertise falls within other fields. Indeed, this can be considered “the age of economists,” and the demand for their services seems insatiable. Supply responds to that demand, and in the United States alone some 400 institutions of higher learning grant about 900 new Ph.D.’s in economics each year.",
  "No one has ever succeeded in neatly defining the scope of economics. Many have agreed with Alfred Marshall , a leading 19th-century English economist, that economics is “a study of mankind in the ordinary business of life; it examines that part of individual and social action which is most closely connected with the attainment, and with the use of the material requisites of wellbeing”—ignoring the fact that sociologists, psychologists, and anthropologists frequently study exactly the same phenomena. In the 20th century, English economist Lionel Robbins defined economics as “the science which studies human behaviour as a relationship between (given) ends and scarce means which have alternative uses.” In other words, Robbins said that economics is the science of economizing. While his definition captures one of the striking characteristics of the economist’s way of thinking, it is at once too wide (because it would include in economics the game of chess) and too narrow (because it would exclude the study of the national income or the price level). Perhaps the only foolproof definition is that attributed to Canadian-born economist Jacob Viner : economics is what economists do.",
  "Difficult as it may be to define economics, it is not difficult to indicate the sorts of questions that concern economists. Among other things, they seek to analyze the forces determining prices—not only the prices of goods and services but the prices of the resources used to produce them. This involves the discovery of two key elements: what governs the way in which human labour, machines, and land are combined in production and how buyers and sellers are brought together in a functioning market. Because prices of the various things must be interrelated, economists therefore ask how such a “price system” or “market mechanism” hangs together and what conditions are necessary for its survival.",
  "These questions are representative of microeconomics , the part of economics that deals with the behaviour of individual entities such as consumers, business firms, traders, and farmers. The other major branch of economics is macroeconomics , which focuses attention on aggregates such as the level of income in the whole economy, the volume of total employment, the flow of total investment , and so forth. Here economists are concerned with the forces determining the income of a country or the level of total investment, and they seek to learn why full employment is so rarely attained and what public policies might help a country achieve higher employment or greater price stability.",
  "But these examples still do not exhaust the range of problems that economists consider. There is also the important field of development economics, which examines the attitudes and institutions supporting the process of economic development in poor countries as well as those capable of self-sustained economic growth (for example, development economics was at the heart of the Marshall Plan ). In this field the economist is concerned with the extent to which the factors affecting economic development can be manipulated by public policy.",
  "Cutting across these major divisions in economics are the specialized fields of public finance, money and banking , international trade , labour economics , agricultural economics , industrial organization, and others. Economists are frequently consulted to assess the effects of governmental measures such as taxation , minimum-wage laws, rent controls, tariffs , changes in interest rates, changes in government budgets , and so on.",
  " Adam Smith Adam Smith  The effective birth of economics as a separate discipline may be traced to the year 1776, when the Scottish philosopher Adam Smith published  An Inquiry into the Nature and Causes of the Wealth of Nations  . There was, of course, economics before Smith: the Greeks made significant contributions, as did the medieval scholastics, and from the 15th to the 18th century an enormous amount of pamphlet literature discussed and developed the implications of economic nationalism (a body of thought now known as mercantilism ). It was Smith, however, who wrote the first full-scale treatise on economics and, by his magisterial influence, founded what later generations were to call the “English school of classical political economy,” known today as classical economics .",
  "The Wealth of Nations , as its title suggests, is essentially a book about economic development and the policies that can either promote or hinder it. In its practical aspects the book is an attack on the protectionist doctrines of the mercantilists and a brief for the merits of free trade. But in the course of attacking “false doctrines of political economy,” Smith essentially analyzed the workings of the private enterprise system as a governor of human activity. He observed that in a “commercial society” each individual is driven by self-interest and can exert only a negligible influence on prices. That is, each person takes prices as they come and is free only to vary the quantities bought and sold at the given prices. The sum of all individuals’ separate actions, however, is what ultimately determines prices. The “invisible hand” of competition, Smith implied, assures a social result that is independent of individual intentions and thus creates the possibility of an objective science of economic behaviour. Smith believed that he had found, in competitive markets, an instrument capable of converting “private vices” (such as selfishness) into “public virtues” (such as maximum production). But this is true only if the competitive system is embedded in an appropriate legal and institutional framework—an insight that Smith developed at length but that was largely overlooked by later generations. Even so, this is not the only value of the Wealth of Nations , and within Smith’s discussion of how nations became rich can be found a simple theory of value, a crude theory of distribution, and primitive theories of international trade and of money. Their imperfections notwithstanding, these theories became the building blocks of classical and modern economics. In fact, the book’s prolific nature strengthened its impact because so much was left for Smith’s followers to clarify.",
  "  One generation after the publication of Smith’s tome, David Ricardo wrote Principles of Political Economy and Taxation (1817). This book acted, in one sense, as a critical commentary on the Wealth of Nations . Yet in another sense, Ricardo’s work gave an entirely new twist to the developing science of political economy. Ricardo invented the concept of the economic model—a tightly knit logical apparatus consisting of a few strategic variables—that was capable of yielding, after some manipulation and the addition of a few empirically observable extras, results of enormous practical import. At the heart of the Ricardian system is the notion that economic growth must sooner or later be arrested because of the rising cost of cultivating food on a limited land area. An essential ingredient of this argument is the Malthusian principle—enunciated in Thomas Malthus ’s “Essay on Population” (1798): according to Malthus, as the labour force increases, extra food to feed the extra mouths can be produced only by extending cultivation to less fertile soil or by applying capital and labour to land already under cultivation—with dwindling results because of the so-called law of diminishing returns . Although wages are held down, profits do not rise proportionately, because tenant farmers outbid each other for superior land. As land prices were increasing, Malthus concluded, the chief beneficiaries of economic progress were the landowners.",
  "Since the root of the problem, according to Ricardo, was the declining yield (i.e., bushels of wheat) per unit of land, one obvious solution was to import cheap wheat from other countries. Eager to show that Britain would benefit from specializing in manufactured goods and exporting them in return for food, Ricardo hit upon the “law of comparative costs” as proof of his model of free trade. He assumed that within a given country labour and capital are free to move in search of the highest returns but that between countries they are not. Ricardo showed that the benefits of international trade are determined by a comparison of costs within each country rather than by a comparison of costs between countries. International trade will profit a country that specializes in the production of the goods it can produce relatively more efficiently (the same country would import everything else). For example, India might be able to produce everything more efficiently than England, but India might profit most by concentrating its resources on textiles, in which its efficiency is relatively greater than in other areas of Indian production, and by importing British capital goods. The beauty of the argument is that if all countries take full advantage of this territorial division of labour , total world output is certain to be physically larger than it will be if some or all countries try to become self-sufficient. Ricardo’s law, known as the doctrine of comparative advantage , became the fountainhead of 19th-century free trade doctrine.",
  "The influence of Ricardo’s treatise was felt almost as soon as it was published, and for over half a century the Ricardian system dominated economic thinking in Britain. In 1848 John Stuart Mill ’s restatement of Ricardo’s thought in his Principles of Political Economy brought it new authority for another generation. After 1870, however, most economists slowly turned away from Ricardo’s concerns and began to reexamine the foundations of the theory of value—that is, to explain why goods exchange at the prices that they do. As a result, many of the late 19th-century economists devoted their efforts to the problem of how resources are allocated under conditions of perfect competition.",
  " Karl Marx's Oekonomische Lehren  Before proceeding, it is important to discuss the last of the classical economists, Karl Marx . The first volume of his work Das Kapital appeared in 1867; after his death the second and third volumes were published in 1885 and 1894, respectively. If Marx may be called “the last of the classical economists,” it is because to a large extent he founded his economics not in the real world but on the teachings of Smith and Ricardo. They had espoused a “labour theory of value,” which holds that products exchange roughly in proportion to the labour costs incurred in producing them. Marx worked out all the logical implications of this theory and added to it “the theory of surplus value ,” which rests on the axiom that human labour alone creates all value and hence constitutes the sole source of profits.",
  "To say that one is a Marxian economist is, in effect, to share the value judgment that it is socially undesirable for some people in the community to derive their income merely from the ownership of property. Since few professional economists in the 19th century accepted this ethical postulate and most were indeed inclined to find some social justification for the existence of private property and the income derived from it, Marxian economics failed to win resounding acceptance among professional economists. The Marxian approach, moreover, culminated in three generalizations about capitalism: the tendency of the rate of profit to fall, the growing impoverishment of the working class, and the increasing severity of business cycles, with the first being the linchpin of all the others. However, Marx’s exposition of the “law of the declining rate of profit” is invalid—both practically and logically (even avid Marxists admit its logical flaws)—and with it all of Marx’s other predictions collapse. In addition, Marxian economics had little to say on the practical problems that are the bread and butter of economists in any society, such as the effect of taxes on specific commodities or that of a rise in the rate of interest on the level of total investment. Although Marx’s ideas launched social change around the world, the fact remains that Marx had relatively little effect on the development of economics as a social science.",
  "The next major development in economic theory, the marginal revolution, stemmed essentially from the work of three men: English logician and economist Stanley Jevons , Austrian economist Carl Menger , and French-born economist Léon Walras . Their contribution to economic theory was the replacement of the labour theory of value with the “ marginal utility theory of value.” The marginalists based their explanation of prices on the behaviour of consumers in choosing among increments of goods and services; that is, they examined the benefit (utility) that a consumer derives from buying an additional unit of something (a commodity or service) that he already possesses in some quantity. ( See  utility and value .) The idea of emphasizing the “marginal” (or last) unit proved in the long run to be more significant than the concept of utility alone, because utility measures only the amount of satisfaction derived from a particular economic activity, such as consumption . Indeed, it was the consistent application of marginalism that marked the true dividing line between classical theory and modern economics. The classical economists identified the major economic problem as predicting the effects of changes in the quantity of capital and labour on the rate of growth of national output. The marginal approach, however, focused on the conditions under which these factors tend to be allocated with optimal results among competing uses—optimal in the sense of maximizing consumers’ satisfaction.",
  "Through the last three decades of the 19th century, economists of the Austrian, English, and French schools formulated their own interpretations of the marginal revolution. The Austrian school dwelt on the importance of utility as the determinant of value and dismissed classical economics as completely outmoded. Austrian economist Eugen von Böhm-Bawerk applied the new ideas to the determination of the rate of interest, an important development in capital theory .",
  "The English school, led by Alfred Marshall, sought to reconcile their work with the doctrines of the classical writers. Marshall based his argument on the observation that the classical economists concentrated their efforts on the supply side in the market while the marginal utility theorists were concerned with the demand side. In suggesting that prices are determined by both supply and demand , Marshall famously used the paradigm of a pair of scissors, which cuts with both blades. Seeking to be practical, he applied his “partial equilibrium analysis” to particular markets and industries.",
  "It was Léon Walras, though, living in the French-speaking part of Switzerland, who carried the marginalist approach furthest by describing the economic system in general mathematical terms. For each product, he said, there is a “demand function” that expresses the quantities of the product that consumers demand as dependent on its price, the prices of other related goods, the consumers’ incomes, and their tastes. For each product there is also a “supply function” that expresses the quantities producers will supply dependent on their costs of production, the prices of productive services, and the level of technical knowledge. In the market, for each product there is a point of “equilibrium”—analogous to the equilibrium of forces in classical mechanics —at which a single price will satisfy both consumers and producers. It is not difficult to analyze the conditions under which equilibrium is possible for a single product. But equilibrium in one market depends on what happens in other markets (a “market” in this sense being not a place or location but a complex array of transactions involving a single good). This is true of every market. And because there are literally millions of markets in a modern economy, “general equilibrium” involves the simultaneous determination of partial equilibria in all markets.",
  "Walras’s efforts to describe the economy in this way led the Austrian American Joseph Schumpeter , a historian of economic thought, to call Walras’s work “the Magna Carta of economics.” While undeniably abstract, Walrasian economics still provides an analytical framework for incorporating all the elements of a complete theory of the economic system. It is not too much to say that nearly the whole of modern economics is Walrasian economics, and modern theories of money, employment, international trade, and economic growth can be seen as Walrasian general equilibrium theories in a highly simplified form.",
  "The years between the publication of Marshall’s Principles of Economics (1890) and the stock market crash of 1929 may be described as years of reconciliation, consolidation, and refinement for the marginalists. The three schools of marginalist doctrines gradually coalesced into a single mainstream that became known as neoclassical economics. The theory of utility was reduced to an axiomatic system that could be applied to the analysis of consumer behaviour under almost any circumstance. The concept of marginalism in consumption led eventually to the idea of marginal productivity in production, and with it came a new theory of distribution in which wages, profits, interest, and rent were all shown to depend on the “marginal value product” of a factor. Marshall’s concept of “external economies and diseconomies” (any external effects, either positive or negative, that a firm or entity might have on people, places, or other markets) was developed by his leading pupil at the University of Cambridge, Arthur Pigou , into a far-reaching distinction between private costs and social costs, thus establishing the basis of welfare theory as a separate branch of economic inquiry. This era also saw a gradual development of monetary theory (which explains how the level of all prices is determined as distinct from the determination of individual prices), notably by Swedish economist Knut Wicksell . In the 1930s the growing harmony and unity of economics was rudely shattered, first by the simultaneous publication of American economist Edward Chamberlin ’s Theory of Monopolistic Competition and British economist Joan Robinson ’s Economics of Imperfect Competition in 1933, then by the appearance of British economist John Maynard Keynes ’s General Theory of Employment, Interest and Money in 1936.",
  "Before going on, it is necessary to take note of the rise and fall of the German historical school and the American institutionalist school, which leveled a steady barrage of critical attacks on the orthodox mainstream. The German historical economists, who had many different views, basically rejected the idea of an abstract economics with its supposedly universal laws: they urged the necessity of studying concrete facts in national contexts. While they gave impetus to the study of economic history , they failed to persuade their colleagues that their method was invariably superior.",
  "The institutionalists are more difficult to categorize. Institutional economics, as the term is narrowly understood, refers to a movement in American economic thought associated with such names as Thorstein Veblen , Wesley C. Mitchell , and John R. Commons . These thinkers had little in common aside from their dissatisfaction with orthodox economics, its tendency to cut itself off from the other social sciences, its preoccupation with the automatic market mechanism, and its abstract theorizing. Moreover, they failed to develop a unified theoretical apparatus that would replace or supplement the orthodox theory. This may explain why the phrase institutional economics has become little more than a synonym for descriptive economics . Particularly in the United States, institutional economics was the dominant style of economic thought during the period between World Wars I and II. At the time there was an expectation that institutional economics would furnish a new interdisciplinary social science. Although there is no longer an institutionalist movement in economics, the spirit of the old institutionalism persists in such best-selling works as Canadian-born economist John Kenneth Galbraith ’s The Affluent Society (1969) and The New Industrial State (1967). In addition, there is the “new institutionalism” that links economic behaviour with societal concerns. This school is represented by such scholars as Oliver Williamson and Douglass North , who view institutions as conventions and norms that develop within a market economy to minimize the “transaction costs” of market activity.",
  "It was through the innovations of the 1930s that the theory of monopolist, or imperfect, competition was integrated into neoclassical economics. Nineteenth-century economists had devoted their attention to two extreme types of market structure, either that of “pure monopoly” (in which a single seller controls the entire market for one product) or that of “pure competition” (meaning markets with many sellers, highly informed buyers, and a single, standard product). The theory of monopolistic competition recognized the range of market structures that lie between these extremes, including (1) markets having many sellers with “differentiated products,” employing brand names, guarantees, and special packaging that cause consumers to regard the product of each seller as unique, (2) “ oligopoly ” markets, dominated by a few large firms, and (3) “ monopsony ” markets, with many sellers but a single monopolistic buyer. The theory produced the powerful conclusion that competitive industries, in which each seller has a partial monopoly because of product differentiation, will tend to have an excessive number of firms, all charging a higher price than they would if the industry were perfectly competitive. Since product differentiation—and the associated phenomenon of advertising—seems to be characteristic of most industries in developed capitalist economies, the new theory was immediately hailed as injecting a healthy dose of realism into orthodox price theory. Unfortunately, its scope was limited, and it failed to provide a satisfactory explanation of price determination under conditions of oligopoly. This was a significant omission, because in advanced economies most manufacturing and even most service industries are dominated by a few large firms. The resulting gap at the centre of modern price theory shows that economists cannot fully explain the conditions under which multinational firms conduct their affairs.",
  "  The second major breakthrough of the 1930s, the theory of income determination, stemmed primarily from the work of John Maynard Keynes, who asked questions that in some sense had never been posed before. Keynes was interested in the level of national income and the volume of employment rather than in the equilibrium of the firm or the allocation of resources . He was still concerned with the problem of demand and supply, but “demand” in the Keynesian model means the total level of effective demand in the economy, while “supply” means the country’s capacity to produce. When effective demand falls short of productive capacity, the result is unemployment and depression ; conversely, when demand exceeds the capacity to produce, the result is inflation .",
  "Central to Keynesian economics is an analysis of the determinants of effective demand. The Keynesian model of effective demand consists essentially of three spending streams: consumption expenditures, investment expenditures, and government expenditures, each of which is independently determined. (Foreign trade is ignored.) Keynes attempted to show that the level of effective demand, as determined in this model, may well exceed or fall short of the physical capacity to produce goods and services. He also proved that there is no automatic tendency to produce at a level that results in the full employment of all available human capital and equipment. His findings reversed the assumption that economic systems would automatically tend toward full employment.",
  "By remaining focused on macroeconomic aggregates (such as total consumption and total investment) and by deliberately simplifying the relationships between these economic variables, Keynes achieved a powerful model that could be applied to a wide range of practical problems. Others subsequently refined his system of analysis (some have said that Keynes himself would hardly have recognized it), and it became thoroughly assimilated into established economic theory. Still, it is not too much to say that Keynes was perhaps the first economist to have added something truly new to economics since Walras put forth his equilibrium theory in the 1870s.",
  "Keynesian economics as conceived by Keynes was entirely “static”; that is, it did not involve time as an important variable. But one of Keynes’s adherents, Roy Harrod , emphasized the importance of time in his simple macroeconomic model of a growing economy. With the publication of Towards a Dynamic Economics (1948), Harrod launched an entirely new specialty, “growth theory,” which soon absorbed the attention of an increasing number of economists.",
  "The 25-year period following World War II can be viewed as an era in which the nature of economics as a discipline was transformed. First of all, mathematics came to permeate virtually every branch of the field. As economists moved from a limited use of differential and integral calculus, matrix algebra represented an attempt to add a quantitative dimension to a general equilibrium model of the economy. Matrix algebra was also associated with the advent of input-output analysis, an empirical method of reducing the technical relations between industries to a manageable system of simultaneous equations. A closely related phenomenon was the development of linear programming and activity analysis, which opened up the possibility of applying numerical solutions to industrial problems. This advance also introduced economists to the mathematics of inequalities (as opposed to exact equation). Likewise, the emergence of growth economics promoted the use of difference and differential equations.",
  "The wider application of mathematical economics was joined by an increasing sophistication of empirical work under the rubric of “ econometrics ,” a field comprising economic theory, mathematical model building, and statistical testing of economic predictions. The development of econometrics had an impact on economics in general, since those who formulated new theories began to cast them in terms that allowed empirical testing.",
  "New developments in economics were not limited to methodological approaches. Interest in the less-developed countries returned in the later decades of the 20th century, especially as economists recognized their long neglect of Adam Smith’s “inquiry into the causes of the wealth of nations.” There was also a conviction that economic planning was needed to lessen the gap between the rich and poor countries. Out of these concerns came the field of development economics, with offshoots in regional economics, urban economics, and environmental economics.",
  "These postwar developments were best exemplified not by the emergence of new techniques or by additions to the economics curriculum but by the disappearance of divisive “schools,” by the increasingly standardized professional training of economists throughout the world, and by the transformation of the science from a rarefied academic exercise into an operational discipline geared to practical advice. This transformation brought prestige (the Nobel Prize in Economic Sciences was first awarded in 1969) but also new responsibility to the profession: now that economics really mattered, economists had to reconcile the differences that so often exist between analytical precision and economic relevance.",
  "The question of relevance was at the centre of a “radical critique” of economics that developed along with the student revolts and social movements of the late 1960s. The radical critics declared that economics had become a defense of the status quo and that its practitioners had joined the power elite. The marginal techniques of the economists, ran the argument, were profoundly conservative in their bias, because they encouraged a piecemeal rather than a revolutionary approach to social problems; likewise, the tendency in theoretical work to ignore the everyday context of economic activity amounted in practice to the tacit acceptance of prevailing institutions. The critics said that economics should abandon its claim of being a value-free social science and address itself to the great questions of the day—those of civil rights , poverty , imperialism , and environmental pollution —even at the cost of analytical rigour and theoretical elegance.",
  "It is true that the study of economics encourages a belief in reform rather than revolution—yet it must be understood that this is so because economics as a science does not provide enough certitude for any thoroughgoing reconstruction of the social order. It is also true that most economists tend to be deeply suspicious of monopoly in all forms, including state monopolies, and for this reason they tend to favour competition between independent producers as a way of diffusing economic power. Finally, most economists prefer to be silent on large questions if they have nothing to offer beyond the expression of personal preferences. Their greater concern lies in the professional standards of their discipline, and this may mean in some cases frankly conceding that economics has as yet nothing very interesting to say about the larger social questions.",
  "Economists, like other social scientists, are sometimes confronted with the charge that their discipline is not a science. Human behaviour, it is said, cannot be analyzed with the same objectivity as the behaviour of atoms and molecules. Value judgments, philosophical preconceptions, and ideological biases unavoidably interfere with the attempt to derive conclusions that are independent of the particular economist espousing them. Moreover, there is no realistic laboratory in which economists can test their hypotheses.",
  "In response, economists are wont to distinguish between “positive economics” and “normative economics.” Positive economics seeks to establish facts: If butter producers are paid a subsidy, will the price of butter be lowered? Will a rise in wages in the automotive industry reduce the employment of automobile workers? Will the devaluation of currency improve a country’s balance of payments ? Does monopoly foster technical progress? Normative economics, on the other hand, is concerned not with matters of fact but with questions of policy or of trade-offs between “good” and “bad” effects: Should the goal of price stability be sacrificed to that of full employment? Should income be taxed at a progressive rate? Should there be legislation in favour of competition?",
  "Because positive economics in principle involves no judgments of value, its findings may appear impersonal. This is not to deny that most of the interesting economic propositions involve the addition of definite value judgments to a body of established facts, that ideological bias creeps into the very selection of the questions that economists investigate, or even that much practical economic advice is loaded with concealed value judgments (the better to persuade rather than merely to advise). This is only to say that economists are human. Their commitment to the ideal of value-free positive economics (or to the candid declaration of personal values in normative economics) serves as a defense against the attempts of special interests to bend the science to their own purposes. The best assurance against bias on the part of any particular economist comes from the criticism of other economists. The best protection against special pleading in the name of science is founded in the professional standards of scientists.",
  "If the science of economics is not based on laboratory experiments (as are the “hard” sciences), then how are facts established? Simply put, facts are established by means of statistical inference . Economists typically begin by describing the terms they believe to be most important in the area under study. Then they construct a “model” of the real world, deliberately repressing some of its features and emphasizing others. Using this model, they abstract, isolate, and simplify, thus imposing a certain order on a theoretical world. They then manipulate the model by a process of logical deduction, arriving eventually at some prediction or implication that is of general significance. At this point, they compare their findings to the real world to see if the prediction is borne out by observed events.",
  "But these observable events are merely a sample, and they may fail to represent real-world examples. This raises a central problem of statistical inference: namely, what can be construed about a population from a sample of the population? Statistical inference may serve as an agreed-upon procedure for making such judgments, but it cannot remove all elements of doubt. Thus the empirical truths of economics are invariably surrounded by a band of uncertainty, and economists therefore make assertions that are “probable” or “likely,” or they state propositions with “a certain degree of confidence” because it is unlikely that their findings could have come about by chance.",
  "It follows that judgments are at the heart of both positive and normative economics. It is easy to see, however, that judgments about “degrees of confidence” and “statistical levels of significance” are of a totally different order from those that crop up in normative economics. Normative statements—that individuals should be allowed to spend income as they choose, that people should not be free to control material resources and to employ others, or that governments must offer relief for the victims of economic distress—represent the kind of value judgments associated with the act of disguising personal preferences as scientific conclusions. There is no room for such value judgments in positive economics.",
  "Most assumptions in economic theory cannot be tested directly. For example, there is the famous assumption of price theory that entrepreneurs strive to maximize profits. Attempts to find out whether they do, by asking them, usually fail; after all, entrepreneurs are no more fully conscious of their own motives than other people are. A logical approach would be to observe entrepreneurs in action. But that would require knowing what sort of action is associated with profit maximizing, which is to say that one would have drawn out all the implications of a profit-maximizing model. Thus one would be testing an assumption about business behaviour by comparing the predictions of a theory of the firm with observations from the real world.",
  "This is not as easy as it sounds. Since the predictions of economics are couched in the nature of probability statements, there can be no such thing as a conclusive, once-and-for-all test of an economic hypothesis. The science of statistics cannot prove any hypothesis; it can only fail to disprove it. Hence economic theories tend to survive until they are falsified repeatedly with new or better data. This is not because they are economic theories but because the attempt to compare predictions with outcomes in the social sciences is always limited by the rules of statistical inference.",
  "It is not remarkable that competing theories exist to explain the same phenomena, with economists disagreeing as to which theory is to be preferred. Much has been written about the uncertain accuracy of economists’ predictions. While economists can foretell the effects of specific changes in the economy, they are better at predicting the direction rather than the actual magnitude of events. When economists predict that a tax cut will raise national income, one may be confident that the prediction is accurate; when they predict that it will raise national income by a certain amount in three years, however, the forecast is likely to miss the mark. The reason is that most economic models do not contain any explicit reference to the passage of time and hence have little to say about how long it takes for a certain effect to make itself felt. Short-period predictions generally fare better than long-period ones. Since its development in the 1990s, experimental economics has, in fact, been testing economic hypotheses in artificial situations—often by using monetary rewards and student subjects. Much of this innovative work has been stimulated by the ascendance of game theory , the mathematical analysis of strategic interactions between economic agents, represented in such works as Theory of Games and Economic Behaviour (1944) by John von Neumann and Oskar Morgenstern . Aspects of game theory have since been applied to nearly every subfield in economics, and its influence has been felt not just in economics but in sociology, political science, and, above all, biology. Because game theory fosters the construction of experimental game situations, it has helped diminish the old accusation that economics is not a laboratory-based discipline.",
  "Since Keynes, economic theory has been of two kinds: macroeconomics (study of the determinants of national income) and traditional microeconomics, which approaches the economy as if it were made up only of business firms and households (ignoring governments, banks, charities, trade unions, and all other economic institutions) interacting in two kinds of markets—product markets and those for productive services, or factor markets. Households appear as buyers in product markets and as sellers in factor markets, where they offer human labour, machines, and land for sale or hire. Firms appear as sellers in product markets and as buyers in factor markets. In each type of market, price is determined by the interaction of demand and supply; the task of microeconomic theory is to say something meaningful about the forces that shape demand and supply.",
  "Firms face certain technical constraints in producing goods and services, and households have definite preferences for some products over others. It is possible to express the technical constraints facing business firms through a series of production functions , one for each firm. A production function is simply an equation that expresses the fact that a firm’s output depends on the quantity of inputs it employs and, in particular, that inputs can be technically combined in different proportions to produce a given level of output. For example, a production engineer could calculate the largest possible output that could be produced with every possible combination of inputs. This calculation would define the range of production possibilities open to a firm, but it cannot predict how much the firm will produce, what mixture of products it will make, or what combination of inputs it will adopt; these depend on the prices of products and the prices of inputs (factors of production), which have yet to be determined. If the firm wants to maximize profits (defined as the difference between the sales value of its output and the cost of its inputs), it will select that combination of inputs that minimizes its expenses and therefore maximizes its revenue. Firms can seek efficiencies through the production function, but production choices depend, in part, on the demand for products. This leads to the part played by households in the system.",
  "Each household is endowed with definite “tastes” that can be expressed in a series of “utility functions.” A utility function (an equation similar to the production function) shows that the pleasure or satisfaction households derive from consumption will depend on the products they purchase and on how they consume these products. Utility functions provide a general description of the household’s preferences between all the paired alternatives it might confront. Here, too, it is necessary to assume that households seek to maximize satisfaction and that they will distribute their given incomes among available consumer goods in a way that derives the largest possible “utility” from consumption. Their incomes, however, remain to be determined.",
  " S D In economic theory, the production function contributes to the calculation of supply curves (graphic representations of the relationship between product price and quantity that a seller is willing and able to supply) for firms in product markets and demand curves (graphic representations of the relationship between product price and the quantity of the product demanded) for firms in factor markets. Similarly, the utility function contributes to the calculation of demand curves for households in product markets and the supply curves for households in factor markets. All of these demand and supply curves express the quantities demanded and supplied as a function of prices not because price alone determines economic behaviour but because the purpose is to arrive at a theory of price determination. Much of microeconomic theory is devoted to showing how various production and utility functions, coupled with certain assumptions about behaviour, lead to demand and supply curves such as those depicted in the figure .",
  "Not all demand and supply curves look alike. The essential point, however, is that most demand curves are negatively inclined (consumers demand less as the price rises), while most supply curves are positively inclined (suppliers are likely to produce more at higher prices). The participants in a market will be driven to the price at which the two curves intersect; this price is called the “equilibrium” price or “market-clearing” price because it is the only price at which supply and demand are equal.",
  "For example, in a market for butter, any change—in the production function of dairy farmers, in the utility function of butter consumers, in the prices of cows, grassland, and milking equipment, in the incomes of butter consumers, or in the prices of nondairy products that consumers buy—can be shown to lead to definite changes in the equilibrium price of butter and in the equilibrium quantity of butter produced. Even more predictable are the effects of government-imposed price limits, taxes on butter producers, or price-support programs for dairy farmers, which can be forecast with reasonable certainty. As a rule, the prediction will refer only to the direction of change (the price will go up or down), but if the demand and supply curves of butter can be defined in quantitative terms, one may also be able to foresee the actual magnitude of the change.",
  "The analysis of the behaviour of firms and households is to some extent symmetrical: all economic agents are conceived of as ordering a series of attainable positions in terms of an entity they are trying to maximize. A firm aims to maximize its use of input combinations, while a household attempts to maximize product combinations. From the maximizing point of view, some combinations are better than others, and the best combination is called the “optimal” or “efficient” combination. As a rule, the optimal allocation equalizes the returns of the marginal (or last) unit to be transferred between all the possible uses. In the theory of the firm, an optimum allocation of outlays among the factors is the same for all factors; the “law of eventually diminishing marginal utility,” a property of a wide range of utility functions, ensures that such an optimum exists. These are merely particular examples of the “equimarginal principle,” a tool that can be applied to any decision that involves alternative courses of action. It is not only at the core of the theory of the firm and the theory of consumer behaviour, but it also underlies the theory of money, of capital, and of international trade. In fact, the whole of microeconomics is nothing more than the spelling out of this principle in ever-wider contexts.",
  "The equimarginal principle can be widely applied because economics furnishes a technique for thinking about decisions, regardless of their character and who makes them. Military planners, for example, may consider a variety of weapons in the light of a single objective, damaging an enemy. Some of the weapons are effective against the enemy’s army, some against the enemy’s navy, and some against the air force; the problem is to find an optimal allocation of the defense budget, one that equalizes the marginal contribution of each type of weapon. But defense departments rarely have a single objective; along with maximizing damage to an enemy, there may be another objective, such as minimizing losses from attacks. In that case, the equimarginal principle will not suffice; it is necessary to know how the department ranks the two objectives in order of importance. The ranking of objectives can be determined through a utility function or a preference function.",
  "When an institution pursues multiple ends, decisions about how to achieve them require a weighting of the ends. Every decision involves a “production function”—a statement of what is technically feasible—and a “utility function”; the equimarginal principle is then invoked to provide an efficient, optimal strategy. This principle applies just as well to the running of hospitals, churches, and schools as to the conduct of a business enterprise and is as applicable to the location of an international airport as it is to the design of a development plan for a country. This is why economists advise on activities that are obviously not being conducted for economic reasons. The general application of economics in unfamiliar places is associated with American economist Gary Becker , whose work has been characterized as “economics imperialism” for influencing areas beyond the boundaries of the discipline’s traditional concerns. In such books as An Economic Approach to Human Behavior (1976) and A Treatise on the Family (1981), Becker, who won the Nobel Prize for Economics in 1992, made innovative applications of “rational choice theory.” His work in rational choice, which went outside established economic practices to incorporate social phenomena, applied the principle of utility maximization to all decision making and appropriated the notion of determinate equilibrium outcomes to evaluate such noneconomic phenomena as marriage, divorce, the decision to have children, and choices about educating children.",
  "As stated earlier, macroeconomics is concerned with the aggregate outcome of individual actions. Keynes’s “ consumption function ,” for example, which relates aggregate consumption to national income, is not built up from individual consumer behaviour; it is simply an empirical generalization. The focus is on income and expenditure flows rather than the operation of markets. Purchasing power flows through the system—from business investment to consumption—but it flows out of the system in two ways, in the form of personal and business savings. Counterbalancing the savings are investment expenditures, however, in the form of new capital goods, production plants, houses, and so forth. These constitute new injections of purchasing power in every period. Since savings and investments are carried out by different people for different motives, there is no reason why “leakages” and “injections” should be equal in every period. If they are not equal, national income (the sum of all income payments to the factors of production) will rise or fall in the next period. When planned savings equal planned investment, income will be at an equilibrium level, but when the plans of savers do not match those of investors, the level of income will go on changing until the two do match.",
  "This simple model can take on increasingly complex dimensions by making investment a function of the interest rate or by introducing other variables such as the government budget, the money market, labour markets, imports and exports, or foreign investment. But all this is far removed from the problem of resource allocation and from the maximizing behaviour of individual economic agents, the traditional microeconomic concerns.",
  "The split between macroeconomics and microeconomics—a difference in questions asked and in the style of answers obtained—has continued since the Keynesian revolution in the 1930s. Macroeconomic theory, however, has undergone significant change. The Keynesian system was amplified in the 1950s by the introduction of the Phillips curve , which established an inverse relationship between wage-price inflation and unemployment.",
  "At first, this relationship seemed to be so firmly founded as to constitute a virtual “law” in economics. Gradually, however, adverse evidence about the Phillips curve appeared, and in 1968 “The Role of Monetary Policy,” first delivered as Milton Friedman ’s presidential address to the American Economic Association, introduced the notorious concept of “the natural rate of unemployment” (the minimum rate of unemployment that will prevent businesses from continually raising prices). Friedman’s paper defined the essence of the school of economic thought now known as monetarism and marked the end of the Keynesian revolution, because it implied that the full-employment policies of Keynesianism would only succeed in sparking inflation. American economist Robert Lucas carried monetarism one step further: if economic agents were perfectly rational, they would correctly anticipate any effort on the part of governments to increase aggregate demand and adjust their behaviour. This concept of “rational expectations” means that macroeconomic policy measures are ineffective not only in the long run but in the very short run. It was Lucas’s concept of “rational expectations” that marked the nadir of Keynesianism, and macroeconomics after the 1970s was never again the consensual corpus of ideas it had been before.",
  "The preceding portrait of microeconomics and macroeconomics is characteristic of the elementary orthodox economics offered in undergraduate courses in the West, often under the heading “neoclassical economics.” Given its name by Veblen at the turn of the 20th century, this approach emphasizes the way in which firms and individuals maximize their objectives. Only at the graduate level do students encounter the many important economic problems and aspects of economic behaviour that are not caught in the neoclassical net. For example, economics is, first and foremost, the study of competition, but neoclassical economics focuses almost exclusively on one kind of competition—price competition. This focus fails to consider other competitive approaches, such as quantity competition (evidenced by discount stores , such as the American merchandising giant Wal-Mart, that use economies of scale to pass cost savings onto consumers) and quality competition (seen in product innovations and other forms of nonprice competition such as convenient location, better servicing, and faster deliveries). Advertising also plays an important role in the process of competition—in fact, it may be more significant than the competitive strategies of raising or lowering prices, yet standard neoclassical economics has little to say about advertising. The neoclassical approach also tends to ignore the complex nature of business enterprises and the organizational structures that guide effective production. In short, neoclassical economics makes important points about pricing and competition, but in its strictest definition it is not equipped to deal with the varied economic problems of the modern world.",
  "One of the principal subfields of contemporary economics concerns money, which should not be surprising since one of the oldest, most widely accepted functions of government is control over this basic medium of exchange. The dramatic effects of changes in the quantity of money on the level of prices and the volume of economic activity were recognized and thoroughly analyzed in the 18th century. In the 19th century a tradition developed known as the “quantity theory of money,” which held that any change in the supply of money can only be absorbed by variations in the general level of prices (the purchasing power of money). In consequence, prices will tend to change proportionately with the quantity of money in circulation. Simply put, the quantity theory of money stated that inflation or deflation could be controlled by varying the quantity of money in circulation inversely with the level of prices.",
  "One of the targets of Keynes’s attack on traditional thinking in his General Theory of Employment, Interest and Money (1935–36) was this quantity theory of money. Keynes asserted that the link between the money stock and the level of national income was weak and that the effect of the money supply on prices was virtually nil—at least in economies with heavy unemployment, such as those of the 1930s. He emphasized instead the importance of government budgetary and tax policy and direct control of investment. As a consequence of Keynes’s theory, economists came to regard monetary policy as more or less ineffective in controlling the volume of economic activity.",
  "In the 1960s, however, there was a remarkable revival of the older view, at least among a small but growing school of American monetary economists led by Friedman. They argued that the effects of fiscal policy are unreliable unless the quantity of money is regulated at the same time. Basing their work on the old quantity theory of money, they tested the new version on a variety of data for different countries and time periods. They concluded that the quantity of money does matter. A Monetary History of the United States, 1867–1960 , by Milton Friedman and Anna Schwartz (1963), which became the benchmark work of monetarism, criticized Keynesian fiscal measures along with all other attempts at fine-tuning the economy. With its emphasis on money supply, monetarism enjoyed an enormous vogue in the 1970s but faded by the 1990s as economists increasingly adopted an approach that combined the old Keynesian emphasis on fiscal policy with a new understanding of monetary policy.",
  "The study of economic growth and development is not a single branch of economics but falls, in fact, into two quite different fields. The two fields—growth and development—employ different methods of analysis and address two distinct types of inquiry.",
  "Development economics is easy to characterize as one of the three major subfields of economics, along with microeconomics and macroeconomics. More specifically, development economics resembles economic history in that it seeks to explain the changes that occur in economic systems over time.",
  "The subject of economic growth is not so easy to characterize. Indeed, it is the most technically demanding field in the whole of modern economics, impossible to grasp for anyone who lacks a command of differential calculus. Its focus is the properties of equilibrium paths, rather than equilibrium states. In applying economic growth theory, one makes a model of the economy and puts it into motion, requiring that the time paths described by the variables be self-sustaining in the sense that they continue to be related to each other in certain characteristic ways. Then one can investigate the way economics might approach and reach these steady-state growth paths from given starting points. Beautiful and frequently surprising theorems have emerged from this experience, but as yet there are no really testable implications nor even definite insights into how economies grow.",
  "Growth theory began with the investigations by Roy Harrod in England and Evsey Domar in the United States. Their independent work, joined in the Harrod-Domar model, is based on natural rates of growth and warranted rates of growth. Keynes had shown that new investment has a multiplier effect on income and that the increased income generates extra savings to match the extra investment, without which the higher income level could not be sustained. One may think of this as being repeated from period to period, remembering that investment, apart from raising income disproportionately, also generates the capacity to produce more output. This results in products that cannot be sold unless there is more demand—that is, more consumption and more investment. This is all there is to the model. It contains one behavioral condition: that people tend to save a certain proportion of extra income, a tendency that can be measured. It also contains one technical condition: that investment generates additional output, a fact that can be established. And it contains one equilibrium condition: that planned saving must equal planned investment in every period if the income level of the period is to be sustained. Given these three conditions, the model generates a time path of income and even indicates what will happen if income falls off the path.",
  "More complex models have since been built, incorporating different saving ratios for different groups in the population, technical conditions for each industry, definite assumptions about the character of technical progress in the economy, monetary and financial equations, and much more. The new growth theory of the 1990s was labeled “endogenous growth theory” because it attempted to explain technical change as the result of profit-motivated research and development (R&D) expenditure by private firms. This was driven by competition along the lines of what Schumpeter called product innovations (as distinct from process innovations). In contrast to the Harrod-Domar model, which viewed growth as exogenous, or coming from outside variables, the endogenous theory emphasizes growth from within the system. This approach enjoyed, and still enjoys, an enormous vogue, partly because it seemed to offer governments a new means of promoting economic growth—namely, national innovation policies designed to stimulate more private and public R&D spending.",
  " Taxation has been a concern of economists since the time of Ricardo. Much interest centres on determining who really pays a tax. If a corporation faced with a profits tax reacts by raising the prices it charges for goods and services, it might succeed in passing the tax on to the consumer. If, however, sales decline as a result of the rise in price, the firm may have to reduce production and lay off some of its workers, meaning that the tax burden has been passed along not only to consumers but to wage earners and shareholders as well.",
  "This simple example shows how complex the so-called “tax incidence” may be. The literature of public finance in the 19th century was devoted to such problems, but Keynesian economics replaced the older emphasis on tax incidence with the analysis of the impact of government expenditures on the level of income and employment. It was some time, however, before economists realized that they lacked a theory of government expenditures—that is, a set of criteria for determining what activities should be supported by governments and what the relative expenditure on each should be. The field of public finance has since attempted to devise such criteria. Decisions on public expenditures have proved to be susceptible to much of the traditional analysis of microeconomics. New developments in the 1960s expanded on a technique known as cost-benefit analysis , which tries to appraise all of the economic costs and benefits, direct and indirect, of a particular activity so as to decide how to distribute a given public budget most effectively between different activities. This technique, first put forth by Jules Dupuit in the 19th century, has been applied to everything from the construction of hydroelectric dams to the control of tuberculosis. Its exponents hoped that the same type of analysis that had proved so fruitful in the past in analyzing individual choice would also succeed with problems of social choice.",
  "Building upon 18th- and 19th-century mathematical studies of the voting process, Scottish economist Duncan Black brought a political dimension to cost-benefit studies. His book The Theory of Committees and Elections (1958) became the basis of public choice theory. As expressed in the book Calculus of Consent (1962) by American economists James Buchanan and Gordon Tullock, public choice theory applies the cost-benefit analysis seen in private decision making to political decision making. Politicians are conceived of as maximizing electoral votes in the same way that firms seek to maximize profits, while political parties are conceived of as organizing electoral support in the same way that firms organize themselves as cartels or power blocs to lobby governments on their behalf. Public choice challenged the notion, implicit in early public finance theory, that politicians always identify their own interest with that of the country as a whole.",
  "Ever since 19th-century economists put forth their theories of international economics, the subject has consisted of two distinct but connected parts: (1) the “pure theory of international trade,” which seeks to account for the gains obtained from trade and to explain how these gains are distributed among countries, and (2) the “theory of balance-of-payments adjustments,” which analyzes the workings of the foreign exchange market, the effects of alterations in the exchange rate of a currency, and the relations between the balance of payments and level of economic activity.",
  "In modern times, the Ricardian pure theory of international trade was reformulated by American economist Paul Samuelson , improving on the earlier work of two Swedish economists, Eli Heckscher and Bertil Ohlin . The so-called Heckscher-Ohlin theory explains the pattern of international trade as determined by the relative land, labour, and capital endowments of countries: a country will tend to have a relative cost advantage when producing goods that maximize the use of its relatively abundant factors of production (thus countries with cheap labour are best suited to export products that require significant amounts of labour).",
  "This theory subsumes Ricardo’s law of comparative costs but goes beyond it in linking the pattern of trade to the economic structure of trading nations. It implies that foreign trade is a substitute for international movements of labour and capital, which raises the intriguing question of whether foreign trade may work to equalize the prices of all factors of production in all trading countries. Whatever the answer, the Heckscher-Ohlin theory provides a model for analyzing the effects of a change in trade on the industrial structures of economies and, in particular, on the distribution of income between factors of production. One early study of the Heckscher-Ohlin theory was carried out by Wassily Leontief , a Russian American economist. Leontief observed that the United States was relatively rich with capital. According to the theory, therefore, the United States should have been exporting capital-intensive goods while importing labour-intensive goods. His finding, that U.S. exports were relatively more labour-intensive and imports more capital intensive, became known as the Leontief Paradox because it disputed the Heckscher-Ohlin theory. Recent efforts in international economics have attempted to refine the Heckscher-Ohlin model and test it on a wider range of empirical evidence.",
  "Like monetary and international economics, labour economics is an old economic speciality. Its raison d’être comes from the peculiarities of labour as a commodity. Unlike land or machinery, labour itself is not bought and sold; rather, its services are hired and rented out. But since people cannot be disassociated from their services, various nonmonetary considerations play a concealed role in the sale of labour services.",
  "For many years labour economics was concerned solely with the demand side of the labour market. This one-sided view held that wages were determined by the “marginal productivity of labour”—that is, by the relationships of production and by consumer demand. If the supply of labour came into the picture at all, it was merely to allow for the presence of trade unions. Unions, it was believed, could only raise wages by limiting the supply of labour. Later in the 20th century, the supply side of the labour market attracted the attention of economists, which shifted from the individual worker to the household as a supplier of labour services. The increasing number of married women entering the labour force and the wide disparities and fluctuations observed in the rate that females participate in a labour force drew attention to the fact that an individual’s decision to supply labour is strongly related to the size, age structure, and asset holdings of the household to which he or she belongs.",
  "Next, the concept of human capital—that people make capital investments in their children and in themselves in the form of education and training, that they seek better job opportunities, and that they are willing to migrate to other labour markets—has served as a unifying explanation of the diverse activities of households in labour markets. Capital theory has since become the dominant analytical tool of the labour economists, replacing or supplementing the traditional theory of consumer behaviour. The economics of training and education, the economics of information, the economics of migration, the economics of health, and the economics of poverty are some of the by-products of this new perspective. A field that was at one time regarded as rather cut-and-dried has taken on new vitality.",
  "Labour economics, old or new, has always regarded the explanation of wages as its principal task, including the factors determining the general level of wages in an economy and the reasons for wage differentials between industries and occupations. There is no question that wages are influenced by trade unions, and the impact of union activities is of increased importance at a time when governments are concerned with unemployment statistics. Questions of whether prices are being pushed up by the labour unions (“cost push”) or pulled up by excess purchasing power (“demand pull”) have become the issues in the larger debate on inflation—a controversy that is directly related to the debates in monetary economics mentioned earlier.",
  "The principal concerns of industrial organization are the structure of markets, public policy toward monopoly, the regulation of public utilities, and the economics of technical change. The monopoly problem, or, more precisely, the problem of the maintenance of competition, does not fit well into the received body of economic thought. Economics started out, after all, as the theory of competitive enterprise, and even today its most impressive theorems require the assumption of numerous small firms, each having a negligible influence on price. Yet, as noted earlier, contemporary market structures tend toward oligopoly—competition among the few—with some industries dominated by firms so large their annual sales volume exceeds the national income of the smaller European countries. It is tempting to conclude that oligopoly is deleterious to economic welfare on the ground that it leads to the misallocation of resources. But some economists, notably Schumpeter, have argued that economic growth and technical progress are achieved not through free competition but by the enlargement of firms and the destruction of competition. According to this view, the giant firms compete not in price but in successful innovation, and this kind of competition has proved more effective for economic progress than the more traditional price competition.",
  "This thesis makes somewhat less compelling the merits of “trust busting,” largely taken for granted since the administration of U.S. President Theodore Roosevelt first set about curbing the concentration of corporate power in the early 20th century. Instead, it points the way for a consideration of competition that seeks to attain the greatest benefit for society. For example, if four or five large firms in an oligopolistic industry compete on the basis of product quality, research, technology, or merchandising, the performance of the entire industry may well be more satisfactory than if it were reorganized into a price-competitive industry. But if the four or five giants compete only in sales promotion techniques, the outcome will likely be less favourable for society. One cannot, therefore, draw facile conclusions about the competitive results of different market structures.",
  "Much uncertainty in the economic discussion of policies towards big business stems from the lack of a general theory of oligopoly. Perhaps a loose criterion for judging the desirability of different market structures is American economist William Baumol’s concept of “contestable markets”: if a market is easy to enter and to exit, it is “contestable” and hence workably competitive.",
  "Farming has long provided economists with their favourite example of a perfectly competitive industry. However, given the level of government regulation of and support for agriculture in most countries, farming also provides striking examples of the effects of price controls, income supports, output ceilings, and marketing cartels. Not surprisingly, agricultural economics commands attention wherever governments wish to stimulate farming or to protect farmers—which is to say everywhere.",
  "Agricultural economists generally have been closer to their subject matter than other economists. In consequence, more is known about the technology of agriculture, the nature of farming costs, and the demand for agricultural goods than is known about any other industry. Thus the field of agricultural economics offers a rich literature on the basics of economic study, such as estimating a production function or plotting a demand curve.",
  "One of the most remarkable new developments is the growth of a discipline combining legal and economic concerns. Its origins in the 1970s are almost wholly due to the unintended effects of two articles by Ronald Coase , a British economist specializing in industrial organization. Before emigrating to the United States in 1950, Coase published “The Nature of the Firm” (1937), which was the first paper to pose a seemingly innocent question: Why are there firms at all—why not a collection of independent producers and merchants supplying whatever is called for in the market? Firms are, after all, nonmarket administrative organizations. Coase determined that firms spring up to minimize the “transaction costs” of marketing—namely, the costs of drawing up contracts and monitoring their implementation. Coase’s idea—that all economic transactions are in fact explicit or implicit contracts and hence that the role of the law in enforcing contracts is crucial to the operations of a market economy—was soon seen as a revelation. Economic institutions (such as corporations) came to be viewed as social devices for reducing transaction costs.",
  "Coase contributed yet another central tenet of law and economics as a unified field of study in his paper “The Problem of Social Cost” (1960). Here he argued that, except for transaction costs, not only could private deals between voluntary agents always accommodate market failures but that “government failures” (that is, those caused by government intervention) were as deleterious as market failures, if not more so. As Coase stated in the paper,",
  "Direct governmental regulation will not necessarily give better results than leaving the problem to be solved by the market or firm. But equally, there is no reason why on occasion such governmental administrative regulation should not lead to an improvement in economic efficiency.",
  "In other words, transaction costs were central to the problem of social welfare, and markets were inherently more efficient than any social intervention devised by governments. Up to this point the accepted neoclassical welfare economics had promoted “perfect competition” as the best of all possible economic worlds. This theoretical market structure comprised a world of many small firms whose product prices were determined by the sum of all their output decisions in relation to the independent demand of consumers. This perfect condition, however, depended on increasing returns to scale which allow firms to cut costs as their businesses expand. The concept of perfect competition therefore assumed that one or more of the small firms must fail. This argument has been known ever since as the Coase theorem, and “The Problem of Social Cost” produced not just law and economics as a speciality study in economics but led to the new institutionalism in industrial organization referred to earlier.",
  "  Toward the end of the 20th century, information economics became an increasingly important specialization. It is almost wholly the legacy of a single article entitled “The Market for ‘Lemons’: Quality Uncertainty and the Market Mechanism” by George Akerlof (1970). Akerlof asserted that the market for secondhand cars is one in which sellers know much more than buyers about the quality of the product being sold, implying that only the worst cars—“lemons”—reach the secondhand car market. As a result, secondhand-car dealers are compelled to offer guarantees as a means of increasing their customers’ confidence. A buyer who knows more about a transaction (i.e., the quality of the secondhand car) will be willing to pay more than a buyer who is provided less information about a transaction. For any product or service, therefore, “asymmetric information” (one party to a transaction knowing more than another) can result in “missing markets,” or the absence of a marketable transaction. The potency of this idea and its relevance to all sorts of economic behaviour captivated many economists, leading some to connect it with contract theory and principal-agency theory (concerning situations in which a principal hires an agent to carry out instructions but then has to monitor the agent’s performance, as in franchising a business). Two or three decades after Akerlof’s groundbreaking work, it was abundantly clear that information economics flowed from his underlying idea of asymmetric information, and in 2001 Akerlof, Joseph Stiglitz , and Michael Spence were jointly awarded the Nobel Prize in Economics for their work in this area.",
  "Although news about the stock market has come to dominate financial journalism, only since the late 20th century was the stock market recognized as an institution suitable for economic analysis. This recognition turned on a changed understanding of the “efficient market hypothesis,” which held that securities prices in an efficient stock market were inherently unpredictable—that is, an investment in the stock market was, for all but insider traders, equivalent to gambling in a casino. (An efficient stock market was one in which all information relevant to the discounted present value of stocks was freely available to all participants in the market and hence was immediately incorporated into their buying and selling plans; stock market prices were unpredictable because every fact that made them predictable had already been acted on.) In the famous economists’ joke, there is no point in picking up a $10 bill lying on the sidewalk, because if it were real, someone else would already have picked it up.",
  "The growth of financial markets, the deregulation of international capital markets, and the unprecedented availability of financial data gradually undermined the efficient market hypothesis. By the 1990s there had been enough “bubbles” in stock prices to remind economists of the excessive volatility of stock markets (and to prompt Federal Reserve Board chairman Alan Greenspan to point to the market’s “irrational exuberance” when share prices hit new peaks late in the decade). The securities markets seemed anything but efficient. In any case, finance is an area where facts can be highly ambiguous but where the number of people desperately interested in the nature of those facts will guarantee the further growth of financial economics.",
  "There are different schools of thought in economics, each with its own journals and conferences. One, the Austrian school, now rooted in the United States, with leading centres at New York University and George Mason University, originated in the works of Carl Menger , Friedrich von Wieser , and Böhm-Bawerk, all of whom emphasized utility as a component of value. Its free market precepts were brought to the United States by Ludwig Mises and the well-known author of The Road to Serfdom (1944), Friedrich A. Hayek .",
  "Charles Darwin’s influence can be seen in all of the social sciences, and another alternative school, evolutionary economics—like much of the literature in economics, psychology, and sociology—builds on analogies to evolutionary processes. Also drawing heavily on game theory, it is primarily concerned with economic change, innovation, and dynamic competition. This is not, of course, the first time that economists have flirted with Darwinian biology. Both Veblen and Alfred Marshall were convinced that biology and not mechanics offered the road to theoretical progress in economics, and, while this belief in biological thinking died out in the early years of the 20th century, it has returned to prominence in evolutionary economics.",
  "Pairing his critique of central planning with a defence of free markets, Hayek became a sophisticated evolutionary economist whose advocacy of markets drew attention to the weakest element in mainstream economics: the assumption that economic agents are always perfectly informed of alternative opportunities. A follower of Mises and Hayek, American economist Israel Kirzner developed this line of thinking into a unique Austrian theory of entrepreneurship (involving spontaneous learning and decision making at the individual level) that emphasized a tendency toward economic equilibrium.",
  "Yet another school outside the mainstream is Sraffian economics. As an offshoot of general equilibrium theory, Sraffian economics purports to explain the determination of prices by means of the technological relationships between inputs and outputs without invoking the preferences of consumers that neoclassical economists rely on so heavily. Moreover, Sraffian theory is said to recover the classical economic tradition of Smith and Ricardo, which Sraffians believe has been deliberately buried by neoclassical orthodoxy. All of this stems from Piero Sraffa’s The Production of Commodities by Means of Commodities (1962), whose 100 or so pages have attracted thousands of pages of elucidation, though the true meaning of Sraffian economics still remains somewhat elusive. Be that as it may, Sraffian economics is a good example of the unequal global diffusion of economic specialization; while it is recognized as a minority school of thought in Europe, Sraffian economics is virtually unknown in American academic circles.",
  "Radical economics, including feminist economics, is better characterized by what it opposes than by what it advocates. A glance at the pages of the Review of Radical Political Economics and Feminist Economics may cause some to wonder if these specialized concerns should even be considered as economics. That question leads back to the notion that economics is what economists do; in that light, heterodox economics, as exemplified by these and similar networks of dissenters, is indeed economics.",
  "Other principal fields in economics include economic history , health economics, cultural economics, economics of education, demographic economics, the study of nonprofit organizations, economic regulation, business management, comparative economic systems, environmental economics, urban and regional economics, and spatial economics.",
  "Economics has always been taught in conjunction with economic history, but the relationship between these two fields has never been an easy one, and to this day economics departments in the United States include economic historians. In most of Europe, however, economists and economic historians are not joined together institutionally. Although economic historians have won Nobel Prizes ( Simon Kuznets in 1971, and Robert Fogel and Douglass North in 1993), most economists do not aspire to study in this area.",
  "The growth of public interest in certain areas affects economists as much as other people. It is not surprising therefore that environmental economics has been an emerging subfield of economics. Marshall and his principal student, Arthur Pigou, created the subject of welfare economics around the theme of the negative “externalities” or spillovers (such as pollution) caused by the growth of big business. Should such “diseconomies of scale” be controlled by administrative regulation, or should firms be made to pay for them by selling them licenses to pollute? Global warming has dramatized the importance of these questions, and the concerns of environmental economics were priorities of applied economists at the start of the 21st century.",
  "In the 1960s the American “war on poverty” and concerns about schooling brought the economics of education to the fore. That was the decade of interest in human capital theory, and since then the growing health bill of Western countries has drawn similar attention to health economics as a specialization. This is unlikely to change in the years to come, and health economics is perhaps the field in the applied economics of the future with the most promising potential. One might have thought that the same would apply to spatial economics or the economics of location ( see  location theory ). After all, what could be more important than the location at which economic activity is carried out? How can the marketing of products be studied without paying attention to the role of location? But although spatial economics has a long and rich history of scholarship (including the work of Johann Heinrich von Thünen and Alfred Weber), it has never attracted the steady interest of economists. Why that is so is a big unanswered question.",
  "Lastly, there is the influence from the field of business management. Developments in higher education have fostered the study of economics within business schools (as opposed to maintaining distinct departments of economics). This trend has been encouraged by the institutions that hire new economists, such as banks, brokerage firms, and governments. As a result, many colleges and universities have reduced their economics faculties while building up their management faculties. The fields of business administration and business economics have their own gurus, but only a few (such as American economists Herbert Simon and Alfred Chandler) straddle both economics and management. By and large, these are different worlds, and only time will tell whether economics and management will one day merge into some new, more comprehensive subject in the study of business governance. What is certain is that economics will remain a vital branch of knowledge, as central to curricula of universities as it is to the conduct of human interaction, with an ongoing proliferation of new theories, schools, and subfields.",
  " Mark Blaug and Howard R. Vane (eds.), Who’s Who in Economics , 4th ed. (2003), contains biographical information on 1,500 economists, based on their frequency of citation in economics journals. Mark Blaug , Great Economists Before Keynes (1986, reissued 1997), provides thumbnail sketches of the ideas of 200 eminent economists. Douglas Greenwald (ed.), The McGraw-Hill Encyclopaedia of Economics , 2nd ed. (1994); and Phillip Anthony O’Hara (ed.), Encyclopaedia of Political Economy , 2 vol. (1998, reissued 2001), are two accessible sources of reference addressed to students coming to economics for the first time.",
  "There is the more comprehensive John Eatwell , Murray Milgate , and Peter Newman (eds.), The New Palgrave: A Dictionary of Economics , 4 vol. (1987, reissued 2002), but the level of readability and technical difficulty varies greatly from entry to entry. For a more accessible overview, see Roger E. Backhouse , The Penguin History of Economics (2002).",
  "Representative introductory textbooks are Paul A. Samuelson and William D. Nordhaus , Economics , 18th ed. (2005); Richard G. Lipsey and K. Alec Chrystal , Economics , 10th ed. (2004); and William J. Baumol and Alan S. Blinder , Economics: Principles and Policy , 9th ed. (2003)."
]