[
  "  soil , the biologically active, porous medium that has developed in the uppermost layer of Earth’s crust . Soil is one of the principal substrata of life on Earth, serving as a reservoir of water and nutrients, as a medium for the filtration and breakdown of injurious wastes, and as a participant in the cycling of carbon and other elements through the global ecosystem . It has evolved through weathering processes driven by biological, climatic, geologic, and topographic influences.",
  "Since the rise of agriculture and forestry in the 8th millennium bce , there has also arisen by necessity a practical awareness of soils and their management. In the 18th and 19th centuries the Industrial Revolution brought increasing pressure on soil to produce raw materials demanded by commerce, while the development of quantitative science offered new opportunities for improved soil management. The study of soil as a separate scientific discipline began about the same time with systematic investigations of substances that enhance plant growth. This initial inquiry has expanded to an understanding of soils as complex, dynamic, biogeochemical systems that are vital to the life cycles of terrestrial vegetation and soil-inhabiting organisms—and by extension to the human race as well.",
  " This article covers the structure, composition, and classification of soils and how these factors affect soil’s role in the global ecosystem. In addition, the two most important phenomena that degrade soils, erosion and pollution, are discussed. For a cartographic guide to the distribution of the world’s major soils, featuring links to short descriptive entries on each soil type, see the interactive world map .",
  "  Soils differ widely in their properties because of geologic and climatic variation over distance and time. Even a simple property, such as the soil thickness, can range from a few centimetres to many metres, depending on the intensity and duration of weathering , episodes of soil deposition and erosion , and the patterns of landscape evolution. Nevertheless, in spite of this variability, soils have a unique structural characteristic that distinguishes them from mere earth materials and serves as a basis for their classification: a vertical sequence of layers produced by the combined actions of percolating waters and living organisms.",
  " These layers are called horizons , and the full vertical sequence of horizons constitutes the soil profile (see the figure ). Soil horizons are defined by features that reflect soil-forming processes. For instance, the uppermost soil layer (not including surface litter) is termed the A horizon. This is a weathered layer that contains an accumulation of humus (decomposed, dark-coloured, carbon-rich matter) and microbial biomass that is mixed with small-grained minerals to form aggregate structures.",
  "Below A lies the B horizon. In mature soils this layer is characterized by an accumulation of clay (small particles less than 0.002 mm [0.00008 inch] in diameter) that has either been deposited out of percolating waters or precipitated by chemical processes involving dissolved products of weathering. Clay endows B horizons with an array of diverse structural features (blocks, columns, and prisms) formed from small clay particles that can be linked together in various configurations as the horizon evolves.",
  "Below the A and B horizons is the C horizon, a zone of little or no humus accumulation or soil structure development. The C horizon often is composed of unconsolidated parent material from which the A and B horizons have formed. It lacks the characteristic features of the A and B horizons and may be either relatively unweathered or deeply weathered. At some depth below the A, B, and C horizons lies consolidated rock, which makes up the R horizon.",
  "These simple letter designations are supplemented in two ways (see the of soil horizon letter designations). First, two additional horizons are defined. Litter and decomposed organic matter (for example, plant and animal remains) that typically lie exposed on the land surface above the A horizon are given the designation O horizon, whereas the layer immediately below an A horizon that has been extensively leached (that is, slowly washed of certain contents by the action of percolating water) is given the separate designation E horizon, or zone of eluviation (from Latin ex , “out,” and lavere , “to wash”). The development of E horizons is favoured by high rainfall and sandy parent material, two factors that help to ensure extensive water percolation. The solid particles lost through leaching are deposited in the B horizon, which then can be regarded as a zone of illuviation (from Latin il , “in,” and lavere ).",
  "The combined A, E, B horizon sequence is called the solum (Latin: “floor”). The solum is the true seat of soil-forming processes and is the principal habitat for soil organisms. (Transitional layers, having intermediate properties, are designated with the two letters of the adjacent horizons.)",
  "The second enhancement to soil horizon nomenclature (also shown in the ) is the use of lowercase suffixes to designate special features that are important to soil development. The most common of these suffixes are applied to B horizons: g to denote mottling caused by waterlogging, h to denote the illuvial accumulation of humus, k to denote carbonate mineral precipitates, o to denote residual metal oxides, s to denote the illuvial accumulation of metal oxides and humus, and t to denote the accumulation of clay.",
  " Soils are natural elements of weathered landscapes whose properties may vary spatially. For scientific study, however, it is useful to think of soils as unions of modules known as pedons. A pedon is the smallest element of landscape that can be called soil. Its depth limit is the somewhat arbitrary boundary between soil and “not soil” (e.g., bedrock). Its lateral dimensions must be large enough to permit a study of any horizons present—in general, an area from 1 to 10 square metres (10 to 100 square feet), taking into account that a horizon may be variable in thickness or even discontinuous. Wherever horizons are cyclic and recur at intervals of 2 to 7 metres (7 to 23 feet), the pedon includes one-half the cycle. Thus, each pedon includes the range of horizon variability that occurs within small areas. Wherever the cycle is less than 2 metres, or wherever all horizons are continuous and of uniform thickness, the pedon has an area of 1 square metre.",
  "Soils are encountered on the landscape as groups of similar pedons, called polypedons, that contain sufficient area to qualify as a taxonomic unit. Polypedons are bounded from below by “not soil” and laterally by pedons of dissimilar characteristics.",
  " The grain size of soil particles and the aggregate structures they form affect the ability of a soil to transport and retain water, air, and nutrients. Grain size is classified as clay if the particle diameter is less than 0.002 mm (0.0008 inch), as silt if it is between 0.002 mm (0.0008 inch) and 0.05 mm (0.002 inch), or as sand if it is between 0.05 mm (0.002 inch) and 2 mm (0.08 inch). Soil texture refers to the relative proportions of sand, silt, and clay particle sizes, irrespective of chemical or mineralogical composition (see the figure ). Sandy soils are called coarse-textured, and clay-rich soils are called fine-textured. Loam is a textural class representing about one-fifth clay, with sand and silt sharing the remainder equally.",
  "  Pore radii (space between soil particles) can range from millimetre-scale between sand grains to micrometre-scale between clay grains. Soil particles falling into the three principal size categories may have various mineralogical or chemical compositions, although sand particles often are composed of quartz and feldspars , silt particles often are micaceous, and clay particles often contain layer-type aluminosilicates (the so-called clay minerals ). Organic matter and amorphous mineral matter also are important constituents of soil clay particles.",
  "Porosity reflects the capacity of soil to hold air and water, and permeability describes the ease of transport of fluids and their dissolved components. The porosity of a soil horizon increases as its texture becomes finer, whereas the permeability decreases as the average pore size becomes smaller. Small pores not only restrict the passage of matter, but they also bring it into close proximity with chemical binding sites on the particle surface that can slow its movement. Clay and humus affect both soil porosity and permeability by binding soil grains together into aggregates, thereby creating a network of larger pores (macropores) that facilitate the movement of water. Plant roots open pores between soil aggregates, and cycles of wetting and drying create channels that allow water to pass easily. (However, this structure collapses under waterlogging conditions.) The stability of aggregates increases with humus content, especially humus that originates from grass vegetation. For soils that are not disturbed significantly by human activities, however, the pore space and the varieties of macropores are more important determinants of porosity than the soil texture. As a general rule, average pore size decreases from certain agricultural practices and other human uses of soil.",
  "  Aggregates of soil particles whose formation has not been influenced by human intervention are called peds. The peds in the surface horizons of soils develop into clods under the effects of cultivation and the traffic of urbanization. Soils whose A horizon is dense and unstructured increase the fraction of precipitation that will become surface runoff and have a high potential for erosion and flooding. These soils include not only those whose peds have been degraded but also coarse-textured soils with low porosity, particularly those of arid regions.",
  "A well-developed clay horizon (Bt) presents a deep-lying obstacle to the downward percolation of water. Subsurface runoff cannot easily penetrate the clay layer and flows laterally along the horizon as it moves toward the stream system. This type of runoff is slower than its erosive counterpart over the land surface and leads to water saturation of the upper part of the soil profile and the possibility of gravity-induced mass movement on hillslopes (e.g., landslides ). It is also responsible for the translocation (migration) of dissolved products of chemical weathering down a hillslope sequence of related soil profiles (a toposequence). Subsurface water flow is also influenced by macropores, which, as noted above, are created through plant root growth and decay, animal burrowing activities, soil shrinkage while drying, or fracturing. In general, subsurface runoff processes are characteristic of soils in humid regions, whereas surface runoff is characteristic of arid regions and, of course, any landscape altered significantly by cultivation or urbanization.",
  "The bulk of soil consists of mineral particles that are composed of arrays of silicate  ions (SiO 4  4− ) combined with various positively charged metal ions. It is the number and type of the metal ions present that determine the particular mineral. The most common mineral found in Earth’s crust is feldspar , an aluminosilicate that contains sodium , potassium , or calcium (sometimes called bases) in addition to aluminum ions. Weathering breaks up crystals of feldspars and other silicate minerals and releases chemical compounds such as bases, silica, and oxides of iron and aluminum (Fe 2 O 3 and alumina [Al 2 O 3 ]). After the bases are removed by leaching, the remaining silica and alumina combine to form crystalline clays.",
  "The kind of crystalline clay produced depends on leaching intensity. Prolonged leaching leaves little silica to combine with alumina and results in what are known as 1:1 clays, consisting of alternating silica and alumina sheets; less extensive leaching leads to the formation of 2:1 clays, consisting of one alumina sheet sandwiched between two silica sheets. In neither case is the result solely one of the two types, though 1:1 clay is predominant in the tropics after prolonged leaching and 2:1 clay more abundant when leaching is less extensive in more temperate climates.",
  "The solid soil particles are chemically reactive because of the presence of electrically charged sites on their surfaces. If a reactive site binds a dissolved ion or molecule to form a stable unit, a “surface complex” is said to exist. The formation reaction itself is called surface complexation. Surface complexation is an example of adsorption, a chemical process in which matter accumulates on a solid particle surface. Ions such as Ca 2+ (calcium), Mg 2+ (magnesium), Na + (sodium), and NO 3  − (nitrate) do not tend to adsorb strongly, making these important plant nutrients susceptible to easy replacement. Once ejected from their surface sites, these ions may be leached downward by percolating water to become removed from the biogeochemical cycles occurring in the upper part of the soil profile.",
  "  Freshwater leaching of soils brings hydrogen ions (H + ) that increase mineral solubility, releasing Al 3+ (aluminum), a toxic ion that can displace nutrients such as Ca 2+ . The gradual loss of nutrients and the accumulation of adsorbed H + and Al 3+ characterize the buildup of soil acidity, with its harmful effects on organisms. Soils display their acidity by a decrease in content of acid-soluble minerals (for example, feldspars or clay minerals) and an increase in insoluble minerals (iron and aluminum oxides). Soils weathered by freshwater leaching evolve from clay particles with a prevalence of metal ion-binding sites to highly weathered metal oxides that do not have sites that bind readily with metal ions.",
  "  The second major component of soils is organic matter produced by organisms. The total organic matter in soil, except for materials identifiable as undecomposed or partially decomposed biomass, is called humus . This solid, dark-coloured component of soil plays a significant role in the control of soil acidity, in the cycling of nutrients, and in the detoxification of hazardous compounds. Humus consists of biological molecules such as proteins and carbohydrates as well as the humic substances (polymeric compounds produced through microbial action that differ from metabolically active compounds).",
  "The processes by which humus forms are not fully understood, but there is agreement that four stages of development occur in the transformation of soil biomass to humus: (1) decomposition of biomass into simple organic compounds, (2) metabolization of the simple compounds by microbes, (3) cycling of carbon, hydrogen, nitrogen, and oxygen between soil organic matter and the microbial biomass, and (4) microbe-mediated polymerization of the cycled organic compounds.",
  "The investigation of molecular structure in humic substances is a difficult area of current research. Although it is not possible to describe the molecular configuration of humic substances in any but the most general terms, these molecules contain hydrogen ions that dissociate in fresh water to form molecules that bear a net negative charge. These negatively charged sites can interact with toxic metal ions and effectively remove them from further interaction with the environment.",
  "Much of the molecular framework of soil organic matter, however, is not electrically charged. The uncharged portions of humic substances can react with synthetic organic compounds such as pesticides, fertilizers, solid and liquid waste materials, and their degradation products. Humus, either as a separate solid phase or as a coating on mineral surfaces, can immobilize these compounds and, in some instances, detoxify them significantly.",
  "Fertile soils are biological environments teeming with life on all size scales, from microfauna (with body widths less than 0.1 mm [0.004 inch]) to mesofauna (up to 2 mm [0.08 inch] wide) and macrofauna (up to 20 mm [0.8 inch] wide). The most numerous soil organisms are the unicellular microfauna: 1 kilogram (2.2 pounds) of soil may contain 500 billion bacteria , 10 billion actinomycetes (filamentous bacteria, some of which produce antibiotics), and nearly 1 billion fungi . The multicellular animal population can approach 500 million in a kilogram of soil, with microscopic nematodes (roundworms) the most abundant. Mites and springtails , which are categorized as mesofauna, are the next most prevalent. Earthworms , millipedes , centipedes , and insects make up most of the rest of the larger soil animal species. Plant roots also make a significant contribution to the biomass—the combined root length from a single plant can exceed 600 km (373 miles) in the top metre of a soil profile.",
  "The soil flora and fauna play an important role in soil development. Microbiological activity in the rooting zone of soils is important to soil acidity and to the cycling of nutrients. Aerobic and anaerobic (oxygen-depleted) microniches support microbes that determine the rate of the production of carbon dioxide (CO 2 ) from organic matter or of nitrate (NO 3  − ) from molecular nitrogen (N 2 ).",
  " 2 2 2 3 + 3 − 3 2− 2 2 4 2 2  The carbon and nitrogen cycles are two important microbe-mediated cycles that are described in more detail in the section Soils in ecosystems . In this section, however, it is worth pointing out how they illustrate the complex, integrated nature of a soil’s physical, chemical, and biological behaviour: soil peds and pore spaces provide microniches for the action of carbon- and nitrogen-cycling organisms, soil humus provides the nutrient reservoirs, and soil biomass provides the chemical pathways for cycling. The carbon in dead biomass is converted to carbon dioxide (CO 2 ) by aerobic microorganisms and to organic acids or alcohols by anaerobic microorganisms. Under highly anaerobic conditions, methane (CH 4 ) is produced by bacteria. The CO 2 produced can be used by photosynthetic microorganisms or by higher plants to create new biomass and thus initiate the carbon cycle again.",
  "  The nitrogen (N) bound into proteins in dead biomass is consumed by microorganisms and converted into ammonium ions (NH 4  + ) that can be directly absorbed by some plant roots (for example, lowland rice). The ammonium ions are usually converted to nitrite ions (NO 2  − ) by  Nitrosomonas  bacteria, followed by a second conversion to nitrate (NO 3  − ) by Nitrobacter bacteria. This very mobile form of nitrogen is that most commonly absorbed by plant roots, as well as by microorganisms in soil. To close the nitrogen cycle, nitrogen gas in the atmosphere is converted to biomass nitrogen by Rhizobium bacteria living in the root tissues of legumes (e.g., alfalfa, peas, and beans) and leguminous trees (such as alder) and by cyanobacteria and Azotobacter bacteria. See also  nitrogen fixation .",
  "As stated at the beginning of this article, soils evolve under the action of biological, climatic, geologic, and topographic influences. The evolution of soils and their properties is called soil formation, and pedologists have identified five fundamental soil formation processes that influence soil properties. These five “state factors” are parent material, topography, climate, organisms, and time.",
  "    Parent material is the initial state of the solid matter making up a soil. It can consist of consolidated rocks, and it can also include unconsolidated deposits such as river alluvium , lake or marine sediments, glacial tills , loess (silt-sized, wind-deposited particles), volcanic ash, and organic matter (such as accumulations in swamps or bogs ). Parent materials influence soil formation through their mineralogical composition, their texture, and their stratification (occurrence in layers). Dark-coloured ferromagnesian (iron- and magnesium-containing) rocks, for example, can produce soils with a high content of iron compounds and of clay minerals in the kaolin or smectite groups, whereas light-coloured siliceous (silica-containing) rocks tend to produce soils that are low in iron compounds and that contain clay minerals in the illite or vermiculite groups. The coarse texture of granitic rocks leads to a coarse, loamy soil texture and promotes the development of E horizons (the leached lower regions of the topmost soil layer). The fine texture of basaltic rocks, on the other hand, yields soils with a loam or clay-loam texture and hinders the development of E horizons. Because water percolates to greater depths and drains more easily through soils with coarse texture, clearly defined E horizons tend to develop more fully on coarse parent material.",
  "  In theory, parent material is either freshly exposed solid matter (for example, volcanic ash immediately after ejection) or deep-lying geologic material that is isolated from atmospheric water and organisms. In practice, parent materials can be deposited continually by wind, water, or volcanoes and can be altered from their initial, isolated state, thereby making identification difficult. If a single parent material can be established for an entire soil profile, the soil is termed monogenetic; otherwise, it is polygenetic. An example of polygenetic soils are soils that form on sedimentary rocks or unconsolidated water- or wind-deposited materials. These so-called stratified parent materials can yield soils with intermixed geologic layering and soil horizons—as occurs in southeastern England, where soils forming atop chalk bedrock layers are themselves overlain by soil layers formed on both loess and clay materials that have been modified by dissolution of the chalk below.",
  "Adjacent soils frequently exhibit different profile characteristics because of differing parent materials. These differing soil areas are called lithosequences, and they fall into two general types. Continuous lithosequences have parent materials whose properties vary gradually along a transect, the prototypical example being soils formed on loess deposits at increasing distances downwind from their alluvial source. Areas of such deposits in the central United States or China show systematic decreases in particle size and rate of deposition with increasing distance from the source. As a result, they also show increases in clay content and in the extent of profile development from weathering of the loess particles.",
  "By contrast, discontinuous lithosequences arise from abrupt changes in parent material. A simple example might be one soil formed on schist (a silicate-containing metamorphic rock rich in mica ) juxtaposed with a soil formed on serpentine (a ferromagnesian metamorphic rock rich in olivine ). More subtle discontinuous lithosequences, such as those on glacial tills, show systematic variation of mineralogical composition or of texture in unconsolidated parent materials.",
  "Topography, when considered as a soil-forming factor, includes the following: the geologic structural characteristics of elevation above mean sea level, aspect (the compass orientation of a landform), slope configuration (i.e., either convex or concave), and relative position on a slope (that is, from the toe to the summit). Topography influences the way the hydrologic cycle affects earth material, principally with respect to runoff processes and evapotranspiration. Precipitation may run off the land surface, causing soil erosion, or it may percolate into soil profiles and become part of subsurface runoff, which eventually makes its way into the stream system. Erosive runoff is most likely on a convex slope just below the summit, whereas lateral subsurface runoff tends to cause an accumulation of soluble or suspended matter near the toeslope. The conversion of precipitation into evapotranspiration is favoured by lower elevation and an equatorially facing aspect.",
  "Adjacent soils that show differing profile characteristics reflecting the influence of local topography are called toposequences. As a general rule, soil profiles on the convex upper slopes in a toposequence are more shallow and have less distinct subsurface horizons than soils at the summit or on lower, concave-upward slopes. Organic matter content tends to increase from the summit down to the toeslope, as do clay content and the concentrations of soluble compounds.",
  " Often the dominant effect of topography is on subsurface runoff (or drainage). In humid temperate regions, well-drained soil profiles near a summit can have thick E horizons (the leached layers) overlying well-developed clay-rich Bt horizons, while poorly drained profiles near a toeslope can have thick A horizons overlying extensive Bg horizons (lower layers whose pale colour signals stagnation under water-saturated conditions). In humid tropical regions with dry seasons, these profile characteristics give way to less distinct horizons, with accumulation of silica, manganese, and iron near the toeslope, whereas in semiarid regions soils near the toeslope have accumulations of the soluble salts sodium chloride or calcium sulfate.",
  "These general conclusions are tempered by the fact that topography is susceptible to great changes over time. Soil erosion by water or wind removes A horizons and exposes B horizons to weathering. Major portions of entire soil profiles can move downslope suddenly by the combined action of water and gravity. Catastrophic natural events, such as volcanic eruptions, earthquakes, and devastating storms, can have obvious consequences for the instability of geomorphologic patterns.",
  "  The term climate in pedology refers to the characteristics of weather as they evolve over time scales longer than those necessary for soil properties to develop. These characteristics include precipitation, temperature, and storm patterns—both their averages and their variation.",
  "Climate influences soil formation primarily through effects of water and solar energy. Water is the solvent in which chemical reactions take place in the soil, and it is essential to the life cycles of soil organisms. Water is also the principal medium for the erosive or percolative transport of solid particles. The rates at which these water-mediated processes take place are controlled by the amount of energy available from the sun.",
  "  On a global scale, the integrated effects of climate can readily be seen along a transect from pole to Equator. As one proceeds from the pole to cool tundra or forested regions, polar desert soils give way to intensively leached soils such as the Podzols (Spodosols) that exhibit an eye-catching ash-coloured E horizon indicative of humid boreal climates. Farther into temperate zones, organic matter accumulates in soils as climates become warmer, and eventually lime (calcium carbonate) also begins to accumulate closer to the top of the soil profile as evapotranspiration increases. Arid subtropical climate then follows, with desert soils that are low in organic matter and enriched in soluble salts. As the climate again becomes humid close to the Equator, high temperature combines with high precipitation to create red and yellow tropical soils, whose colours reveal the prevalence of residual iron oxide minerals that are resistant to leaching losses because of their low solubility.",
  "On a continental scale, a transect taken across the central United States from east to west shows the effects of increasing evapotranspiration. First, soils that exhibit E horizons appear, followed by soils high in organic matter. These give way to soils with accumulations of lime and ultimately to desert soils with soluble salt efflorescence (powdery crust) near the surface.",
  "On a regional scale, variations in climate also can influence soil properties significantly, resulting in a contiguous array of soils called a climosequence. One typical climosequence occurs along a 1,000-km (600-mile) north-south transect through the foothills of the Cascade and Sierra Nevada mountains in California. There soils that have formed on landscapes of similar topography vary continuously in their profile characteristics with variations in annual precipitation. Soils formed at the dry southern end of the transect are shallow and rocky, whereas those at the humid northern end show well-developed B horizons and reddish colour. Clay mineralogy in the upper 20 cm (8 inches) of these soils also responds to the increase in precipitation, shifting from the smectite group to the mixed vermiculite or illite group/kaolin group and finally to the kaolin group alone. These changes result primarily from increasing loss of silica and soluble metals as soil leaching extends deeper with increasing rainfall. In addition, soil acidity and organic matter content increase, while readily soluble forms of calcium (important to plant growth and soil aggregation) decrease, with increasing precipitation.",
  " 3  In principle, soil profile characteristics that are closely linked to climate can in turn be interpreted as climatic indicators. For example, a soil profile with two well-defined zones of lime accumulation, one shallow and one deep, may signal the existence of a past climate whose greater precipitation drove the lime layer deeper than the present climate is able to do.",
  "Soils that formed in past environments different from the present and that are preserved (at least partially) at greater depth are known as paleosols. Some features of these soils can serve as climatic indicators, the most reliable being robust features such as horizons with hardened accumulations of relatively insoluble iron, manganese, or calcium minerals or layers with accumulations of strongly aggregated clay-size particles. Given a knowledge of the clay mineral in a suspected paleosol, and assuming the precipitation-clay mineralogy relationship described above, pedologists might be able to infer past climate. The precipitation level of a past climate might be inferred from an observation of the depth of lime-containing horizons in a paleosol. These potential applications of climatic relationships must be evaluated carefully in order to distinguish the effects of previously weathered parent material from those of purely climatic influence.",
  "The development of soils can be significantly affected by vegetation, animal inhabitants, and human populations. Any array of contiguous soils influenced by local flora and fauna is termed a biosequence. To return to the climosequence along the Cascade and Sierra Nevada ranges discussed above, the vegetation observed along this narrow foothill region varies from shrubs in the dry south to needle-leaved trees in the humid north, with extensive grasslands in between. In the middle of the precipitation range, transition zones occur in which small groves of needle-leaved trees are interspersed with grassland patches in an apparently random manner. These plant populations represent local flora largely selected by climate. The properties of the soils underlying these plants, however, exhibit differences that do not arise from climate, topography, or parent material but are an effect of the differing plant species. The soils under trees, for instance, are much more acidic and contain much less humus than those under grass, and nitrogen content is considerably greater in the grassland soil. These properties come directly from the type of litter produced by the two different kinds of vegetation.",
  "An opportunity to examine biosequences is often presented by relatively young soils formed from an alluvial parent material. Soils of this kind lying beneath shrubs may be richer in humus and plant nutrients than similar soils found beneath needle-leaved trees. This variation results from differences in the cyclic processes of plant growth, litter production, and litter decay. Organic matter decomposers will feed on stored material in soil if litter production is low, whereas high litter production will permit soil stocks of organic matter to increase, leading to humus-rich A horizons as opposed to the leached E horizons found in soils that form under humid climatic conditions.",
  "  Human beings are also part of the biological influx that influences soil formation. Human influence can be as severe as wholesale removal or burial (by urbanization) of an entire soil profile, or it can be as subtle as a gradual modification of organic matter by agriculture or of soil structure by irrigation . The chemical and physical properties of soils critical to the growth of crops often are affected significantly by cultural practices. Among the problems created for agriculture by cultural practices themselves are loss of arable land, erosion, the buildup of salinity, and the depletion of organic matter.",
  "The soil-forming factors of parent material and topography are largely site-related (attributes of the terrain), whereas those of climate and organisms are largely flux-related (inputs from the surroundings). Time as a soil-forming factor is neither a property of the terrain nor a source of external stimulus. It is instead an abstract variable whose significance is solely as a marker of the evolution of soil characteristics. The conceptual independence of time from its four companion factors means simply that soil evolution can occur while site attributes and external inputs remain essentially unchanged.",
  "Certain soil profile features can be interpreted as indicators of the passage of time. (A series of soil profiles whose features differ only as a result of age constitutes a chronosequence.) One example of a time-related feature is the humus content of the A horizon, which, for soils less than 10,000 years old, increases continually at a rate dependent on parent material, vegetation, and climate. Typically, this rate of increase slows after about 10,000 years, plant nutrients begin to leach away, and a significant decline in humus content is observed for soils whose age approaches one million years. (Agricultural practices can interrupt this trend, causing a gradual drop in stored humus by 25 percent or more. Correlated with these changes are economically important soil properties, such as nutrient supply and retention capability, acidity, and aeration.)",
  "The accumulation of clay and lime in soil profiles as a result of their translocation downward is also an indication of aging. For example, older soils that have formed on calcium-containing loess deposits have better-developed E and Bt horizons (as well as thinner A horizons) than younger soils forming on these deposits. Similarly, soils in a chronosequence developed on alluvium can exhibit a clayey hardpan after 100,000 years or so. Soils also tend to redden in colour as they age, irrespective of climatic conditions, reflecting the persistence of poorly crystalline or crystalline oxide minerals containing Fe 3+ . Indeed, the dominant mineralogy of the clay-size particles in soils is itself a reliable indicator of soil age. Any particular sequence of predominant clay mineralogy found in a soil is known collectively as the set of Jackson-Sherman weathering stages (see the ). Each downward increment through the table corresponds to increasing mineral residence time, both among and within the three principal stages (early, intermediate, and advanced).",
  "The early stage of weathering is recognized through the dominance of sulfates , carbonates , and primary silicates , other than quartz and muscovite , in the soil clay fraction. These minerals can survive only if soils remain very dry, very cold, or very wet most of the time—that is, if they have limited exposure to water, air, or solar energy. The intermediate stage features quartz, muscovite, and secondary aluminosilicates prominently in the clay fraction. These minerals can survive under leaching conditions that do not deplete silica and metals, such as calcium or magnesium, and that do not result in the complete oxidation of Fe 2+ , which is then incorporated into illite and smectite clays. The advanced stage, on the other hand, is associated with intensive leaching and strong oxidizing conditions, such that only oxides of aluminum, Fe 3+ , and titanium remain. Kaolin will be a dominant clay mineral group only if the removal of silica by leaching is not complete or if there is an encroachment of silica-rich waters—as can occur, for example, when water percolating through a soil profile at the upper part of a toposequence moves downslope into a soil profile at the lower part.",
  "Implicit is the conclusion that more time is required to form soils featuring the more persistent minerals in the clay fraction. This conclusion is borne out by careful field studies worldwide in which the rate of soil horizon formation is determined. Soils whose clay mineralogy falls in the early stage require less than a decade to develop a centimetre (0.4 inch) of horizon thickness. Soils with dominant clay minerals in the intermediate stage do this in less than a century, whereas soils with dominant clay minerals in the advanced stage need several hundred years to form a centimetre of solum.",
  " The two principal systems of soil classification in use today are the soil order system of the U.S. Soil Taxonomy and the soil group system, published as the World Reference Base for Soil Resources , developed by the Food and Agriculture Organization (FAO) of the United Nations . Both of these systems are morphogenetic, in that they use structural properties as the basis of classification while also drawing on the five factors of soil formation described in the previous section in choosing which properties to emphasize.",
  "Central to both systems is the notion of diagnostic horizons, well-defined soil layers whose structure and origin may be correlated to soil-forming processes and can be used to distinguish among soil units at the highest level of classification (see the of primary diagnostic horizons). Diagnostic horizons may be found very near the land surface (epipedons) or deep in the soil profile (subsurface horizons); they need not correspond to the horizon letter designations.",
  "The existence of a diagnostic horizon in a soil profile often is sufficient to indicate its taxonomic class at the level of order (U.S.) or group (FAO). For example, soil profiles with mollic epipedons are in the Mollisol order of the U.S. Soil Taxonomy. Alternatively, mollic A horizons occur distinctively in the FAO soil groups whose properties are conditioned by a steppe environment (that is, Chernozem , Kastanozem , and Phaeozem ). The U.S. and FAO names both denote soils that have formed in plains under grassland vegetation, whose extensive root growth leads to a high content of humus in the A horizon. Often, however, the correspondence between the two taxonomic systems is not as close as in this example, a point quite evident when soil maps of the United States based on the U.S. and FAO taxonomies are compared.",
  "  The U.S. Soil Taxonomy classifies soils within a hierarchy of six categories. Only the highest-level category, order, is discussed here. Soil orders are named by adding the suffix -sol to a root word, as shown in the of the U.S. Soil Taxonomy. The resulting 12 soil order names thus represent a classification based either on parent material or on processes related to the five factors of soil formation as reflected in diagnostic horizons.",
  "  The soil orders associated with specific kinds of parent material ( Andisol , Histosol , and Vertisol ) account for less than 5 percent of Earth’s continental areas covered by soil. Soils that show little development because they are too young ( Entisol ) or lie in an adverse weathering environment ( Inceptisol ) represent nearly 33 percent of the land area. Soils that are likely to exhibit natural toxicity to agricultural plants because of accumulations of salts ( Aridisol ) or of acidity and aluminum ( Spodosol , Oxisol , and Ultisol ) make up almost 40 percent of the total. This leaves essentially only the Alfisols and Mollisols —with about 15 percent of the total land area—as the inherently more fertile soils of the world. They occupy a strategic belt at middle latitudes in the Northern Hemisphere and in South America.",
  " The classification system of the FAO primarily involves a two-level nomenclature comprising the name of a soil group and a modifying adjective that serves to identify a soil unit within a group on the FAO Soil Map of the World. It is not meant to substitute for national soil classification systems such as the U.S. Soil Taxonomy but instead is designed to facilitate comparisons among these systems. Only the major soil groups are discussed here. Four of the soil groups are defined principally by their parent material (first cluster in the of the classification system of the FAO), four are largely related to topographic factors in soil formation, and the remaining 22 groups are based on the three other soil-forming factors: climate, organisms, and time. Like the U.S. soil orders, the soil groups in the FAO system are based on extensive sets of field and laboratory observations and on technical criteria.",
  "Some of the FAO soil groups are quite comparable to soil orders in the U.S. Soil Taxonomy (for example, Andosol , Cambisol , Histosol , and Vertisol ). Others correspond more closely to lower levels of nomenclature than the soil order; for example, Gypsisol , Calcisol , Solonchak , and Solonetz would be classified mostly within the U.S. Aridisol order. Still others have no equivalent within the U.S. taxonomy (for example, Anthrosol ).",
  "  The FAO designates eight soil groups— Cambisol , Chernozem , Fluvisol , Gleysol , Kastanozem , Phaeozem , Umbrisol , and Vertisol —as having a high inherent soil fertility. They constitute 31 percent of the total land area. This figure would drop to 16 percent if the Cambisol and Vertisol groups were excluded, an estimate quite close to that made above for the more fertile U.S. soil orders. The soil groups that according to the FAO present toxicity hazards from salt accumulation ( Calcisol , Gypsisol , Solonchak , and Solonetz ) or aridity and aluminum accumulation ( Acrisol , Alisol , and Ferralsol ) cover about 25 percent of the land area. This figure would increase to about 33 percent if more tropical soil groups and the Podzol and Albeluvisol groups were included. Thus, both systems of soil classification conclude that the inherently more fertile soils are but a small portion of the total soil resources on Earth.",
  "Soil profiles are continually disrupted by the actions of flowing water, wind, or ice and by the force of gravity . These erosive processes remove soil particles from A horizons and expose subsurface horizons to weathering, resulting in the loss of humus, plant nutrients, and beneficial soil organisms. Not only are these losses of paramount importance to agriculture and forestry, but the removal, transport, and subsequent deposition of soil can have significant economic consequences by damaging buildings, bridges, culverts, and other structures.",
  "  Water-induced erosion can take various forms depending on climate and topography. The force of rainfall striking a land surface unimpeded by vegetation or man-made structures is sufficient to raise 15 cm (6 inches) of material from an A horizon nearly 1 metre (39 inches) into the air. The impact of raindrops breaks the bonds holding soil aggregates together and catapults the particles into the flowing water from surface runoff. Wholesale removal of soil particles by the sheet flow of water (sheet erosion) or by flow in small channels (rill erosion) accounts for most of the water-induced soil loss from exposed land surfaces. More spectacular but less prevalent types of erosion are gully erosion, in which water concentrates in channels too deep to smooth over by tilling, and streambank erosion, in which the saturated sides of running streams tumble into the moving water below. The same forces at work in streambank erosion are seen in soils on hillslopes that become thoroughly saturated with water. Gravity, able to overcome the cohesive forces that hold soil particles together, can cause the entire soil profile to move downslope—a phenomenon called mass movement. This movement may be either slow (soil creep), rapid (debris flow or mudflow), or sometimes catastrophic (landslide).",
  " The mechanisms involved in wind erosion depend on soil texture and the size of soil particles. Dry soil particles of silt or clay size can be transported over great distance by wind. Larger particles that are the size of fine sand, 0.05 mm (0.002 inch) to 0.5 mm (0.02 inch) in diameter, can be vaulted as high as 25 cm (10 inches) into the air, then drop to the ground after a short flight, only to rebound under the continual driving force of the wind. Coarser sand particles are not lifted, but they can tumble along the land surface. The major cause of wind erosion is the jumping motion of the smaller soil particles, a process called saltation. The texture of the windblown surfaces of these soils becomes coarser, making them less chemically reactive and less able to retain plant nutrients or trap pollutants. In arid regions, wind erosion often produces a gravelly land surface known as desert pavement.",
  "Soil erosion and deposition are natural geomorphic processes that give shape to landforms and provide new parent material for the development of soil profiles. These processes become soil conservation issues when the rate of erosion greatly exceeds the rate expected in the absence of human land use—a situation referred to as accelerated erosion. Rates of normal soil erosion have been estimated from measurements of sediment transport and accumulation, mass movement on hillslopes, and radioactive carbon dating of landforms. They range from less than 0.02 to more than 10 metric tons per hectare (0.01 to 4.5 tons per acre) of soil lost annually. In comparison the rates of natural soil formation range from 0.2 to 9 metric tons per hectare per year. The average annual rate of normal soil erosion is nearly 1 metric ton per hectare (0.45 ton per acre), while that of natural soil formation is nearly 0.7 metric ton per hectare (0.3 ton per acre). Broad variation is the rule, but rates of soil loss exceeding 10 metric tons per hectare annually signal accelerated erosion. It is important to note that this accelerated soil loss is equivalent to less than 1 mm (0.04 inch) of soil depth, making erosion damage very difficult to observe over short time spans.",
  " When climate and topography are fixed and soil cover is varied, the rate of soil loss by water erosion has a predictable and dramatic dependence on vegetation. Irrespective of location, erosion losses are usually very small from forestland or permanent pastureland, moderate to high from land planted with grain crops, and very high from clean-tilled orchards, vineyards, and land planted with row crops, as shown in the figure .",
  " The ability of soils to resist water and wind erosion depends on their texture and topographic characteristics. Clay-rich soils resist erosion well because of strong cohesive forces between particles and the gluelike characteristics of humus. Both loam and sandy soils are moderately resistant to erosion—the former because they have sufficient clay content to hold the particles together, the latter because their high permeability limits the amount of surface runoff that can wash soil particles away, while their larger particle size makes them too heavy to be easily entrained (transported) in flowing water. Silty soils, on the other hand, exhibit the least resistance to erosion because their permeability is low (resulting in more surface runoff), and their particle size is neither small enough to promote cohesion nor large enough to prevent entrainment. Soils on steep, long slopes are much more susceptible to erosion than those on shallow, short slopes because the steeper slopes accelerate the flow of surface runoff.",
  "The development of soil conservation strategies requires knowledge of actual and acceptable rates of soil erosion. A practical measure of soil resistance to erosion used by pedologists in the United States is the soil loss tolerance (T-value, or T-factor). This quantity is defined as the maximum annual rate of soil loss by erosion that will permit high soil productivity for an indefinite period of time. Operationally, the concept is interpreted as the maximum annual loss from the A horizon that does not reduce the thickness of the rooting zone significantly over millennia.",
  "Guidelines have been developed by the U.S. Natural Resource Conservation Service to assist field estimations of the T-value based on texture, topography, and depth to bedrock or to a root-impeding layer (hardpan) in a soil profile. Deep, coarse-textured soils are assigned a T-value of 11.2 metric tons per hectare (5 tons per acre), fine-textured soils have a T-value of 9 metric tons per hectare (4 tons per acre), and shallow soils or those with an impeding layer are assigned T-values in the range of 2.2–6.7 metric tons per hectare (1–3 tons per acre), depending on texture. Unfavourable slope characteristics are used to modify these values downward as experience may warrant.",
  "An ecosystem is a collection of organisms and the local environment with which they interact. For the soil scientist studying microbiological processes, ecosystem boundaries may enclose a single soil horizon or a soil profile. When nutrient cycling or the effects of management practices on soils are being considered, the ecosystem may be as large as an entire plant community and soil polypedon system.",
  "Soils are dynamic, open habitats that provide plants with physical support, water, nutrients, and air for growth. Soils also sustain an enormous population of microorganisms such as bacteria and fungi that recycle chemical elements, notably carbon and nitrogen, as well as elements that are toxic. The carbon and nitrogen cycles are important natural processes that involve the uptake of nutrients from soil, the return of organic matter to the soil by tissue aging and death, the decomposition of organic matter by soil microbes (during which nutrients or toxins may be cycled within the microbial community), and the release of nutrients into soil for uptake once again. These cycles are closely linked to the hydrologic cycle , since water functions as the primary medium for chemical transport.",
  " Nitrogen (N), one of the major nutrients, originates in the atmosphere. It is transformed and transported through the ecosystem by the water cycle and biological processes. This nutrient enters the biosphere primarily as wet deposition to the soil surface (throughfall), where plants, microbial decomposers, or nitrifiers (microbes that convert ammonium [NH 4  + ] to nitrate [NO 3  − ]) compete for it. This competition plays a major role in determining the extent to which incoming nitrogen will be retained within an ecosystem.",
  " Carbon (C) also enters the ecosystem from the atmosphere—in the form of carbon dioxide (CO 2 )—and is taken up by plants and converted into biomass. Organic matter in the soil in the form of humus and other biomass contains about three times as much carbon as does land vegetation. Soils of arid and semiarid regions also store carbon in inorganic chemical forms, primarily as calcium carbonate (CaCO 3 ). These pools of carbon are important components of the global carbon cycle because of their location near the land surface, where they are subject to erosion and decomposition. Each year, soils release 4–5 percent of their carbon to the atmosphere by the transformation of organic matter into CO 2 gas, a process termed soil respiration. This amount of CO 2 is more than 10 times larger than that currently produced from the burning of fossil fuels (coal and petroleum), but it is returned to the soil as organic matter by the production of biomass.",
  "A large portion of the soil carbon pool is susceptible to loss as a result of human activities. Land-use changes associated with agriculture can disrupt the natural balance between the production of carbon-containing biomass and the release of carbon by soil respiration. One estimate suggests that this imbalance alone results in an annual net release of CO 2 to the atmosphere from agricultural soils equal to about 20 percent of the current annual release of CO 2 from the burning of fossil fuels. Agricultural practices in temperate zones, for example, can result in a decline of soil organic matter that ranges from 20 to 40 percent of the original content after about 50 years of cultivation. Although a portion of this loss can be attributed to soil erosion, the majority is from an increased flux of carbon to the atmosphere as CO 2 . The draining of peatlands may cause similarly large losses in soil carbon storage.",
  "Soils and climate have always been closely related. The predicted temperature increases due to global warming and the consequent change in rainfall patterns are expected to have a substantial impact on both soils and demographics. This anticipated climatic change is thought to be driven by the greenhouse effect —an increase in levels of certain trace gases in the atmosphere such as carbon dioxide (CO 2 ), methane (CH 4 ), and nitrous oxide (N 2 O). The conversion of land to agriculture, especially in the humid tropics, is an important contribution to greenhouse gas emissions. Some computer models predict that CH 4 and N 2 O emissions will also be very important in future global change. About 70 percent of the CH 4 and 90 percent of the N 2 O in the atmosphere are derived from soil processes. But soils can also function as repositories for these gases, and it is important to appreciate the complexity of the source-repository relationship. For example, the application of nitrogen-containing fertilizers reduces the ability of the soil to process CH 4 . Even the amount of nitrogen introduced into soil from acid rain on forests is sufficient to produce this effect. However, the extent of net emissions of CH 4 and N 2 O and the microbial trade-off between the two gases are undetermined at the global scale.",
  "Perhaps the most notable and pervasive role of soils in global warming is the regulation of the CO 2 budget. Carbon that is stored in terrestrial plants mainly through photosynthesis is called net primary production or NPP and is the dominant source of food, fuel, fibre, and feed for the entire population of Earth. Approximately 55 billion metric tons (61 billion tons) of carbon are stored in this way each year worldwide, most of it in forests. About 800 million hectares (20 billion acres) of forestland have been lost since the dawn of civilization; this translates to about 6 billion metric tons of carbon per year less NPP than before land was cleared for agriculture and commerce. This estimated decrease in carbon storage can be compared to the 5–6 billion metric tons of carbon currently released per year by fossil fuel burning. One is left with the sobering conclusion that reforestation of the entire planet to primordial levels would have only a temporary counterbalancing effect on carbon release to the atmosphere from human consumption of natural resources.",
  "Carbon in terrestrial biomass that is not used directly becomes carbon in litter (about 25 billion metric tons of carbon annually) and is eventually incorporated into soil humus. Soil respiration currently releases an average of 68 billion metric tons of this carbon back into the atmosphere. The natural cycling of carbon is directly and indirectly affected by land-use changes through deforestation, reforestation, wood products decomposition, and abandonment of agricultural land. The current estimate of carbon loss from all these changes averages about 1.7 billion metric tons per year worldwide, or about one-third the current loss from fossil fuel burning. This figure could as much as double in the first half of the 21st century if the rate of deforestation is not controlled. Reforestation, on the other hand, could actually reduce the current carbon loss by up to 10 percent without exorbitant demands on management practices.",
  "The presence of substances in soil that are not naturally produced by biological species is of great public concern. Many of these so-called xenobiotic (from Greek xenos , “stranger,” and bios , “life”) chemicals have been found to be carcinogens or may accumulate in the environment with toxic effects on ecosystems (see the of major soil pollutants). Although human exposure to these substances is primarily through inhalation or drinking water, soils play an important role because they affect the mobility and biological impact of these toxins.",
  "The abundance of xenobiotic compounds in soil has been increased dramatically by the accelerated rate of extraction of minerals and fossil fuels and by highly technological industrial processes. Most of the metals were typically found at very low total concentrations in pristine waters—for this reason they often are referred to as trace metals. Rapid increases of trace metal concentrations in the environment are commonly coupled to the development of exploitative technologies. This kind of sudden change exposes the biosphere to a risk of destabilization, since organisms that developed under conditions with low concentrations of a metal present have not developed biochemical pathways capable of detoxifying that metal when it is present at high concentrations. The same line of reasoning applies to the organic toxic compounds.",
  "The mechanisms underlying the toxicity of xenobiotic compounds are not understood completely, but a consensus exists as to the importance of the following processes for the interactions of toxic metals with biological molecules: (1) displacement by a toxic metal of a nutrient mineral (for example, calcium) bound to a biomolecule, (2) complexation of a toxic metal with a biomolecule that effectively blocks the biomolecule from participating in the biochemistry of an organism, and (3) modification of the conformation of a biomolecule that is critical to its biochemical function. All of these mechanisms are related to complex formation between a toxic metal and a biomolecule. They suggest that strong complex-formers are more likely to induce toxicity by interfering with the normal chemistry of biomolecules.",
  "Not all soil pollutants are xenobiotic compounds. Crop production problems in agriculture are encountered when excess salinity (salt accumulation) occurs in soils in arid climates where the rate of evaporation exceeds the rate of precipitation. As the soil dries, ions released by mineral weathering or introduced by saline groundwater tend to accumulate in the form of carbonate, sulfate, chloride, and clay minerals. Because all Na + (sodium) and K + (potassium) and many Ca 2+ (calcium) and Mg 2+ (magnesium) salts of chloride, sulfide, and carbonate are readily soluble, it is this set of metal ions that contributes most to soil salinity. At sufficiently high concentrations, the salts pose a toxicity hazard from Na + , HCO 3  − (bicarbonate) and Cl − (chloride) and interfere with water uptake by plants from soil. Toxicity from B (boron) is also common because of the accumulation of boron-containing minerals in arid soil environments.",
  "The sustained use of a water resource for irrigating agricultural land in an arid region requires that the applied water not damage the soil environment. Irrigation waters are also salt solutions; depending on their particular source and postwithdrawal treatment, the particular salts present in irrigation water may not be compatible with the suite of minerals present in the soils. Crop utilization of water and fertilizers has the effect of concentrating salts in the soil; consequently, without careful management irrigated soils can become saline or develop toxicity. A widespread example of irrigation-induced toxicity hazard is NO 3  − (nitrate) accumulation in groundwater caused by the excess leaching of nitrogen fertilizer through agricultural soil. Human infants receiving high-nitrate groundwater as drinking water can contract methemoglobinemia (“blue baby syndrome”) because of the transformation of NO 3  − to toxic NO 2  − (nitrite) in the digestive tract. Costly groundwater treatment is currently the only remedy possible when this problem arises.",
  "Field observation and laboratory experimentation have confirmed the effectiveness of natural pathways in the soil for detoxifying chemicals. Volatilization, adsorption, precipitation, and other chemical transformations, as well as biological immobilization and degradation, are the first line of defense against invasive pollutants. These processes are particularly active in soil A horizons (usually 1 metre [about 39 inches] deep or less) where the humus is essential to the detoxification mechanisms by blocking the reactivity of toxic chemicals or by microbial degradation.",
  "Soil microorganisms, particularly bacteria, have developed diverse means to use readily available substances as sources of carbon or energy. Microorganisms obtain their energy by transferring electrons biochemically from organic matter (or from certain inorganic compounds) to electron acceptors such as oxygen (O 2 ) and other inorganic compounds. Therefore, they provide a significant pathway for decomposing xenobiotic compounds in soil by using them as raw materials in place of naturally occurring organic matter or electron acceptors, such as O, NO 3  − (nitrate), Mn 4+ (manganese) or Fe 3+ (iron) ions, and sulfate (SO 4  2− ).",
  " Geobacter metallireducens 3+ 2+ 2  For instance, one species of bacteria might use the pollutant toluene , a solvent obtained from petroleum , as a carbon source, and naturally occurring Fe 3+ might serve as a normal electron acceptor. Another species might use natural organic acids as a carbon source and selenium-containing pollutants as electron acceptors. Often, however, the ultimate decomposition of a contaminating xenobiotic compound requires a series of many chemical steps and several different species of microorganism. This is especially true for organic compounds that contain chlorine (Cl), such as chlorinated pesticides, chlorinated solvents, and polychlorinated biphenyls (PCBs; once used as lubricants and plasticizers). For example, the chlorinated herbicide atrazine is gradually degraded by aerobic microorganisms through a variety of pathways involving intermediate products. The complexity of the decomposition processes and the inherent toxicity of the pollutant compounds to the microorganisms themselves can lead to long residence times in soil, ranging from years to decades for toxic metals and chlorinated organic compounds.",
  "Most of the metals that are major soil pollutants (see ) can form strong complexes with soil humus that significantly decrease the solubility of the metal and its movement toward groundwater. Humus can serve as a detoxification pathway by assuming the role taken by biomolecules in the metal toxicity mechanisms discussed above. Just as strong complex formation leads to irreversible metal association with a biomolecule and to the disruption of biochemical functions, so, too, can it lead to effective immobilization of toxic metals by soil humus—in particular, the humic substances. The very property of toxic metals that makes them so hazardous to organisms also makes them detoxifiable by humus in soil.",
  " Pesticides exhibit a wide variety of molecular structures that permit an equally diverse array of mechanisms of binding to humus. The diversity of molecular structures and reactivities results in the production of a variety of aromatic compounds through partial decomposition of the pesticides by microbes. These intermediate compounds become incorporated into the molecular structure of humus by natural mechanisms, effectively reducing the threat of toxicity. The benefits of humus to soil fertility and detoxification have resulted in a growing interest in this remarkable substance and in the fragile A horizon it occupies.",
  "Perhaps the finest book on soils for the layperson is Milo I. Harpstead , Thomas J. Sauer , and William F. Bennett , Soil Science Simplified , 3rd ed. (1997). An in-depth introductory treatment is given by Frederick R. Troeh and Louis M. Thompson , Soils and Soil Fertility , 5th ed. (1993). A holistic account of soils in their ecological setting is presented in Hans Jenny , The Soil Resource (1980, reprinted with corrections, 1983). Technical terms are defined in Glossary of Soil Science Terms (1997), published by the Soil Science Society of America .",
  "An excellent technical discussion of pedology in an ecological context is Stanley W. Buol et al., Soil Genesis and Classification , 4th ed. (1997). Guides to soil classification are Keys to Soil Taxonomy , 8th ed. (1998), published by the U.S. Department of Agriculture ; and Soil Map of the World: Revised Legend (1990, reprinted with corrections, 1994), published by the Food and Agriculture Organization (FAO) and UNESCO .",
  "The modern classic on soil formation is Hans Jenny , Factors of Soil Formation (1941, reissued 1994). See also the commentary volume, Factors of Soil Formation: A Fiftieth Anniversary Retrospective (1994), published by the Soil Science Society of America . The geomorphic processes related to soil formation and erosion are discussed by Cliff Ollier , Weathering (1984). Erosion is considered in more technical detail in Frederick R. Troeh , James Arthur Hobbs , and Roy L. Donahue , Soil and Water Conservation , 3rd ed. (1999). The special problems of soil loss in the humid tropics are brought out in R. Lal and Pedro A. Sánchez (eds.), Myths and Science of Soils of the Tropics (1992); and, on a practical level, in Ted C. Sheng , Soil Conservation for Small Farmers in the Humid Tropics (1989).",
  "Soil pollution issues are given modern treatment in Garrison Sposito , The Chemistry of Soils (1989); Murray B. McBride , Environmental Chemistry of Soils (1994); Eldor A. Paul and Francis E. Clark (eds.) Soil Microbiology and Biochemistry , 2nd ed. (1996); and F.J. Stevenson and M.A. Cole , Cycles of Soil , 2nd ed. (1999). The last four texts also discuss biogeochemical cycling in soils at a technical level."
]