[
  " social structure , in sociology, the distinctive, stable arrangement of institutions whereby human beings in a society interact and live together. Social structure is often treated together with the concept of social change , which deals with the forces that change the social structure and the organization of society.",
  "Although it is generally agreed that the term social structure refers to regularities in social life, its application is inconsistent. For example, the term is sometimes wrongly applied when other concepts such as custom, tradition, role , or norm would be more accurate.",
  "Studies of social structure attempt to explain such matters as integration and trends in inequality. In the study of these phenomena, sociologists analyze organizations, social categories (such as age groups), or rates (such as of crime or birth). This approach, sometimes called formal sociology, does not refer directly to individual behaviour or interpersonal interaction. Therefore, the study of social structure is not considered a behavioral science; at this level, the analysis is too abstract. It is a step removed from the consideration of concrete human behaviour, even though the phenomena studied in social structure result from humans responding to each other and to their environments. Those who study social structure do, however, follow an empirical (observational) approach to research, methodology, and epistemology.",
  "Social structure is sometimes defined simply as patterned social relations—those regular and repetitive aspects of the interactions between the members of a given social entity. Even on this descriptive level, the concept is highly abstract: it selects only certain elements from ongoing social activities. The larger the social entity considered, the more abstract the concept tends to be. For this reason, the social structure of a small group is generally more closely related to the daily activities of its individual members than is the social structure of a larger society. In the study of larger social groups, the problem of selection is acute: much depends on what is included as components of the social structure. Various theories offer different solutions to this problem of determining the primary characteristics of a social group.",
  "Before these different theoretical views can be discussed, however, some remarks must be made on the general aspects of the social structure of any society. Social life is structured along the dimensions of time and space. Specific social activities take place at specific times, and time is divided into periods that are connected with the rhythms of social life—the routines of the day, the month, and the year. Specific social activities are also organized at specific places; particular places, for instance, are designated for such activities as working, worshiping, eating, and sleeping. Territorial boundaries delineate these places and are defined by rules of property that determine the use and possession of scarce goods. Additionally, in any society there is a more or less regular division of labour. Yet another universal structural characteristic of human societies is the regulation of violence. All violence is a potentially disruptive force; at the same time, it is a means of coercion and coordination of activities. Human beings have formed political units, such as nations, within which the use of violence is strictly regulated and which, at the same time, are organized for the use of violence against outside groups.",
  "Furthermore, in any society there are arrangements within the structure for sexual reproduction and the care and education of the young. These arrangements take the form partly of kinship and marriage relations. Finally, systems of symbolic communication, particularly language, structure the interactions between the members of any society.",
  "The term structure has been applied to human societies since the 19th century. Before that time, its use was more common in other fields such as construction or biology.",
  " Karl Marx's Oekonomische Lehren   Karl Marx used construction as a metaphor when he spoke of “the economic structure [ Struktur ] of society, the real basis on which is erected a legal and political superstructure [ Überbau ] and to which definite forms of social consciousness correspond.” Thus, according to Marx, the basic structure of society is economic, or material, and this structure influences the rest of social life, which is defined as nonmaterial, spiritual, or ideological.",
  "The biological connotations of the term structure are evident in the work of British philosopher Herbert Spencer . He and other social theorists of the 19th and early 20th centuries conceived of society as an organism comprising interdependent parts that form a structure similar to the anatomy of a living body. Although social scientists since Spencer and Marx have disagreed on the concept of social structure, their definitions share common elements. In the most general way, social structure is identified by those features of a social entity (a society or a group within a society) that persist over time, are interrelated, and influence both the functioning of the entity as a whole and the activities of its individual members.",
  "The origin of contemporary sociological references to social structure can be traced to Émile Durkheim , who argued that parts of society are interdependent and that this interdependency imposes structure on the behaviour of institutions and their members. In other words, Durkheim believed that individual human behaviour is shaped by external forces. Similarly, American anthropologist George P. Murdock , in his book Social Structure (1949), examined kinship systems in preliterate societies and used social structure as a taxonomic device for classifying, comparing, and correlating various aspects of kinship systems.",
  "Several ideas are implicit in the notion of social structure. First, human beings form social relations that are not arbitrary and coincidental but exhibit some regularity and continuity. Second, social life is not chaotic and formless but is, in fact, differentiated into certain groups, positions, and institutions that are interdependent or functionally interrelated. Third, individual choices are shaped and circumscribed by the social environment, because social groups, although constituted by the social activities of individuals, are not a direct result of the wishes and intentions of the individual members. The notion of social structure implies, in other words, that human beings are not completely free and autonomous in their choices and actions but are instead constrained by the social world they inhabit and the social relations they form with one another.",
  "Within the broad framework of these and other general features of human society, there is an enormous variety of social forms between and within societies. Some social scientists use the concept of social structure as a device for creating an order for the various aspects of social life. In other studies, the concept is of greater theoretical importance; it is regarded as an explanatory concept, a key to the understanding of human social life. Several theories have been developed to account for both the similarities and the varieties. In these theories, certain aspects of social life are regarded as basic and, therefore, central components of the social structure. Some of the more prominent of these theories are reviewed here.",
  " A.R. Radcliffe-Brown , a British social anthropologist, gave the concept of social structure a central place in his approach and connected it to the concept of function. In his view, the components of the social structure have indispensable functions for one another—the continued existence of the one component is dependent on that of the others—and for the society as a whole, which is seen as an integrated, organic entity. His comparative studies of preliterate societies demonstrated that the interdependence of institutions regulated much of social and individual life. Radcliffe-Brown defined social structure empirically as patterned, or “normal,” social relations (those aspects of social activities that conform to accepted social rules or norms). These rules bind society’s members to socially useful activities.",
  "American sociologist Talcott Parsons elaborated on the work of Durkheim and Radcliffe-Brown by using their insights on social structure to formulate a theory that was valid for large and complex societies. For Parsons, social structure was essentially normative—that is, consisting of “institutional patterns of normative culture.” Put differently, social behaviour conforms to norms, values, and rules that direct behaviour in specific situations. These norms vary according to the positions of the individual actors: they define different roles, such as various occupational roles or the traditional roles of husband-father and wife-mother. Moreover, these norms vary among different spheres of life and lead to the creation of social institutions—for example, property and marriage. Norms, roles, and institutions are all components of the social structure on different levels of complexity.",
  "Later sociologists criticized definitions of social structure by scholars such as Spencer and Parsons because they believed the work (1) made improper use of analogy, (2) through its association with functionalism defended the status quo, (3) was notoriously abstract, (4) could not explain conflict and change, and (5) lacked a methodology for empirical confirmation.",
  "Parsons’s work was criticized for several reasons, not least for the comparatively meagre attention he paid to inequalities of power, wealth, and other social rewards. Other social theorists, including functionalists such as the American sociologist Robert K. Merton , gave these “distributional” properties a more central place in their concepts of social structure. For Merton and others, social structure consists not only of normative patterns but also of the inequalities of power, status, and material privileges, which give the members of a society widely different opportunities and alternatives.",
  "In complex societies, these inequalities define different strata, or classes, that form the stratification system, or class structure, of the society. Both aspects of the social structure, the normative and the distributive aspect, are strongly interconnected, as may be inferred from the observation that members of different classes often have different and even conflicting norms and values.",
  "This leads to a consideration contrary to structural functionalism: certain norms in a society may be established not because of any general consensus about their moral value but because they are forced upon the population by those who have both the interest in doing so and the power to carry it out. To take one example, the “norms” of apartheid in South Africa reflected the interests and values of only one section of the population, which had the power to enforce them upon the majority. In theories of class and power, this argument has been generalized: norms, values, and ideas are explained as the result of the inequalities of power between groups with conflicting interests.",
  "The most influential theory of this type has been Marxism, or historical materialism. The Marxian view is succinctly summarized in Marx’s phrase “The ideas of the ruling class are, in every age, the ruling ideas.” These ideas are regarded as reflections of class interests and are connected to the power structure, which is identified with the class structure. This Marxian model, which was claimed to be particularly valid for capitalist societies, has met with much criticism. One basic problem is its distinction between economic structure and spiritual superstructure, which are identified with social being and consciousness, respectively. This suggests that economic activities and relations are in themselves somehow independent of consciousness, as if they occur independently of human beings.",
  "Nevertheless, the Marxian model became influential even among non-Marxist social scientists. The distinction between material structure and nonmaterial superstructure continues to be reflected in sociological textbooks as the distinction between social structure and culture. Social structure here refers to the ways people are interrelated or interdependent; culture refers to the ideas, knowledge, norms, customs, and capacities that they have learned and share as members of a society.",
  "  Another important theoretical approach to the concept of social structure is structuralism (sometimes called French structuralism), which studies the underlying, unconscious regularities of human expression—that is, the unobservable structures that have observable effects on behaviour, society, and culture. French anthropologist Claude Lévi-Strauss derived this theory from structural linguistics, developed by the Swiss linguist Ferdinand de Saussure . According to Saussure, any language is structured in the sense that its elements are interrelated in nonarbitrary, regular, rule-bound ways; a competent speaker of the language largely follows these rules without being aware of doing so. The task of the theorist is to detect this underlying structure, including the rules of transformation that connect the structure to the various observed expressions.",
  "According to Lévi-Strauss, this same method can be applied to social and cultural life in general. He constructed theories concerning the underlying structure of kinship systems, myths, and customs of cooking and eating. The structural method, in short, purports to detect the common structure of widely different social and cultural forms. This structure does not determine concrete expressions, however; the variety of expressions it generates is potentially unlimited. Moreover, the structures that generate the varieties of social and cultural forms ultimately reflect, according to Lévi-Strauss, basic characteristics of the human mind.",
  "  Structures such as the human mind, grammar, and language are sometimes called “deep structures” or “substructures.” Since such structures are not readily observable, they must be discerned from intensive interpretive analysis of myths, language, or texts. Then they can be applied to explain the customs or traits of social institutions. The French philosopher Michel Foucault , for example, used this approach in his study of corporal punishment. His research led him to conclude that the abolition of corporal punishment by liberal states was an illusion, because the state substituted punishment of the “soul” by monitoring and controlling both the behaviour of prisoners and the behaviour of everyone in the society.",
  "Structuralism became an intellectual fashion in the 1960s in France, where writers as different as Roland Barthes , Foucault, and Louis Althusser were regarded as representatives of the new theoretical current. In this broad sense, however, structuralism is not one coherent theoretical perspective. The Marxist structuralism of Althusser, for example, is far removed from the anthropological structuralism of Lévi-Strauss. The structural method, when applied by different scholars, appears to lead to different results.",
  "The onslaught of criticism launched against structural functionalism, class theories, and structuralism indicates the problematic nature of the concept of social structure. Yet the notion of social structure is not easy to dispense with, because it expresses ideas of continuity, regularity, and interrelatedness in social life. Other terms are often used that have similar, but not identical, meanings, including social network , social figuration , and social system . Starting with his work in general sociological theory in the mid-1970s, British sociologist Anthony Giddens suggested the term structuration to express the view that social life is, to a certain extent, both dynamic and ordered.",
  "The critical difference between social structure theory and structuralism is one of approach. Analysis of social structure uses standard empirical (observational) methods to arrive at generalizations about society, while structuralism uses subjective, interpretive, phenomenological, and qualitative analysis. Most sociologists prefer the social structure approach and regard structuralism as philosophical—that is, more compatible with the humanities than with the social sciences. Still, a significant number of sociologists insist that structuralism occupies a legitimate place in their discipline.",
  "Those pursuing research in the area of social structure have pursued limited but practical goals. They have focused on the development of theories, laws, generalizations, calculi, and methods that account for structural regularities in society. They have not, however, been concerned with demonstrating the limitless structural regularities in society (such as linguistic routines, the permanence of national boundaries, the stability of religious practices, or the durability of gender or racial inequality).",
  "In concrete terms, the task of structural analysis is not so much to account for poverty, for example, as it is to account for the rates of poverty. Likewise, the analysis focuses on empirical data such as the distribution of cities in the world, the patterns of land use, the shifts in educational achievement, changes in occupational structure, the manifestation of revolutions, the increase in collaboration between institutions, the existence of networks among groups, the routines of different types of organizations, the cycles of growth or decline in organizations and institutions, or the unintended collective consequences of individual choices.",
  "Only a few sociologists have developed structural theories that apply to institutions and whole societies—an approach known as macrosociology. Gerhard Lenski in Power and Privilege (1966) classified societies on the basis of their main tools of subsistence and, unlike Marx, demonstrated statistically that variations in the primary tools used in a given society systematically accounted for different types of social stratification systems.",
  "An entire specialty in sociology has been built on a structural theory developed by Amos Hawley in Human Ecology (1986). For Hawley, the explanatory variables are the makeup of the population, the external environment, the complex of organizations, and technology. Research has revealed that these variables account for differences in the spatial characteristics, rhythm of activities, mobility patterns, and external relations between communities in various parts of the world. Applying this framework to the world ecosystem, Hawley focused on the problem of its expansion and growth. Unlike Marxist world systems theory, which emphasizes political factors, Hawley’s work emphasized technology as the critical factor. He argued that the growth and spread of technology leads to population growth, burdens the land, and prompts changes in the organization of institutions. At worst, according to Hawley, the long-term costs of expansion would lead to polarization and inequality, urban decay, environmental destruction, and political instability, which over time must result in a reordering of the ecosystem.",
  "In Structural Contexts of Opportunities (1994), Peter M. Blau developed a formal macrosociological theory concerning the influences of large population structures on social life. He identified how different population groups relate to each other. He found that occupational heterogeneity increases the chance for contact between people in different status groups. For populations with multiple-group affiliations, in-group associations tend to promote intergroup relations.",
  "These are some examples of ways in which logically drawn abstract generalizations provide insights about society. Such findings are approached through macrosociological or structural theory and are not readily available through the study of individuals or isolated groups.",
  "Social structure and social change are general concepts used by social scientists, particularly in the fields of sociology and social and cultural anthropology. They are often conceived of as polarized concepts, with social structure referring to basic characteristics of social life—those demonstrating a lasting and permanent quality—and social change reflecting the opposite. However, the relationship between the two concepts is more complicated. Social structure, for example, cannot be conceptualized adequately without some recognition of actual or potential change, just as social change, as a more or less regular process, is structured over time and is inconceivable without the notion of continuity. Both concepts, in the end, can contribute to a fuller understanding of society, its patterns, and patterns of change.",
  "A general survey of social structure is Peter M. Blau (ed.), Approaches to the Study of Social Structure (1975); while a more sophisticated theoretical treatment of social structure is Peter M. Blau , Structural Contexts of Opportunities (1994). Structural studies in human ecology include Amos H. Hawley , Human Ecology: A Theoretical Essay (1986); Otis Dudley Duncan , “Social Organization and the Ecosystem,” in Robert E.L. Faris (ed.), Handbook of Modern Sociology (1964, reissued 1968); and Richard Newbold Adams , Energy and Structure: A Theory of Social Power (1975). Michael T. Hannan and John Freeman , Organizational Ecology (1989, reissued 1993), applies a structural ecology perspective to organizational growth.",
  "The most important theoretical works in structural functionalism are A.R. Radcliffe-Brown , Structure and Function in Primitive Society (1952, reissued 1968); and Talcott Parsons , The Social System , new ed. (1991). For coverage of the debate on structural functionalism, see N.J. Demerath and Richard A. Peterson (eds.), System, Change, and Conflict (1967). A more empirical type of functionalism is represented by Robert K. Merton , Social Theory and Social Structure , enlarged ed. (1968), in which due consideration is given the distributive aspects of the social structure. These are stressed even more by Peter M. Blau , Inequality and Heterogeneity: A Primitive Theory of Social Structure (1977).",
  " Ralf Dahrendorf , Class and Conflict in Industrial Society (1959; originally published in German, 1957), advances a power-and-conflict model of society. Other, more sophisticated power models are contained in Peter M. Blau , Exchange and Power in Social Life (1964, reprinted 1986); Steven Lukes , Power: A Radical View (1974, reissued 1993); and Norbert Elias , What Is Sociology? (1978; originally published in German, 1970).",
  " David Robey (ed.), Structuralism (1973), offers an introduction to the subject. Claude Lévi-Strauss , Structural Anthropology , 2 vol. (1963–76, reprinted 1993–94; originally published in French, 1958–73), contains several articles on the structural method and its applications. A brief treatment of French structuralism and poststructuralism is Anthony Giddens , Social Theory and Modern Sociology (1987). Works on the role of language include Jean Piaget , Structuralism (1970, reissued 1973; originally published in French, 1966); Jürgen Habermas , The Theory of Communicative Action , 2 vol. (1984–87, reissued 1989; originally published in German, 1981); and Roger Penrose , The Emperor’s New Mind (1989, reissued 1999).",
  "Examples of different empirical applications of the concept of social structure are George Peter Murdock , Social Structure (1949, reissued 1967); Peter M. Blau and Otis Dudley Duncan , The American Occupational Structure (1967, reprinted 1978); and Peter V. Marsden and Nan Lin (eds.), Social Structure and Network Analysis (1982). A synthesis of different views is offered by Anthony Giddens , Central Problems in Social Theory: Action, Structure, and Contradiction in Social Analysis (1979, reprinted 1990).",
  "An influential criticism of deterministic theories of social development is Karl R. Popper , The Poverty of Historicism , 2nd ed. (1960, reprinted 1972). Examples of pessimistic social forecasting with much attention to ecological conditions are Donella H. Meadows et al., The Limits to Growth , 2nd ed. (1974); and Mihajlo Mesarovic and Eduard Pestel , Mankind at the Turning Point (1974, reissued 1976). Much more optimistic examples are Herman Kahn and Anthony J. Wiener , The Year 2000 (1967); Daniel Bell , The Coming of Post-Industrial Society: A Venture in Social Forecasting (1973, reissued as special anniversary ed., 1999); and Clark Kerr , The Future of Industrial Societies: Convergence or Continuing Diversity? (1983). A history of ideas about future social developments is given in Krishan Kumar , Prophecy and Progress: The Sociology of Industrial and Post-Industrial Society (1978, reprinted 1986)."
]