[
  " sound , a mechanical disturbance from a state of equilibrium that propagates through an elastic material medium. A purely subjective definition of sound is also possible, as that which is perceived by the ear, but such a definition is not particularly illuminating and is unduly restrictive, for it is useful to speak of sounds that cannot be heard by the human ear, such as those that are produced by dog whistles or by sonar equipment.",
  "The study of sound should begin with the properties of sound waves. There are two basic types of wave, transverse and longitudinal, differentiated by the way in which the wave is propagated. In a transverse wave, such as the wave generated in a stretched rope when one end is wiggled back and forth, the motion that constitutes the wave is perpendicular, or transverse, to the direction (along the rope) in which the wave is moving. An important family of transverse waves is generated by electromagnetic sources such as light or radio, in which the electric and magnetic fields constituting the wave oscillate perpendicular to the direction of propagation.",
  "  Sound propagates through air or other mediums as a longitudinal wave, in which the mechanical vibration constituting the wave occurs along the direction of propagation of the wave. A longitudinal wave can be created in a coiled spring by squeezing several of the turns together to form a compression and then releasing them, allowing the compression to travel the length of the spring. Air can be viewed as being composed of layers analogous to such coils, with a sound wave propagating as layers of air “push” and “pull” at one another much like the compression moving down the spring.",
  " Graphic representations of a sound wave. A sound wave thus consists of alternating compressions and rarefactions, or regions of high pressure and low pressure, moving at a certain speed. Put another way, it consists of a periodic (that is, oscillating or vibrating) variation of pressure occurring around the equilibrium pressure prevailing at a particular time and place. Equilibrium pressure and the sinusoidal variations caused by passage of a pure sound wave (that is, a wave of a single frequency) are represented in Figure 1A and 1B , respectively.",
  "A discussion of sound waves and their propagation can begin with an examination of a plane wave of a single frequency passing through the air. A plane wave is a wave that propagates through space as a plane, rather than as a sphere of increasing radius. As such, it is not perfectly representative of sound (see below Circular and spherical waves ). A wave of single frequency would be heard as a pure sound such as that generated by a tuning fork that has been lightly struck. As a theoretical model, it helps to elucidate many of the properties of a sound wave.",
  " Figure 1C is another representation of the sound wave illustrated in Figure 1B . As represented by the sinusoidal curve, the pressure variation in a sound wave repeats itself in space over a specific distance. This distance is known as the wavelength of the sound, usually measured in metres and represented by λ. As the wave propagates through the air, one full wavelength takes a certain time period to pass a specific point in space; this period, represented by T , is usually measured in fractions of a second. In addition, during each one-second time interval, a certain number of wavelengths pass a point in space. Known as the frequency of the sound wave, the number of wavelengths passing per second is traditionally measured in hertz or kilohertz and is represented by f .",
  "  There is an inverse relation between a wave’s frequency and its period, such that   ",
  " This means that sound waves with high frequencies have short periods, while those with low frequencies have long periods. For example, a sound wave with a frequency of 20 hertz would have a period of 0.05 second ( i.e., 20 wavelengths/second × 0.05 second/wavelength = 1), while a sound wave of 20 kilohertz would have a period of 0.00005 second (20,000 wavelengths/second × 0.00005 second/wavelength = 1). Between 20 hertz and 20 kilohertz lies the frequency range of hearing for humans. The physical property of frequency is perceived physiologically as pitch, so that the higher the frequency, the higher the perceived pitch. There is also a relation between the wavelength of a sound wave, its frequency or period, and the speed of the wave ( S ), such that   ",
  "The equilibrium value of pressure, represented by the evenly spaced lines in Figure 1A and by the axis of the graph in Figure 1C , is equal to the atmospheric pressure that would prevail in the absence of the sound wave. With passage of the compressions and rarefactions that constitute the sound wave, there would occur a fluctuation above and below atmospheric pressure. The magnitude of this fluctuation from equilibrium is known as the amplitude of the sound wave; measured in pascals, or newtons per square metre, it is represented by the letter A . The displacement or disturbance of a plane sound wave can be described mathematically by the general equation for wave motion, which is written in simplified form as:   ",
  "This equation describes a sinusoidal wave that repeats itself after a distance λ moving to the right (+ x ) with a velocity given by equation (2).",
  "The amplitude of a sound wave determines its intensity, which in turn is perceived by the ear as loudness. Acoustic intensity is defined as the average rate of energy transmission per unit area perpendicular to the direction of propagation of the wave. Its relation with amplitude can be written as   where ρ is the equilibrium density of the air (measured in kilograms per cubic metre) and S is the speed of sound (in metres per second). Intensity ( I ) is measured in watts per square metre, the watt being the standard unit of power in electrical or mechanical usage.",
  "The value of atmospheric pressure under “standard atmospheric conditions” is generally given as about 10 5 pascals, or 10 5 newtons per square metre. The minimum amplitude of pressure variation that can be sensed by the human ear is about 10 -5 pascal, and the pressure amplitude at the threshold of pain is about 10 pascals, so the pressure variation in sound waves is very small compared with the pressure of the atmosphere. Under these conditions a sound wave propagates in a linear manner—that is, it continues to propagate through the air with very little loss, dispersion, or change of shape. However, when the amplitude of the wave reaches about 100 pascals (approximately one one-thousandth the pressure of the atmosphere), significant nonlinearities develop in the propagation of the wave.",
  "Nonlinearity arises from the peculiar effects on air pressure caused by a sinusoidal displacement of air molecules. When the vibratory motion constituting a wave is small, the increase and decrease in pressure are also small and are very nearly equal. But when the motion of the wave is large, each compression generates an excess pressure of greater amplitude than the decrease in pressure caused by each rarefaction. This can be predicted by the ideal gas law, which states that increasing the volume of a gas by one-half decreases its pressure by only one-third, while decreasing its volume by one-half increases the pressure by a factor of two. The result is a net excess in pressure—a phenomenon that is significant only for waves with amplitudes above about 100 pascals.",
  "The ear mechanism is able to respond to both very small and very large pressure waves by virtue of being nonlinear; that is, it responds much more efficiently to sounds of very small amplitude than to sounds of very large amplitude. Because of the enormous nonlinearity of the ear in sensing pressure waves, a nonlinear scale is convenient in describing the intensity of sound waves. Such a scale is provided by the sound intensity level, or decibel level, of a sound wave, which is defined by the equation   ",
  "Here L represents decibels, which correspond to an arbitrary sound wave of intensity I , measured in watts per square metre. The reference intensity I  0 , corresponding to a level of 0 decibels, is approximately the intensity of a wave of 1,000 hertz frequency at the threshold of hearing—about 10 -12 watt per square metre. Because the decibel scale mirrors the function of the ear more accurately than a linear scale, it has several advantages in practical use; these are discussed in Hearing , below.",
  "A fundamental feature of this type of logarithmic scale is that each unit of increase in the decibel scale corresponds to an increase in absolute intensity by a constant multiplicative factor. Thus, an increase in absolute intensity from 10 -12 to 10 -11 watt per square metre corresponds to an increase of 10 decibels, as does an increase from 10 -1 to 1 watt per square metre. The correlation between the absolute intensity of a sound wave and its decibel level is shown in, along with examples of sounds at each level. When the defining level of 0 decibel (10 -12 watt per square metre) is taken to be at the threshold of hearing for a sound wave with a frequency of 1,000 hertz, then 130 decibels (10 watts per square metre) corresponds to the threshold of feeling, or the threshold of pain. (Sometimes the threshold of pain is given as 120 decibels, or 1 watt per square metre.)",
  "Although the decibel scale is nonlinear, it is directly measurable, and sound-level meters are available for that purpose. Sound levels for audio systems, architectural acoustics, and other industrial applications are most often quoted in decibels.",
  "For longitudinal waves such as sound, wave velocity is in general given as the square root of the ratio of the elastic modulus of the medium (that is, the ability of the medium to be compressed by an external force) to its density:   ",
  "Here ρ is the density and B the bulk modulus (the ratio of the applied pressure to the change in volume per unit volume of the medium). In gas mediums this equation is modified to   where K is the compressibility of the gas. Compressibility ( K ) is the reciprocal of the bulk modulus ( B ), as in   ",
  "Using the appropriate gas laws, wave velocity can be calculated in two ways, in relation to pressure or in relation to temperature:   or   ",
  "Here p is the equilibrium pressure of the gas in pascals, ρ is its equilibrium density in kilograms per cubic metre at pressure p, θ is absolute temperature in kelvins, R is the gas constant per mole, M is the molecular weight of the gas, and γ is the ratio of the specific heat at a constant pressure to the specific heat at a constant volume,   ",
  "Values for γ for various gases are given in many physics textbooks and reference works. The speed of sound in several different gases, including air, is given in .",
  " Equation (10 ) states that the speed of sound depends only on absolute temperature and not on pressure, since, if the gas behaves as an ideal gas, then its pressure and density, as shown in equation (9 ), will be proportional. This means that the speed of sound does not change between locations at sea level and high in the mountains and that the pitch of wind instruments at the same temperature is the same anywhere. In addition, both equations (9 ) and ( 10 ) are independent of frequency, indicating that the speed of sound is in fact the same at all frequencies—that is, there is no dispersion of a sound wave as it propagates through air. One assumption here is that the gas behaves as an ideal gas. However, gases at very high pressures no longer behave like an ideal gas, and this results in some absorption and dispersion. In such cases equations (9 ) and ( 10 ) must be modified, as they are in advanced books on the subject.",
  "For a liquid medium, the appropriate modulus is the bulk modulus, so that the speed of sound is equal to the square root of the ratio of the bulk modulus ( B ) to the equilibrium density ( ρ ), as shown in equation (6 ) above. The speed of sound in liquids under various conditions is given in . The speed of sound in liquids varies slightly with temperature—a variation that is accounted for by empirical corrections to equation (6 ), as is indicated in the values given for water in .",
  "For a long, thin solid the appropriate modulus is the Young’s, or stretching, modulus (the ratio of the applied stretching force per unit area of the solid to the resulting change in length per unit length; named for the English physicist and physician Thomas Young). The speed of sound, therefore, is   where Y is the Young’s modulus and ρ is the density. gives the speed of sound in representative solids.",
  "In the case of a three-dimensional solid, in which the wave is traveling outward in spherical waves, the above expression becomes more complicated. Both the shear modulus, represented by η , and the bulk modulus B play a role in the elasticity of the medium:   ",
  " Huygens’ wavelets. The above discussion of the propagation of sound waves begins with a simplifying assumption that the wave exists as a plane wave. In most real cases, however, a wave originating at some source does not move in a straight line but expands in a series of spherical wavefronts. The fundamental mechanism for this propagation is known as Huygens’ principle, according to which every point on a wave is a source of spherical waves in its own right. The result is a Huygens’ wavelet construction, illustrated in Figure 2A and 2B for a two-dimensional plane wave and circular wave. The insightful point suggested by the Dutch physicist Christiaan Huygens is that all the wavelets of Figure 2A and 2B , including those not shown but originating between those that are shown, form a new coherent wave that moves along at the speed of sound to form the next wave in the sequence. In addition, just as the wavelets add up in the forward direction to create a new wavefront, they also cancel one another, or interfere destructively, in the backward direction, so that the waves continue to propagate only in the forward direction.",
  "The principle behind the adding up of Huygens’ wavelets, involving a fundamental difference between matter and waves, is known as the principle of superposition. The old saying that no two things can occupy the same space at the same time is correct when applied to matter, but it does not apply to waves. Indeed, an infinite number of waves can occupy the same space at the same time; furthermore, they do this without affecting one another, so that each wave retains its own character independent of how many other waves are present at the same point and time. A radio or television antenna can receive the signal of any single frequency to which it is tuned, unaffected by the existence of any others. Likewise, the sound waves of two people talking may cross each other, but the sound of each voice is unaffected by the waves’ having been simultaneously at the same point.",
  "Superposition plays a key role in many of the wave properties of sound discussed in this section. It is also fundamental to the addition of Fourier components of a wave in order to obtain a complex wave shape (see below Steady-state waves ).",
  "A plane wave of a single frequency in theory will propagate forever with no change or loss. This is not the case with a circular or spherical wave, however. One of the most important properties of this type of wave is a decrease in intensity as the wave propagates. The mathematical explanation of this principle, which derives as much from geometry as from physics, is known as the inverse square law.",
  "As a circular wave front (such as that created by dropping a stone onto a water surface) expands, its energy is distributed over an increasingly larger circumference. The intensity, or energy per unit of length along the circumference of the circle, will therefore decrease in an inverse relationship with the growing radius of the circle, or distance from the source of the wave. In the same way, as a spherical wave front expands, its energy is distributed over a larger and larger surface area. Because the surface area of a sphere is proportional to the square of its radius, the intensity of the wave is inversely proportional to the square of the radius. This geometric relation between the growing radius of a wave and its decreasing intensity is what gives rise to the inverse square law.",
  "The decrease in intensity of a spherical wave as it propagates outward can also be expressed in decibels. Each factor of two in distance from the source leads to a decrease in intensity by a factor of four. For example, a factor of four decrease in a wave’s intensity is equivalent to a decrease of six decibels, so that a spherical wave attenuates at a rate of six decibels for each factor of two increase in distance from the source. If a wave is propagating as a hemispherical wave above an absorbing surface, the intensity will be further reduced by a factor of two near the surface because of the lack of contributions of Huygens’ wavelets from the missing hemisphere. Thus, the intensity of a wave propagating along a level, perfectly absorbent floor falls off at the rate of 12 decibels for each factor of two in distance from the source. This additional attenuation leads to the necessity of sloping the seats of an auditorium in order to retain a good sound level in the rear.",
  "In addition to the geometric decrease in intensity caused by the inverse square law, a small part of a sound wave is lost to the air or other medium through various physical processes. One important process is the direct conduction of the vibration into the medium as heat, caused by the conversion of the coherent molecular motion of the sound wave into incoherent molecular motion in the air or other absorptive material. Another cause is the viscosity of a fluid medium ( i.e., a gas or liquid). These two physical causes combine to produce the classical attenuation of a sound wave. This type of attenuation is proportional to the square of the sound wave’s frequency, as expressed in the formula α / f  2 , where α is the attenuation coefficient of the medium and f is the wave frequency. The amplitude of an attenuated wave is then given by   where A   o  is the original amplitude of the wave and A ( x ) is the amplitude after it has propagated a distance x through the medium.",
  "gives sound-absorption coefficients for several gases. The magnitudes of the coefficients indicate that, although attenuation is rather small for audible frequencies, it can become extremely large for high-frequency ultrasonic waves. Attenuation of sound in air also varies with temperature and humidity.",
  "Because less sound is absorbed in solids and liquids than in gases, sounds can propagate over much greater distances in these mediums. For instance, the great range over which certain sea mammals can communicate is made possible partially by the low attenuation of sound in water. In addition, because absorption increases with frequency, it becomes very difficult for ultrasonic waves to penetrate a dense medium. This is a persistent limitation on the development of high-frequency ultrasonic applications.",
  "Most sound-absorbing materials are nonlinear, in that they do not absorb the same fraction of acoustic waves of all frequencies. In architectural acoustics, an enormous effort is expended to use construction materials that absorb undesirable frequencies but reflect desired frequencies. Absorption of undesirable sound, such as that from machines in factories, is critical to the health of workers, and noise control in architectural and industrial acoustics has expanded to become an important field of environmental engineering.",
  "A direct result of Huygens’ wavelets is the property of diffraction, the capacity of sound waves to bend around corners and to spread out after passing through a small hole or slit. If a barrier is placed in the path of half of a plane wave, as shown in Figure 2C , the part of the wave passing just by the barrier will propagate in a series of Huygens’ wavelets, causing the wave to spread into the shadow region behind the barrier. In light waves, wavelengths are very small compared with the size of everyday objects, so that very little diffraction occurs and a relatively clear shadow can be formed. The wavelengths of sound waves, on the other hand, are more nearly equal to the size of everyday objects, so that they readily diffract.",
  "Diffraction of sound is helpful in the case of audio systems, in which sound emanating from loudspeakers spreads out and reflects off of walls to fill a room. It is also the reason why “sound beams” cannot generally be produced like light beams. On the other hand, the ability of a sound wave to diffract decreases as frequency rises and wavelength shrinks. This means that the lower frequencies of a voice bend around a corner more readily than the higher frequencies, giving the diffracted voice a “muffled” sound. Also, because the wavelengths of ultrasonic waves become extremely small at high frequencies, it is possible to create a beam of ultrasound. Ultrasonic beams have become very useful in modern medicine.",
  "The scattering of a sound wave is a reflection of some part of the wave off of an obstacle around which the rest of the wave propagates and diffracts. The way in which the scattering occurs depends upon the relative size of the obstacle and the wavelength of the scattering wave. If the wavelength is large in relation to the obstacle, then the wave will pass by the obstacle virtually unaffected. In this case, the only part of the wave to be scattered will be the tiny part that strikes the obstacle; the rest of the wave, owing to its large wavelength, will diffract around the obstacle in a series of Huygens’ wavelets and remain unaffected. If the wavelength is small in relation to the obstacle, the wave will not diffract strongly, and a shadow will be formed similar to the optical shadow produced by a small light source. In extreme cases, arising primarily with high-frequency ultrasound, the formalism of ray optics often used in lenses and mirrors can be conveniently employed.",
  "If the size of the obstacle is the same order of magnitude as the wavelength, diffraction may occur, and this may result in interference among the diffracted waves. This would create regions of greater and lesser sound intensity, called acoustic shadows, after the wave has propagated past the obstacle. Control of such acoustic shadows becomes important in the acoustics of auditoriums.",
  "Diffraction involves the bending or spreading out of a sound wave in a single medium, in which the speed of sound is constant. Another important case in which sound waves bend or spread out is called refraction. This phenomenon involves the bending of a sound wave owing to changes in the wave’s speed. Refraction is the reason why ocean waves approach a shore parallel to the beach and why glass lenses can be used to focus light waves. An important refraction of sound is caused by the natural temperature gradient of the atmosphere. Under normal conditions the Sun heats the Earth and the Earth heats the adjacent air. The heated air then cools as it rises, creating a gradient in which atmospheric temperature decreases with elevation by an amount known as the adiabatic lapse rate. Because sound waves propagate faster in warm air, they travel faster closer to the Earth. This greater speed of sound in warmed air near the ground creates Huygens’ wavelets that also spread faster near the ground. Because a sound wave propagates in a direction perpendicular to the wave front formed by all the Huygens’ wavelets, sound under these conditions tends to refract upward and become “lost.” The sound of thunder created by lightning may be refracted upward so strongly that a shadow region is created in which the lightning can be seen but the thunder cannot be heard. This typically occurs at a horizontal distance of about 22.5 kilometres (14 miles) from a lightning bolt about 4 kilometres high.",
  "At night or during periods of dense cloud cover, a temperature inversion occurs; the temperature of the air increases with elevation, and sound waves are refracted back down to the ground. Temperature inversion is the reason why sounds can be heard much more clearly over longer distances at night than during the day—an effect often incorrectly attributed to the psychological result of nighttime quiet. The effect is enhanced if the sound is propagated over water, allowing sound to be heard remarkably clearly over great distances.",
  "Refraction is also observable on windy days. Wind, moving faster at greater heights, causes a change in the effective speed of sound with distance above ground. When one speaks with the wind, the sound wave is refracted back down to the ground, and one’s voice is able to “carry” farther than on a still day. When one speaks into the wind, however, the sound wave is refracted upward, away from the ground, and the voice is “lost.”",
  "Another example of sound refraction occurs in the ocean. Under normal circumstances the temperature of the ocean decreases with depth, resulting in the downward refraction of a sound wave originating under water—just the opposite of the shadow effect in air described above. Many marine biologists believe that this refraction enhances the propagation of the sounds of marine mammals such as dolphins and whales, allowing them to communicate with one another over enormous distances. For ships such as submarines located near the surface of the water, this refraction creates shadow regions, limiting their ability to locate distant vessels.",
  "A property of waves and sound quite familiar in the phenomenon of echoes is reflection. This plays a critical role in room and auditorium acoustics, in large part determining the adequacy of a concert hall for musical performance or other functions. In the case of light waves passing from air through a glass plate, close inspection shows that some of the light is reflected at each of the air-glass interfaces while the rest passes through the glass. This same phenomenon occurs whenever a sound wave passes from one medium into another—that is, whenever the speed of sound changes or the way in which the sound propagates is substantially modified.",
  "The direction of propagation of a wave is perpendicular to the front formed by all the Huygens’ wavelets. As a plane wave reflects off some reflector, the reflector directs the wave fronts formed by the Huygens’ wavelets just as a light reflector directs light “rays.” The same law of reflection is followed for both sound and light, so that focusing a sound wave is equivalent to focusing a light ray.",
  "Reflectors of appropriate shape are used for a variety of purposes or effects. For example, a parabolic reflector will focus a parallel wave of sound onto a specific point, allowing a very weak sound to be more easily heard. Such reflectors are used in parabolic microphones to collect sound from a distant source or to choose a location from which sound is to be observed and then focus it onto a microphone. An elliptical shape, on the other hand, can be used to focus sound from one point onto another—an arrangement called a whispering chamber. Domes in cathedrals and capitols closely approximate the shape of an ellipse, so that such buildings often possess focal points and function as a type of whispering chamber. Concert halls must avoid the smooth, curved shape of ellipses and parabolas, because strong echoes or focusing of sound from one point to another are undesirable in an auditorium.",
  "One of the important physical characteristics relating to the propagation of sound is the acoustic impedance of the medium in which the sound wave travels. Acoustic impedance (Z) is given by the ratio of the wave’s acoustic pressure (p) to its volume velocity (U):   ",
  "Like its analogue, electrical impedance (or electrical resistance), acoustic impedance is a measure of the ease with which a sound wave propagates through a particular medium. Also like electrical impedance, acoustic impedance involves several different effects applying to different situations. For example, specific acoustic impedance ( z ), the ratio of acoustic pressure to particle speed, is an inherent property of the medium and of the nature of the wave. Acoustic impedance, the ratio of pressure to volume velocity, is equal to the specific acoustic impedance per unit area. Specific acoustic impedance is useful in discussing waves in confined mediums, such as tubes and horns. For the simplest case of a plane wave, specific acoustic impedance is the product of the equilibrium density ( ρ ) of the medium and the wave speed ( S ):   ",
  "The unit of specific acoustic impedance is the pascal second per metre, often called the rayl, after Lord Rayleigh. The unit of acoustic impedance is the pascal second per cubic metre, called an acoustic ohm, by analogy to electrical impedance.",
  "Mediums in which the speed of sound is different generally have differing acoustic impedances, so that, when a sound wave strikes an interface between the two, it encounters an impedance mismatch. As a result, some of the wave reflects while some is transmitted into the second medium. In the case of the well-known bell-in-vacuum experiment, the impedance mismatches between the bell and the air and between the air and the jar result in very little transmission of sound when the air is at low pressure.",
  "The efficiency with which a sound source radiates sound is enhanced by reducing the impedance mismatch between the source and the outside air. For example, if a tuning fork is struck and held in the air, it will be nearly inaudible because of the inability of the vibrations of the tuning fork to radiate efficiently to the air. Touching the tuning fork to a wooden plate such as a tabletop will enhance the sound by providing better coupling between the vibrating tuning fork and the air. This principle is used in the violin and the piano, in which the vibrations of the strings are transferred first to the back and belly of the violin or to the piano’s sounding board, and then to the air.",
  " Acoustic filters typically used in air-handling systems. Filtration of sound plays an important part in the design of air-handling systems. In order to attenuate the level of sound from blower motors and other sources of vibration, regions of larger or smaller cross-sectional area are inserted into air ducts, as illustrated in Figure 3 . The impedance mismatch introduced into a duct by a change in the area of the duct or by the addition of a side branch reflects undesirable frequencies, as determined by the size and shape of the variation. A region of either larger or smaller area will function as a low-pass filter, reflecting high frequencies; an opening or series of openings will function as a high-pass filter, removing low frequencies. Some automobile mufflers make use of this type of filter.",
  "A connected spherical cavity, forming what is called a band-pass filter, actually functions as a type of band absorber or notch filter, removing a band of frequencies around the resonant frequency of the cavity (see below, Standing waves: The Helmholtz resonator ).",
  "The particular manner in which sound waves can combine is known as interference. Two identical waves in the same place at the same time can interfere constructively if they are in phase or destructively if they are out of phase. “Phase” is a term that refers to the time relationship between two periodic signals. “In phase” means that they are vibrating together, while “out of phase” means that their vibrations are opposite. Opposite vibrations added together cancel each other.",
  "Constructive interference leads to an increase in the amplitude of the sum wave, while destructive interference can lead to the total cancellation of the contributing waves. An interesting example of both interference and diffraction of sound, called the “speaker and baffle” experiment, involves a small loudspeaker and a large, square wooden sheet with a circular hole in it the size of the speaker. When music is played on the loudspeaker, sound waves from the front and back of the speaker, which are out of phase, diffract into the entire region around the speaker. The two waves interfere destructively and cancel each other, particularly at very low frequencies, where the wavelength is longest and the diffraction is thus greatest. When the speaker is held up behind the baffle, though, the sounds can no longer diffract and mix while they are out of phase, and as a consequence the intensity increases enormously. This experiment illustrates why loudspeakers are often mounted in boxes, so that the sound from the back cannot interfere with the sound from the front. In a home stereo system, when two speakers are wired properly, their sound waves are in phase along an antinodal line between the two speakers and in the area of best listening. If the two speakers are wired incorrectly—the wires being reversed on one of the speakers—their waves will be out of phase in the area of best listening and will interfere destructively—especially at low frequencies, so that the bass frequencies will be strongly attenuated.",
  "A common application of destructive interference is the modern electronic automobile muffler. This device senses the sound propagating down the exhaust pipe and creates a matching sound with opposite phase. These two sounds interfere destructively, muffling the noise of the engine. Another application is in industrial noise control. This involves sensing the ambient sound in a workplace, electronically reproducing a sound with the opposite phase, and then introducing that sound into the environment so that it interferes destructively with the ambient sound to reduce the overall sound level.",
  "An important occurrence of the interference of waves is in the phenomenon of beats. In the simplest case, beats result when two sinusoidal sound waves of equal amplitude and very nearly equal frequencies mix. The frequency of the resulting sound ( F ) would be the average of the two original frequencies ( f  1 and f  2 ):   ",
  "The amplitude or intensity of the combined signal would rise and fall at a rate ( f   b  ) equal to the difference between the two original frequencies,   where f  1 is greater than f  2 .",
  "Beats are useful in tuning musical instruments to each other: the farther the instruments are out of tune, the faster the beats. Other types of beats are also of interest. Second-order beats occur between the two notes of a mistuned octave, and binaural beats involve beating between tones presented separately to the two ears, so that they do not mix physically.",
  "The Doppler effect is a change in the frequency of a tone that occurs by virtue of relative motion between the source of sound and the observer. When the source and the observer are moving closer together, the perceived frequency is higher than the normal frequency, or the frequency heard when the observer is at rest with respect to the source. When the source and the observer are moving farther apart, the perceived frequency is lower than the normal frequency. For the case of a moving source, one example is the falling frequency of a train whistle as the train passes a crossing. In the case of a moving observer, a passenger on the train would hear the warning bells at the crossing drop in frequency as the train speeds by.",
  "For the case of motion along a line, where the source moves with speed v   s  and the observer moves with speed v   o  through still air in which the speed of sound is S , the general equation describing the change in frequency heard by the observer is   ",
  "In this equation the speeds of the source and the observer will be negative if the relative motion between the source and observer is moving them apart, and they will be positive if the source and observer are moving together.",
  "From this equation, it can be deduced that a Doppler effect will always be heard as long as the relative speed between the source and observer is less than the speed of sound. The speed of sound is constant with respect to the air in which it is propagating, so that, if the observer moves away from the source at a speed greater than the speed of sound, nothing will be heard. If the source and the observer are moving with the same speed in the same direction, v   o  and v   s  will be equal in magnitude but with the opposite sign; the frequency of the sound will therefore remain unchanged, like the sound of a train whistle as heard by a passenger on the moving train.",
  "If the speed of the source is greater than the speed of sound, another type of wave phenomenon will occur: the sonic boom. A sonic boom is a type of shock wave that occurs when waves generated by a source over a period of time add together coherently, creating an unusually strong sum wave. An analogue to a sonic boom is the V-shaped bow wave created in water by a motorboat when its speed is greater than the speed of the waves. In the case of an aircraft flying faster than the speed of sound (about 1,230 kilometres per hour, or 764 miles per hour), the shock wave takes the form of a cone in three-dimensional space called the Mach cone. The Mach number is defined as the ratio of the speed of the aircraft to the speed of sound. The higher the Mach number—that is, the faster the aircraft—the smaller the angle of the Mach cone.",
  "This section focuses on waves in bounded mediums—in particular, standing waves in such systems as stretched strings, air columns, and stretched membranes. The principles discussed here are directly applicable to the operation of string and wind instruments.",
  "When two identical waves move in opposite directions along a line, they form a standing wave—that is, a wave form that does not travel through space or along a string even though (or because) it is made up of two oppositely traveling waves. The resulting standing wave is sinusoidal, like its two component waves, and it oscillates at the same frequency. An easily visualized standing wave can be created by stretching a rubber band between two fixed points, displacing its centre slightly, and releasing it so that it vibrates back and forth between two extremes. In musical instruments, a standing wave can be generated by driving the oscillating medium (such as the reeds of a woodwind) at one end; the standing waves are then created not by two separate component waves but by the original wave and its reflections off the ends of the vibrating system.",
  "For a stretched string of a given mass per unit length ( μ ) and under a given tension ( F ), the speed ( v ) of a wave in the string is given by the following equation:   ",
  "When a string of a given length ( L ) is plucked gently in the middle, a vibration is produced with a wavelength (λ) that is twice the length of the string:   ",
  "The frequency ( f  1 ) of this vibration can then be obtained by the following adaptation of equation (2 ):   ",
  "As the vibration that has the lowest frequency for that particular type and length of string under a specific tension, this frequency is known as the fundamental, or first harmonic.",
  " The first three harmonic standing waves in a stretched string. N A n Additional standing waves can be created in a stretched string; the three simplest are represented graphically in Figure 4 . At the top is a representation of the fundamental, which is labeled n = 1. Because a string must be stretched by holding it in place at its ends, each end is fixed, and there can be no motion of the string at these points. The ends are called nodal points, or nodes, and labeled N . The shape of the string at the extreme positions in its oscillation is illustrated by curved solid and dashed lines, the two positions occurring at time intervals of one-half period. In the centre of the string is the point at which the string vibrates with its greatest amplitude; this is called an antinodal point, or antinode, and labeled A .",
  "The next two vibrational modes of the string are also represented in Figure 4 . For these vibrations the string is divided into equal segments called loops. Each loop is one-half wavelength long, and the wavelength is related to the length of the string by the following equation:   ",
  "Here the integer n equals the number of loops in the standing wave. From equation (22 ) above, the frequencies of these vibrations ( f   n  ) can be deduced as:   or, in terms of the fundamental frequency f  1 ,   ",
  "Here n is called the harmonic number, because the sequence of frequencies existing as standing waves in the string are integral multiples, or harmonics, of the fundamental frequency.",
  "In the middle representation of Figure 4 , labeled n = 2 and called the second harmonic, the string vibrates in two sections, so that the string is one full wavelength long. Because the wavelength of the second harmonic is one-half that of the fundamental, its frequency is twice that of the fundamental. Similarly, the frequency of the third harmonic (labeled n = 3) is three times that of the fundamental.",
  "Another term sometimes applied to these standing waves is overtones. The second harmonic is the first overtone, the third harmonic is the second overtone, and so forth. “Overtone” is a term generally applied to any higher-frequency standing wave, whereas the term harmonic is reserved for those cases in which the frequencies of the overtones are integral multiples of the frequency of the fundamental. Overtones or harmonics are also called resonances. In the phenomenon of resonance, a system that vibrates at some natural frequency is subjected to external vibrations of the same frequency; as a result, the system resonates, or vibrates at a large amplitude.",
  " 2 The first 10 notes in the overtone series of G  2 . The sequence of frequencies defined by equation (25 ), known as the overtone series, plays an important part in the analysis of musical instruments and musical tone quality. If the fundamental frequency is the note G 2 at the bottom of the bass clef, the first 10 frequencies in the series will correspond closely to the notes shown in Figure 5 . Here the frequencies of the octaves (harmonics 1, 2, 4, and 8) are exactly those of the notes shown, but the other frequencies of the overtone series differ by a small amount from the frequencies of the notes on the equal-tempered scale. The seventh harmonic is quite out of tune when compared with the actual note, so it is enclosed in parentheses.",
  "During the Middle Ages in Europe, keyboard instruments were sometimes tuned to a scale in which the primary chords were true frequencies of the overtone series. This tuning method, called just intonation, provided beatless chords, because the notes in the chord were members of a single overtone series.",
  "From equation (22 ) can be derived three “laws” detailing how the fundamental frequency of a stretched string depends on the length, tension, and mass per unit length of the string. Known as Mersenne’s laws, these can be written as follows:",
  "1.The fundamental frequency of a stretched string is inversely proportional to the length of the string, keeping the tension and the mass per unit length of the string constant:   ",
  "2.The fundamental frequency of a stretched string is directly proportional to the square root of the tension in the string, keeping the length and the mass per unit length of the string constant:   ",
  "3.The fundamental frequency of a stretched string is inversely proportional to the square root of the mass per unit length of the string, keeping the length and the tension in the string constant:   ",
  "Mersenne’s laws help explain the construction and operation of string instruments. The lower strings of a guitar or violin are made with a greater mass per unit length, and the higher strings made thinner and lighter. This means that the tension in all the strings can be made more nearly the same, resulting in a more uniform sound. In a grand piano, the tension in each string is over 100 pounds, creating a total force on the frame of between 40,000 and 60,000 pounds. A large variation in tension between the lower and the higher strings could lead to warping of the piano frame, so that, in order to apply even tension throughout, the higher strings are shorter and smaller in diameter while the bass strings are constructed of heavy wire wound with additional thin wire. This construction makes the wires stiff, causing the overtones to be higher in frequency than the ideal harmonics and leading to the slight inharmonicity that plays an important part in the characteristic piano tone.",
  " The first three harmonic standing waves in open and closed tubes. N A n In a manner analogous to the treatment of standing waves in a stretched string, it is possible to carry out an analysis of the structure of standing waves in air columns. If two identical sinusoidal waves move in opposite directions in a column of air, a standing wave of the same frequency will be formed, just as it is in a string. The standing wave will consist of equally spaced nodes and antinodes with a loop length equal to one-half wavelength in air. Because the motion of the air forming this standing wave is rather complicated, the graphic representation is more abstract, but it can be drawn in a similar manner to that of the string. The simplest standing waves in both open and closed air columns are shown in Figure 6 . Each standing wave is identified by its harmonic number ( n ), and location of the nodes ( N ) and antinodes ( A ) are indicated.",
  "Tubes are classified by whether both ends of the tube are open (an open tube) or whether one end is open and one end closed (a closed tube). The basic acoustic difference is that the open end of a tube allows motion of the air; this results in the occurrence there of a velocity or displacement antinode similar to the centre of the fundamental mode of a stretched string, as illustrated at the top of Figure 4 . On the other hand, the air at the closed end of a tube cannot move, so that a closed end results in a velocity node similar to the ends of a stretched string.",
  "In an open tube, the standing wave of the lowest possible frequency for that particular length of tube (in other words, the fundamental) has antinodes at each end and a node in the centre. This means that an open tube is one-half wavelength long. The fundamental frequency ( f  1 ) is thus   where L   o  is the length of the open tube. The standing wave of each successive harmonic has one additional loop, as shown by n = 2 and n = 3 in Figure 6 . The wavelength (λ  n  ) of each successive standing wave is calculated as   and the frequency ( f   n  ) as   just as in the case of the stretched string.",
  "The end conditions of a closed tube create a node at the closed end and an antinode at the open end, so that the length of a closed tube ( L   c  ) is one-quarter of a wavelength. For this reason, the length of the closed tubes represented in Figure 6 is one-half that of the open tubes, so that both open and closed tubes produce the same fundamental frequency. In addition, the boundary conditions of a closed tube allow only an odd number of quarter-wavelengths to occupy any given length, so that   where only odd n are allowed. Thus, the frequencies of standing waves in a closed tube include only the odd harmonics,   where values for n are odd integers only.",
  "A dramatic device used to “observe” the motion of air in a standing wave is the Kundt’s tube. Cork dust is placed on the bottom of this tube, and a standing wave is created. A standing wave in a Kundt’s tube consists of a complex series of small cell oscillations, an example of which is illustrated in . The air is set in motion, and the vortex motion of the air cells blows the cork dust into small piles, forming a striation pattern. This pattern is very clear and strong at the velocity antinodes of the standing wave, but it disappears at the locations of nodal points. Alternating locations of nodes and antinodes are thus readily observed using this technique.",
  "Under actual conditions, a node is located exactly at the closed end of a tube, but the antinode, owing to the way a wave reflects when it hits the open end, is actually out past the end of the tube by a small distance known as the end correction. The end correction depends primarily on the radius of the tube: it is approximately equal to 0.6 times the radius of an unflanged tube and 0.82 times the radius of a flanged tube. The effective length of the tube, which must be assumed for the value of L in the equations above, incorporates the end correction.",
  "An important feature of this discussion of standing waves in air columns is that the terms node and antinode refer to the places in the vibrating medium where there is zero and maximum displacement or velocity. Many textbooks and reference works use illustrations in which the wave drawn in a tube represents pressure rather than velocity or displacement. In this case, all the nodes and the antinodes are the reverse of those shown in Figure 6 —that is, a pressure node (corresponding to a displacement or velocity antinode) occurs at the open end of a tube, while a pressure antinode (corresponding to a displacement or velocity node) occurs at the closed end. Because most microphones respond to changes in pressure, this type of representation may be more useful when discussing experimental observations involving the use of microphones.",
  "A thin metal rod can sustain longitudinal vibrations in much the same way as an air column. The ends of a rod, when free, act as antinodes, while any point at which the rod is held becomes a node, so that the representation of their standing waves is identical to that of an open tube. Such standing waves can be activated by sharply striking the end of the rod with a hard object or by scraping the rod with a cloth or with fingers coated with resin. The harmonic frequencies are then given by   where n is the harmonic number, Y is the Young’s modulus (as described above in Plane waves: The speed of sound: In solids ), and ρ is the density of the material. This type of standing wave was used by Ernst Chladni in determining the speed of sound in metals.",
  "The resonant systems described above have a series of standing-wave resonances that vibrate at the frequencies of the overtone series, but there are several systems whose resonances are not so simply related.",
  " V L A. An important type of resonator with very different acoustic characteristics is the Helmholtz resonator, named after the German physicist Hermann von Helmholtz. Essentially a hollow sphere with a short, small-diameter neck, a Helmholtz resonator has a single isolated resonant frequency and no other resonances below about 10 times that frequency. The resonant frequency (f) of a classical Helmholtz resonator, shown in Figure 8 , is determined by its volume (V) and by the length (L) and area (A) of its neck:   where S is the speed of sound in air. As with the tubes discussed above, the value of the length of the neck should be given as the effective length, which depends on its radius.",
  "The isolated resonance of a Helmholtz resonator made it useful for the study of musical tones in the mid-19th century, before electronic analyzers had been invented. When a resonator is held near the source of a sound, the air in it will begin to resonate if the tone being analyzed has a spectral component at the frequency of the resonator. By listening carefully to the tone of a musical instrument with such a resonator, it is possible to identify the spectral components of a complex sound wave such as those generated by musical instruments.",
  "The air cavity of a string instrument, such as the violin or guitar, functions acoustically as a Helmholtz-type resonator, reinforcing frequencies near the bottom of the instrument’s range and thereby giving the tone of the instrument more strength in its low range. The acoustic band-pass filter shown in Figure 3D uses a Helmholtz resonator to absorb a band of frequencies from the sound wave passing down an air duct and then reemitting them with the opposite phase, so that they will interfere destructively with the incoming wave and cause it to attenuate. The large jugs used in a jug band also function as Helmholtz resonators, resonating at a single low frequency when air is blown across their openings. Tuning forks are often mounted on boxes, because the air cavity in a box oscillates like a Helmholtz resonator and provides coupling between the tuning fork and the outside air.",
  "An air cavity in the shape of a rectangular box has a sequence of nonharmonic resonances. In such a case the walls are nodal points, and there are standing waves between two parallel walls and mixed standing waves involving several walls. The frequencies of such standing waves are given by the relation   where x, y , and z are the dimensions of the box and N   x  , N   y  , and N   z  are any integers. In the case where N   y  = N   z  = 0 and N   x  = 1, the frequency is   corresponding to a half-wavelength the length of the box. This type of resonance is found inside a loudspeaker box, and it must be avoided when tuning a bass reflex speaker port. Such resonances are also readily observed in shower stalls and small rooms such as music practice rooms with parallel walls. Because of these resonances, practice rooms are often made with oblique walls.",
  "In a two-dimensional system—for instance, a vibrating plate or a stretched membrane such as a drumhead—the resonant frequencies are not related by integral multiples; that is, their resonances or overtones are inharmonic. Most tuned percussion instruments fall into this category, which is one reason why a tune played on bells or timpani is sometimes more difficult to follow than a tune played on a violin or trumpet. Part of the design goal for tuned bar instruments is to make the shape such that two or more of the resonant frequencies line up like those of wind or string instruments, rendering the pitch clearer. Some, such as the marimba and xylophone, use tubular resonators tuned to the desired frequency of the bar in order to reinforce any overtones that are harmonics of the tube. The South Asian tabla achieves its relatively clear pitch by using a nonuniform, or weighted, drumhead.",
  "Fundamental to the analysis of any musical tone is the spectral analysis, or Fourier analysis, of a steady-state wave. According to the Fourier theorem, a steady-state wave is composed of a series of sinusoidal components whose frequencies are those of the fundamental and its harmonics, each component having the proper amplitude and phase. The sequence of components that form this complex wave is called its spectrum.",
  " Fourier synthesis of a complex wave. The synthesis of a complex wave from its spectral components is illustrated by the sawtooth wave in Figure 9 . The wave to be synthesized is shown by the graph at the upper middle, with its fundamental to the left and right. Adding the second through fourth harmonics, as shown on the left below the fundamental, results in the sawtooth shapes shown on the right.",
  "A sound that changes in time, such as a spoken word or a bird call, can be more completely described by examining how the Fourier spectrum changes with time. In a graph called the sound spectrograph, frequency of the complex sound is plotted versus time, with the more intense frequency components shown in the third dimension or more simply as a darker point on a two-dimensional graph. The so-called voiceprint is an example of a sound spectrograph. At one time it was believed that people have voiceprints that are as unique as their fingerprints, so that individuals could be identified by their voiceprints, but the technology of the voiceprint has never been developed. In certain bird atlases, sound spectrographs of bird calls are included with other information, allowing identification of each bird by its call.",
  "The steady-state tone of any musical instrument can also be analyzed and its Fourier spectrum constructed. The amplitudes of the various spectral components partially determine the tone quality, or timbre, of the instrument.",
  "The bore shapes of musical instruments, which have developed over the centuries, have rather interesting effects. Cylindrical and conical bores can produce resonances that are harmonics of the fundamental frequencies, but bores that flare faster than a cone create nonharmonic overtones and thus produce raucous tones rather than good musical sounds. A fact discovered by early musical instrument builders, this is the reason why the musical instruments that have developed over the past millennium of Western history are limited to those with either cylindrical or conical bores. In general, a rapidly flaring bell is added to the end of the instrument to reduce the impedance mismatch as the sound emerges from the instrument, thus increasing the ability of the instrument to radiate sound.",
  "The presence of any given harmonic in the spectrum of a particular musical instrument depends on the nature of the vibrating system. For example, if the system functions acoustically as an open tube or a vibrating string, all harmonics will likely be present in the wave. Examples of this are the flute, the recorder, and the violin. On the other hand, the clarinet functions acoustically as a closed tube, because it is cylindrical in shape and has a reed end. Therefore, as explained above in Standing waves: In air columns , the odd harmonics are emphasized in the clarinet spectrum—particularly at low frequencies. Other wind instruments function acoustically as open tubes for a variety of reasons. The addition of a mouthpiece and a bell to a tube, either cylindrical or conical, results in all harmonics being possible, as in both the trumpet (cylindrical) and cornet (conical) family of brasses. Even after fixing a reed to one end of a conical tube—as in the oboe, bassoon, and saxophone families—the instruments still function acoustically as open tubes, producing all harmonics. The sawtooth wave, having all harmonics, therefore sounds more like a trumpet or a saxophone than like a clarinet.",
  "Because many musical instrument families have similar spectra, there must be other factors that affect their tone quality and by which their tones can be distinguished. Attack transients, such as the way in which a string is bowed, a trumpet tongued, or a piano key struck, and decay transients, such as the way the sound of a plucked string dies away, are very important in many instruments, particularly those that are struck or plucked. Vibrato (a periodic slow change in pitch) and tremolo (a periodic slow change in amplitude) also aid the analysis of steady-state sounds.",
  "Inharmonicities, or deviations of the frequencies of the harmonics from the exact multiples of the fundamental, are very important in tuned percussion instruments. For example, because of the inherent stiffness of piano strings, the overtones of the piano have slight inharmonicities. Indeed, the frequency of the 16th harmonic as played on the piano is about one-half step higher than the exact frequency of the harmonic.",
  "Basic to flutes and recorders, an edge tone is a stream of air that strikes a sharp edge, where it creates pressure changes in the air column that propagate down the tube. Reflections of these pressure variations then force the air stream back and forth across the edge, reinforcing the vibration at the resonant frequency of the tube. The time required to set up this steady-state oscillation is called the transient time of the instrument. The human ear is extremely sensitive to transients in musical tones, and such transients are crucial to the identification of various musical instruments whose spectra are similar.",
  "In musical instruments the pressure variations generated by edge tones, a reed, or the lips set up standing waves in the air column that in turn drive the air stream, reed, or lips. Thus, contrary to common belief, the vibrations of the air column drive the reed or the lips open and closed; the reed or lips do not drive the air column. In the clarinet, for example, air is forced through the reed, creating a pulse of air that travels down the tube. Simultaneously, the reed is pulled closed by pressure of the lips and by rapid air flow out of the reed. After one reflection off the end of the tube, the pulse reflects as a rarefaction, holding the reed shut, but after the second reflection the pulse returns as a compression, forcing the reed open so that the process is repeated.",
  "Groups of emphasized harmonics, known as formants, play a crucial role in the vowel sounds produced by the human voice. Vocal formants arise from resonances in the vocal column. The vocal column is about 17.5 centimetres (7 inches) long, on the average, with its lower end at the vocal folds and its upper end at the lips. Like a reed or like lips at the mouthpiece of a wind instrument, the vocal folds function acoustically as a closed end, so that the vocal column is a closed-tube resonator with resonant frequencies of about 500, 1,500, 2,500, and 3,500 hertz, and so on. The vibration frequency of the vocal folds, determined by the folds’ tension, determines the frequency of the vocal sound. When a sound is produced, all harmonics are present in the spectrum, but those near the resonant frequencies of the vocal column are increased in amplitude. These emphasized frequency regions are the vocal formants. By changing the shape of the throat, mouth, and lips, the frequencies of the formants are varied, creating the different vowel sounds.",
  "The idea of noise is fundamental to the sound of many vibrating systems, and it is useful in describing the spectra of vocal sibilants as well. Just as white light is the combination of all the colours of the rainbow, so white noise can be defined as a combination of equally intense sound waves at all frequencies of the audio spectrum. A characteristic of noise is that it has no periodicity, and so it creates no recognizable musical pitch or tone quality, sounding rather like the static that is heard between stations of an FM radio.",
  "Another type of noise, called pink noise, is a spectrum of frequencies that decrease in intensity at a rate of three decibels per octave. Pink noise is useful for applications of sound and audio systems because many musical and natural sounds have spectra that decrease in intensity at high frequencies by about three decibels per octave. Other forms of coloured noise occur when there is a wide noise spectrum but with an emphasis on some narrow band of frequencies—as in the case of wind whistling through trees or over wires. In another example, as water is poured into a tall cylinder, certain frequencies of the noise created by the gurgling water are resonated by the length of the tube, so that pitch rises as the tube is effectively shortened by the rising water.",
  "The ear has an enormous range of response, both in frequency and in intensity. The frequency range of human hearing extends over three orders of magnitude, from about 20 hertz to about 20,000 hertz, or 20 kilohertz. The minimum audible pressure amplitude, at the threshold of hearing, is about 10 -5 pascal, or about 10 -10 standard atmosphere, corresponding to a minimum intensity of about 10 -12 watt per square metre. The pressure fluctuation associated with the threshold of pain, meanwhile, is over 10 pascals—one million times the pressure or one trillion times the intensity of the threshold of hearing. In both cases, the enormous dynamic range of the ear dictates that its response to changes in frequency and intensity must be nonlinear.",
  "Shown in is a set of equal-loudness curves, sometimes called Fletcher-Munson curves after the investigators, the Americans Harvey Fletcher and W.A. Munson, who first measured them. The curves show the varying absolute intensities of a pure tone that has the same loudness to the ear at various frequencies. The determination of each curve, labeled by its loudness level in phons, involves the subjective judgment of a large number of people and is therefore an average statistical result. However, the curves are given a partially objective basis by defining the number of phons for each curve to be the same as the sound intensity level in decibels at 1,000 hertz—a physically measurable quantity. Fletcher and Munson placed the threshold of hearing at 0 phons, or 0 decibels at 1,000 hertz, but more accurate measurements now indicate that the threshold of hearing is slightly greater than that. For this reason, the curve labeled 0 phons in is slightly lower than the intensity level of the threshold of hearing over the entire frequency range. The curve labeled 120 phons is sometimes called the threshold of pain, or the threshold of feeling.",
  "Several interesting observations can be made regarding . The minimum intensity in the threshold of hearing occurs at about 4,000 hertz. This corresponds to the fundamental frequency at which the ear canal, acting as a closed tube about two centimetres long, has a specific resonance. The pressure variation corresponding to the threshold of hearing, roughly equivalent to placing the wing of a fly on the eardrum, causes a vibration of the eardrum of less than the radius of an atom. If the threshold of hearing did not rise for low frequencies, body sounds, such as heartbeat and blood pulsing, would be continually audible. Music is normally played at intensity levels between about 30 and 100 decibels. When it is played more softly, decreasing the sound level of all frequencies by the same amount, bass frequencies fall below the threshold of hearing. This is why the loudness control on an audio system raises the intensity of low frequencies—so that the music will have the same proportion of treble and bass to the ear as when it is played at a higher level.",
  "As stated above, the ear has an enormous dynamic range, the threshold of pain corresponding to an intensity 12 orders of magnitude (10 12 times) greater than the threshold of hearing. This leads to the necessity of a nonlinear intensity response. In order to be sensitive to intense waves and yet remain sensitive to very low intensities, the ear must respond proportionally less to higher intensity than to lower intensity. This response is logarithmic, because the ear responds to ratios rather than absolute pressure or intensity changes. At almost any region of the Fletcher-Munson diagram, the smallest change in intensity of a sinusoidal sound wave that can be observed, called the intensity just noticeable difference, is about one decibel (further reinforcing the value of the decibel intensity scale). One decibel corresponds to an absolute energy variation of a factor of about 1.25. Thus, the minimum observable change in the intensity of a sound wave is greater by a factor of nearly 10 12 at high intensities than it is at low intensities.",
  "The frequency response of the ear is likewise nonlinear. Relating frequency to pitch as perceived by the musician, two notes will “sound” similar if they are spaced apart in frequency by a factor of two, or octave. This means that the frequency interval between 100 and 200 hertz sounds the same as that between 1,000 and 2,000 hertz or between 5,000 and 10,000 hertz. In other words, the tuning of musical scales and musical intervals is associated with frequency ratios rather than absolute frequency differences in hertz. As a result of this empirical observation that all octaves sound the same to the ear, each frequency interval equivalent to an octave on the horizontal axis of the Fletcher-Munson scale is equal in length.",
  "The audio frequency range encompasses nearly nine octaves. Over most of this range, the minimum change in the frequency of a sinusoidal tone that can be detected by the ear, called the frequency just noticeable difference, is about 0.5 percent of the frequency of the tone, or about one-tenth of a musical half-step. The ear is less sensitive near the upper and lower ends of the audible spectrum, so that the just noticeable difference becomes somewhat larger.",
  "The ear actually functions as a type of Fourier analysis device, with the mechanism of the inner ear converting mechanical waves into electrical impulses that describe the intensity of the sound as a function of frequency. Ohm’s law of hearing is a statement of the fact that the perception of the tone of a sound is a function of the amplitudes of the harmonics and not of the phase relationships between them. This is consistent with the place theory of hearing, which correlates the observed pitch with the position along the basilar membrane of the inner ear that is stimulated by the corresponding frequency.",
  "The intensity level at which a sound can be heard is affected by the existence of other stimuli. This effect, called masking, plays an important role in the psychophysical response to sound. Low frequencies mask higher frequencies much more strongly than high frequencies mask lower ones; this is one reason why a complex wave is perceived as having a different tone quality or timbre from a pure wave of the same frequency, even though they have the same pitch. Noise of low frequencies can be used to mask unwanted distracting sounds, such as nearby conversation in an office, and to create greater privacy.",
  "The ear is responsive to the periodicity of a wave, so that it will hear the frequency of a complex wave as that of the fundamental whether or not the fundamental is actually present as a component in the wave, although the wave will have a different timbre than it would were the fundamental actually present. This effect, known as the missing fundamental, subjective fundamental, or periodicity pitch, is used by the ear to create the fundamental in sound radiating from a small loudspeaker that is not capable of providing low frequencies.",
  "If the intensity of a sound is sufficiently great, the wave shape will be distorted by the ear mechanism, owing to its nonlinearity. The spectral analysis of the sound will then include frequencies that are not present in the sound wave, causing a distorted perception of the sound. If two or more sounds of great intensity are presented to the ear, this effect will introduce what are called combination tones. Two pure tones of frequency f  1 and f  2 will create a series of new pure tones: the sum tones,   and the difference tones,   ",
  "(Here n and m are any two integers.) Sum tones are difficult to hear because they are masked by the higher-intensity tones creating them, but difference tones are often observed in musical performance. For example, if the two tones are adjacent members of the harmonic series, the fundamental of that series will be produced as a difference tone, enhancing the ability of the ear to identify the fundamental pitch.",
  "The paths from the ears to the brain are separate; that is, each ear converts the sound reaching it into electrical impulses, so that sounds from the two ears mix in the brain not as physical vibrations but as electrical signals. This separation of pathways has the direct result that, if two pure tones are presented to each ear separately ( i.e., binaurally) at low levels, it will be very difficult for the ears to compare the frequencies because with no direct mixing of the mechanical waves there will be no regular beats. This difference in pitch perception between the two ears, called diplacusis, is generally not a problem. A type of beating known as binaural beats can sometimes be observed when the two tones are presented binaurally.",
  "Also, two tones very close to an octave apart produce another type of monaural beating as they change in phase. This effect, known as second-order beats or quality beats, is observed as a slight periodic change in the quality of the combined tone. It serves as a counterexample to Ohm’s law of hearing, which suggests that the quality of a sound depends only on the amplitudes of the harmonics and not on their phases.",
  "Although the two ears are not connected by mechanical means, the brain is sensitive to phase and is able to determine the phase relationship between stimuli presented to the two ears. Locating a sound source laterally in space makes use of fundamental properties of sound waves as well as the ability of the brain to identify the phase difference between signals from the two ears. At low frequencies, where the wavelength is large and the waves diffract strongly, the brain is able to perceive the phase difference between the same sound reaching both ears, and it can thus locate the direction from which the sound is coming. On the other hand, at high frequencies the wavelength may be so short that there may be more than one period of time delay between the signals arriving at the two ears, creating an ambiguity in the phase difference. Fortunately, at these high frequencies there is so much less diffraction of sound waves that the head actually shields one ear more than the other. In such cases the difference in intensity of the sound waves reaching the two ears, rather than their phase difference, is used by the ears in spatial localization. Spatial localization in the vertical direction is poor for most people.",
  "An enormous amount of physical data on such topics as the velocity of sound and the elastic properties of materials, as well as surveys of important theories in the field, are found in the following reference books: Herbert L. Anderson (ed.), A Physicist’s Desk Reference (1989); Dwight E. Gray (ed.), American Institute of Physics Handbook , 3rd ed. (1972); and Rita G. Lerner and George L. Trigg (eds.), Encyclopedia of Physics , 2nd ed. (1991). For biographies of scientists who worked in the field of acoustics, see Charles Coulston Gillispie (ed.), Dictionary of Scientific Biography , 16 vol. (1970–80).",
  "A most important modern work on the physiology of hearing is Georg von Békésy , Experiments in Hearing (1960, reprinted 1980). Juan G. Roederer , Introduction to the Physics and Psychophysics of Music , 2nd ed. (1975), thoroughly and clearly discusses the ear and hearing, using only basic mathematics. An excellent survey of psychoacoustics is provided in Brian C.J. Moore , An Introduction to the Psychology of Hearing , 3rd ed. (1989). Modern experiments in hearing are described in Reinier Plomp , Aspects of Tone Sensation: A Psychophysical Study (1976).",
  "Data on hearing ranges in animals is collected in Richard R. Fay , Hearing in Vertebrates: A Psychophysics Databook (1988). Chandler S. Robbins , Bertel Bruun , and Herbert S. Zim , Birds of North America , expanded rev. ed. (1983), includes audio spectrographs of bird calls."
]