[
  "   San Francisco ,  city and port, coextensive with San Francisco county, northern California , U.S., located on a peninsula between the Pacific Ocean and San Francisco Bay . It is a cultural and financial centre of the western United States and one of the country’s most cosmopolitan cities. Area 46 square miles (120 square km). Pop. (2010) 805,235; San Francisco–San Mateo–Redwood City Metro Division, 1,776,095; San Francisco–Oakland–Fremont Metro Area, 4,335,391; (2020) 873,965; San Francisco–San Mateo–Redwood City Metro Division, 1,638,407; San Francisco–Oakland–Berkeley Metro Area, 4,749,008.",
  "San Francisco holds a secure place in the United States ’ romantic dream of itself—a cool, elegant, handsome, worldly seaport whose steep streets offer breathtaking views of one of the world’s greatest bays. According to the dream, San Franciscans are sophisticates whose lives hold full measures of such civilized pleasures as music, art, and good food. Their children are to be pitied, for, as the wife of publishing magnate Nelson Doubleday once said, “They will probably grow up thinking all cities are so wonderful.” To San Franciscans their city is a magical place, almost an island , saved by its location and history from the sprawl and monotony that afflicts so much of urban California .",
  "Since World War II , however, San Francisco has had to face the stark realities of urban life: congestion, air and water pollution, violence and vandalism, and the general decay of the inner city. San Francisco’s makeup has been changing as families, mainly white and middle-class, have moved to its suburbs, leaving the city to a population that, viewed statistically, tends to be older and to have fewer married people. Now more than one of every two San Franciscans is “nonwhite”—in this case African American, East Asian, Filipino, Samoan, Vietnamese, Latin American, or Native American. Their dreams increasingly demand a realization that has little to do with the romantic dream of San Francisco. But both the dreams and the realities are important, for they are interwoven in the fabric of the city that might be called Paradox-by-the-Bay.",
  "Although San Franciscans complain of the congestion, homelessness, and high cost of living that plague the city and talk endlessly of the good old days, the majority still think of San Francisco the way poet George Sterling did, as “the cool grey city of love,” one of America’s most attractive, colourful, and distinctive places to live.",
  "  Hilly and roughly square, San Francisco occupies the northern tip of a peninsula. To its south are the bedroom suburbs of San Mateo county, to the east and northeast is the bay, and to the west and northwest lies the Pacific Ocean.",
  "  The most prominent of San Francisco’s hills are Twin Peaks, Mount Davidson, and Mount Sutro, all of which exceed 900 feet (270 metres) in elevation. The best known are Nob Hill, where the wealthy “nobs” (nabobs) built extravagant mansion s in the 1870s, and Telegraph Hill, which once looked down on the Barbary Coast, a neighbourhood formerly alive with gaudy wickedness. As a result of the pioneer planners’ prejudice in favour of a squared-off grid, the downtown streets march intrepidly up precipitous slopes, terrifying newly arrived drivers, making the cable cars more than sentimental anachronisms, and providing splendid views of the bay .",
  "  San Francisco Bay is a drowned river valley, submerged during the melting of the last glacial ice sheet. Enthusiastic and profitable filling of the tidelands has reduced its area at mean high tide from about 700 square miles (1,800 square km) in 1880 to a mere 435 square miles (1,125 square km). More than half of the bay is still fillable, but in 1965 the state legislature created the Bay Conservation and Development Commission to control further landfill projects. At its widest extent the bay measures 13 miles (21 km) across; its deepest point, 357 feet (109 metres), is in the Golden Gate , a narrow channel between the peninsula and Marin county to the north that connects the bay to the Pacific. The maximum daily flow of water through the Golden Gate into the Pacific is seven times the flow of the Mississippi River at its mouth.",
  "  Within the portion of San Francisco Bay lying inside the city limits are the natural islands of Alcatraz and Yerba Buena and man-made Treasure Island, created for a world’s fair in 1939 and later turned into a naval base (1941–93). Alcatraz (Spanish: “Pelican”) was from 1934 to 1963 the most notorious maximum-security, “escape-proof” prison in the United States. In 1969, after the decaying cell blocks had been given up by the Federal Bureau of Prisons, a multi-tribal group of Native Americans invaded the island and asserted their rights to abandoned federal property, but they were forcibly evicted in 1971. The island became part of Golden Gate National Recreation Area in 1972 and has become a popular tourist attraction.",
  "   Winter in San Francisco is rainy and mild, spring sunny and temperate, summer foggy and cool, and autumn sunny and warm. The average minimum temperature is 51 °F (11 °C), and the average maximum is 63 °F (17 °C). The mean rainfall, almost all of which occurs between November and April, is about 21 inches (533 mm). There is sunshine during two-thirds of the possible daylight hours. The most characteristic feature of the weather, however, is the summer fog, which lies low over the city until midday, creating consternation among shivering tourists. This fog is a phenomenon of temperature contrasts, created when warm, moist ocean air comes in contact with cold water welling up from the ocean bottom along the coast.",
  "    The central business district, the financial district, North Beach, and Chinatown occupy the site of the gold-rush city, which subsequently was expanded by progressive fillings along the waterfront. The remnants of many ships that were deserted in 1849 now lie under office buildings several blocks inland. To the west, at the approach to the Golden Gate Bridge , lies the Presidio, a two-century-old military installation that became part of Golden Gate National Recreation Area in 1994; it is remarkable for its parklike lawns and wind-sculptured stands of trees. South of the Presidio is Golden Gate Park, reclaimed from a onetime sandy desert. The rest of San Francisco is largely composed of residential neighbourhoods, from Pacific Heights, in which the old, wealthy families reside, to Hunters Point, which is predominantly an African American community. Most are filled with flower-decked houses of pastel stucco and “painted ladies”—frame structures with abundant and often elegant architectural detailing, intricately coloured.",
  "  A great change, which has been described as the Manhattanization of San Francisco, became apparent after the late 1960s, and it has been both welcomed and resisted. In the financial district, in particular, one tall building after another has been constructed in a city in which, for generations, few structures were higher than 20 stories. Among the modern skyscrapers are 555 California Street (formerly known as the Bank of America building), the Transamerica Pyramid (which rises to an elongated point), and the Le Méridien San Francisco hotel (formerly the Park Hyatt). The Hyatt Regency is part of the massive Embarcadero Center complex—designed by John Portman in the 1970s—which encompasses six city blocks and houses numerous shops, hotels, and restaurants.",
  "    Another concern is one that San Francisco shares with few other U.S. cities—destruction by earthquake . Severe quakes have been felt in 1868, 1898, 1900, 1906, and 1989. But it was the 1906 earthquake that did the most damage and that has become identified with the city. A little after 5:00 am on April 18 the entire city began to tremble and shake. There was a terrible noise, “like the roar of 10,000 lions,” and San Franciscans knew they were experiencing a nightmarish earthquake. Cable cars jerked to a stop and the $7 million City Hall crumbled like a movie set. The glass roof over the Palace Hotel court splintered and rained down shards.",
  "  That quake was followed by a massive fire that destroyed the centre of town and burned for four days, until the smouldering ashes were wetted down by rain. Starting in the business section near Montgomery Street and the South of Market district, the inferno swept toward Russian Hill, Chinatown, North Beach, and Telegraph Hill, where Italians poured wine on the flames to save their houses. Gone were 4 square miles (10 square km), making up 512 blocks in the centre of town, along with 28,000 buildings and a total property value of about $350 million. It was originally thought that some 700 people died, though the death toll is now believed to be more than 3,000. In addition, 250,000 were left homeless, and survivors camped in Golden Gate Park. An Eastern journalist, celebrating the survival of a local distillery, composed the verse, “If, as some say, God spanked the town / For being over frisky, / Why did he burn the Churches down / And save Hotaling’s Whisky?”",
  "    Since the 1906 earthquake, seismologists and engineers have warned that it could happen again. Several relatively strong earthquakes (measuring more than 5.0 on the Richter scale ) have since then caused little damage. But the quake on October 17, 1989 , which measured 7.1 on the Richter scale, killed more than 60 people and caused severe damage to the Marina District and to some freeways and even more devastation to surrounding areas. Modern office towers were largely unaffected, indicating that new building methods may provide some protection for the city.",
  "The pattern of immigration into San Francisco during the latter half of the 19th century was significantly different from that of anywhere else in the United States . The waves of newcomers included not only native-born Americans moving west but also Europeans arriving directly by ship who had not previously lived for a time along the Eastern Seaboard . The demography of the gold-rush city was summed up concisely by a real-estate firm that advertised it could “transact business in the English, French, German, Spanish and Italian languages.” San Francisco remains one of the most Mediterranean of American cities— New Orleans is another—and Italians are still the dominant European minority, followed by Germans, Irish, and British.",
  "Jewish immigrants from Europe arrived in the city even before the gold seekers of 1849, and much credit for San Francisco’s culture must be given to them. They founded libraries, symphonies, and theatres and gave the city its first aura of sophistication.",
  "Before World War II about 20,000 African Americans lived in the entire Bay Area, about 4,000 of them in San Francisco. The tremendous increase in the black population during the next 30 years was set in motion by the war, which brought at least a half million war workers to the Bay Area’s shipyards and other industries. Among them were tens of thousands from the South, who settled mainly in San Francisco, Oakland, and Richmond. In San Francisco they moved into the old Carpenter Gothic houses in the blocks around Fillmore Street, vacated when the Japanese who had lived there were driven into wartime internment camps. By the 1980s, the character of the district shifted again, as the renovation of these houses and the high cost of property caused rents to skyrocket. Poorer African American residents were forced out of their neighbourhoods and into slum housing in the city’s already crowded southeastern sector.",
  "An increasing number of African Americans have become prominent in the city’s life— Willie Brown was elected mayor in 1995 and reelected in 1999—and many others also have won elective office.",
  "  Chinatown, which is the best-known Chinese community in the United States, is also probably the least understood minority community in the city. The colourful shops and restaurants of Grant Avenue mask a slum of crowded tenements and sweatshops that has the highest population density in an already densely populated city. Many Chinese residents have increasingly moved into North Beach, hitherto predominantly Italian, onto the nearby slopes of Russian Hill, or into the middle-class neighbourhoods of the Richmond district north of Golden Gate Park, where some of the city’s most popular Chinese restaurants and bakeries are found on Clement Street. Many of those who reside in Chinatown are more recent immigrants, particularly from Hong Kong.",
  "Never as large as Chinatown, the Japanese community of San Francisco was wiped out at a single stroke by the infamous Executive Order 9066 of 1942, which sent them, foreign-born and citizen alike, into “relocation centres.” The present centre of the Japanese community is Japantown (Nihonmachi), a few blocks east of Fillmore Street, now an ambitious commercial and cultural centre. Though the rising generation of Japanese Americans go to Japantown as visitors, bound for church services, social or cultural events (such as the annual cherry blossom festival), or to buy imported goods, their own roots are elsewhere.",
  "The Hispanic population is the second largest ethnic minority in the city (the Chinese community being the first). Before World War II the Mission District, named for the Mission Dolores, was principally working class and Irish. The Irish were largely replaced by Spanish-speaking Latin American immigrants, mainly from Central America and Mexico, although the neighbourhood saw another influx of white residents through gentrification in the first decades of the 21st century.",
  "The Filipino community has grown remarkably since World War II and has spread to all areas of the city, especially the South of Market area. Though not as numerous as in southern California, the Vietnamese, Cambodian, and Laotian communities have grown considerably since the 1980s, which resulted in conflicts with blacks and Hispanics over low-income housing and a proliferation of ethnic restaurants in the troubled Tenderloin area between the Civic Center and Union Square.",
  "San Franciscans have historically considered their city to be laissez-faire and open-minded, which is probably why homosexuals have felt comfortable there. The affluent Castro district (technically Eureka Valley near Twin Peaks) has attracted gays and lesbians from throughout the country, becoming perhaps the most famous gay neighbourhood in the world. Its streets are adorned with elegantly restored Victorian homes and landmarks highlighting significant dates in the struggle for gay rights. It is said that no local politician can win an election without the gay community’s vote.",
  "The gold rush (1848–49) established San Francisco as the premier city of the West, known from the Oregon border to the pueblo of Los Angeles simply as the City. It is still a great port, the financial and administrative capital of the West, and a substantial centre for commerce and manufacturing.",
  "San Francisco is well known for its connection to the technology industry. Some San Franciscans commute to nearby Silicon Valley—a region just south of the bay that is the heart of the nation’s technology industry—to work, but the city itself is home to a number of smaller technology companies and start-ups. Another large portion of the city’s employed work in the area of finance. Other leading areas of employment include business services (personnel supply, building maintenance, security, computers and data processing, and advertising), retail trade, the tourist and convention industry, and professional services. Many companies, such as Levi Strauss & Co., producer of one of San Francisco’s most famous products, blue jeans, have located their national headquarters in the Bay Area.",
  "From its beginnings as a port of call in the hide-and-tallow trade and, later, as the home port of the Pacific whale fishery, San Francisco has been acutely conscious of the importance of shipping. In the 19th century ships stopped there from their trip around Cape Horn or the Isthmus of Panama, and “steamer day” was a civic institution; after 1914 cargo and passenger vessels arrived from the East by way of the Panama Canal . In 1867 the Pacific Mail Steamship Company opened the first transpacific service, sailing from San Francisco to Yokohama (Japan) and Hong Kong. Imports and exports now passing through the San Francisco Customs District make the combined ports of San Francisco Bay—San Francisco, Oakland, Alameda, Sacramento, and Stockton—one of the most active international ports in the country.",
  " Manufacturing is the main source of income in the Bay Area. In San Francisco, in which manufacturing is a lesser source of income, the principal industries are apparel and other textile products, food processing, and shipbuilding, while the aerospace and electronics industries are strong in the cities of the peninsula.",
  "    Tourism is a major source of income. The bridges , Coit Tower, the museums, the restaurants, Chinatown, North Beach, the Victorian mansions, crooked Lombard Street, and the dazzling Fairmont Hotel are major attractions; Fisherman’s Wharf, however, is the most popular. Families browse the area, watching fishermen prepare the crab catch and mend their nets amid dozens of souvenir shops, street entertainers, restaurants, and bakeries selling one of the city’s specialties, sourdough bread. Getting to Fisherman’s Wharf on the Powell-Hyde Street cable car is a popular route.",
  "  San Francisco’s waterfront offers whale-watching excursions, provides a boat tour from the wharf to Alcatraz Island , and is home to Ghirardelli Square, the onetime chocolate factory; the Cannery, built for the California Fruit Canners Association (now Del Monte Corporation) in 1907, and now a marketplace; Pier 39, reconstructed using timbers from old ships to create a New England look, home to shops and eateries and one of the best seal-watching spots on the coast; the Ferry Building, a ferry terminal on the Embarcadero that also houses a food hall and a farmers market; and the Anchorage, which has a mini-amphitheatre. Nearby is the Marina District, formerly known as Harbor View when its natural amphitheatre was the scene of the 1915 Panama-Pacific International Exposition.",
  "A financial centre since the first pinch of gold dust was exchanged for cash, San Francisco is the seat of the Pacific Stock Exchange as well as the headquarters of many banks and other financial services companies, among them Wells Fargo . Though there are no native, independent banks headquartered in San Francisco, the city still ranks among the nation’s largest investment banking centres.",
  "  Periodic smog, produced mainly by the automobiles in the area, is a serious concern. Freeway traffic is also a problem, as travel from the East Bay cities of Oakland and Berkeley and from Marin county to the north is confined to two great but overburdened bridges. The world’s longest high-level steel bridge, the San Francisco–Oakland Bay Bridge , is 4.5 miles (7.2 km) long; it was completed in 1936 and consists of two back-to-back suspension bridges, a connecting tunnel on Yerba Buena Island, five truss spans, and a cantilever span. The orange-red Golden Gate Bridge , leading north to Marin county, was completed in 1937. It is a pure suspension bridge with a 4,200-foot (1,280-metre) centre span; the spectacular clear span was the longest in the world until 1964 when New York City’s Verrazano-Narrows Bridge opened. At its highest point the bridge is about 260 feet (80 metres) above the bay.",
  "Until the ferries were doomed by the bridges, San Francisco was served by a great network of ferry routes, whose splendid vessels were said to deliver more passengers to the Ferry Building at the foot of Market Street than arrived at any other transportation depot except Charing Cross railway station in London. Only after the bridges began to choke with traffic did the ferries return, on a smaller scale, between San Francisco and Marin county.",
  "A much greater undertaking was the interurban rapid-transit system known as BART (Bay Area Rapid Transit), which began operating in 1972. With service between San Francisco and surrounding communities through an underwater tube more than 3.6 miles (5.8 km) long, BART was the first system of its sort—part subway and part elevated—to be built in half a century. These comfortable, computerized automatic trains run at speeds as high as 80 miles (130 km) per hour.",
  "San Francisco, situated at the head of a peninsula, has always been a dead end for rail traffic. Beginning with the arrival of the first westbound train over the tracks of the Central Pacific on September 6, 1869, transcontinental trains began discharging their passengers in Oakland, where ferries or buses carried them to San Francisco. As in the rest of the country, the railroad’s importance as a passenger carrier declined after World War II.",
  "  The instantly recognizable symbol of San Francisco is the beloved cable car. Invented by Andrew Hallidie (because he felt sorry for the dray horses that were often injured on the steep hills), the system was tested in 1873 and soon adopted by other cities. By the 1880s, cities such as Chicago, Kansas City (Missouri), and Los Angeles had variations of Hallidie’s creation. The other cities eventually abandoned cable cars, but San Francisco has stubbornly clung to the picturesque if archaic, and sometimes dangerous, means of negotiating the hills. Rudyard Kipling was awed by the concept:",
  "I gave up asking questions about their mechanism.…If it pleases Providence to make a car run up and down a slit in the ground for many miles, and if for two-pence-hapenny I can ride in that car, why should I seek reasons for that miracle?",
  "Before the 1906 earthquake 600 cars covered 110 miles (177 km) of the city, but the system was devastated by the quake and much of it was not restored. Today more than two dozen cars operate at peak hours, carrying about 15,000 people daily to limited destinations via three lines.",
  "San Francisco International Airport is located about 7 miles (11 km) south of the city-county limits, occupying a filled site on the southwestern shore of the bay.",
  "  Unlike any other California city, San Francisco (incorporated 1850) has a consolidated city-county government. The 1932 freeholders’ charter, under which the city-county still operates, provides the mayor with strong executive powers but delegates substantial authority to a chief administrative officer (appointed by the mayor) and a controller. The legislative authority is lodged with an elected board of supervisors. The other key officials, who are both appointed, are the superintendent of schools and the manager of utilities.",
  "Since 1934 San Francisco’s principal source of water has been the Hetch Hetchy Reservoir, 167 miles (269 km) away, in the Sierra Nevada. Other sources are the Calaveras and San Antonio reservoirs in Alameda and Santa Clara counties and reservoirs in San Mateo county to the south. The Hetch Hetchy project required the damming of a scenic valley in Yosemite National Park and the construction of tunnels, one 25 miles (40 km) long, through the Coast Range. In 1902 the first high-voltage line transmitting hydroelectric power was completed between a powerhouse on the Mokelumne River and San Francisco, some 180 miles (290 km) in length. Since then, the Bay Area has developed a network of hydroelectric plants on the rivers of the interior, as well as a steam-powered plant on Monterey Bay.",
  "The Bay Area is one of the country’s centres of higher learning. Although strictly speaking they cannot be counted as San Francisco institutions, two of the region’s universities—the University of California , located across the bay in Berkeley (campus opened 1873), and Stanford University (opened 1891), neighbour to Palo Alto down the peninsula—are among the nation’s most prestigious schools. Within San Francisco itself are the University of San Francisco , originally a Jesuit academy established in 1855, and San Francisco State University, which was founded as a normal school in 1899, became a four-year college in 1935, and achieved university status in 1972. Other institutions include Golden Gate University (1853), the City College of San Francisco (1935; a two-year public college), and the San Francisco Art Institute (1871).",
  "A great part of San Francisco’s appeal has been its well-established image as a cultural centre. By 1880 it boasted one of the largest opera houses in the country, the largest hotel, a public park, great churches and synagogues, and a skyline bristling with the mansions of millionaires. Drama and music flourished there, with appearances by such luminaries as Sarah Bernhardt , Edwin Booth , Luisa Tetrazzini , James O’Neill, Lillie Langtry , and Lotta Crabtree . Isadora Duncan , in fact, began teaching modern dance in San Francisco.",
  "  The city’s true artistic calling, however, has been as a mecca for writers. One of the first was Mark Twain , who arrived in time for the great silver boom that came some 10 years after the gold boom faded. Other noted writers were Ambrose Bierce , who came to the city after horrendous experiences in the American Civil War , Jack London , Bret Harte , Frank Norris , Gertrude Atherton , and Robert Louis Stevenson , who lived in great poverty in a boarding house; later came Dashiell Hammett , Stewart Edward White, Kathleen Norris, Erskine Caldwell , William Saroyan , and Wallace Stegner . During the mid-1950s, San Francisco became known as a centre of the Beat movement , and poet Lawrence Ferlinghetti ’s City Lights Bookstore, which was the country’s first to sell paperbacks, became one of the movement’s best-known gathering places. More recent Bay Area authors are Amy Tan , Herbert Gold, Anne Lamott, Ethan Canin, Danielle Steele, and Dave Eggers .",
  "San Francisco is home to two major musical institutions. The San Francisco Symphony performs in the Louise M. Davies Symphony Hall and gives pop concerts in the summer. The San Francisco Opera stages an early season to allow its leading singers to fulfill their commitments at New York City’s Metropolitan Opera. With the exception of American Conservatory Theater (A.C.T.), a resident repertory group, the professional theatre is virtually nonexistent in the city. The surviving downtown theatres are largely occupied by the touring casts of successful Broadway shows.",
  "San Franciscans believe their city is a haven for the artist. While this would hold true for those who value architecture and public sculpture, the painting collections do not rival those of Los Angeles or the East Coast. Notable, however, are the jades and porcelains in the Asian Museum, the Rodin sculptures at the California Palace of the Legion of Honor, the downtown Museum of Modern Art, and the many treasures in such small museums as the Fire Department Pioneer Memorial Museum. While San Francisco’s artistic community does not approach the prominence of its writing establishment, it has produced such notable figures as Wayne Thiebaud and Richard Diebenkorn.",
  "    Several cultural institutions were constructed after the 1906 earthquake, among them the Civic Center (a lovely square sparkling with fountains surrounded by such Renaissance revival-style buildings as City Hall), the public library, and the civic auditorium. Publisher M.H. de Young helped fund the building of the de Young Museum (now under the aegis of Fine Arts Museums of San Francisco, as is the Legion of Honor) in Golden Gate Park, and Adolph and Alma de Bretteville Spreckels sponsored the stately California Palace of the Legion of Honor, which overlooks the Golden Gate Bridge. A spectacular reminder of the 1915 Panama-Pacific International Exposition is found in the monumental Palace of Fine Arts, located in a little park near the waterfront in the Marina District. Housing the Exploratorium (a science museum), the palace is a giant Neoclassical rotunda, which was designed by the architect Bernard Maybeck and completely restored in the 1960s. The Walt Disney Family Museum, celebrating the life and work of the animation pioneer, producer, and showman, was opened in 2009 in the Presidio.",
  "A vital part of San Francisco culture is found in its restaurant s, bars, and hotel s. To this must be added the popular culture of the ethnic enclaves—Chinatown, the Italian community of North Beach, Japantown, the Russian colony along Clement Street, and the Hispanic Mission District.",
  "San Francisco’s first topflight professional sports team was the gridiron football  49ers , who began play in 1946. The team became one of the most successful in National Football League history, winning five Super Bowl titles. San Francisco became, along with Los Angeles, one of the first two West Coast cities to be home to a Major League Baseball franchise when the Giants relocated to San Francisco from New York City in 1958. San Francisco was home to the Golden State Warriors of the National Basketball Association from 1962 until 1971, when the team relocated across the bay to Oakland; the franchise returned to San Francisco in 2019.",
  "In the minds of many, however, San Francisco’s most memorable contribution to the nation’s culture is its past. It was in the late 1960s that the city’s Haight-Ashbury District became a haven for the “flower children” and “ hippies ” who declared themselves in headlong flight from the established society and who preached the saving graces of peace, love, and hallucinogens . However, by the 1970s Haight-Ashbury had become an ugly and dangerous marketplace for drugs and vice. More recently, with the rise in real estate prices all over the city, a gentrification took place in the district, and Haight-Ashbury now boasts a middle-class population and specialty boutiques, upscale restaurants, used bookstores, and the ubiquitous coffeehouses.",
  "It is extraordinary that the site of San Francisco should have been explored first by land instead of from the sea, for San Francisco Bay is one of the most splendid natural harbours of the world, yet great captains and explorers— Juan Rodríguez Cabrillo (1542–43), Sir Francis Drake (1579), and Sebastián Vizcaíno (1602)—sailed unheeding past the entrance. In 1769 a scouting party from an expedition led by the Spanish explorer Gaspar de Portolá looked down from a hilltop onto a broad body of water; they were the first Europeans known to have seen San Francisco Bay. It was not until August 5, 1775, that the first Spanish ship, the San Carlos , commanded by Lieutenant Juan Manuel de Ayala, turned eastward between the headlands, breasted the ebbing tide, and dropped anchor just inside the harbour mouth. It is possible that Drake may have entered the bay, but most evidence suggests otherwise.",
  "Settlers from Monterey, under Lieutenant José Joaquin Moraga and the Reverend Francisco Palóu, established themselves at the tip of the San Francisco peninsula the following year. The military post, which remained in service as the Presidio of San Francisco until 1994, was founded in September 1776, and the Mission San Francisco de Asis, popularly called the Mission Dolores, was opened in October.",
  "Almost half a century later, a village sprang up on the shore of Yerba Buena Cove, 2 miles (3 km) east of the mission. The pioneer settler was an Englishman, Captain William Anthony Richardson, who in 1835 cleared a plot of land and erected San Francisco’s first dwelling—a tent made of four pieces of redwood and a ship’s foresail. In the same year, the United States tried unsuccessfully to buy San Francisco Bay from the Mexican government, having heard reports from whalers and captains in the hide-and-tallow trade that the great harbour held bright commercial possibilities. Richard Henry Dana, whose ship entered the bay in 1835, wrote in Two Years Before the Mast (1840) that “If California ever becomes a prosperous country, this bay will be the centre of its prosperity.”",
  "The Americans had to wait only another 11 years. After fighting began along the Rio Grande, Captain John B. Montgomery sailed the sloop of war Portsmouth into the bay on June 3, 1846, anchored in Yerba Buena Cove, and later went ashore with a party of sailors and marines to raise the U.S. flag in the plaza. On January 30, 1847, Yerba Buena was renamed San Francisco, which was regarded as a more propitious name.",
  "The permanent European population of Yerba Buena in 1844 did not exceed 50 persons. By 1846 the settlement had a population of 375, in addition to 83 African Americans, Native Americans, and Sandwich Islanders (Hawaiians). Two years later, just before the discovery of gold on the American River, the town had grown to about 200 shacks and adobes inhabited by about 800 settlers.",
  "  With the discovery of gold, San Francisco picked up pace and direction. The modest village was at first almost deserted as its population scrambled inland to the Mother Lode, and then it exploded into one of the most extraordinary cities ever constructed. Some 40,000 gold hunters arrived by sea, another 30,000 plodded across the Great Basin, and still another 9,000 moved north from Mexico. By 1851 more than 800 ships rode at anchor in the cove, deserted by their crews.",
  "Everybody except the miners got rich. Eggs sold for one dollar apiece, and downtown real estate claimed prices that would almost hold their own against modern-day appreciated values. Until the bubble burst in the panic of 1857, 50,000 San Franciscans became rich and went bankrupt, cheated and swindled one another, and took to violence all too readily. As The Sacramento Union noted in 1856, there had been “some fourteen hundred murders in San Francisco in six years, and only three of the murderers hung, and one of these was a friendless Mexican.” Two vigilance committees in the 1850s responded to the challenge with crude and extralegal justice, hanging eight men as an example to the others.",
  "In 1859 silver was discovered in the Nevada Territory. The exploitation in Nevada of the Comstock Lode , which eventually yielded some $300 million, turned San Francisco from a frontier boomtown into a metropolis whose leading citizens were bankers, speculators, and lawyers, all of whom ate and drank in splendid restaurants and great hotels. By 1870 San Francisco boasted a population of nearly 150,000.",
  "San Francisco then was by all accounts an intoxicating city whose many charms moved the historian-moralist B.E. Lloyd to advise parents in 1876",
  "to look closer to their daughters, for they know not the many dangers to which they are exposed…and to mildly counsel their sons, for when upon the streets of this gay city they are wandering among many temptations.",
  "The 1860s and ’70s marked the birth of the modern San Francisco, which has since then claimed to be the Athens , Paris , and New York City of the West but has never completely lost its mark of a wild beginning. As Rudyard Kipling was to observe after he visited the city in the 1890s, “San Francisco is a mad city, inhabited for the most part by perfectly insane people.”",
  " Encyclopædia Britannica    While the rest of the world was preparing for World War I , San Francisco held a highly successful World’s Fair —the Panama-Pacific International Exposition—to celebrate the new boost to Western commerce, the opening of the Panama Canal . During the Great Depression , 4,000 longshoremen competed for 1,300 jobs parceled out by the International Longshoremen’s and Warehousemen’s Union. The ILWU fought scabs and union busters at the port on “Bloody Thursday,” July 4, 1934, and then called a citywide general strike, the largest and most successful in the country’s history.",
  " World War II made a significant impact on San Francisco’s prosperity, as it served as a major disembarkation for the Pacific theatre. Great shipyards were built around the bay, and some half million people came to work in the area’s war-related industries; many of them stayed on permanently after the war. The United Nations was born there in 1945, the result of the San Francisco Conference , which took place that year from April to June.",
  "San Francisco in the 1950s was remarkable, not only for its role in the Beat movement but for the number of performers who came to fame in its clubs and cafés: Lenny Bruce , Jonathan Winters , Woody Allen , Phyllis Diller , Barbra Streisand , and Mort Sahl all had their first successes in North Beach venues. The next decade was marked by drugs, hippies, and the violent protests against the Vietnam War . As one wag said, “If you can remember the ’60s in San Francisco, you weren’t there.” The city emerged as a centre of psychedelic rock music, which largely achieved national prominence because of such local groups as the Jefferson Airplane , Grateful Dead , and Quicksilver Messenger Service, as well as such individual performers as Janis Joplin . The city also at that time became a centre for environmentalists and advocates of gay and minority rights. San Francisco was one of the first cities in the country to bus students in order to achieve racial integration; the Save the Bay Association and San Francisco Bay Conservation and Development Commission were formed in the mid-1960s; and in 1969 a group of Native Americans, believing they had a right to unused government land, invaded Alcatraz Island and occupied it until 1971.",
  "Several violent acts put the city in the news in the 1970s. In September 1975 an assassination attempt was made against President Gerald Ford in a downtown square, and in November 1978 the followers of Jim Jones (whose cultlike ministry was based in San Francisco) died in a mass suicide in Jonestown, Guyana . A few days after the Jonestown massacre, Mayor George Moscone and City Supervisor Harvey Milk were murdered at City Hall. These events had a sobering effect on the city, in contrast to the freewheeling atmosphere of the previous decade. However, the city’s first female mayor, Dianne Feinstein , provided crucial stability after Moscone’s assassination. San Francisco also completed BART, its rapid transit system, in the 1970s and established the Golden Gate National Recreation Area, which ultimately comprised some 110 square miles (285 square km) of protected lands in San Francisco, Marin, and San Mateo counties.",
  "San Francisco experienced great growth in the 1980s. The city’s population topped 700,000, not least because of the great influx of immigrants from South Asia. The cost of living skyrocketed, which made San Francisco one of the most expensive cities in the country. The number of automobiles doubled, the popular but deteriorating cable cars received a multimillion-dollar face-lift, tourism became the city’s most lucrative business, and the homeless population grew precipitously, as it did throughout the United States. But by far the most momentous event locally, if not nationally, was the earthquake of 1989.",
  "A milestone was reached in 1995 when the city’s first African American mayor, Willie L. Brown, Jr. , was elected. In 1997 San Franciscans held a candlelight vigil following the death of Pulitzer Prize-winning columnist Herb Caen. The “cool grey city of love” had been Caen’s bailiwick for more than 60 years, and with his death San Francisco lost one of its favourite sons.",
  "With the city’s close connection to Silicon Valley, it was unsurprising when San Francisco’s economy struggled in the wake of the bursting of the dot-com bubble in the early 2000s. During the tenures of Mayors Gavin Newsom (2004–11) and Ed Lee (2011–17), the city bounced back, especially with the second technology boom of the 2010s. This led to a population influx in the already crowded city, sparking a construction boom and a widespread increase in property values. However, it also exacerbated the long-standing homelessness problem in San Francisco and led to criticisms of gentrification as some historically minority-occupied neighbourhoods such as the Mission District and Chinatown saw the arrival of more high-income white residents.",
  "For accounts of the early history of San Francisco, Frank Soulé , John H. Gihon , and James Nisbet , The Annals of San Francisco (1855), is invaluable; whereas B.E. Lloyd , Lights and Shades in San Francisco (1876), is both vivid and divertingly moralistic. Herbert Asbury , The Barbary Coast (1933, reprinted 1968), is a classic account of the underworld; and Julia Cooley Altrocchi , The Spectacular San Franciscans (1949), is a useful social history. John Haskell Kemble , San Francisco Bay: A Pictorial Maritime History (1957, reprinted 1978), contains splendid drawings and photographs. William Bronson , The Earth Shook, the Sky Burned (1959, reprinted 1997), is a first-rate historical account of the 1906 earthquake.",
  "The growth of San Francisco is treated in Gunther Barth , Instant Cities: Urbanization and the Rise of San Francisco and Denver (1975, reissued 1988). John Bernard McGloin , San Francisco: The Story of a City (1978), is a popular history; and Frederick M. Wirt , Power in the City: Decision Making in San Francisco (1974, reissued 1978), is a study of local politics. The Writers’ Program, California , San Francisco: The Bay and Its Cities , new rev. ed. (1973), is a well-known guide; Harold Gilliam , San Francisco Bay (1957), written by the naturalist-conservationist, is authoritative and evocative; and Mel G. Scott , The San Francisco Bay Area: A Metropolis in Perspective , 2nd ed. (1985), is a systematic description of the metropolitan area. Comprehensive books on the city’s history include Gladys Hansen , San Francisco Almanac: Everything You Want to Know About the City , updated and rev. ed. (1980); and Lawrence Ferlinghetti and Nancy J. Peters , Literary San Francisco: A Pictorial History from Its Beginnings to the Present Day (1980). Morton Beebe , San Francisco , new rev. ed. (1993, reissued 1996), includes essays by Herb Caen, Tom Cole, Barnaby Conrad, Herbert Gold, Kevin Starr, and John Hart, as well as vivid photographs of the city. Barnaby Conrad (ed.), The World of Herb Caen (1997), provides a lively account of the life of the newspaper columnist from 1938 to 1997. Richard Saul Wurman and Donna Peck , Access San Francisco , 8th ed. (1999), is a helpful guidebook."
]