[
  "  human eye , in humans, specialized sense organ capable of receiving visual images, which are then carried to the brain.",
  "The eye is protected from mechanical injury by being enclosed in a socket, or orbit, which is made up of portions of several of the bones of the skull to form a four-sided pyramid, the apex of which points back into the head. Thus, the floor of the orbit is made up of parts of the maxilla, zygomatic, and palatine bones, while the roof is made up of the orbital plate of the frontal bone and, behind this, by the lesser wing of the sphenoid. The optic foramen, the opening through which the optic nerve runs back into the brain and the large ophthalmic artery enters the orbit, is at the nasal side of the apex; the superior orbital fissure is a larger hole through which pass large veins and nerves. These nerves may carry nonvisual sensory messages—e.g., pain—or they may be motor nerves controlling the muscles of the eye. There are other fissures and canals transmitting nerves and blood vessels. The eyeball and its functional muscles are surrounded by a layer of orbital fat that acts much like a cushion, permitting a smooth rotation of the eyeball about a virtually fixed point, the centre of rotation. The protrusion of the eyeballs—proptosis—in exophthalmic goitre is caused by the collection of fluid in the orbital fatty tissue.",
  "  It is vitally important that the front surface of the eyeball, the cornea, remain moist. This is achieved by the eyelids, which during waking hours sweep the secretions of the lacrimal apparatus and other glands over the surface at regular intervals and which during sleep cover the eyes and prevent evaporation. The lids have the additional function of preventing injuries from foreign bodies, through the operation of the blink reflex. The lids are essentially folds of tissue covering the front of the orbit and, when the eye is open, leaving an almond-shaped aperture. The points of the almond are called canthi; that nearest the nose is the inner canthus, and the other is the outer canthus. The lid may be divided into four layers: (1) the skin, containing glands that open onto the surface of the lid margin, and the eyelashes; (2) a muscular layer containing principally the orbicularis oculi muscle, responsible for lid closure; (3) a fibrous layer that gives the lid its mechanical stability, its principal portions being the tarsal plates, which border directly upon the opening between the lids, called the palpebral aperture; and (4) the innermost layer of the lid, a portion of the conjunctiva. The conjunctiva is a mucous membrane that serves to attach the eyeball to the orbit and lids but permits a considerable degree of rotation of the eyeball in the orbit.",
  "The conjunctiva lines the lids and then bends back over the surface of the eyeball, constituting an outer covering to the forward part of this and terminating at the transparent region of the eye, the cornea. The portion that lines the lids is called the palpebral portion of the conjunctiva; the portion covering the white of the eyeball is called the bulbar conjunctiva. Between the bulbar and the palpebral conjunctiva there are two loose, redundant portions forming recesses that project back toward the equator of the globe. These recesses are called the upper and lower fornices, or conjunctival sacs; it is the looseness of the conjunctiva at these points that makes movements of lids and eyeball possible.",
  "The fibrous layer, which gives the lid its mechanical stability, is made up of the thick, and relatively rigid, tarsal plates, bordering directly on the palpebral aperture, and the much thinner palpebral fascia, or sheet of connective tissue; the two together are called the septum orbitale. When the lids are closed, the whole opening of the orbit is covered by this septum. Two ligaments, the medial and lateral palpebral ligaments, attached to the orbit and to the septum orbitale, stabilize the position of the lids in relation to the globe. The medial ligament is by far the stronger.",
  "Closure of the lids is achieved by contraction of the orbicularis muscle, a single oval sheet of muscle extending from the regions of the forehead and face and surrounding the orbit into the lids. It is divided into orbital and palpebral portions, and it is essentially the palpebral portion, within the lid, that causes lid closure. The palpebral portion passes across the lids from a ligament called the medial palpebral ligament and from the neighbouring bone of the orbit in a series of half ellipses that meet outside the outer corner of the eye, the lateral canthus, to form a band of fibres called the lateral palpebral raphe. Additional parts of the orbicularis have been given separate names—namely, Horner’s muscle and the muscle of Riolan; they come into close relation with the lacrimal apparatus and assist in drainage of the tears. The muscle of Riolan, lying close to the lid margins, contributes to keeping the lids in close apposition. The orbital portion of the orbicularis is not normally concerned with blinking, which may be carried out entirely by the palpebral portion; however, it is concerned with closing the eyes tightly. The skin of the forehead, temple, and cheek is then drawn toward the medial (nose) side of the orbit, and the radiating furrows, formed by this action of the orbital portion, eventually lead to the so-called crow’s feet of elderly persons. It must be appreciated that the two portions can be activated independently; thus, the orbital portion may contract, causing a furrowing of the brows that reduces the amount of light entering from above, while the palpebral portion remains relaxed and allows the eyes to remain open.",
  "Opening of the eye is not just the result of passive relaxation of the orbicularis muscle but also is the effect of the contraction of the levator palpebrae superioris muscle of the upper lid. This muscle takes origin with the extraocular muscles at the apex of the orbit as a narrow tendon and runs forward into the upper lid as a broad tendon, the levator aponeurosis, which is attached to the forward surface of the tarsus and the skin covering the upper lid. Contraction of the muscle causes elevation of the upper eyelid. The nervous connections of this muscle are closely related to those of the extraocular muscle required to elevate the eye, so that when the eye looks upward the upper eyelid tends to move up in unison.",
  "The orbicularis and levator are striated muscles under voluntary control. The lids also contain smooth (involuntary) muscle fibres that are activated by the sympathetic division of the autonomic system and tend to widen the palpebral fissure (the eye opening) by elevation of the upper, and depression of the lower, lid.",
  "In addition to the muscles already described, other facial muscles often cooperate in the act of lid closure or opening. Thus, the corrugator supercilii muscles pull the eyebrows toward the bridge of the nose, making a projecting “roof” over the medial angle of the eye and producing characteristic furrows in the forehead; the roof is used primarily to protect the eye from the glare of the sun. The pyramidalis, or procerus, muscles occupy the bridge of the nose; they arise from the lower portion of the nasal bones and are attached to the skin of the lower part of the forehead on either side of the midline; they pull the skin into transverse furrows. In lid opening, the frontalis muscle, arising high on the forehead, midway between the coronal suture, a seam across the top of the skull, and the orbital margin, is attached to the skin of the eyebrows. Contraction therefore causes the eyebrows to rise and opposes the action of the orbital portion of the orbicularis; the muscle is especially used when one gazes upward. It is also brought into action when vision is rendered difficult either by distance or the absence of sufficient light.",
  "The outermost layer of the lid is the skin, with features not greatly different from skin on the rest of the body, with the possible exception of large pigment cells, which, although found elsewhere, are much more numerous in the skin of the lids. The cells may wander, and it is these movements of the pigment cells that determine the changes in coloration seen in some people with alterations in health. The skin has sweat glands and hairs. As the junction between skin and conjunctiva is approached, the hairs change their character to become eyelashes.",
  "The eye is kept moist by secretions of the lacrimal glands (tear glands). These almond-shaped glands under the upper lids extend inward from the outer corner of each eye. Each gland has two portions. One portion is in a shallow depression in the part of the eye socket formed by the frontal bone. The other portion projects into the back part of the upper lid. The ducts from each gland, three to 12 in number, open into the superior conjunctival fornix, or sac. From the fornix, the tears flow down across the eye and into the puncta lacrimalia, small openings at the margin of each eyelid near its inner corner. The puncta are openings into the lacrimal ducts; these carry the tears into the lacrimal sacs, the dilated upper ends of the nasolacrimal ducts, which carry the tears into the nose.",
  "The evaporation of the tears as they flow across the eye is largely prevented by the secretion of oily and mucous material by other glands. Thus, the meibomian, or tarsal glands, consist of a row of elongated glands extending through the tarsal plates; they secrete an oil that emerges onto the surface of the lid margin and acts as a barrier for the tear fluid, which accumulates in the grooves between the eyeball and the lid barriers.",
  "Six muscles outside the eye govern its movements. These muscles are the four rectus muscles—the inferior, medial, lateral, and superior recti—and the superior and inferior oblique muscles. The rectus muscles arise from a fibrous ring that encircles the optic nerve at the optic foramen, the opening through which the nerve passes, and are attached to the sclera, the opaque portion of the eyeball, in front of the equator, or widest part, of the eye. The superior oblique muscle arises near the rim of the optic foramen and somewhat nearer the nose than the origin of the rectus medialis. It ends in a rounded tendon that passes through a fibrous ring, the trochlea, that is attached to the frontal bone. The trochlea acts as a pulley. The tendon is attached to the sclera back of the equator of the eye.",
  "The inferior oblique muscle originates from the floor of the orbit, passes under the eyeball like a sling, and is attached to the sclera between the attachments of the superior and lateral rectus muscles. The rectus muscles direct the gaze upward and downward and from side to side. The inferior oblique muscle tends to direct the eye upward, and the superior oblique to depress the eye; because of the obliqueness of the pull, each causes the eye to roll, and in an opposite direction.",
  "The oblique muscles are strictly antagonistic to each other, but they work with the vertical rectus muscles in so far as the superior rectus and inferior oblique both tend to elevate the gaze and the inferior rectus and superior oblique both tend to depress the gaze. The superior and inferior recti do not produce a pure action of elevation or depression because their plane of action is not exactly vertical; in consequence, as with the obliques, they cause some degree of rolling (torsion), but by no means so great as that caused by the obliques; the direction of rolling caused by the rectus muscle is opposite to that of its synergistic oblique; the superior rectus causes the eye to roll inward, and the inferior oblique outward.",
  "  The eyeball is not a simple sphere but can be viewed as the result of fusing a small portion of a small, strongly curved sphere with a large portion of a large, not so strongly curved sphere. The small piece, occupying about one-sixth of the whole, has a radius of 8 mm (0.3 inch); it is transparent and is called the cornea; the remainder, the scleral segment, is opaque and has a radius of 12 mm (0.5 inch). The ring where the two areas join is called the limbus. Thus, on looking directly into the eye from in front one sees the white sclera surrounding the cornea; because the latter is transparent one sees, instead of the cornea, a ring of tissue lying within the eye, the iris. The iris is the structure that determines the colour of the eye. The centre of this ring is called the pupil. It appears dark because the light passing into the eye is not reflected back to any great extent. By use of an ophthalmoscope, an instrument that permits the observer to illuminate the interior of the eyeball while observing through the pupil, the appearance of the interior lining of the globe can be made out. Called the fundus oculi, it is characterized by the large blood vessels that supply blood to the retina; these are especially distinct as they cross over the pallid optic disk, or papilla, the region where the optic nerve fibres leave the globe.",
  "The dimensions of the eye are reasonably constant, varying among normal individuals by only a millimetre or two; the sagittal (vertical) diameter is about 24 mm (about one inch) and is usually less than the transverse diameter. At birth the sagittal diameter is about 16 to 17 mm (about 0.65 inch), it increases rapidly to about 22.5 to 23 mm (about 0.89 inch) by the age of three years, and between age three and 13 the globe attains its full size. The weight is about 7.5 grams (0.25 ounce) and its volume about 6.5 cm 3 (0.4 cubic inch).",
  "The eye is made up of three coats, which enclose the optically clear aqueous humour, lens, and vitreous body. The outermost coat consists of the cornea and the sclera; the middle coat contains the main blood supply to the eye and consists, from the back forward, of the choroid, the ciliary body, and the iris. The innermost layer is the retina, lying on the choroid and receiving most of its nourishment from the vessels within the choroid, the remainder of its nourishment being derived from the retinal vessels that lie on its surface and are visible in the ophthalmoscope. The ciliary body and iris have a very thin covering, the ciliary epithelium and posterior epithelium of the iris, which is continuous with the retina.",
  "Within the cavities formed by this triple-layered coat there are the crystalline lens, suspended by fine transparent fibres—the suspensory ligament or zonule of Zinn—from the ciliary body; the aqueous humour, a clear fluid filling the spaces between the cornea and the lens and iris; and the vitreous body, a clear jelly filling the much larger cavity enclosed by the sclera, the ciliary body, and the lens. The anterior chamber of the eye is defined as the space between the cornea and the forward surfaces of the iris and lens, while the posterior chamber is the much smaller space between the rear surface of the iris and the ciliary body, zonule, and lens; the two chambers both contain aqueous humour and are in connection through the pupil.",
  "The outermost coat is made up of the cornea and the sclera. The cornea is the transparent window of the eye. It contains five distinguishable layers; the epithelium, or outer covering; Bowman’s membrane; the stroma, or supporting structure; Descemet’s membrane; and the endothelium, or inner lining. Up to 90 percent of the thickness of the cornea is made up of the stroma. The epithelium, which is a continuation of the epithelium of the conjunctiva, is itself made up of about six layers of cells. The superficial layer is continuously being shed, and the layers are renewed by multiplication of the cells in the innermost, or basal, layer.",
  "The stroma appears as a set of lamellae, or plates, running parallel with the surface and superimposed on each other like the leaves of a book; between the lamellae lie the corneal corpuscles, cells that synthesize new collagen (connective tissue protein) essential for the repair and maintenance of this layer. The lamellae are made up of microscopically visible fibres that run parallel to form sheets; in successive lamellae the fibres make a large angle with each other. The lamellae in man are about 1.5 to 2.5 microns (one micron = 0.001 mm) thick, so that there are about 200 lamellae in the human cornea. The fibrous basis of the stroma is collagen.",
  "Immediately above the stroma, adjacent to the epithelium, is Bowman’s membrane, about eight to 14 microns thick; with the electron microscope it is evident that it is really stroma, but with the collagen fibrils not arranged in the orderly fashion seen in the rest of the stroma.",
  "Beneath the stroma are Descemet’s membrane and the endothelium. The former is about five to 10 microns thick and is made up of a different type of collagen from that in the stroma; it is secreted by the cells of the endothelium, which is a single layer of flattened cells. There is apparently no continuous renewal of these cells as with the epithelium, so that damage to this layer is a more serious matter.",
  "The sclera is essentially the continuation backward of the cornea, the collagen fibres of the cornea being, in effect, continuous with those of the sclera. The sclera is pierced by numerous nerves and blood vessels; the largest of these holes is that formed by the optic nerve, the posterior scleral foramen. The outer two-thirds of the sclera in this region continue backward along the nerve to blend with its covering, or dural sheath—in fact, the sclera may be regarded as a continuation of the dura mater, the outer covering of the brain. The inner third of the sclera, combined with some choroidal tissue, stretches across the opening, and the sheet thus formed is perforated to permit the passage of fasciculi (bundles of fibres) of the optic nerve. This region is called the lamina cribrosa. The blood vessels of the sclera are largely confined to a superficial layer of tissue, and these, along with the conjunctival vessels, are responsible for the bright redness of the inflamed eye. As with the cornea, the innermost layer is a single layer of endothelial cells; above this is the lamina fusca, characterized by large numbers of pigment cells.",
  "The most obvious difference between the opaque sclera and the transparent cornea is the irregularity in the sizes and arrangement of the collagen fibrils in the sclera by contrast with the almost uniform thickness and strictly parallel array in the cornea; in addition, the cornea has a much higher percentage of mucopolysaccharide (a carbohydrate that has among its repeating units a nitrogenous sugar, hexosamine) as embedding material for the collagen fibrils. It has been shown that the regular arrangement of the fibrils is, in fact, the essential factor leading to the transparency of the cornea.",
  "When the cornea is damaged—e.g., by a virus infection—the collagen laid down in the repair processes is not regularly arranged, with the result that an opaque patch called a leukoma, may occur.",
  "When an eye is removed or a person dies, the cornea soon loses its transparency, becoming hazy; this is due to the taking in of fluid from the aqueous humour, the cornea becoming thicker as it becomes hazier. The cornea can be made to reassume its transparency by maintaining it in a warm, well-aerated chamber, at about 31 °C (88 °F, its normal temperature); associated with this return of transparency is a loss of fluid.",
  "Modern studies have shown that, under normal conditions, the cornea tends to take in fluid, mainly from the aqueous humour and from the small blood vessels at the limbus, but this is counteracted by a pump that expels the fluid as fast as it enters. This pumping action depends on an adequate supply of energy, and any situation that prejudices this supply causes the cornea to swell—the pump fails, or works so slowly that it cannot keep pace with the leak. Death is one cause of the failure of the pump, but this is primarily because of the loss of temperature; place the dead eye in a warm chamber and the reserves of metabolic energy it contains in the form of sugar and glycogen are adequate to keep the cornea transparent for 24 hours or more. When it is required to store corneas for grafting, as in an eye bank, it is best to remove the cornea from the globe to prevent it from absorbing fluid from the aqueous humour. The structure responsible for the pumping action is almost certainly the endothelium, so that damage to this lining can lead to a loss of transparency with swelling.",
  "The cornea is exquisitely sensitive to pain. This is mediated by sensory nerve fibres, called ciliary nerves, that run just underneath the endothelium; they belong to the ophthalmic branch of the fifth cranial nerve, the large sensory nerve of the head. The ciliary nerves leave the globe through openings in the sclera, not in company with the optic nerve, which is concerned exclusively with responses of the retina to light.",
  "The middle coat of the eye is called the uvea (from the Latin for “grape”) because the eye looks like a reddish-blue grape when the outer coat has been dissected away. The posterior part of the uvea, the choroid, is essentially a layer of blood vessels and connective tissue sandwiched between the sclera and the retina. The forward portion of the uvea, the ciliary body and iris, is more complex, containing as it does the ciliary muscle and the sphincter and dilator of the pupil.",
  "The blood supply responsible for nourishing the retina consists of the retinal and uveal circulations, both of which derive from branches of the ophthalmic artery. The two systems of blood vessels differ in that the retinal vessels, which supply nutrition to the innermost layers of the retina, derive from a branch of the ophthalmic artery, called the central artery of the retina, that enters the eye with the optic nerve, while the uveal circulation, which supplies the middle and outer layers of the retina as well as the uvea, is derived from branches of the ophthalmic artery that penetrate the globe independently of the optic nerve.",
  "The ciliary body is the forward continuation of the choroid. It is a muscular ring, triangular in horizontal section, beginning at the region called the ora serrata and ending, in front, as the root of the iris. The surface is thrown into folds, called ciliary processes, the whole being covered by the ciliary epithelium, which is a double layer of cells; the layer next to the vitreous body ( see below ), called the inner layer, is transparent, while the outer layer, which is continuous with the pigment epithelium of the retina, is heavily pigmented. These two layers are to be regarded embryologically as the forward continuation of the retina, which terminates at the ora serrata. Their function is to secrete the aqueous humour.",
  "The ciliary muscle is an unstriped, involuntary, muscle concerned with alterations in the adjustments of focus—accommodation—of the optical system; the fibres run both across the muscle ring and circularly, and the effect of their contraction is to cause the whole body to move forward and to become fatter, so that the suspensory ligament that holds the lens in place is loosened.",
  "The most anterior portion of the uvea is the iris. This is the only portion that is visible to superficial inspection, appearing as a perforated disc, the central perforation, or pupil, varying in size according to the surrounding illumination and other factors. A prominent feature is the collarette at the inner edge, representing the place of attachment of the embryonic pupillary membrane that, in embryonic life, covers the pupil. As with the ciliary body, with which it is anatomically continuous, the iris consists of several layers: namely, an anterior layer of endothelium, the stroma; and the posterior iris epithelium. The stroma contains the blood vessels and the sphincter and dilator muscles; in addition, the stroma contains pigment cells that determine the colour of the eye. Posteriorly, the stroma is covered by a double layer of epithelium, the continuation forward of the ciliary epithelium; here, however, both layers are heavily pigmented and serve to prevent light from passing through the iris tissue, confining the optical pathway to the pupil. The pink iris of the albino is the result of the absence of pigment in these layers. The cells of the anterior layer of the iris epithelium have projections that become the fibres of the dilator muscle; these projections run radially, so that when they contract they pull the iris into folds and widen the pupil; by contrast, the fibres of the sphincter pupillae muscle run in a circle around the pupil, so that when they contract the pupil becomes smaller.",
  "Usually, a baby belonging to the white races is born with blue eyes because of the absence of pigment cells in the stroma; the light reflected back from the posterior epithelium, which is blue because of scattering and selective absorption, passes through the stroma to the eye of the observer. As time goes on, pigment is deposited, and the colour changes; if much pigment is laid down the eye becomes brown or black, if little, it remains blue or gray.",
  "The inner tunic of the rear portion of the globe, as far forward as the ciliary body, is the retina, including its epithelia or coverings. These epithelia continue forward to line the remainder of the globe.",
  "Separating the choroid (the middle tunic of the globe) from the retina proper is a layer of pigmented cells, the pigment epithelium of the retina; this acts as a restraining barrier to the indiscriminate diffusion of material from the blood in the choroid to the retina. The retina ends at the ora serrata, where the ciliary body begins. The pigment epithelium continues forward as a pigmented layer of cells covering the ciliary body; farther forward still, the epithelium covers the posterior surface of the iris and provides the cells that constitute the dilator muscle of this diaphragm. Next to the pigment epithelium of the retina is the neuroepithelium, or rods and cones ( see below ). Their continuation forward is represented by a second layer of epithelial cells covering the ciliary body, so that by the ciliary epithelium is meant the two layers of cells that are the embryological equivalent of the retinal pigment epithelium and the receptor layer (rods and cones) of the retina. This unpigmented layer of the ciliary epithelium is continued forward over the back of the iris, where it acquires pigment and is called the posterior iris epithelium.",
  "  The retina is the part of the eye that receives the light and converts it into chemical energy. The chemical energy activates nerves that conduct the messages out of the eye into the higher regions of the brain. The retina is a complex nervous structure, being, in essence, an outgrowth of the forebrain.",
  "Ten layers of cells in the retina can be seen microscopically. In general, there are four main layers: (1) Next to the choroid is the pigment epithelium, already mentioned. (2) Above the epithelium is the layer of rods and cones, the light-sensitive cells. The changes induced in the rods and cones by light are transmitted to (3) a layer of neurons (nerve cells) called the bipolar cells. These bipolar cells connect with (4) the innermost layer of neurons, the ganglion cells; and the transmitted messages are carried out of the eye along their projections, or axons, which constitute the optic nerve fibres. Thus, the optic nerve is really a central tract, rather than a nerve, connecting two regions of the nervous system, namely, the layer of bipolar cells, and the cells of the lateral geniculate body, the latter being a visual relay station in the diencephalon (the rear portion of the forebrain).",
  "The arrangement of the retinal cells in an orderly manner gives rise to the outer nuclear layer, containing the nuclei of the rods and cones; the inner nuclear layer, containing the nuclei and perikarya (main cell bodies outside the nucleus) of the bipolar cells, and the ganglion cell layer, containing the corresponding structures of the ganglion cells. The plexiform layers are regions in which the neurons make their interconnections. Thus, the outer plexiform layer contains the rod and cone projections terminating as the rod spherule and cone pedicle; these make connections with the dendritic processes of the bipolar cells, so that changes produced by light in the rods and cones are transmitted by way of these connections to the bipolar cells. (The dendritic process of a nerve cell is the projection that receives nerve impulses to the cell; the axon is the projection that carries impulses from the cell.) In the inner plexiform layer are the axons of the bipolar cells and the dendritic processes of the ganglion and amacrine cells ( see below ). The association is such as to allow messages in the bipolar cells to be transmitted to the ganglion cells, the messages then passing out along the axons of the ganglion cells as optic nerve messages.",
  "The photosensitive cells are, in the human and in most vertebrate retinas, of two kinds, called rods and cones, the rods being usually much thinner than the cones but both being built up on the same plan. The light-sensitive pigment is contained in the outer segment, which rests on the pigment epithelium. Through the other end, called the synaptic body, effects of light are transmitted to the bipolar and horizontal cells. When examined in the electron microscope, the outer segments of the rods and cones are seen to be composed of stacks of disks, apparently made by the infolding of the limiting membrane surrounding the outer segment; the visual pigment, located on the surfaces of these disks, is thus spread over a very wide area, and this contributes to the efficiency with which light is absorbed by the visual cell.",
  "The arrangement of the retina makes it necessary for light to pass through the layers not sensitive to light first before it reaches the light-sensitive rods and cones. The optical disadvantages of this arrangement are largely overcome by the development of the fovea centralis, a localized region of the retina, close to the optic axis of the eye, where the inner layers of the retina are absent. The result is a depression, the foveal pit, where light has an almost unrestricted passage to the light-sensitive cells. It is essentially this region of the retina that is employed for accurate vision, the eyes being directed toward the objects of regard so that their images fall in this restricted region. If the object of interest is large, so as to subtend a large angle, then the eye must move rapidly from region to region so as to bring their images successively onto the fovea; this is typically seen during reading. In the central region of the fovea there are cones exclusively; toward its edges, rods also occur, and as successive zones are reached the proportion of rods increases while the absolute density of packing of the receptors tends to decrease. Thus, the central fovea is characterized by an exclusive population of very densely packed cones; here, also, the cones are very thin and in form very similar to rods. The region surrounding the fovea is called the parafovea; it stretches about 1,250 microns from the centre of the fovea, and it is here that the highest density of rods occurs. Surrounding the parafovea, in turn, is the perifovea, its outermost edge being 2,750 microns from the centre of the fovea; here the density of cones is still further diminished, the number being only 12 per hundred microns compared with 50 per hundred microns in the most central region of the fovea. In the whole human retina there are said to be about 7,000,000 cones and from 75,000,000 to 150,000,000 rods.",
  "The fovea is sometimes referred to as the macula lutea (“yellow spot”); actually this term defines a rather vague area, characterized by the presence of a yellow pigment in the nervous layers, stretching over the whole central retina—i.e., the fovea, parafovea, and perifovea.",
  "The blind spot in the retina corresponds to the optic papilla, the region on the nasal side of the retina through which the optic nerve fibres pass out of the eye.",
  "Although the rods and cones may be said to form a mosaic, the retina is not organized in a simple mosaic fashion in the sense that each rod or cone is connected to a single bipolar cell that itself is connected to a single ganglion cell. There are only about 1,000,000 optic nerve fibres, while there are at least 150,000,000 receptors, so that there must be considerable convergence of receptors on the optic pathway. This means that there will be considerable mixing of messages. Furthermore, the retina contains additional nerve cells besides the bipolar and ganglion cells; these, the horizontal and amacrine cells, operate in the horizontal direction, allowing one area of the retina to influence the activity of another. In this way, for example, the messages from one part of the retina may be suppressed by a visual stimulus falling on another, an important element in the total of messages sent to the higher regions of the brain. Finally, it has been argued that some messages may be running the opposite way; they are called centrifugal and would allow one layer of the retina to affect another, or higher regions of the brain to control the responses of the retinal neurons. In primates the existence of these centrifugal fibres has been finally disproved, but in such lower vertebrates as the pigeon, their existence is quite certain.",
  "The pathway of the retinal messages through the brain is described later in this article; it is sufficient to state here that most of the optic nerve fibres in primates carry their messages to the lateral geniculate body, a relay station specifically concerned with vision. Some of the fibres separate from the main stream and run to a midbrain centre called the pretectal nucleus, which is a relay centre for pupillary responses to light.",
  "Within the cavities enclosed by the three layers of the globe described above there are the aqueous humour in the anterior and posterior chambers; the crystalline lens behind the iris; and the vitreous body, which fills the large cavity behind the lens and iris.",
  "The aqueous humour is a clear colourless fluid with a chemical composition rather similar to that of blood plasma (the blood exclusive of its cells) but lacking the high protein content of the latter. Its main function is to keep the globe reasonably firm. It is secreted continuously by the ciliary body into the posterior chamber, and flows as a gentle stream through the pupil into the anterior chamber, from which it is drained by way of a channel at the limbus; that is, the juncture of the cornea and the sclera. This channel, the canal of Schlemm, encircles the cornea and connects by small connector channels to the blood vessels buried in the sclera and forming the intrascleral plexus or network. From this plexus the blood, containing the aqueous humour, passes into more superficial vessels; it finally leaves the eye in the anterior ciliary veins. The wall of the canal that faces the aqueous humour is very delicate and allows the fluid to percolate through by virtue of the relatively high pressure of the fluid within the eye. Obstruction of this exit, for example, if the iris is pushed forward to cover the wall of the canal, causes a sharp rise in the pressure within the eye, a condition that is known as glaucoma. Often the obstruction is not obvious, but is caused perhaps by a hardening of the tissue just adjacent to the wall of the canal—the trabecular meshwork, in which case the rise of pressure is more gradual and insidious. Ultimately the abnormal pressure damages the retina and causes a variable degree of blindness. The normal intraocular pressure is about 15 mm (0.6 inch) of mercury above atmospheric pressure, so that if the anterior chamber is punctured by a hypodermic needle the aqueous humour flows out readily. Its function in maintaining the eye reasonably hard is seen by the collapse and wrinkling of the cornea when the fluid is allowed to escape. An additional function of the fluid is to provide nutrition for the crystalline lens and also for the cornea, both of which are devoid of blood vessels; the steady renewal and drainage serve to bring into the eye various nutrient substances, including glucose and amino acids, and to remove waste products of metabolism.",
  "The vitreous body is a semisolid gel structure that is remarkable for the small amount of solid matter that it contains. The solid material is made up of a form of collagen, vitrosin, and hyaluronic acid (a mucopolysaccharide). Thus, its composition is rather similar to that of the cornea, but the proportion of water is much greater, about 98 percent or more, compared with about 75 percent for the cornea. The jelly is probably secreted by certain cells of the retina. In general, the vitreous body is devoid of cells, in contrast with the lens, which is packed tight with cells. Embedded in the surface of the vitreous body, however, there is a population of specialized cells, the hyalocytes of Balazs, which may contribute to the breakdown and renewal of the hyaluronic acid. The vitreous body serves to keep the underlying retina pressed against the choroid.",
  "The lens is a transparent body, flatter on its anterior than on its posterior surface, and suspended within the eye by the zonular fibres of Zinn attached to its equator; its anterior surface is bathed by aqueous humour, and its posterior surface by the vitreous body. The lens is a mass of tightly packed transparent fibrous cells, the lens fibres, enclosed in an elastic collagenous capsule. The lens fibres are arranged in sheets that form successive layers; the fibres run from pole to pole of the lens, the middle of a given fibre being in the equatorial region. On meridional (horizontal) section, the fibres are cut longitudinally to give an onion-scale appearance, whereas a section at right-angles to this—an equatorial section—would cut all the fibres across, and the result would be to give a honeycomb appearance. The epithelium, covering the anterior surface of the lens under the capsule, serves as the origin of the lens fibres, both during embryonic and fetal development and during infant and adult life, the lens continuing to grow by the laying down of new fibres throughout life.",
  "The first line of protection of the eyes is provided by the lids , which prevent access of foreign bodies and assist in the lubrication of the corneal surface. Lid closure and opening are accomplished by the orbicularis oculi and levator palpebri muscles; the orbicularis oculi operates on both lids, bringing their margins into close apposition in the act of lid closure. Opening results from relaxation of the orbicularis muscle and contraction of the levator palpebri of the upper lid; the smooth muscle of the upper lid, Müller’s muscle, or the superior palpebral muscle, also assists in widening the lid aperture. The lower lid does not possess a muscle corresponding to the levator of the upper lid, and the only muscle available for causing an active lowering of the lid, required during the depression of the gaze, is the inferior palpebral muscle, which is analogous to the muscle of Müller of the upper lid (called the superior palpebral muscle). This inferior palpebral muscle is so directly fused with the sheaths of the ocular muscles that it provides cooperative action, opening of the lid on downward gaze being mediated, in effect, mainly by the inferior rectus.",
  "The seventh cranial nerve —the facial nerve —supplies the motor fibres for the orbicularis muscle. The levator is innervated by the third cranial nerve—the oculomotor nerve—which also innervates some of the extraocular muscles concerned with rotation of the eyeball, including the superior rectus. The smooth muscle of the eyelids and orbit is activated by the sympathetic division of the autonomic system. The secretion of epinephrine (adrenaline) during such states of excitement as fear would also presumably cause contraction of the smooth muscle, but it seems unlikely that this would lead to the protrusion of the eyes traditionally associated with extreme fear. It is possible that the widening of the lid aperture occurring in this excited state and the dilation of the pupil create the illusion of eye protrusion.",
  "Blinking is normally an involuntary act, but it may be carried out voluntarily. The more vigorous “full closure” of the lids involves the orbital portion of the orbicularis muscle and may be accompanied by contraction of the facial muscles that have been described as accessory muscles of blinking—namely, the corrugator supercilii, which on contraction pulls the eyebrows toward the bridge of the nose , and the procerus or pyramidalis, which pulls the skin of the forehead into horizontal folds, acting as a protection when the eyes are exposed to bright light. The more vigorous full closure may be evoked as a reflex response.",
  "Reflex blinking may be caused by practically any peripheral stimulus, but the two functionally significant reflexes are (1) that resulting from stimulation of the endings of the fifth cranial nerve in the cornea , lid, or conjunctiva—the sensory blink reflex, or corneal reflex—and (2) that caused by bright light—the optical blink reflex. The corneal reflex is rapid (0.1 second reflex time) and is the last to disappear in deepening anesthesia , impulses being relayed from the nucleus of the fifth nerve to the seventh cranial nerve, which transmits the motor impulses. The reflex is said to be under the control of a medullary centre. The optical reflex is slower; in humans, the nervous pathway includes the visual cortex (the outer substance of the brain ; the visual centre is located in the occipital—rear—lobe).",
  "In the waking hours, the eyes blink fairly regularly at intervals of two to 10 seconds, the actual rate being a characteristic of the individual. The function of this is to spread the lacrimal secretions over the cornea. It might be thought that each blink would be reflexly determined by a corneal stimulus—drying and irritation—but extensive studies indicate that this view is incorrect. The normal blinking rate is apparently determined by the activity of a “blinking centre” in the globus pallidus of the caudate nucleus, a mass of neurons between the base and the outer substance of the brain. This is not to deny that the blink rate is modified by external stimuli.",
  "There is a strong association between blinking and the action of the extraocular muscles. Eye movement is generally accompanied by a blink, and it is thought that this aids the eyes in changing their fixation point.",
  "The exposed surface of the globe (eyeball) is kept moist by the tears secreted by the lacrimal apparatus, together with the mucous and oily secretions of the other secretory organs and cells of the lids and conjunctiva; these have been described earlier. The secretion produces what has been called the precorneal film, which consists of an inner layer of mucus, a middle layer of lacrimal secretion, and an outer oily film that reduces the rate of evaporation of the underlying watery layer. The normal daily (24-hour) rate of secretion has been estimated at about 0.75 to 1.1 grams (0.03–0.04 ounce avoirdupois); secretion tends to decrease with age. Chemical analysis of the tears reveals a typical body fluid with a salt concentration similar to that of blood plasma . An interesting component is lysozyme , an enzyme that has bactericidal action by virtue of its power of dissolving away the outer coats of many bacteria .",
  "Tears are secreted reflexly in response to a variety of stimuli—e.g., irritative stimuli to the cornea, conjunctiva, nasal mucosa; hot or peppery stimuli applied to the mouth and tongue ; or bright lights. In addition, tear flow occurs in association with vomiting , coughing , and yawning. The secretion associated with emotional upset is called psychical weeping. Severing of the sensory root of the trigeminal (fifth cranial) nerve prevents all reflex weeping, leaving psychical weeping unaffected; similarly, the application of cocaine to the surface of the eye, which paralyzes the sensory nerve endings, inhibits reflex weeping, even when the eye is exposed to potent tear gases. The afferent (sensory) pathway in the reflex is thus by way of the trigeminal nerve. The motor innervation is by way of the autonomic (involuntary) division; the parasympathetic supply derived from the facial nerve (the seventh cranial nerve) seems to have the dominant motor influence. Thus, drugs that mimic the parasympathetic, such as acetylcholine , provoke secretion, and secretion may be blocked by such typical anticholinergic drugs as atropine . Innervation of the lacrimal gland is not always complete at birth, so that the newborn infant is generally said to cry without weeping. Because absence of reflex tearing fails to produce any serious drying of the cornea, and surgical destruction of the main lacrimal gland is often without serious consequences, it seems likely that the subsidiary secretion from the accessory lacrimal glands is adequate to keep the cornea moist. The reflex secretion that produces abundant tears may be regarded as an emergency response.",
  "A drainage mechanism for tears is necessary only during copious secretion. The mechanism, described as the lacrimal pump, consists of alternately negative and positive pressure in the lacrimal sac caused by the contraction of the orbicularis muscle during blinking.",
  "Because only a small portion of the retina , the fovea, is actually employed for distinct vision, it is vitally important that the motor apparatus governing the direction of gaze be extremely precise in its operation, and rapid. Thus, the gaze must shift swiftly and accurately during the process of reading. Again, if the gaze must remain fixed on a single small object—e.g., a golf ball—the eyes must keep adjusting their gaze to compensate for the continuous small movements of the head and to maintain the image exactly on the fovea. The extraocular muscles that carry out these movements are under voluntary control; thus, the direction of regard can be changed deliberately. Most of the actual movements of the eyes are carried out without awareness, however, in response to movements of the objects in the environment, or in response to movements of the head or the rest of the body, and so on. In examining the mechanisms of the eye movements, then, one must resolve them into a number of reflex responses to changes in the environment or the individual, remembering, of course, that there is an overriding voluntary control.",
  "It is worthwhile at this point to define certain axes of the eyes employed during different types of study. The optic axis of the eye is a line drawn through the centre of the cornea and the nodal (central) point of the eye; it actually does not intersect with the retina at the centre of the fovea as might be expected, but toward the nose from this, so that there is an angle of about five degrees between (1) the visual axis—the line joining the point fixated (the point toward which the gaze is directed) and the nodal point—and (2) the optic axis.",
  "  The general modes of action of the six extraocular muscles have been described in connection with their anatomy: rotation of the eye toward the nose is carried out by the medial rectus; outward movement is by the lateral rectus. Upward movements are carried out by the combined actions of the superior rectus and the inferior oblique muscles, and downward movements by the inferior rectus and the superior oblique. Intermediate directions of gaze are achieved by combined actions of several muscles. When the two eyes act together, as they normally do, and change their direction of gaze to the left, for example, the left eye rotates away from the nose by means of its lateral rectus, while the right eye turns toward the nose by means of its medial rectus. These muscles may be considered as a linked pair; that is, when they are activated by the central nervous system this occurs conjointly and virtually automatically. This linking of the muscles of the two eyes is an important physiological feature and has still more important pathological interest in the analysis of squint, when the two eyes fail to be directed at the same point.",
  "The binocular movements (the movements of the two eyes) fall into two classes, the conjugate movements, when both eyes move in the same direction, as in a change in the direction of gaze, and disjunctive movements, when the eyes move in opposite directions. Thus, during convergence onto a near object both eyes move toward the nose; the movement is horizontal, but disjunctive, by contrast with the conjugate movement when both eyes move, say, to the right. The disjunctive movement of convergence can be carried out voluntarily, but the act is usually brought about reflexly in response to the changed optical situation—i.e., the nearness of the object of gaze. A seesaw movement of the eyes, whereby one eye looks upward and the other downward, is possible, but not voluntarily; to achieve this a prism is placed in front on one eye so that the object seen through it appears displaced upward or downward; the other eye sees the object where it is. The result of such an arrangement is that, unless the eye with the prism in front makes an upward or downward movement, independent of the other, the images will not fall on corresponding parts of the retinas in the two eyes. Such a noncorrespondence of the retinal images causes double vision ; to avoid this, there is an adjustment in the alignment of the eyes so that a seesaw movement is actually executed. In a similar way, the eyes may be made to undergo torsion, or rolling. A conjugate torsion, in which both eyes rotate about their anteroposterior (fore-and-aft) axes in the same sense, occurs naturally; for example, when the head tips toward one shoulder, the eyes tend to roll in the opposite direction, with the result that the image of the visual field on the retina tends to remain vertical in spite of the rotation of the head.",
  "The nerves controlling the actions of the muscles are the third, fourth, and sixth cranial nerves, with their bodies (nuclei) in the brainstem ; the third, or oculomotor nerve, controls the superior and inferior recti, the medial rectus, and inferior oblique; the fourth cranial nerve, the trochlear nerve, controls the superior oblique; and the sixth, the abducens nerve, controls the lateral rectus. The nuclei of these nerves are closely associated; especially, there are connections between the nuclei of the sixth cranial nerve, controlling the lateral rectus, and the nucleus of the third, controlling the medial rectus; it is through this close relationship that the linking of the lateral rectus of one eye and the medial rectus of the other, indicated above, is achieved. Another type of linking is concerned with reciprocal inhibition; that is, when there are two antagonistic muscles, such as the medial and the lateral rectus, contraction of one is accompanied by a simultaneous inhibition of the other. Muscles show a continuous slight activity even when at rest; this keeps them taut; this action, called tonic activity, is brought about by discharges in the motor nerve to the muscle. Hence, when the agonist muscle contracts its antagonist must be inhibited.",
  "In examining any reflex movement, one must look for the sensory input—i.e., the way in which messages in sensory nerves bring about discharges in the motor nerves to the muscles. This study involves the connections of the motor nerves or nuclei with other centres of the brain.",
  "When a subject is looking straight ahead and a bright light appears in the periphery of his or her field of vision, the subject’s eyes automatically turn to fix on the light; this is called the fixation reflex. The sensory pathway in the reflex arc leads as far as the cerebral cortex, because removal of the occipital cortex (the outer brain substance at the back of the head) abolishes reflex eye movements in response to light stimuli. If the occipital cortex is stimulated electrically, movements of the eyes may be induced, and in fact one may draw a pattern of the visual field on the occipital cortex corresponding with the directions in which the gaze is turned when given points on the cortex are stimulated. This pattern corresponds with the pattern obtained by recording the visual responses to light stimuli from different parts of the visual field.",
  "The remainder of the pathway—i.e., from the occipital cortex to the motor neurons in the brainstem—has long been considered to involve the superior colliculi as relay stations, and they certainly have such a role in lower animals; but in humans a pathway from the cortex to the eye-muscle nuclei independent of the superior colliculi of the midbrain is now generally assumed.",
  "Continual movements of the eyes occur even when an effort is made to maintain steady fixation of an object. Some of these movements may be regarded as manifestations of the fixation reflex; thus, the eyes tend to drift off their target, and, because of this, the fixation reflex comes into play, bringing the eyes back on target.",
  "Experimentally, the fixation reflex can be studied by observation of the regular to-and-fro movements of the eyes as they follow a rotating drum striped in black and white. (Such movements of the eyes directed at a moving object are called optokinetic nystagmus; nystagmus itself is the involuntary movement of the eye back and forth, up and down, or in a rotatory or a mixed fashion.) While the eyes watch the moving drum, they involuntarily make a slow movement as a result of fixing their gaze on a particular stripe. At a certain point, fixation is broken off, and the eyes spring back to fix on a new stripe. Thus, the nystagmus consists of a slow movement with angular velocity equal to that of the rotation of the drum, then a fast saccade, or jump from one point of fixation to another, in the opposite direction; the process is repeated indefinitely.",
  "Another type of nystagmus reveals the play of another set of reflexes. These are mediated by the semicircular canals—i.e., the organs of balance or the vestibular apparatus. Such a reflex may be evoked by rotating the subject in a chair at a steady speed; the eyes move slowly in the opposite direction to that of rotation and, at the end of their excursion, jump back with a fast saccade in the direction of rotation. If rotation suddenly ceases, the eyes go into a nystagmus in the opposite direction, the postrotatory nystagmus.",
  "During rotation, certain semicircular canals are being stimulated, and the important point is that any acceleration of the head that stimulates these canals will cause reflex movements of the eyes. Thus, acceleration of the head to the right causes a movement of the eyes to the left, the function of the reflex being to enable the eyes to maintain steady fixation of an object despite movements of the head. The reflex occurs even when the eyes are shut, and, when the eyes are open, it obviously cooperates with the fixation reflex in maintaining steady fixation. In many lower animals, this connection between organs of balance and eyes is very rigid; thus, one may move the tail of a fish, and its eyes will move reflexly. In humans, not only do the semicircular canals function in close relation to the eye muscles but so also do the gravity organ—the utricle—and the stretch receptors in the muscles of the neck . Thus, when the head is turned upward, there is a reflex tendency for the eyes to move downward even if the eyes are shut. The actual movement is probably initiated by the reflex from the semicircular canals, which respond to acceleration, but the maintenance of the position is brought about by a reflex through the stretch of the neck muscles and also through the pull of gravity on the utricle, or otolith organ, in the inner ear .",
  "The eyes are under voluntary control, and it is thought that the cortical area subserving voluntary eye movements is in the frontal cortex. Stimulation of this in primates causes movements of the eyes that are well coordinated, and a movement induced by this region prevails over one induced by stimulation of the occipital cortex. The existence of a separate centre in humans is revealed by certain neurological disorders in which the subject is unable to fixate voluntarily but can do so reflexly; e.g., he or she can follow a moving light.",
  "So far, the relation of the movements of the eyes to the requirements of the visual apparatus and their control have been touched upon. To examine the character of the movements in some detail requires rapid, accurate measurement of the movements that the eyes undergo. Modern studies of this subject employ a contact lens fitting on to the globe; on the lens is a small plane mirror, and a parallel bundle of rays is reflected off this mirror onto a moving film.",
  "By the use of refined methods of measuring the position of the eyes at any moment, it becomes immediately evident that the eyes are never stationary for more than a fraction of a second; the movements are of three types: (1) irregular movements of high frequency (30–70 per second) and small excursions of about 20 seconds of arc; (2) flicks, or saccades, of several minutes of arc occurring at regular intervals of about one second; and between these saccades there occur (3) slow irregular drifts extending up to six minutes of arc. The saccades are corrective, serving to bring the fixation axis on the point of regard after this has drifted away from it too far, and thus are a manifestation of the fixation reflex.",
  "The significance of these small movements during fixation was revealed by studies on the stabilized retinal image: by a suitable optical device the image of an object could be held stationary on the retina in spite of the movements of the eye. It was found that under these conditions the image would disappear within a few seconds. Thus, the movements of the eye are apparently necessary to allow the contours of the image to fall on a new set of rods and cones at repeated intervals; if this does not occur, the retina adapts to their stimulus and ceases to send messages to the central nervous system. The small flicks mentioned above are essentially the same as the larger movement made when the two eyes fixate (fix on) a light when it suddenly appears in the peripheral field; this is given the general name of the saccade, to distinguish it from the slower movements occurring during convergence and smooth following.",
  "The dynamics of the saccade have been studied in some detail. There is a reaction time of about 120 to 180 milliseconds, after which both eyes move simultaneously; there is a definite overshoot and, with an excursion of 20°, the operation is completed in about 90 milliseconds. The maximum velocity increases with the extent of the movement, being 300° per second for 10° and 500° per second for 30°. Α remarkable feature is the apparent absence of significant inertia in the eyeball, so that movement is halted, not by any checking action of antagonistic muscles but simply by cessation of contraction of the agonists; thus, the movement is not ballistic. Once under way, the saccade is determined in amount, so that the subject cannot voluntarily alter its direction and extent. The control mechanism for the saccadic type of movement can be described as a sampled data system; i.e., the brain makes discontinuous samples of the position of the eyes in relation to the target and corrects the error, in contrast to a continuous feedback system that takes account of the error all the time.",
  "The movements of the eyes when they converge onto a near object are in remarkable contrast to the saccade; the angular velocity is only about 25° per second, compared with values as high as 500° per second in the saccade. The great difference in speed suggests that the two movements are executed by different muscle fibres. In fact, the extraocular muscles do contain two types of muscle fibre with characteristically different nerve supplies, and studies tend to support this view of a dual mechanism.",
  "If a moving light suddenly appears in the field of view, and if its rate of movement is less than about 30° per second, the response of the eyes is remarkably efficient; a saccade brings the eyes on target, and they follow the motion at almost exactly the same angular velocity as that of the target; inaccuracies in following lead to corrective saccades. When the rate of movement of the target is greater than about 30° per second, these corrective saccades become more obvious because now smooth following is not possible; the eyes make constant-velocity movements, but the velocity rarely matches that of the moving target, so that there must be frequent corrective saccades. Studies have shown that the following movements are highly integrated and must involve a continuous feedback system whereby errors are used to modify the performance. Thus, the systems for control of saccades and tracking movements are fundamentally different.",
  "If one looks into a mirror and fixates one of one’s eyes and then fixates the other, one does not see the eyes moving; and it has been argued that, during an eye movement, vision is suppressed; if vision were not suppressed, moreover, it seems likely that the images of the external world would appear smeared during a movement. Experimental studies have shown that there is, indeed, a suppression of vision during a saccade.",
  "The optical system of the eye is such as to produce a reduced inverted image of the visual field on the retina; the system behaves as a convex lens but is, in fact, much more complex, refraction taking place not at two surfaces, as in a lens, but at four separate surfaces—at the anterior and the posterior surfaces of the cornea and of the crystalline lens. Each of these surfaces is approximately spherical, and at each optical interface—e.g., between air and the anterior surface of the cornea—the bending of a ray of light is toward the axis, so that, in effect, there are four surfaces tending to make rays of light converge on each other. If the rays of light falling on the cornea are parallel—i.e., if they come from a distant point—the net effect of this series of refractions at the four surfaces is to bring these rays to a point focus of the optical system, which in the normal, or emmetropic, eye corresponds with the retina.",
  "The greatest change of direction, or bending of the rays, occurs where the difference of refractive index is greatest, and this is when light passes from air into the cornea, the refractive index of the corneal substance being 1.3376; the refractive indices of the cornea and aqueous humour are not greatly different, that of the aqueous humour being 1.336 (as is that of the vitreous); thus, the bending, as the rays meet the concave posterior surface of the cornea and emerge into a medium of slightly less refractive index, is small. The lens has a greater refractive index than that of its surrounding aqueous humour and vitreous body, 1.386 to 1.406, so that its two surfaces contribute to convergence, the posterior surface normally more than the anterior surface because of its greater curvature (smaller radius).",
  "    In contrast to the focusing of the normal (emmetropic) eye, in which the image of the visual field is focused on the retina, the image may be focused in front of the retina (nearsightedness, or myopia ) or behind the retina (farsightedness or hyperopia ). In myopia the vision of distant objects is not distinct, because the image of a distant point falls within the vitreous and the rays spread out to form a blur circle on the retina instead of a point. In this condition, the eye is said to have dioptric (refractive) power too great for its length. When the focus falls behind the retina, the image of the distant point is again a circle on the retina, and the farsighted eye is said to have too little dioptric power. The important point to appreciate is that emmetropia, or normal sight, requires that the focal power of the dioptric system be matched to the axial length of the eye. It certainly is remarkable that emmetropia is indeed the most common condition when it is appreciated that just one millimetre of error in the matching of axial length with focal length would cause a person to require a spectacle correction. In general, however, the effects of variations in dimensions tend to compensate each other. For example, an unusually large eye might, at first thought, be expected to be myopic, but a large eye tends to be associated with a large radius of curvature of the cornea, and this would reduce the power—i.e., increase the focal length—so an unusually large eye is not necessarily a myopic one.",
  "The image of an object brought close to the eye would be formed behind the retina if there were no change in the focal length of the eye. This change to bring the image of an object upon the retina is called accommodation. The point nearer than which accommodation is no longer effective is called the near point of accommodation. In very young people, the near point of accommodation is quite close to the eye, about 7 cm (about 3 inches) in front at 10 years old. At 40 years the distance has increased to about 16 cm (about 6 inches), and at 60 years it is 100 cm, or 1 metre (39 inches). Thus, a 60-year-old would not be able to read a book held at the convenient distance of about 40 cm (16 inches), and the extra power required would have to be provided by convex lenses in front of the eye, an arrangement called the presbyopic correction.",
  "It is essentially an increase in curvature of the anterior surface of the lens that is responsible for the increase in power involved in the process of accommodation. A clue to the way in which this change in shape takes place is given by the observation that a lens that has been taken out of the eye is much rounder and fatter than one within the eye; thus, its attachments by the zonular fibres to the ciliary muscle within the eye preserve the unaccommodated or flattened state of the lens ; and modern investigations leave little doubt that it is the pull of the zonular fibres on the elastic capsule of the lens that holds the anterior surface relatively flat. When these zonular fibres are loosened, the elastic tension in the capsule comes into play and remolds the lens, making it smaller and thicker. Thus, the physiological problem is to find what loosens the zonular fibres during accommodation. The ciliary muscle has been described earlier, and it has been shown that the effect of contracting its fibres is, in general, to pull the whole ciliary body forward and to move the anterior region toward the axis of the eye by virtue of the sphincter action of the circular fibres. Both of these actions will slacken the zonular fibres and therefore allow the change in shape. As to why it is the anterior surface that changes most is not absolutely clear, but it is probably a characteristic of the capsule rather than of the underlying lens tissue . Defective accommodation in presbyopia is not due to a failure of the ciliary muscle but rather to a hardening of the substance of the lens with age to the point that readjustments of its shape become ever more difficult.",
  "Accommodation is an involuntary reflex act, and the ciliary muscle belongs to the smooth involuntary class. Appropriate to this, the innervation is through the autonomic system , the parasympathetic nerve cells belonging to the oculomotor nerve (the third cranial nerve) occupying a special region of the nucleus in the midbrain called the Edinger-Westphal nucleus; the fibres have a relay point in the ciliary ganglion in the eye socket, and the postganglionic fibres enter the eye as the short ciliary nerves. The stimulus for accommodation is the nearness of the object, but the manner in which this nearness is translated into a stimulus is not clear. Thus, the fact that the image is blurred is not sufficient to induce accommodation; the eye has some power of discriminating whether the blurredness is due to an object being too far away or too close, so that something more than mere blurredness is required.",
  "The amount of light entering the eye is restricted by the aperture in the iris , the pupil . In a dark room, a person’s pupils are large, perhaps 8 mm (0.3 inch) or more in diameter. When the room is lighted, there is an immediate constriction of the pupils, the light reflex. This is bilateral, so that even if only one eye is exposed to the light, both pupils contract to nearly the same extent. After a time, the pupils expand even though the bright light is maintained, but the expansion is not large. The final state is determined by the actual degree of illumination. If this is high, then the final state may be a diameter of only about 3 to 4 mm (about 0.15 inch). If it is not so high, then the initial constriction may be nearly the same, but the final state may be a diameter of 4 to 5 mm (about 0.18 inch). During this steady condition, the pupils do not remain at exactly constant size; there is a characteristic oscillation in size that, if exaggerated, is called hippus.",
  "A pupillary constriction will also occur when a person looks at a near object—the near reflex. Thus, accommodation and pupillary constriction occur together reflexly and are excited by the same stimulus. The function of the pupil is clearly that of controlling the amount of light entering the eye, and hence the light reflex. The constriction occurring during near vision suggests other functions, too; thus, the aberrations of the eye (failure of some refracted rays to focus on the retina) are decreased by reducing the aperture of its optical system. In the dark, aberrations are of negligible significance, so that a person is concerned only with allowing as much light into the eye as possible; in bright light high visual acuity is usually required, and this means reducing the aberrations. The depth of focus of the optical system is increased when the aperture is reduced, and the near reflex is probably concerned with increasing depth of focus under these conditions.",
  "Dilation of the pupil occurs as a result of strong psychical stimuli and also when any sensory nerve is stimulated; dilation thus occurs in extreme fear and in pain .",
  "The muscles of the iris have been described earlier. It is clear from their general features that constriction of the pupil is brought about by shortening of the circular ring of fibres—the sphincter; dilation is brought about by shortening of the radially oriented fibres. The sphincter is innervated by parasympathetic fibres of the oculomotor nerve, with their cell bodies in the Edinger-Westphal nucleus, as are the nerve cells controlling accommodation; thus, the close association between the accommodation and pupillary reflexes is reflected in a close anatomical contiguity of their motor nerve cells.",
  "The sensory pathway in the light reflex involves the rods and cones, bipolar cells, and ganglion cells. As indicated earlier, a relay centre for pupillary responses to light is the pretectal nucleus in the midbrain. There is a partial crossing-over of the fibres of the pretectal nerve cells so that some may run to the motor nerve cells in the Edinger-Westphal nucleus of both sides of the brain , and it is by this means that illumination of one eye affects the other. The Edinger-Westphal motor neurons have a relay point in the ciliary ganglion, a group of neurons in the eye socket, so that its electrical stimulation causes both accommodation and pupillary constriction. Similarly, application of a drug such as pilocarpine to the cornea will cause a constriction of the pupil and a spasm of accommodation. Atropine , by paralyzing the nerve supply, causes dilation of the pupil and paralysis of accommodation (cycloplegia).",
  "The dilator muscle of the iris is activated by sympathetic nerve fibres. Stimulation of the sympathetic nerve in the neck causes a powerful dilation of the iris. Again, the influx of epinephrine (adrenalin) into the blood from the adrenal glands during extreme excitement results in pupillary dilation.",
  "Many involuntary muscles receive a double innervation, being activated by one type of nerve supply and inhibited by the other. Modern experimentation indicates that the iris muscles are no exception, so that the sphincter has an inhibitory sympathetic nerve supply while the dilator has a parasympathetic (cholinergic) inhibitor. Thus, a drug like pilocarpine not only activates the constrictor muscle but actively inhibits the dilator. A similar double innervation has been described for the ciliary muscle. In general, any change in pupillary size results from a reciprocal innervation of dilator and constrictor; thus, activation of the constrictor is associated with inhibition of the dilator and vice versa.",
  "In general, as has been indicated, pupillary constriction and accommodation occur together, in response to the same stimulus; a third element in this near response is, of course, the convergence (turning in) of the eyes, mediated by voluntary muscles, the medial recti. Experimentally, it is often possible to separate these activities, in the sense that one may cause convergence without accommodation by placing appropriate prisms in front of the eyes, or one may cause accommodation without convergence by placing diverging lenses in front of the eyes. There are many experiments that show that accommodation and convergence are neurologically linked to some extent, however.",
  "So far, attention has been directed to what are essentially the preliminaries to vision . It is now time to examine some of the elementary facts of vision and to relate them to the structure of the retina and, later, to chemically identifiable events.",
  "An important means of measuring a sensation is to determine the threshold stimulus—i.e., the minimum energy required to evoke the sensation. In the case of vision, this would be the minimum number of quanta of light entering the eye in unit time. If it is found that the threshold has altered because of a change of some sort, then this change can be said to have altered the subject’s sensitivity to light, and a numerical value can be assigned to the sensitivity by use of the reciprocal of the threshold energy.",
  "Practically, a subject may be placed in the dark in front of a white screen, and the screen may be illuminated by flashes of light. For any given intensity of illumination of the screen, it is not difficult to calculate the flow of light energy entering the eye. One may begin with a low intensity of flash and increase this successively until the subject reports that he or she can see the flash. In fact, at this threshold level, the individual will not see every flash presented, even though the intensity of the light is kept constant. For this reason, a certain frequency of seeing—e.g., four times out of six—must be selected as the arbitrary point at which to fix the threshold.",
  "When measurements of this sort are carried out, it is found that the threshold falls progressively as the subject is maintained in the dark room. This is not due to dilation of the pupil , because the same phenomenon occurs if the subject is made to look through an artificial pupil of fixed diameter. The eye, after about 30 minutes in the dark, may become about 10,000 times more sensitive to light. Vision under these conditions is, moreover, characteristically different from what it is under ordinary daylight conditions. Thus, in order to obtain best vision, the eye must look away from the screen so that the image of the screen does not fall on the fovea. If the screen is continuously illuminated at around this threshold level, it will be found to disappear if its image is brought onto the fovea, and it will become immediately visible on looking away. The same phenomenon may be demonstrated on a moonless night if the gaze is fixed on a dim star : it disappears on fixation and reappears on looking away. This feature of vision under these near-threshold, or scotopic, conditions suggests that the cones are effectively blind to weak light stimuli, since they are the only photoreceptors in the fovea. This is the basis of the duplicity theory of vision, which postulates that when the light stimulus is weak and the eye has been dark-adapted, it is the rods that are utilized because, under these conditions, their threshold is much lower than that of the cones. When the subject first enters the dark, the rods are the less sensitive type of photoreceptor, and the threshold stimulus is the light energy required to stimulate the cones. During the first five or more minutes, the threshold of the cones decreases; i.e., they become more sensitive. The rods then increase their sensitivity to the point that they are the more sensitive, and it is they that now determine the sensitivity of the whole eye, the threshold stimuli obtained after 10 minutes in the dark, for example, being too weak to activate the cones.",
  "When different wavelengths of light are employed for measuring the threshold, it is found, for example, that the eye is much more sensitive to blue-green light than to orange. The interesting feature of this kind of study is that the subject reports only that the light is light; he or she distinguishes no colour . If the intensity of a given wavelength of light is increased step by step above the threshold, a point comes when the subject states that it is coloured. The difference between the threshold for light appreciation and this, the chromatic threshold, is called the photochromatic interval. This suggests that the rods give only achromatic, or colourless, vision, and that it is the cones that permit wavelength discrimination. The photochromatic interval for long wavelengths (red light) is about zero, which means that the intensity required to reach the sensation of light is the same as that to reach the sensation of colour. This is because the rods are so insensitive to red light. If the dark-adaptation curve is plotted for a red stimulus, it is found that it follows the cone path, like that for foveal vision at all wavelengths.",
  "If, when the subject has become completely dark-adapted, one eye is held shut and the other exposed to a bright light for a little while, it is found that, whereas the dark-adapted eye retains its high sensitivity, that of the light-exposed eye has decreased greatly; it requires another period of dark adaptation for the two eyes to become equally sensitive.",
  "These simple experiments pose several problems, the answers to which throw a great deal of light on the whole mechanism of vision. Why, for example, does it require time for both rods and cones to reach their maximum sensitivity in the dark? Again, why is visual acuity so low under scotopic conditions compared with that in daylight, although sensitivity to light is so high? Finally, why do the rods not serve to discriminate different wavelengths?",
  "It may be assumed that a photoreceptor is sensitive to light because it contains a substance that absorbs light and converts this vibrational type of energy into some other form that is eventually transmuted into electrical changes, which may be transmitted from the photoreceptor to the bipolar cell with which it is immediately connected. When the retina of a dark-adapted animal is removed and submitted to extraction procedures, a pigment, originally called visual purple but now called rhodopsin , may be obtained. If the eye is exposed to a bright light for some time before extraction, little or no rhodopsin is obtained. When retinas from animals that had been progressively dark-adapted were studied, a gradual increase in the amount of rhodopsin that could be extracted was observed. Thus, rhodopsin, on absorption of light energy, is changed to some other compound, but new rhodopsin is formed, or rhodopsin is regenerated, during dark adaptation. The obvious inference is that rhodopsin is the visual pigment of the rods and that, when it is exposed to relatively intense light, it becomes useless for vision. When the eye is allowed to remain in the dark, the rhodopsin regenerates and thus becomes available for vision. There is now conclusive proof that rhodopsin is, indeed, the visual pigment for the rods. It is obtained from retinas that have only rods and no cones—e.g., the retinas of the rat or guinea pig—and it is not obtained from the pure cone retina of the chicken.",
  "When the absorption spectrum is measured, it is found that its maximum absorption occurs at the point of maximum sensitivity of the dark-adapted eye. Similar measurements may be carried out on animals, but the threshold sensitivity must be determined by some objective means—e.g., the response of the pupil, or, better still, the electrical changes occurring in the retina in response to light stimuli. Thus, the electroretinogram (ERG) is the record of changes in potential between an electrode placed on the surface of the cornea and an electrode placed on another part of the body, caused by illumination of the eye.",
  "The high sensitivity of the rods by comparison with the cones may be a reflection of the greater concentration in them of pigment that would permit them to catch light more efficiently, or it may depend on other factors—e.g., the efficiency of transformation of the light energy into electrical energy. The pigments responsible for cone vision are not easily extracted or identified, and the problem will be considered in the material on colour vision. An important factor, so far as sensitivity is concerned, is the actual organization of the photoreceptors and neurons in the retina.",
  "The basic structure of the retina has been indicated earlier. As in other parts of the nervous system , the messages initiated in one element are transmitted, or relayed, to others. The regions of transmission from one cell to another are areas of intimate contact known as synapses . An impulse conveyed from one cell to another travels from the first cell body along a projection called an axon , to a synapse, where the impulse is received by a projection, called a dendrite, of the second cell. The impulse is then conveyed to the second cell body, to be transmitted further, along the second cell’s axon.",
  "It will be recalled that the functioning cells of the retina are the photoreceptor cells, the rods and cones; the ganglion cells, the axons of which form the optic nerve ; and cells that act in a variety of ways as intermediaries between the photoreceptors and the ganglion cells. These intermediaries are named bipolar cells, horizontal cells, and amacrine cells.",
  "As was indicated earlier, the synapses occur in definite layers, the outer and inner plexiform layers. In the outer plexiform layer the bipolar cells make their contacts, by way of their dendrites, with the rods and cones, specifically the spherules of the rods and the pedicles of the cones. In this layer, too, the projections from horizontal cells make contacts with rods, cones, and bipolar cells, giving rise to a horizontal transmission and thereby allowing activity in one part of the retina to influence the behaviour of a neighbouring part. In the inner plexiform layer, the axons of the bipolar cells make connection with the dendrites of ganglion cells, once again at special synaptic regions. (The dendrites of a nerve cell carry impulses to the nerve cell; its axon, away from the cell.) Here, too, a horizontal interconnection between bipolar cells is brought about, in this case by way of the axons and dendrites of amacrine cells.",
  "The bipolar cells are of two main types: namely, those that apparently make connection with only one photoreceptor—a cone—and those that connect to several photoreceptors. The type of bipolar cell that connects to a single cone is called the midget bipolar. The other type of bipolar cell is called diffuse. Varieties of the latter include the rod bipolar, the dendritic projections of which spread over an area wide enough to allow contacts with as many as 50 rods, and the flat cone bipolar, which collects messages from up to seven cones.",
  "Ganglion cells are of two main types: namely, the midget ganglion cell, which apparently makes a unique connection with a midget bipolar cell, which in turn is directly connected to a single cone; and a diffuse type, which collects messages from groups of bipolar cells.",
  "The presence of diffuse bipolar and ganglion cells collecting messages from groups of photoreceptors and bipolar cells and, what may be even more important, the presence of lateral connections of groups of photoreceptors and bipolar cells through the horizontal and amacrine cells means that messages from photoreceptors over a rather large area of the retina may converge on a single ganglion cell. This convergence means that the effects of light falling on the receptive field may be cumulative, so that a weak light stimulus spread over about 1,000 rods is just as effective as a stronger stimulus spread over 100 or fewer. In other words, a large receptive field will have a lower threshold than a small one. This is, in fact, the basis for the high sensitivity of the area immediately outside the fovea, where there is a high density of rods that converge on single bipolar cells. Thus, if it is postulated that the cones do not converge to anything like the same extent as the rods, the greater sensitivity of the latter may be explained, and the anatomical evidence favours this postulate.",
  "It has been indicated above that the regeneration of visual pigment is a cause of the increased sensitivity of the rods that occurs during dark adaptation. This, apparently, is only part of the story. An important additional factor is the change in functional organization of the retina during adaptation. When the eye is light-adapted, functional convergence is small, and sensitivity of rods and cones is low; as dark adaptation proceeds, convergence of rods increases. The anatomical connections do not change, but the power of the bipolar cells and ganglion cells to collect impulses is increased, perhaps by the removal of an inhibition that prevents this during high illumination of the retina.",
  "As was indicated earlier, the threshold is best indicated in terms of frequency of seeing since, because of fluctuations in the threshold, there is no definite luminance of a test screen at which it is always seen by the observer, and there is no luminance just below this at which it is never seen. Experiments, in which 60 percent was arbitrarily taken as the frequency of seeing and in which the image of a patch of light covered an area of retina containing about 20,000,000 rods, led to the calculation that the mean threshold stimulus represents 2,500 quanta of light that is actually absorbed per square centimetre of retina. This calculation leads to two important conclusions: namely, that at the threshold only one rod out of thousands comes into operation, and that during the application of a short stimulus the chances are that no rod receives more than a single quantum.",
  "A quantum, defined as the product of Planck’s constant (6.63 × 10 −27 erg-second) times the frequency of light, is the minimum amount of light energy that can be employed. A rod excited by a single quantum cannot excite a bipolar cell without the simultaneous assistance of one or more other rods. Experiments carried out in the 1940s indicated that a stimulus of about 11 quanta is required; thus, it may require 11 excited rods, each receiving one quantum of light, to produce the sensation of light.",
  "With such small amounts of energy as those involved in the threshold stimulus, the uncertainty principle becomes important; according to this, there is no certainty that a given flash will have the expected number of quanta in it, but only a probability. Thus, one may speak of a certain average number of quanta and the actual number in any given flash, and one may compute on statistical grounds the shape of curve that is obtained by plotting frequency with which a flash contains, say, four quanta or more against the average number in the flash. One may also plot the frequency with which a flash is seen against the average number of quanta in the flash, and this frequency-of-seeing curve turns out to be similar to the frequency-of-containing-quanta curve when the number of quanta chosen is five to seven, depending on the observer. This congruence strongly suggests that the fluctuations in response to a flash of the same average intensity are caused by fluctuations in the energy content of the stimulus, and not by fluctuations in the sensitivity of the retina.",
  "In spatial summation, two stimuli falling on nearby areas of the retina add their effects; though either alone may be inadequate to evoke the sensation of light, they may do so when presented simultaneously. Thus, the threshold luminance of a test patch required to be just visible depends, within limits, on its size, a larger patch requiring a lower luminance and vice versa. Within a small range of limiting area—namely, that subtending about 10 to 15 minutes of arc—the relationship called Ricco’s law holds: threshold intensity multiplied by the area equals a constant. This means that over this area, which embraces several hundred rods, light falling on the individual rods summates, or accumulates, its effects completely, so that 100 quanta falling on a single rod are as effective as one quantum falling simultaneously on 100 rods. The basis for this summation is clearly the convergence of photoreceptors on ganglion cells, the chemical effects of the quanta of light falling on individual rods being converted into electrical changes that converge on a single bipolar cell through its branching dendritic processes. Again, the electrical effects induced in the bipolar cells may summate at the dendritic processes of a ganglion cell, so that the receptive field of a ganglion cell may embrace many thousands of rods.",
  "In temporal summation, two stimuli, each being too weak to excite, cause a sensation of light if presented in rapid succession on the same spot of the retina; thus, over a certain range of times, up to 0.1 second, the Bunsen-Roscoe law holds: namely, that the intensity of light multiplied by the time of exposure equals a constant. Thus it was found that within this time interval (up to 0.1 second), the total number of quanta required to excite vision was 130, irrespective of the manner in which these were supplied. Beyond this time, summation was still evident, but it was not perfect, so that if the duration was increased to one second the total number of quanta required was 220. Temporal summation is consistent with quantum theory; it has been shown that fluctuations in the number of quanta actually in a light flash are responsible for the variable responsiveness of the eye; increasing the duration of a light stimulus increases the probability that it will contain a given number of quanta, and that it will excite.",
  "In the central nervous system generally, the relay of impulses from one nerve cell, or neuron , to excite another is only one aspect of neuronal interaction. Just as important, if not more so, is the inhibition of one neuron by the discharge in another. So it is in the retina. Subjectively, the inhibitory activity is reflected in many of the phenomena associated with adaptation to light or its reverse. Thus, the decrease in sensitivity of the retina to light during exposure to light is only partially accounted for by bleaching of visual pigment, be it the pigment in rod or cone; an important factor is the onset of inhibitory processes that reduce the convergence of photoreceptors on ganglion cells. Some of the rapidly occurring changes in sensitivity described as alpha adaptation are doubtless purely neural in origin.",
  "Many so-called inductive phenomena indicate inhibitory processes. Thus, the phenomenon of simultaneous contrast, whereby a patch of light appears much darker if surrounded by a bright background than by a black, is due to the inhibitory effect of the surrounding retina on the central region, induced by the bright surrounding. Many colour-contrast phenomena are similarly caused. Thus, if a blue light is projected onto a large white screen, the white screen rapidly appears yellow; the blue stimulus falling on the central retina causes inhibition of blue sensitivity in the periphery, and, hence, the white background will appear to be missing its blue light—white minus blue is a mixture of red and green—i.e., yellow. Particularly interesting from this viewpoint are the phenomena of metacontrast; by this is meant the inductive effect of a primary light stimulus on the sensitivity of the eye to a previously presented light stimulus on an adjoining area of retina. It is a combination of temporal and spatial induction. The effect is produced by illuminating the two halves of a circular patch consecutively for a brief duration. If the left half only, for example, is illuminated for 10 milliseconds it produces a definite sensation of brightness. If, now, both halves are illuminated for the same period, but the right half from 20 to 50 milliseconds later, the left half of the field appears much darker than before and, near the centre, may be completely extinguished. The left field has thus been inhibited by the succeeding, nearby, stimulus. The right field, moreover, appears darker than when illuminated alone—it has been inhibited by the earlier stimulus (paracontrast).",
  "Another visual phenomenon that brings out the importance of inhibition is the sensation evoked when a visual stimulus is repeated rapidly. For example, one may view a screen that is illuminated by a source of light the rays from which may be intercepted at regular intervals by rotating a sector of a circular screen in front of it. If the sector rotates slowly, a sensation of black followed by white is aroused. As the speed increases, the sensation becomes one of flicker—i.e., rapid fluctuations in brightness. Finally, at a certain speed, called the critical fusion frequency, the sensation becomes continuous and the subject is unaware of the alterations in the illumination of the screen.",
  "At high levels of luminance, when cone vision is employed, the fusion frequency is high, increasing with increasing luminance in a logarithmic fashion—the Ferry-Porter law—so that at high levels it may require 60 flashes per second to reach a continuous sensation. Under conditions of night, or scotopic, vision, the frequencies may be as low as four per second. The difference between rod and cone vision in this respect probably resides in the power of the eye to inhibit activity in cones rapidly, so that the sensation evoked by a single flash is cut off immediately, and this leaves the eye ready to respond to the next stimulus. By contrast, the response in the rod lasts so much longer that, when a new stimulus falls even a quarter of a second later, the difference in the state of the rods is insufficient to evoke a change in intensity of sensation; it merely prolongs it. One interesting feature of an intermittent stimulus is that the intensity of the sensation of brightness, when fusion is achieved, is dependent on the relative periods of light and darkness in the cycle, and this gives one a method of grading the effective luminance of a screen; one may keep the intensity of the illuminating source constant and merely vary the period of blackness in a cycle of black and white. The effective luminance will be the average luminance during a cycle; this is known as the Talbot-Plateau law.",
  "As has been stated, the ability to perceive detail is restricted in the dark-adapted retina when the illumination is such as to excite only the scotopic type of vision; this is in spite of the high sensitivity of the retina to light under the same conditions. The power of distinguishing detail is essentially the power to resolve two stimuli separated in space, so that, if a grating of black lines on a white background is moved farther and farther away from observers, a point is reached when they will be unable to distinguish this stimulus pattern from a uniformly gray sheet of paper. The angle subtended at the eye by the spacing between the lines at the point where they are just resolvable is called the resolving power of the eye. The reciprocal of this angle, in minutes of arc, is called the visual acuity. Thus, a visual acuity of unity indicates a power of resolving detail subtending one minute of arc at the eye; a visual acuity of two indicates a resolution of one-half minute, or 30 seconds of arc. The visual acuity depends strongly on the illumination of the test target, and this is true of both daylight (photopic) and night (scotopic) vision. Thus, with a brightly illuminated target, with the surroundings equally brightly illuminated (the ideal condition), the visual acuity may be as high as two. When the illumination is reduced, the acuity falls, so that, under ordinary conditions of daylight viewing, visual acuity is not much better than unity. Under scotopic conditions, the visual acuity may be only 0.04, so that lines would have to subtend about 25 minutes at the eye to be resolvable; this corresponds to a thickness of 4.4 cm (1.7 inches) at a distance of 6 metres (20 feet).",
  "In the laboratory, visual acuity is measured by the Landolt C, which is a circle with a break in it. The subject is asked to state where the break is when the figure is rotated to successive random positions. The size of the C , and thus of its break, is reduced until the subject makes more than an arbitrarily chosen percentage of mistakes. The angle subtended at the eye by the break in the C at this limit is taken as the resolving power of the eye. The testing of the eyes by the ophthalmologist or optometrist is essentially a determination of visual acuity. Here the subject is presented with the Snellen chart , rows of letters whose details subtend progressively smaller angles at the eye. The row in which, say, five out of six letters are seen correctly is chosen as that which measures the visual acuity. If the details subtended one minute of arc, the visual acuity would be unity. The notation employed is somewhat obscure; a visual acuity of unity would be expressed as 6/6; an acuity of a half as 6/12, and so on; here the numerator is the viewing distance in metres from the chart and the denominator the distance at which details on the letters of the limiting row subtend one minute of arc at the eye.",
  "From an anatomical point of view, one may expect the limit to resolving power to be imposed by the “grain” of the retinal mosaic, in the same way that the size of the grains in a light-sensitive photographic emulsion imposes a limit to the accuracy with which detail may be captured in analog photography. Two white lines on a black ground, for example, could not be appreciated as distinct if their images fell on the same or adjacent sets of photoreceptors. If a set of photoreceptors intervened between the stimulated ones, there would be a basis for discrimination, because the message sent to the central nervous system could be that two rows of photoreceptors, separated by an unstimulated row, were sending messages to their bipolar cells. On this basis, the limit to resolution should be the diameter of a foveal cone, or rather the angle subtended by this at the nodal point of the eye. This is about 30 seconds of arc, which, in fact, corresponds to the best visual acuity attainable.",
  "If this grain of the retinal mosaic is to be the basis of resolution, however, one must postulate, in addition, a nervous mechanism that will transmit accurately the events taking place in the individual photoreceptors, in this case the foveal cones. That is, there must be a one-to-one relationship between cones, bipolar cells, ganglion cells, and lateral geniculate cells, so that what is called the local sign of the impulses from a given foveal cone may be obtained. It must be appreciated that restriction on convergence (or its reverse, spread) of messages may be achieved by inhibition: the anatomical connections may be there, but they may be made functionally inoperative by inhibition exerted by other neurons. Thus, the horizontal and amacrine cells might well exert a restraining influence on certain junctions, thereby reducing the spread, or convergence, of messages. It seems likely that the improvement in foveal visual acuity from one to two, brought about by increased luminance of the target and its surroundings, is achieved by an increase in inhibition that tends to make transmission one-to-one in the fovea.",
  "It must be appreciated that true one-to-one connections in the retina do not exist. A cone, although making an exclusive type of synapse with a midget bipolar, may also make a less exclusive contact with a flat bipolar cell. Furthermore, midget bipolars and cones are connected laterally by amacrine and horizontal cells, so that it is most unlikely that a given optic nerve fibre carries messages from only a single cone. The one-to-one relationship may in fact exist under certain conditions, but that is because pathways from other photoreceptors have been blocked, or occluded, by inhibitory processes that keep the line clear for a given cone.",
  "The low visual acuity obtained in night, or rod, vision is now understandable. It has been pointed out that a high sensitivity to light is achieved by the convergence of rods on the higher neurons to allow spatial summation, and it is this convergence that interferes with the resolution of detail. If hundreds of rods converge on a single bipolar cell and if many bipolar cells converge on a single ganglion cell, it is understandable that the unit responsible for resolution may be very large and thus that the visual acuity is very small.",
  "It has been implied, in the comments on visual acuity, that the limiting factor is one of an anatomical arrangement of photoreceptors and of their neural organization. A very important feature, however, must be the accuracy of the formation of an image of external objects by the optical system of the eye. It may be calculated, for example, that the image of a grating produces lines 0.5 micron wide on the retina , but this is on the basis of ideal geometrical optics. In fact, the optics of the eye are not perfect, and diffraction of light by its passage through the pupil further spoils the image. As a result of these defects, the image of a black-and-white grating on the retina is not sharp, the black lines being not completely black but gray because of spread of light from the white lines. (When the optical system of the eye is defective, moreover, as in nearsightedness, or myopia , the imagery is worse, but this can be corrected by the use of appropriate lenses.) Physiologically, the eye effectively improves the retinal image by enhancing contrasts. Thus, the image of a fine black line on a white background formed on the retina is not a sharply defined black line but a relatively wide band of varying degrees of grayness, yet, to the observer, the line appears sharply defined. This is because of lateral inhibition: the photoreceptors that receive the most light tend to inhibit those that receive less. The result is a physiological “sharpening of the image,” so that the eye often behaves as though the image were perfect. This applies to chromatic aberration too, which should cause black-and-white objects to appear fringed with colour, yet, because of suppression of the chromatic responses, one is not aware of the coloured fringes that do in effect surround the images of objects in the external world.",
  "The iris behaves as a diaphragm, modifying the amount of light entering the eye. Probably of greater significance than control of the light entering the eye is the influence on aberrations of the optical system. In general, the smaller the pupil, the less serious the aberrations. The smaller the pupil, however, the more serious the effects of diffraction become, so that a balance must be struck. Experimentally, it is found that, at high luminances with pupils below 3 mm (0.12 inch) in diameter, the visual acuity is not improved by further reduction of the diameter; increasing the pupil size beyond this reduces acuity, presumably because of the greater optical aberrations. It is interesting that when a subject is placed in a room that is darkened steadily, the size of the pupil increases, and the size attained for any given level of luminance is, in fact, optimal for visual acuity at this particular luminance. The reason that visual acuity increases with the larger pupils is that the extra light admitted into the eye compensates for the increased aberrations.",
  "When the gaze is fixed intently on an object for a long time, peripheral images that tend to disappear reappear immediately when the eyes are moved. This effect is called the Troxler phenomenon. To study it reproducibly, it is necessary to use an optical device that ensures that the image of any object upon which the gaze is fixed will remain on the same part of the retina however the eyes move. When this is achieved, the stabilized retinal image tends to fade within a few seconds. It may be assumed that in normal vision the normal involuntary movements—the microsaccades and drifts mentioned earlier—keep the retinal image in sufficient movement to prevent the fading. This is essentially an example of sensory adaptation, the tendency for any receptive system to cease responding to a maintained stimulus.",
  "Subjective studies on humans can traverse only a certain distance in the interpretation of visual phenomena; beyond this the standard electrophysiological techniques, which have been successful in unravelling the mechanisms of the central nervous system, must be applied to the eye; this, as repeatedly emphasized, is an outgrowth of the brain.",
  "Records from single optic nerve fibres of the frog and from the ganglion cell of the mammalian retina indicated three types of response. In the frog there were fibres that gave a discharge when a light was switched on the “on-fibres.” Another group, the “off-fibres,” remained inactive during illumination of the retina but gave a powerful discharge when the light was switched off. A third group, the “on-off fibres,” gave discharges at “on” and “off” but were inactive during the period of illumination. The responses in the mammal were similar but more complex than in the frog. The mammalian retina shows a background of activity in the dark, so that on- and off-effects are manifest as accentuations or diminutions of this normal discharge. In general, on-elements gave an increased discharge when the light was switched on and an inhibition of the background discharge when the light was switched off. An off-element showed inhibition of the background discharge during illumination and a powerful discharge at off; this off-discharge is thus a release of inhibition and reveals unmistakably the inhibitory character of the response to illumination that takes place in some ganglion cells. Each ganglion cell or optic nerve fibre tested had a receptive field, and the area of frog’s retina from which a single fibre could be activated varied with the intensity of the light stimulus. The largest field was obtained with the strongest stimulus, so that, in order for a light stimulus falling some distance from the centre of the field to affect this particular fibre, it had to be much more intense than a light stimulus falling on the centre of the field. This means that some synaptic pathways are more favoured than others.",
  "The mammalian receptive field is more complex, with the peripheral part of the field giving the opposite type of response compared with that given by the centre. Thus, if at the centre of the field, the response was “on” (an on-centre field), the response to a stimulus farther away in the same fibre was “off,” and in an intermediate zone it was often mixed to give an on-off element. In order to characterize an element, therefore, it must be called on-centre or off-centre, with the meaning thereby that at the centre of its receptive field its response was “on” or “off,” respectively, while in the periphery it was opposite. By studying the effects of small spot stimuli on centre and periphery separately and together, a mutual inhibition is found between the two. A striking feature is the effect of adaptation. After dark adaptation, the surrounding area of opposite activity becomes ineffective. In this sense, therefore, the receptive field shrinks, but, as it is a reduction in inhibitory activity between centre and periphery, it means, in fact, that the effective field—i.e., the regions over which summation can occur—can actually increase during dark adaptation, and this is exactly what is found in psychophysical experiments on dark adaptation.",
  "The receptive field is essentially a measure of the number of photoreceptors— rods or cones or a mixture of these—that make nervous connections with a single ganglion cell. The organization of centre and periphery implies that the photoreceptors in the periphery of an on-centre cell tend to inhibit it, while those in the centre of the field tend to excite it, so that the effects of a uniform illumination covering the whole field tend to cancel out. This has an important physiological value, as it means, in effect, that the brain is not bombarded with an enormous number of unnecessary messages, as would be the case were every ganglion cell to send discharges along its optic nerve fibre as long as it was illuminated. Instead, the cell tends to respond to change—i.e., the movement of a light or dark spot over the receptive field—and to give an especially prominent response, often when the spot passes from the periphery to the centre or vice versa. Thus, the centre-periphery organization favours the detection of movement. In a similar way, it favours the detection of contours, because these give rise to differences in the illumination of the parts of the receptive fields. The anatomical basis of the arrangement presumably is given by the organization of the bipolar and amacrine cells in relation to the dendrites of the ganglion cell; it is interesting that the actual diameter of the centre of the receptive field of a ganglion cell is frequently equal to the area over which its dendrites spread. The periphery exerts its effects presumably by means of amacrine cells that are capable of connecting with bipolars over a wide area. These amacrine cells could exert an inhibitory action on the bipolar cells connected to the photoreceptors of the central zone of the field, preventing them from responding to these photoreceptors; in this case, the ganglion cell related to these bipolars would be of an on-centre and off-periphery type.",
  "When examining the receptive fields of rabbit ganglion cells, investigators found some that gave a maximal response when a moving spot of light passed in a certain “preferred” direction, while they gave no response at all when the spot passed in the opposite direction; in fact, the spontaneous activity of the cell was usually inhibited by this movement in the “null” direction. It may be assumed that the photoreceptors connected with this type of ganglion cell are organized in a linear fashion, so that the stimulation of one photoreceptor causes inhibition of a photoreceptor adjacent to it. This inhibition would prevent the excitatory effect of light on the adjacent photoreceptor from having a response when the movement was in the null direction, but it would arrive too late at the adjacent photoreceptor if the light were moving in the preferred direction.",
  "If an electrode is placed on the cornea and another, indifferent electrode is placed, for example, in the mouth, illumination of the retina is followed by a succession of electrical changes; the record of these is the electroretinogram, or ERG. Modern analysis has shown that the electrode on the cornea picks up changes in potential occurring successively at different levels of the retina, so that it is now possible to recognize, for example, the electrical changes occurring in the rods and cones—the photoreceptor potentials—those occurring in the horizontal cells, and so on. In general, the electrical changes caused by the different types of cell tend to overlap in time, so that the record in the electroretinogram is only a faint and attenuated index to the actual changes; nevertheless, it has, in the past, been a most valuable tool for the analysis of retinal mechanisms. Thus, the most prominent wave—called the b -wave—is closely associated with discharge in the optic nerve, so that in humans and other animals the height of the b -wave can be used as an objective measure of the response to light. Hence, the sensitivity of the dark-adapted frog’s retina to different wavelengths, as indicated by the heights of the b -waves, can be plotted against wavelength to give a typical scotopic sensitivity curve, with a maximum at 5000 angstroms (1 angstrom = 1 × 10 −4 micron) corresponding to the maximum for absorption of rhodopsin .",
  "Electrophysiology has been used as a tool for the examination of the basic mechanism of flicker and fusion. The classical studies based on the electroretinogram indicated that the important feature that determines fusion in the cone-dominated retina is the inhibition of the retina caused by each successive light flash, inhibition being indicated by the a -wave of the electroretinogram. In the rod-dominated retina—e.g., in humans under scotopic conditions—the a -wave is not prominent, and fusion depends simply on the tendency for the excitatory response to a flash to persist, the inhibitory effects of a succeeding stimulus being small. More modern methods of analysis, in which the discharges in single ganglion cells in response to repeated flashes are measured, have defined fairly precisely the nature of fusion, which, so far as the retinal message is concerned, is a condition in which the record from the ganglion cell becomes identical to the record observed in the ganglion cell during spontaneous discharge during constant illumination.",
  "Although the resolving power of the retina depends, in the last analysis, on the size and density of packing of the photoreceptors in the retina, it is the neural organization of the photoreceptors that determines whether the brain will be able to make use of this theoretical resolving power. It is therefore of interest to examine the responses of retinal ganglion cells to gratings, either projected as stationary images onto the receptive field or moved slowly across it. One group of investigators showed that ganglion cells of the cat differed in sensitivity to a given grating when the sensitivity was measured by the degree of contrast between the black and white lines of the grating necessary to evoke a measurable response in a ganglion cell. When the lines were made very fine (i.e., the “grating-frequency” was high), a point was reached at which the ganglion cell failed to respond, however great the contrast; this measured the resolving power of the particular cell being investigated. The interesting feature of this work is that individual ganglion cells had a special sensitivity to particular grating-frequencies, as if the ganglion cells were “tuned” to particular frequencies, the frequencies being measured by the number of black and white lines in a given area of retina. When the same technique was applied to human subjects, the electrical changes recorded from the scalp being taken as a measure of the response, the same results were obtained.",
  "The spectrum, obtained by refracting light through a prism , shows a number of characteristic regions of colour —red, orange, yellow, green, blue, indigo, and violet. These regions represent large numbers of individual wavelengths; thus, the red extends roughly from 7600 angstrom units to 6500, the yellow from 6300 to 5600, green from 5400 to 5000, blue from 5000 to 4200, and violet from 4200 to 4000. Thus, the limits of the visual spectrum are commonly given as 7600 to 4000 angstroms. In fact, however, the retina is sensitive to ultraviolet light to 3500 angstroms, the failure of the short wavelengths to stimulate vision being due to absorption by the ocular media. Again, if the infrared radiation is strong enough, wavelengths as long as 10,000–10,500 angstroms evoke a sensation of light.",
  "Within the bands of the spectrum, subtle distinctions in hue may be appreciated. The power of the eye to discriminate light on the basis of its wavelength can be measured by projecting onto the two halves of a screen lights of different wavelengths. When the difference is very small—e.g., five angstroms—no difference can be appreciated. As the difference is increased, a point is reached when the two halves of the screen appear differently coloured. The hue discrimination (hue is the quality of colour that is determined by wavelength) measured in this way varies with the region of the spectrum examined; thus, in the blue-green and yellow it is as low as 10 angstroms, but in the deep red and violet it may be 100 angstroms or more. Thus, the eye can discriminate several hundreds of different spectral bands, but the capacity is limited. If it is appreciated that there are a large number of nonspectral colours that may be made up by mixing the spectral wavelengths, and by diluting these with white light, the number of different colours that may be distinguished is high indeed.",
  "At extremely low intensities of stimuli, when only rods are stimulated, the retina shows a variable sensitivity to light according to its wavelength, being most sensitive at about 5000 angstroms, the absorption maximum of the rod visual pigment, rhodopsin. In the light-adapted retina, one may plot a similar type of curve, obtained by measuring the relative amounts of light energy of different wavelengths required to produce the same sensation of brightness. Now the different stimuli appear coloured, but the subject is asked to ignore the colours and match them on the basis of their luminosity (brightness). This is carried out with a special instrument called the flicker-photometer. There is a characteristic shift in the maximum sensitivity from 5000 angstroms for scotopic (night) vision to 5550 angstroms for photopic (day) vision, the so-called Purkinje shift. It has been suggested that the cones have a pigment that shows a maximum of absorption at 5550 angstroms, but the phenomena of colour vision demand that there be three types of cones, with three separate pigments having maximum absorption in the red, green, and blue, so that it is more probable that the photopic luminosity curve is a reflection of the summated behaviour of the three types of cones rather than of one.",
  "The Purkinje shift has an interesting psychophysical correlate. It may be observed, as evening draws on, that the luminosities of different colours of flowers in a garden change: the reds become much darker or black, while the blues become much brighter. What is happening is that, in this range of luminosities, called mesopic, both rods and cones are responding, and, as the rod responses become more pronounced—i.e., as darkness increases—the rod luminosity scale prevails over that of the cones.",
  "It may be assumed that the sensation of luminosity under any given condition is determined by certain ganglion cells that make connections to all three types of cones and also to rods; at extremely low levels of illumination, their responses are determined by the activity aroused in the rods. As the luminance is increased, the ganglion cell is activated by both rods and cones, and so its luminosity curve is governed by both rod and cone activity. Finally, at extremely high luminances, when the rods are “saturated” and ceasing to respond, the luminosity curve is, in effect, compounded of the responses of all three types of cones.",
  "The fundamental principle of colour mixing was discovered by Isaac Newton when he found that white light separates spatially into its different component colours on passing through a prism. When the same light is passed through another prism, so that the individual bands of the spectrum are superimposed on each other, the sensation becomes one of white light. Thus, the retina, when white light falls on it, is really being exposed to all the wavelengths that make up the spectrum. Because these wavelengths fall simultaneously on the same photoreceptors, the evoked sensation is one of white. If the wavelengths are spread out spatially, they evoke separate sensations, such as red or yellow, according to which photoreceptors receive which bands of wavelengths. In fact, the sensation of white may be evoked by employing much fewer wavelengths than those in the spectrum, namely by mixing three primary hues—red, green, and blue.",
  "Furthermore, any colour, be it a spectral hue or not, may be matched by a mixture of these three primaries, red, green, and blue, if their relative intensities are varied. Many of the colours of the spectrum can be matched by mixtures of only two of the primary colours, red and green; thus, the sensations of red, orange, yellow, and green may be obtained by adding more and more green light to a red one.",
  "To one accustomed to mixing pigments, and to mixing a blue pigment, for example, with yellow to obtain green, the statement that red plus green can give yellow or orange, or that blue plus yellow can give white, may sound strange. The mixing of pigments is essentially a subtractive process, however, as opposed to the additive process of throwing differently coloured lights on a white screen. Thus, a blue pigment is blue because it reflects mainly blue (and some green) light and absorbs red and yellow; and a yellow pigment reflects mainly yellow and some green and absorbs blue and red. When blue and yellow pigments are mixed and white light falls on the mixture, all bands of colour are absorbed except for the green colour band.",
  "Subjects with colour-defective vision are those whose wavelength discrimination apparatus is not as good as that of the majority of people. They see many colours as identical that people with normal vision see as different. About 1 percent of males and a much smaller percentage of females are dichromats; that is, they can mix all the colours of the spectrum, as they see them, with only two primaries instead of three. Thus, protanopes (people with red blindness) require only blue and green to make colour matches. Whereas for people with normal (trichromatic) vision the various reds, oranges, yellows, and many greens are the result of mixing red and green, protanopes match all these with a green. In other words, protanopes are unable to distinguish all these hues from one another on the basis of their colour. If a protanope distinguishes them, it is because of differences in their luminosity (brightness). The protanope matches white with a mixture of blue and green and is, in fact, unable to distinguish between white and bluish green. Deuteranopes (people with green blindness) match all colours with a mixture of red and blue. Thus, the deuteranope’s white is a mixture of red and blue that appears purple to a person with normal vision. The deuteranope also is unable to discriminate reds, oranges, yellows, and many greens. Consequently, both types of dichromats are classed as red-green blind. For the protanope, however, the spectrum is more limited, because the individual is unable to appreciate red. Tritanopes (people with blue blindness) are rare, constituting only 1 in 13,000 to 65,000 of the population. Because tritanopes are blue blind, their colour discrimination is best in the region of red to green, where that of protanopes and deuteranopes is worse.",
  "The scotopic (night) visual system, mediated by rods, is unable to discriminate between different wavelengths. Thus, a threshold stimulus of light with a wavelength of 4800 angstroms gives a sensation of light that is indistinguishable from that evoked by a wavelength of 5300 angstroms. If the intensities are increased, however, the lights evoke sensations of blue and green, respectively. Unlike cones, rods are unable to mediate wavelength, or colour, discrimination, because the rods form a homogeneous population, all containing the same photopigment, rhodopsin. Thus, the response of a neuron connected with a rod or a group of rods will vary with the wavelength of light. When the response, measured in frequency of discharge in the bipolar or ganglion cell, is plotted against the wavelength of the stimulating light, the curve is essentially similar to the absorption spectrum of rhodopsin when the same amount of energy is in each stimulus. Thus, blue-green of 5000 angstroms has the most powerful effect, because it is absorbed most efficiently, while violet and red have the smallest effects. In this sense, the rods behave as wavelength discriminators, but it is to be noted that there are pairs of wavelengths on each side of the peak to which the same response is obtained; thus, a blue of 4800 angstroms and a yellow of 6000 angstroms give the same discharge. Moreover, if the intensity of the stimulus is varied, a new curve is obtained, and now the same response is obtained with a high intensity of violet at 4000 angstroms as with blue at the lower intensity. In general, it is easy to show that, by varying the intensity of the stimulus of a single wavelength, all types of response may be obtained, so that the brain would never receive a message indicating, in a unique fashion, that the retina was stimulated with, say, green light of 5300 angstroms; the same message could be given by blue light of 4800 angstroms, red light of 6500 angstroms, and so on.",
  "Ideally, colour discrimination would require a large number of photoreceptors specifically sensitive to small bands of the spectrum, but the number would have to be extremely large because the capacity for hue discrimination is extremely great, as has been indicated. In fact, however, the phenomena of colour mixing suggest that the number of photoreceptors may be limited.",
  "It was the phenomena of colour mixing that led Thomas Young in 1802 to postulate that there are three photoreceptors, each one especially sensitive to one part of the spectrum; these photoreceptors were thought to convey messages to the brain, and, depending on how strongly they were stimulated by the coloured light, the combined message would be interpreted as that due to the actual colour. The theory was developed by Hermann Ludwig Ferdinand von Helmholtz , and is called the Young-Helmholtz trichromatic theory. As expressed in modern terms, it is postulated that there are three types of cone in the retina, characterized by the presence of one of three different pigments, one absorbing preferentially in the red part of the spectrum, another in the green, and another in the blue. A coloured stimulus—e.g., a yellow light—would stimulate the red and green photoreceptors, but would have little effect on the blue; the combined sensation would be that of yellow, which would be matched by stimulating the eye with red and green lights in correct proportions of relative intensity. A given coloured stimulus would, in general, evoke responses in all three photoreceptors, and it would be the pattern of these responses—e.g., blue strongly, green less strongly, and red weakest—that would determine the quality of the sensation. The intensity of the sensation would be determined by the average frequencies of discharge in the photoreceptors. Thus, increasing the intensity of the stimulus would clearly change the responses in all the photoreceptors, but if they maintained the same pattern, the sensation of hue might remain unaltered and only that of intensity would change; the observer would say that the light was brighter but still bluish green. Thus, with several photoreceptors, the possibility is reduced of confusion between stimuli of different intensity but the same wavelength composition; the system is not perfect because the laws of colour mixing show that the eye is incapable of certain types of discrimination, as, for example, between yellow and a mixture of red and green, but as a means of discriminating subtle changes in the environment the eye is a very satisfactory instrument.",
  "The direct proof that the eye does contain three types of cone has been secured, but only relatively recently. This was done by examining the light emerging from the eye after reflection off the retina; in the dark-adapted eye the light emerging was deficient in blue light because this had been preferentially absorbed by the rhodopsin. In the light-adapted eye, when only cone pigments are absorbing light, the emerging light can be shown to be deficient in red and green light because of the absorption by pigments called erythrolabe and chlorolabe. Again, the light passing through individual cones of the excised human retina can be examined by a microscope device, and it was shown by such examination that cones were of three different kinds according to their preference for red, green, and blue lights.",
  "If the three types of cones respond differently to light stimuli, one may expect to find evidence for this difference in type of response by examining the electrophysiological changes taking place in the retina; ideally, one should like to place a microelectrode in or on a cone, then in or on its associated bipolar cell, and so on up the visual pathway. In the earliest studies, the optic nerve fibres of the frog were examined—i.e., the axons of ganglion cells. The light-adapted retina was stimulated with wavelengths of light stretching across the spectrum, and the responses in arbitrarily selected single fibres were examined. The responses to stimuli of the same energy but different wavelengths were plotted as frequency of discharge against wavelength, and the fibres fell into several categories, some giving what the investigator called a dominator response, the fibre responding to all wavelengths and giving a maximum response in the yellow-green at 5600 angstroms. Other fibres gave responses only over limited ranges of wavelengths, and their wavelengths of maximum response tended to be clustered in the red, green, and blue regions. The investigator called these modulators, and considered that the message in the dominator indicated to the brain the intensity of the stimulus—i.e., it determined the sensation of brightness—while the modulators indicated the spectral composition of the stimulus, the combined messages in all the modulators resulting in a specific colour sensation. In the dark-adapted retina, when only rods were being stimulated, the response was of the dominator type, but this time the maximum response occurred with a wavelength of 5000 angstroms, the absorption maximum of rhodopsin.",
  "A more careful examination of the responses in single fibres, especially in the fish, which has good colour vision , showed that things were not quite as simple as the original investigator had thought because, as has been seen, the response of a ganglion cell, when light falls on its receptive field in the retina, is not just a discharge of action potentials that ceases when the light is switched off. This type of response is rare; the most usual ganglion cell or optic nerve fibre has a receptive field organized in a concentric manner, so that a spot of light falling in the central part of the field produces a discharge, while a ring of light falling on the surrounding area has the opposite effect, giving an off-response—i.e., giving a discharge only when the light is switched off. Such a ganglion cell would be called an on-centre-off-periphery unit; others behaved in the opposite way, being off-centre-on-periphery.",
  "When these units are examined with coloured lights, and when care is taken to stimulate the centres and surrounding areas separately, an interesting feature emerges; the centre and surrounding areas usually have opposite or opponent responses. Thus, some may be found giving an on-response to red in the centre of the field and an off-response to green in the surrounding area, so that simultaneous stimulation of centre with red and surrounding area with green gives no response, the inhibitory effect of the off-type of response cancelling the excitatory effect of the on-type. With many other units the effects were more complex, the centre giving an on-response to red and an off-response to green, while the surrounding area gave an off-response to red and an on-response to green, and vice versa. This opponent organization probably subserves several functions. First, it enables the retina to emphasize differences of colour in adjacent parts of the field, especially when the boundary between them moves, as indeed it is continually doing in normal vision because of the small involuntary movements of the eyes. Second, it is useful in “keeping the retina quiet”; there are about one million optic nerve fibres, and if all these were discharging at once the problem of sorting out their messages, and making meaning of them, would be enormous; by this “opponence,” diffuse white light falling on many of these chromatic units would have no effect because the inhibitory surrounding area cancelled the excitatory centre, or vice versa. When the light became coloured, however, the previously inactive units could come into activity.",
  "These responses show that, by the time the effect of light has passed out of the eye in the optic nerve, the message is well colour-coded. Thus, all the evidence points to the correctness of the Young-Helmholtz hypothesis with respect to the three-colour basis. The three types of photoreceptor, responding to different regions of the spectrum in specific manners, transmit their effects to bipolar and horizontal cells. The latter neurons have been studied from the point of view of their colour-coding. The potentials recorded from them were called S -potentials; these were of two types, which classified them as responding to colour ( C -units) and luminosity ( L -units).",
  "The C -type of cell gave an opponent type of response, in the sense that the electrical sign varied with the wavelength band, red and green having opponent effects on some cells, and blue and yellow on others. These responses reflect the connections of the horizontal cells to groups of different cones, the blue-yellow type, for example, having connections with blue and red and green cones, while the red-green would have connections only with red and green cones.",
  "As indicated above, the cells at the next stage, the ganglion cells, give a fairly precisely coded set of messages indicating the chromatic (colour) quality and the luminosity (brightness) of the stimulus, organized in such a way, however, as to facilitate the discrimination of contrast. At higher stages—e.g., in the cells of the lateral geniculate body—this emphasis on opponence, or contrast, is maintained and extended; thus, several types of cell have been described that differ in accordance with the organization of their receptive fields from the colour aspect; some were very similar to ganglion cells, while others differed in certain respects. Some showed no opponence between colours when centre and periphery were compared, so that if a red light on the periphery caused inhibition, green and blue light would also do so. Others had no centre-periphery organization, the receptive field consisting of only a central spot; different colours had different effects on this spot; and so on.",
  "In the cerebral cortex there is the same type of opponence with many units, but because cortical cells require stimuli of definite shape and often are not activated by simple spot stimuli, early studies carried out before these requirements were known probably failed to elucidate the true chromatic requirements of these high-order neurons. In general, the responses are what might be predicted on the basis of connections made to lateral geniculate neurons having the chromatic responses already known. Thus, the final awareness of colour probably depends on the bombardment of certain higher-order cortical neurons by groups of primary cortical neurons, each group sending a different message by virtue of the connections it makes to groups of cones, connections mediated, of course, through the neurons of the retina and lateral geniculate body.",
  "For the energy of light to exert its effect it must be absorbed; it has been stated above that the action-spectrum for vision (the sensitivity of the eye to light) in the completely dark-adapted eye has a maximum in the region of 5000 angstroms, and that this corresponds with the maximum of absorption of light by the pigment, rhodopsin, extracted from the dark-adapted retina of the same species. The chemical nature of rhodopsin must now be examined, as well as its localization in the rod and the changes it undergoes in response to the absorption of light. It must be appreciated at the outset that the amount of light energy absorbed by a single rod at the threshold for vision is extremely small—namely, one quantum—and this is quite insufficient to provide the energy required to cause an electrical change in the membrane of the rod that will be propagated from the point of absorption of the light to the rod spherule (which takes part in the synapse between rod and bipolar cell). There must, therefore, be a chemical amplification process taking place within the rod, and the absorption of a quantum must be viewed as the trigger that sets off other changes, which in turn provide the required amount of energy.",
  "Visual purple, or rhodopsin , is a chromoprotein, a protein , opsin, with an attached chromatophore (“pigment-bearing”) molecule that gives it its colour —i.e., that allows it to absorb light in the visible part of the spectrum. In the absence of such a chromatophore , the protein would only absorb in the ultraviolet and so would appear colourless to the eye. The chromatophore group was identified as retinal, which is the substance formed by oxidation of vitamin A; on prolonged exposure of the eye to light , retinal can be found, free from the protein opsin, in the retina. When the eye is allowed to remain in the dark, the rhodopsin is regenerated by the joining up of retinal with opsin. Thus, one may write: rhodopsin ⇌ retinal + opsin. The incidence of light on the retina causes the reaction to go to the right (that is, causes rhodopsin to form retinal plus opsin), and this photochemical change causes the sensation of light. The process is reversed by a thermal—i.e., non-photochemical—reaction, so that for any given light intensity a steady state is reached with the regenerative process just keeping pace with the photochemical bleaching. Dark adaptation, or one element in it, is the regenerative process. The change in the rhodopsin molecule that leads to its bleaching—i.e., the splitting off of the retinal molecule—takes place in a succession of steps; and there is reason to believe that the electrical change in the rod that eventually evokes the sensation of light occurs at a stage well before the splitting off of the retinal. One may describe as a transduction process the chemical events that take place between the absorption of light and the electrical event, whatever that may be; the rod behaves as a transducer in that it converts light into electrical or neural energy.",
  "Immediately after absorption of a quantum, the rhodopsin molecule is changed into a substance called prelumirhodopsin, recognized by its different colour from that of rhodopsin; this product is so highly unstable that at body temperature it is converted, without further absorption of light, into a series of products. These changes may be arrested by cooling the solution to −195 °C (−319 °F), at which temperature prelumirhodopsin remains stable; on warming to −140 °C (−220 °F) prelumirhodopsin becomes lumirhodopsin, with a slightly different colour; on warming further, successive changes are permitted until finally retinal is split off from the opsin to give a yellow solution. The important point to appreciate is that only at this stage is the chromatophore group split off; the earlier products have involved some change in the structure of the chromoprotein, but not so extreme as to break off the retinal. The precise nature of these changes is not yet completely elucidated, but the most fundamental one—namely, that occurring immediately after absorption of the quantum—has been shown to consist in a change in shape of the retinal molecule while it is still attached to opsin.",
  "Thus, retinal, like vitamin A , can exist in several forms because of the double bonds in its carbon chain—the so-called cis-trans  isomerism . In other words, the same group of atoms constituting the retinal molecule can be twisted into a number of different shapes, although the sequence of the atoms is unaltered. While attached to the opsin molecule in the form of rhodopsin, the retinal has a shape called 11- cis , being somewhat folded, while on conversion to prelumirhodopsin the retinal has a straighter shape called all- trans ; the process is called one of photoisomerization, the absorption of light energy causing the molecule to twist into a new shape. Having suffered this alteration in shape, the retinal presumably causes some instability in the opsin, making it, too, change its shape, and thereby exposing to the medium in which it is bathed chemical groupings that were previously shielded by being enveloped in the centre of the molecule. It may be assumed that these changes in shape induce alterations in the light-absorbing character of the molecule that permit the recognition of the new forms of molecule represented by lumirhodopsin, metarhodopsins I and II, and so on.",
  "The final change is more drastic because it involves the complete splitting off of the retinal. An earlier stage—namely, the conversion of metarhodopsin I to metarhodopsin II—has been shown recently to involve a bodily change in position of the retinal, which in rhodopsin is linked to the lipid (fatty) portion of the molecule, whereas in metarhodopsin II it is found to have become attached to an amino acid in the backbone-chain of the protein (amino acids are subunits of proteins). Thus, in its native unilluminated state, retinal is attached to a lipid, which is presumably linked to the protein, so that rhodopsin is more properly called a chromolipoprotein rather than a chromoprotein. The outer segments of the rods are, as has been stated, constituted by membranous disks, and it is well established that the material from which these membranes are constructed is predominantly lipid, so that one may envisage the rhodopsin molecules as being, in fact, part of the membrane structure. The techniques used for extraction presumably tear the molecules from the main body of the lipid, but some of the lipid remains with the protein and retinal to constitute the link holding these two parts together.",
  "Within the retina these chemical changes are all reversible, so that when a steady light is maintained on the retina the latter will contain a mixture of several or all of the intermediate compounds. In the dark, all will be gradually reconverted to rhodopsin. Because lack of vitamin A, from which retinal is derived, causes night blindness , some of the retinal must get lost from the eye to the general circulation; and it is actually replaced by the cells of the pigment epithelium , which are closely associated with the rods.",
  "As to which of these chemical changes acts as the trigger for vision, there is some doubt. The discovery that the transition from metarhodopsin I to metarhodopsin II involves an actual shift of the retinal part of the molecule from linkage to lipid to linkage to protein reinforces the idea that this particular shift is sufficient to lead ultimately to electrical discharges in the optic nerve.",
  "So far as colour vision is concerned, the changes that take place in the three cone pigments have not been analyzed, simply because, so far, they have defied isolation, presumably because their concentrations are so much less than that of the rod pigment.",
  "  The axons of the ganglion cells converge on the region of the retina called the papilla or optic disk. They leave the globe as the optic nerve , in which they maintain an orderly arrangement in the sense that fibres from the macular zone of the retina occupy the central portion, the fibres from the temporal half of the retina take up a concentric position, and so on; when outside the orbit, there is a partial decussation (crossover). The fibres from the nasal halves of each retina cross to the opposite side of the brain , while those from the temporal halves remain uncrossed. This partial decussation is called the chiasma. The optic nerves after this point are called the optic tracts, containing nerve fibres from both retinas. The result of the partial decussation is that an object in, say, the right-hand visual field produces effects in the two eyes that are transmitted to the left-hand side of the brain only. With cutaneous (skin) sensation there is a complete crossing-over of the sensory pathway; thus, information from the right half of the body, and the right visual field, is all conveyed to the left-hand part of the brain by the time that it has reached the diencephalon (the posterior part of the forebrain ).",
  "Partial decussation is an arrangement that serves the needs of frontally directed eyes and permits binocular vision, which consists in the fusion of the responses of both eyes to a single object—more loosely, one speaks of the fusion of the retinal images. In many lower mammals , with laterally directed eyes and therefore limited binocular vision, the degree of decussation is much greater, so that in the rat, for example, practically all of the optic nerve fibres pass to the opposite side of the brain.",
  "The fibres of the optic tracts relay their messages to neurons in those parts of the diencephalon called the lateral geniculate bodies, and from the lateral geniculate bodies the messages are relayed to neurons in the occipital cortex of the same side. (The occipital cortex is the outer substance in the posterior portion of the brain.)",
  "  If one eye is fixed on a point in space, the visual field for this eye may be thought of as the part of a surface of a sphere on to which all visible objects are projected. The limits to this field will be determined by the sensitivity and extent of the retina and the accessibility of light rays from the environment. Experimentally or clinically, the field is measured on a perimeter, a device for ascertaining the point on a given meridian where a white spot just appears or disappears from vision when moved along this meridian. (A meridian is a curve on the surface of a sphere that is formed by the intersection of the sphere surface and a plane passing through the centre of the sphere.) The field is recorded on a chart. On the nasal side, the field is restricted to about 60° from the midline. This is due to the obstruction caused by the nose, since the retina extends nearly as far forward on the temporal side of the globe as on the nasal side. It is customary to refer to the binocular visual field as that common to the two eyes, the uniocular field being the extreme temporal (outside) region peculiar to each eye. The binocular field is determined in the horizontal meridian by the nasal field of each eye, and so will amount to about 60° to either side of the vertical meridian.",
  "The dorsal (posterior) nucleus of the lateral geniculate body, where the optic tract fibres relay, has six layers, and the crossed fibres relay in layers 1, 4, and 6, while the uncrossed relay in layers 2, 3, and 5; thus, at this level, the impulses from the two eyes are kept separate, and when the discharges in geniculate neurons are recorded electrically it is rare to find any responding to stimuli in both eyes.",
  "The optic tract fibres make synapses with nerve cells in the respective layers of the lateral geniculate body, and the axons of these third-order nerve cells pass upward to the calcarine fissure (a furrow) in each occipital lobe of the cerebral cortex. This area is called the striate area because of bands of white fibres—axons from neurons in the retina—that run through it. It is also identified as Brodmann area 17. It is at this level that the impulses from the separate eyes meet at common cortical neurons, so that when the discharges in single cortical neurons are recorded it is usual to find that they respond to light falling in one or the other eye. It is probable that it is when the retinal messages have reached this level of the central nervous system, and not before, that the human subject becomes aware of the visual stimulus, since destruction of the area causes absolute blindness in humans. Because of the partial decussation, however, the removal of only one striate cortex will not cause complete blindness in either eye, since only messages from two halves of the retinas will have been blocked; the same will be true if one optic tract is severed or one lateral geniculate body is destroyed. The result of such lesions will be half-blindness, or hemianopia, the messages from one half of the visual field being obliterated.",
  "Some of the fibres in the optic tracts do not relay in the lateral geniculate bodies but pass instead to a midbrain region—the pretectal centre—where they mediate (transmit) reflex alterations in the size of the pupil. Thus, in bright light, the pupils are constricted; this happens by virtue of the pupillary light reflex mediated by these special nerve fibres. Removal of the occipital cortex, although it causes blindness in the opposite visual field, does not destroy the reaction of the pupils to light; if the optic nerve is cut, however, the eye will be both completely blind and also unreactive to light falling on this eye. The pupil of the blind eye will react to light falling on the other eye by virtue of a decussation in the pupillary reflex pathway.",
  "Because of the ordered manner in which the optic tract fibres relay in the lateral geniculate bodies and from there pass in an orderly fashion to the striate area, when a given point on the retina is stimulated, the response recorded electrically in either the lateral geniculate body or the striate area is localized to a small region characteristic for that particular retinal spot. When the whole retinal field is stimulated in this point-to-point way, and the positions on the geniculate or striate gray matter on which the responses occur are plotted, it is possible to plot on these regions of the brain maps of the retinal fields or, more usually, maps of the visual fields.",
  "Area 17, the striate area, is the primary visual centre in the sense that, in primates at any rate, all of the geniculate fibres project onto it and none projects onto another region of the cortex. There are two other areas containing neurons that have close connections with the eye; these are the parastriate and peristriate areas, or Brodmann areas 18 and 19, respectively, in close anatomical relationship to one another and to area 17. They are secondary visual areas in the sense that messages are relayed from area 17 to area 18 and from area 18 to area 19, and, because area 17 does not relay to regions beyond area 18, these circumstriate areas are the means whereby visual information is brought into relation with more remote parts of the cortex. Thus, in writing, the eyes direct the activities of the fingers, which are controlled by a region of the frontal cortex, so that one may presume that visual information is relayed to this frontal region. In the monkey, bilateral destruction of the areas causes irrecoverable loss of a learned visual discrimination, but this can be relearned after the operation. In humans, lesions in this region are said to cause disturbances in spatial orientation and stereoscopic vision.",
  "The two halves of the retina, and thus of the visual field, are represented on opposite cerebral hemispheres, but the visual field is perceived as a unity and hence one would expect an intimate connection between the two visual cortical areas.",
  "The great bulk of the connections between the two sides of the cerebral mantle are made by the interhemispheric commissure (the point of union between the two hemispheres of the cerebrum ) called the corpus callosum , which is made up of neurons and their axons and dendrites that make synapses with cortical neurons on symmetrically related points of the hemispheres. Thus, electrical stimulation of a point on one hemisphere usually gives rise to a response on a symmetrically related point on the other, by virtue of these callosal connections. The striate area is an exception, however, and it is by virtue of the connections of the striate neurons with the area 18 neurons that this integration occurs, the two areas 18 on opposite hemispheres being linked by the corpus callosum.",
  "Usually stereopsis, or perception of depth, is possible by the use of a single hemisphere because the images of the same object formed by right and left eyes are projected to the same hemisphere; however, if the gaze is fixed on a distant point and a pin is placed in line with this but closer to the observer, a stereoscopic perception of the distant point and the pin can be achieved by the fusion of disparate images of the pin, but the images of the pin actually fall on opposite retinal halves, so that this fusion must be brought about by way of the corpus callosum.",
  "In experimental animals it is possible, by section of the chiasma, to ensure that visual impulses from one eye pass only to one hemisphere. If this is done, an animal trained to respond to a given pattern and permitted to use only one eye during the training is just as efficient, when fully trained, in making the discrimination with the other eye. There has thus been a callosal transfer of the learning so that the hemisphere that was not directly involved in the learning process can react as well as that directly involved. If the corpus callosum is also sectioned, this transfer is impossible, so that the animal, trained with one eye, must be trained again if it is to carry out the task with the other eye only.",
  "The visual pathway so far described is called the geniculostriate pathway, and in humans it may well be the exclusive one from a functional aspect because lesions in this pathway lead to blindness. Nevertheless, many of the optic tract fibres, even in humans, relay in the superior colliculi, a paired formation on the roof of the midbrain . From the colliculi there is no relay to the cortex, so that any responses brought about by this pathway do not involve the cortex. In humans, as has been said, lesions in the striate area, which would of course leave the collicular centres intact, cause blindness, so that the visual fibres in these centres serve no obvious function. In lower animals, including primates, removal of the striate areas does not cause complete blindness; in fact, it is often difficult to determine any visual impairment from a study of the behaviour of the animals.",
  "Thus, in reptiles and birds, vision is barely affected, so that a pigeon that has been subjected to the operation can fly and avoid obstacles as well as a normal one. In rodents, such as the rabbit, removal of the occipital lobes causes some impairment of vision, but the animal can perform such feats as avoiding obstacles when running and recognizing food by sight. In the monkey, the effects are more serious, but the animal can be trained to discriminate lights of different intensity and even the shapes of objects, provided that these are kept in continual motion. It seems likely, then, that it is the visual pathway through the colliculi that permits the use of the eyes in the absence of visual cortex, although the connections of the optic tract fibres with the pulvinar of the thalamus (an area in the diencephalon), established in some animals, may well permit the use of regions of the cortex other than those denoted as visual.",
  "So far, the visual process has been considered from rather elementary aspects; the ability to detect light and changes in its intensity, and to discriminate colour and form. It is now time to deal with more complex features, particularly some phenomena of binocular vision. It will then be in order to return to the electrophysiology of the visual pathway to see how some of the phenomena can be interpreted.",
  "Objects are perceived in definite positions in space—positions definite in relation to each other and to the percipient. The first problem is to analyze the physiological basis for this spatial perception or, as it is expressed, the projection of the retina into space.",
  "  The perception of the positions of objects in relation to each other is essentially a geometrical problem. Take, for the present, the perception of these relationships by one eye, monocular perception: a group of objects produces images on the retina in a certain fixed geometrical relationship. For the perception of the fact that C is to the left of D , for example, that D is to the left of E , and so on, it is necessary that the incidence of images at c , d , and e on the retina be interpreted in a similar but, of course, inverted geometrical relationship. The neural requirements for this interpretation are (1) that the retina be built up of elements that behave as units throughout their conducting system to the visual cortex, and (2) that the retinal elements have “local signs.” The local sign could represent an innate disposition or could result from experience—the association of the direction of objects in space, as determined by such evidence as that provided by touch, with the retinal pattern of stimulation. In neurophysiological terms, the retinal elements are said to be connected to cortical cells, each being specific for a given element, so that when a given cortical cell is excited the awareness is of a specific local sign. Studies of the projection of the retina on the cerebral cortex have confirmed this.",
  "The retinal stimuli at c , d , and e in are appreciated as objects outside the eye, the retina is said to be projected into space, and the field of vision is thus the projection of the retina through the nodal point. It will be seen that the geometrical relationship between objects and retinal stimuli is reversed; in the retina c is to the right of d , and so on.",
  "The recognition of the directions of objects in relation to the observer is more complex. If the eye is turned to the left, the image of C falls on the retinal point d , so that if d were always projected into the same direction in space, C would appear to be in D ’s place. In practice, one knows that C is perceived as fixed in space in spite of the movements of the eye; hence, the direction of projection of a retinal point is constantly modified to take into account movements of the eye; this may be called psychological compensation. It will be seen that correct projection is achieved by projecting the stimulated retinal point through the nodal point of the eye. Movements of the eye caused by movements of the head must be similarly compensated. As a result, any point in space remains fixed in spite of movements of the eye and head. Given this system of compensated projection, the recognition of direction in relation to the individual is now feasible. D may be said to be due north or, more vaguely, “over there”; when the head is turned, since D is perceived to be in the same place, it is still due north or “over there.” In some circumstances, the human subject makes an error in projecting his retinal image, so that the object giving rise to the image appears to be in a different place from its true one; the image is said to be falsely projected. If the eye is moved passively, for example, by pulling on the conjunctiva with forceps, the subject has the impression that objects in the outside world are moving in a direction opposite to that of the eye.",
  "The apparent movement of an afterimage, when the eye moves, is an excellent illustration of psychological compensation. A retinal stimulus, being normally projected through the nodal point, is projected into different points in space as the eye moves; an afterimage can be considered to be the manifestation of a continued retinal impulse, and its projection changes as the eye moves. The afterimage thus appears to move in the same direction as that of the movement of the eye. Whether the drift of an afterimage across the field of view is entirely due to eye movements is difficult to say. One certainly has the impression that the eye is chasing the afterimage.",
  "So far, consideration has been given to the problem of estimating the positions of points in relation to each other and to the percipient. The estimate of the directions of lines involves no really new principles, since, if two points, A and B , are exactly localized, the direction of the line A  B can be appreciated. As will be seen, the organization of the neural connections of the retina and higher visual pathway is such as to favour the accurate recognition of direction; for the moment, the question of the maintenance of a frame of reference must be considered, in the sense that a map has vertical and horizontal lines with which to compare other directions. In fact, the vertical and horizontal meridians of the retina seem to be specialized as frames of reference; the accuracy with which a human subject can estimate whether a line is vertical or horizontal is very great.",
  "An important point in this connection is that of the effects of eye movements on interpretation of the directions of lines because, when the eye moves to positions different from the primary straight-ahead position, the images of vertical lines will not necessarily fall on its vertical meridian. This can be due to an actual torsion of the eye about its anteroposterior (fore and aft) axis or to distortion of the retinal image. This means, then, that the line on the retina that corresponds to verticality in one position of the eye does not correspond to verticality in another, so that, once again, the space representation centre must take account not only of the retinal elements that have been stimulated but also of the corollary motor discharge.",
  "The influence of the movements of the eyes in the estimation of length was emphasized by Helmholtz. An accurate comparison of the lengths of two parallel lines A  B and C  D can be made, whereas if an attempt is made to compare the nonparallel lines A ′ B ′ and C ′ D ′, quite large errors occur. According to Helmholtz, the eye fixates first the point A , and the line A  B falls along a definite row of photoreceptors, thereby indicating its length. The eye is now moved to fixate C , and if the image of C  D falls along the same set of photoreceptors the length of C  D is said to be the same as that of A  B . Such a movement of the eye is not feasible with lines that are not parallel. Similarly, the parallelism, or otherwise, of pairs of lines can be perceived accurately because on moving the eye over the lines the distance between them must remain the same.",
  "Fairly accurate estimates of relative size may be made, nevertheless, without movements of the eyes. If two equal lines are observed simultaneously, the one with direct fixation and the other with peripheral vision, their images fall, of course, on different parts of the retina; if the images were equally long it could be stated that a certain length of stimulated retina was interpreted as a certain length of line in space. It is probable that this is roughly the basis on which rapid estimates of length depend, although there are such complications as the fact that the retina is curved so that lines of equal length in different parts of the retina do not produce images of equal length on the retina.",
  "Many instances have been cited of well-defined and consistent errors in visual estimates under special conditions. There is probably no single factor by which the errors can be explained, but the tendency for distinctly perceptible differences to appear larger than those more vaguely perceived is important.",
  "The image of the external world on the retina is essentially flat or two-dimensional, and yet it is possible to appreciate its three-dimensional character with remarkable precision. To a great extent this is by virtue of the simultaneous presentation of different aspects of the world to the two eyes, but, even when subjects view the world with a single eye, it does not appear flat to them, and they can, in fact, make reasonable estimates of the relative positions of objects in all three dimensions. Examples of monocular cues are the apparent movements of objects in relation to each other when the head is moved. Objects nearer the observer move in relation to more distant points in the opposite direction to the movement of the head. Perspective, by which is meant the changed appearance of an object when it is viewed from different angles, is another important clue to depth. Thus, the projected retinal image of an object in space may be represented as a series of lines on a plane—e.g., a box—though these lines are not a unique representation of the box, because the same lines could be used to convey the impression of a perfectly flat object with the lines drawn on it or of a rectangular but not cubical box viewed at a different angle. In order for a three-dimensional object to be correctly represented to the subject on a two-dimensional surface, the subject must know what the object is; i.e., it must be familiar to the subject. Thus, a bicycle is a familiar object. If it is viewed at an angle from the observer, the wheels seem elliptical and apparently differ in size. Because the observer knows that the wheels are circular and of the same size, he or she perceives depth in a two-dimensional pattern of lines. The perception of depth in a two-dimensional pattern thus depends greatly on experience—the knowledge of the true shape of things when viewed in a certain way. Other cues are light and shade, overlapping of contours, and relative sizes of familiar objects.",
  "The cues to depth mentioned above are essentially uniocular; they would permit the appreciation of three-dimensional space with a single eye. When two eyes are employed, two additional factors play a role, the one not very important—namely, the act of convergence or divergence of the eyes—and the other very important—namely, the stereoscopic perception of depth by virtue of the dissimilarity of the images presented by a three-dimensional object, or array of objects, to the separate eyes.",
  "When a three-dimensional object or array is examined binocularly, the nearer points or objects require greater convergence for fixation than the more distant points or objects, so that this provides a cue to the three-dimensional character of the presentation. It is by no means a necessary cue, since presentation of the array for such a short time that movements of the eyes cannot occur still permits the three-dimensional perception, which is achieved under these conditions by virtue of the dissimilar images received by the two retinas.",
  "A stereogram contains two drawings of a three-dimensional object taken from different angles, chosen such that the pictures are right- and left-eyed views of the object. When the stereogram is placed in a stereoscope, an optical device for enabling the two separate pictures to be fused and seen single, the impression created is one of a three-dimensional object. The perception is immediate, and is not a matter of interpretation. Clearly, with the stereoscope the situation is simulated as it normally occurs. To appreciate the full implications of the stereoscopic perceptual process, one must examine some simpler aspects of binocular vision.",
  "  In the case in which a subject is fixating (fixing his or her gaze on) the point F so that the images of F fall on the foveal (retinal) points f   L  and f   R  , F is seen as a single point because the retinal points f   L  and f   R  are projected to the same point in space, and the projection is such that the subject says that the point F is straight in front, although it is to the right of the left eye and to the left of the right eye. The two eyes in this case are behaving as a single eye, “the cyclopean eye,” situated in the centre of the forehead, and one may represent the projection of the two separate retinal points, f   L  and f   R  , as the single projection of the point f   C  of the cyclopean eye. As will be seen, the cyclopean eye is a useful concept in consideration of certain aspects of stereoscopic vision.",
  "The points f   L  and f   R  may be defined as corresponding points because they have the same retinal direction values. The images formed by the points A and B , in the same frontal plane as F , fall on a   L  and a   R  and b   L  and b   R  ; once again the pairs of retinal points are projected to the same points, namely, to A and B , and they are treated as being on the left and right of F , respectively. On the cyclopean projection, they may be said to be localized by the outward projections of a   C  and b   C  , respectively.",
  "If the subject fixes on the point F , the point A is now no longer in the same frontal plane as the point F , but closer to the observer. The images of F fall on corresponding points and are projected to a single point in front. The images of A , on a   L  and a   R  , do not fall on corresponding points and are, in fact, projected into space in different directions, as indicated by the cyclopean projection. This means that A is seen simultaneously at two different places, a phenomenon called physiological diplopia, and this in fact does happen, as can be seen by fixing one’s gaze on a distant point and holding a pencil fairly close to the face; with a little practice the two images of the pencil can be distinguished. Thus, when the eyes are directed into the distance the objects closer to the observer are seen double, although one of the double images of any pair is usually suppressed. When F and A are seen single and in the same plane, their images each fall on corresponding points. When F is seen single and A double, the images of A fall on noncorresponding, or disparate, points. A is appreciated as being closer to the observer than F by virtue of these double images but, in general, although it is retinal disparity that creates the percept of three-dimensional space, it is not necessarily the formation of double images, since the point will be seen single if the disparity is not large, and this single point will appear to be in a different frontal plane from that containing the fixation point.",
  " The Vieth-Müller circle. F X  To appreciate the nature of this stereoscopic perception one must examine what is meant by corresponding points in a little more detail. In general, it seems that the two retinas are, indeed, organized in such a way that pairs of points are projected innately to the same point in space, and the horopter is defined as the outward projection of these pairs. One may represent this approximately by a sphere passing through the fixation point, or, if one confines attention to the fixation plane, it may be represented by the so-called Vieth-Müller circle. On this basis, the corresponding points are arranged with strict symmetry, and each pair projects to a single point in space on the horopter circle. Theoretically, then, all points on the circle passing through the fixation point, F , will be seen single, and the point X will be seen double because it will be projected by the left eye to F and by the right eye to A . The actual situation is somewhat more complex than this, since experimentally the horopter turns out to have different shapes according to how close the fixation point is to the observer. The point to appreciate, however, is that the experimentally determined line, be it circular or straight or elliptical, is such that when points are placed on it they all appear to be in the same frontal plane—i.e., there is no stereoscopic perception of depth when one views these points—and one may say that this is because the images of points on the horopter fall on corresponding points of the two retinas.",
  " a  L  a  R  b  L  b  R  b  L  b  R   When the two eyes are viewing an arrow lying in the frontal plane, there is no stereopsis. When the arrow is inclined into the third dimension, it tends to point toward the observer. All points on the arrow are, in fact, seen single under both conditions, and yet, if the gaze is fixed on A , the images of B ′ will fall on noncorresponding points. B ′ is not seen double but, instead, the noncorresponding points, b ′  L  and b ′  R  , are projected to a common point B ′ and a stereoscopic percept is achieved. Thus the noncorresponding, or disparate, points on the retinas can be projected to a single point, and it is essentially this fusion of disparate images by the brain that creates the impression of depth. If the point B ′ were brought much closer to the eyes, its images would fall on such disparate points that fusion would no longer be possible, and B ′ would be seen double, or one double image would be suppressed. There is thus a certain zone of disparity that, if not exceeded, allows fusion of disparate points. This is called Panum’s fusional area; it is the area on one retina such that any point in it will fuse with a single point on the other retina.",
  "To return to the stereoscopic perception of three-dimensional space, one may recapitulate that it is because the two eyes receive different images of the same object that the stereoscopic percept happens; when the two images of the object are identical, then, except under very special conditions, the object has no three-dimensionality. A special condition is given by a uniformly illuminated sphere; this is three-dimensional, but the observer would have to use special cues to discriminate this from a flat disk lying in the frontal plane. Such a cue might be the different degree of convergence of the eyes required to fixate the centre from that required to fixate the periphery, or the different degree of accommodation.",
  " L R  The difference in the two aspects of the same object (or group of objects), measured as the instantaneous parallax. B is closer to the observer than A ; the fact is perceived stereoscopically because the line A  B subtends different angles at the two eyes, and the instantaneous parallax is measured by the difference between the angles a and b . The binocular parallax of any point in space is given by the angle subtended at it by the line joining the nodal points of the two eyes. Hence, the binocular parallax of A is a , and that of B is b . The instantaneous parallax is thus the difference of binocular parallax of the two points considered.",
  "If one places three vertical wires in front of an observer in the frontal plane, one may move the middle one in front of, or behind, the plane containing the other two and ask the subject to say when he perceives that it is out of the plane; under correct experimental conditions the only cue will be the difference of binocular parallax, and it is found that the minimum difference is remarkably small, of the order of five seconds of arc, corresponding to a disparity of retinal images far smaller than the diameter of a single cone. With two editions of the same book, it is not possible, by mere inspection, to detect that a given line of print was not printed from the same type as the same line in the other book. If the two lines in question are placed in the stereoscope, it is found that some letters appear to float in space, a stereoscopic impression created by the minute differences in size, shape, and relative position of the letters in the two lines. The stereoscope may thus be used to detect whether a bank note has been forged, whether two coins have been stamped by the same die, and so on.",
  "The stereoscopic appearance obtained by regarding two differently coloured, but otherwise identical, plane pictures with the two eyes separately, is probably due to chromatic differences of magnification. If the left eye, for example, views a plane picture through a red glass and the right eye views the same picture through a blue glass, an illusion of solidity results. Chromatic difference in magnification causes the images on the two retinas to be slightly different in size, so that the images of any point on the picture do not fall on corresponding points; the conditions for a stereoscopic illusion are thus present.",
  "Stereoscopic perception results from the presentation to the two eyes of different images of the same object; if two pictures that cannot possibly be related as two aspects of the same three-dimensional object are presented to the two eyes, single vision may, under some conditions, be obtained, but the phenomenon of retinal rivalry enters. Thus, if the letter F occupies one side of a stereogram and L the other, the two letters can be fused by the eyes to give the letter E . The letters F and L cannot, however, by any stretch of the imagination, be regarded as left and right aspects of a real object in space, so that the final percept is not three-dimensional, and, moreover, it is not a unitary percept in the sense used in this discussion. Great difficulty is experienced in retaining the appearance of the letter E , the two separate images F and L tending to float apart. This is a mode of binocular vision that may be more appropriately called simultaneous perception; the two images are seen simultaneously, and it is by superimposition, rather than fusion, that the illusion of the letter E is created. More frequent than superimposition is the situation in which one or the other image is completely suppressed; thus, if the right eye views a vertical black bar and the left eye a horizontal one, the binocular percept is not that of a cross; usually the subject is aware of the vertical bar alone or the horizontal bar alone. Moreover, there is a fairly characteristic rhythm of suppression, or alternation of dominance, as it is called.",
  "Retinal rivalry may be viewed as the competition of the retinal fields for attention; such a notion leads to the concept of ocular dominance—the condition when one retinal image habitually compels attention at the expense of the other. While there seems little doubt that a person may use one eye in preference to the other in acts requiring monocular vision—e.g., in aiming a rifle—it seems doubtful whether, in the normal individual, ocular dominance is really an important factor in the final awareness of the two retinal images. Where the retinal images overlap, stereoscopic perception is possible and the two fields, in this region, are combined into a single three-dimensional percept. In the extreme temporal fields (i.e., at the outside of the fields of vision), entirely different objects are seen by the two eyes, and the selection of what is to dominate the awareness at any moment depends largely on the interest it arouses; as a result, the complete field of view is filled in and one is not aware of what objects are seen by only one eye. Where the fields overlap, and different objects are seen by the two eyes—e.g., on looking through a window the bars may obscure some objects as seen by one eye but not as seen by the other—the final percept is determined by the need to make something intelligible out of the combined fields. Thus, the left eye may see a chimney pot on a house, while the other eye sees the bar of a window in its place; the final perceptual pattern involves the simultaneous awareness of both the bar and the chimney pot because the retinal images have meaning only if both are present in consciousness. So long as the individual retinal images can be regarded as the visual tokens of an actual arrangement of objects, it is possible to obtain a single percept, and there seems no reason to suppose that the final percept will be greatly influenced by the dominance of one or other eye. When a single percept is impossible, retinal rivalry enters; this is essentially an alternation of awareness of the two fields—the subject apparently makes attempts to find something intelligible in the combined presentation by suppressing first one field and then the other—and certainly it would be incorrect to speak of ocular dominance as an absolute and invariable imposition of a single field on awareness, since this does not occur. Dominance, however, has a well-defined physiological meaning in so far as certain cells of the cerebral cortex may be activated exclusively by one eye, either because the other eye makes no neural connections with it or because the influence of the other eye is dominant.",
  "When the two eyes are presented with differently illuminated objects or surfaces some interesting phenomena emerge. Thus fusion may give rise to a sensation of lustre. In other instances, rivalry takes place, the one or other picture being suppressed, while in still others the brightness sensation is intermediate between those of the two pictures. This gives rise to the paradox whereby a monocularly viewed white surface appears brighter than when it is viewed binocularly in such a way that one eye views it directly and the other through a dark glass. In this second case the eyes are receiving more light, but because the sensation is determined by both eyes, the result is one that would be obtained were one eye to look at a less luminous surface.",
  "To elucidate the functions of the various stages in the visual pathway, one must examine the responses to a retinal light-stimulus of the individual neurons at the different stages.",
  "The main features of the responses of ganglion cells have already been touched upon. These have receptive fields that indicate a dual type of connection with the rods and cones , as indicated by the centre-periphery organization. A spot of light falling on receptors in the centre of this field may provoke a discharge in the ganglion cell or its optic nerve fibre; it is called an on-response and consists usually in an increase in the background discharge occurring in darkness. If a spot of light falls on a ring of retina surrounding this central region, the effect is one of inhibition of the background while the light is on, and as soon as it is switched off there is a pronounced discharge, the off-response. Other ganglion cells have been shown to have a directional sensitivity, responding to a moving spot of light only if this moves in a preferred direction and showing inhibition of background discharge if movement is in the null direction.",
  "In general, the lateral geniculate neuron is characterized by an accentuation of the centre-periphery arrangement, so that the two parts of the receptive field tend to cancel each other out completely when stimulated together, by contrast with the ganglion cell in which one or another would predominate. Thus, when the retina is illuminated uniformly there is little response in the geniculate cells because of this cancellation. This represents a useful elaboration of the messages from the retina because, to the animal, uniformity is uninteresting; it is the nonuniformity created by a contour or a moving object that is of interest, and the brain is therefore spared from being bombarded by unnecessary information that would result if every receptor response were transmitted to the brain.",
  "When investigators made records of responses from neurons in area 17 there was an interesting change in the nature of the receptive fields; there was still the organization into excitatory (on) and inhibitory (off) zones, but these were linearly arranged, so that the best stimulus for evoking a response was a line, either white on black or black on white. When this line fell on the retina in a definite direction, and on a definite part of the retina, there was, say, an on-response, while if it fell on adjacent areas there was an off-response. Changing the orientation of the line by as little as 15° could completely abolish the responses. The simplest interpretation of this type of receptive field is based on the connection of the cortical cell with a set of geniculate cells with their receptive fields arranged linearly.",
  "Most of these units (i.e., cortical cells plus connections) could be excited by a light stimulus falling on either eye, although there was usually dominance of one eye, in the sense that its response was greater; when both eyes were stimulated together, the effects summated. In general, then, when a large number of units are studied, a certain proportion are fired by one eye alone, others by the opposite eye alone, others by both eyes with dominance of one or other eye, while still others respond only when both eyes are stimulated. It is interesting that when kittens are deprived of the use of one eye from birth for several months, this deprived eye is virtually blind and the distribution of dominance in the cortical neurons is changed dramatically; if the left eye is deprived, the right hemispherical cortical neurons show a marked fall in dominance by the left eye, and an increase by the right eye. Thus, the ability of the eye to make use of cortical neurons is not fully developed at birth.",
  "When an electrode is directed downward into the cortex it picks up responses in individual units at successive depths; units having the same directional sensitivity are arranged in columns so that the receptive fields of successive neurons are similarly oriented. When units were classified on the basis of eye dominance, a similar vertical distribution of units was found, overlapping with those based on directional preference. The columns for eye preference were about one millimetre wide, but those for directional preference were considerably finer. This columnar organization of cortical cells is not peculiar to the visual area.",
  "The cortical units (cells) described above, with receptive fields organized on a linear basis, have been called simple units in contrast to complex and hypercomplex units. Four types of complex units have been described; as with the simple units, the orientation of a slit stimulus (that is, a line) is of the utmost importance for obtaining maximal response, but unlike the situation with the simple unit, the position on the retina is unimportant. This type of unit makes abstractions of a higher order, responding to direction of orientation but not to position. It is this type of neuron that would be concerned, for example, with determining the verticality or horizontality of lines in space. Space does not permit of a description of the receptive field of a hypercomplex cell, but in general its features could be explained on the basis of connections with complex cells.",
  "Of special interest is the behaviour of binocularly driven (stimulated) cortical cells, since their responses provide a clue to the fusion of retinal images. The cortical nerve cell receiving impulses emanating from both retinas must select those parts of the two retinal images that are the images of the same point on an object; second, for stereopsis, the nerve cell must assess the small displacements from exact symmetry that give the binocular parallax. In experiments, maximal response was often obtained only when the stimuli fell on disparate parts of the two retinas; these cortical cells were obviously disparity detectors, in contrast to others that gave maximal response when the stimuli fell on strictly symmetrically related parts of the two retinas—i.e., on corresponding points. When successive units, during penetration of the electrode, were recorded, it was found that those requiring the same degree of disparity for maximal response were arranged in columns, as with direction sensitivity, so that, in effect, all these nerve cells were responding to stimuli in a strip of space at a definite distance from the fixation point.",
  " Hugh Davson (ed.), The Eye , 4 vol. (1962; 2nd ed., vol. 1, 1969), covers the whole field of eye physiology, written by a group of experts; Stewart Duke-Elder  et al. (eds.), System of Ophthalmology , 15 vol. in 19 (1958–76), authoritative accounts of the anatomy and physiology of the eye; E. Wolff , Anatomy of the Eye and Orbit , 5th ed. (1961), the classic work on this aspect; Hugh Davson , Physiology of the Eye , 3rd ed. (1971), an account of eye physiology covering all aspects; M.H. Pirenne , Vision and the Eye , 2nd ed. (1967), a simple account of certain features of eye physiology; R.A. Weale , The Eye and Its Function (1960), a short and elementary account; H. von Helmholtz , Handbuch der physiologischen Optik , 3rd ed. (1886–96; Eng. trans., Physiological Optics , 3 vol., 1924–25; reprinted in 2 vol., 1962), a classic account of the psychological aspects of vision—not at all out of date, although written over 100 years ago; H.H. Emsley , Visual Optics , 5th ed., 2 vol. (1952–53), a technical account of the detailed optics of the eye. Physiological aspects of vision are discussed in Hitoshi Shichi , Biochemistry of Vision (1983). Psychology of vision, including motion, depth, binocular vision, visual effects, and colour, is discussed in Mark Fineman , The Inquisitive Eye (1981)."
]