[
  "  human ear , organ of hearing and equilibrium that detects and analyzes sound by transduction (or the conversion of sound waves into electrochemical impulses) and maintains the sense of balance (equilibrium).",
  "The human ear, like that of other mammals , contains sense organs that serve two quite different functions: that of hearing and that of postural equilibrium and coordination of head and eye movements. Anatomically, the ear has three distinguishable parts: the outer, middle, and inner ear. The outer ear consists of the visible portion called the auricle , or pinna, which projects from the side of the head, and the short external auditory canal, the inner end of which is closed by the tympanic membrane , commonly called the eardrum. The function of the outer ear is to collect sound waves and guide them to the tympanic membrane. The middle ear is a narrow air-filled cavity in the temporal bone. It is spanned by a chain of three tiny bones —the malleus (hammer), incus (anvil), and stapes (stirrup), collectively called the auditory ossicles. This ossicular chain conducts sound from the tympanic membrane to the inner ear, which has been known since the time of Galen (2nd century ce ) as the labyrinth. It is a complicated system of fluid-filled passages and cavities located deep within the rock-hard petrous portion of the temporal bone. The inner ear consists of two functional units: the vestibular apparatus, consisting of the vestibule and semicircular canals, which contains the sensory organs of postural equilibrium; and the snail-shell-like cochlea, which contains the sensory organ of hearing. These sensory organs are highly specialized endings of the eighth cranial nerve , also called the vestibulocochlear nerve .",
  "The most-striking differences between the human ear and the ears of other mammals are in the structure of the outermost part, the auricle. In humans the auricle is an almost rudimentary, usually immobile shell that lies close to the side of the head. It consists of a thin plate of yellow elastic cartilage covered by closely adherent skin . The cartilage is molded into clearly defined hollows, ridges, and furrows that form an irregular shallow funnel. The deepest depression, which leads directly to the external auditory canal , or acoustic meatus, is called the concha. It is partly covered by two small projections, the tonguelike tragus in front and the antitragus behind. Above the tragus a prominent ridge, the helix, arises from the floor of the concha and continues as the incurved rim of the upper portion of the auricle. An inner, concentric ridge, the antihelix, surrounds the concha and is separated from the helix by a furrow, the scapha, also called the fossa of the helix. In some ears a little prominence known as Darwin’s tubercle is seen along the upper, posterior portion of the helix; it is the vestige of the folded-over point of the ear of a remote human ancestor. The lobule, the fleshy lower part of the auricle, is the only area of the outer ear that contains no cartilage. The auricle also has several small rudimentary muscles, which fasten it to the skull and scalp. In most individuals these muscles do not function, although some persons can voluntarily activate them to produce limited movements. The external auditory canal is a slightly curved tube that extends inward from the floor of the concha and ends blindly at the tympanic membrane. In its outer third, the wall of the canal consists of cartilage; in its inner two-thirds, of bone. The entire length of the passage (24 mm, or almost 1 inch) is lined with skin, which also covers the outer surface of the tympanic membrane. Fine hairs directed outward and modified sweat glands that produce earwax, or cerumen, line the canal and discourage insects from entering it.",
  "  The thin semitransparent tympanic membrane , or eardrum, which forms the boundary between the outer ear and the middle ear, is stretched obliquely across the end of the external canal. Its diameter is about 8–10 mm (about 0.3–0.4 inch), its shape that of a flattened cone with its apex directed inward. Thus, its outer surface is slightly concave. The edge of the membrane is thickened and attached to a groove in an incomplete ring of bone, the tympanic annulus, which almost encircles it and holds it in place. The uppermost small area of the membrane where the ring is open, the pars flaccida, is slack, but the far greater portion, the pars tensa, is tightly stretched. The appearance and mobility of the tympanic membrane are important for the diagnosis of middle-ear disease, which is especially common in young children. When viewed with the otoscope, the healthy membrane is translucent and pearl-gray in colour, sometimes with a pinkish or yellowish tinge.",
  "The entire tympanic membrane consists of three layers. The outer layer of skin is continuous with that of the external canal. The inner layer of mucous membrane is continuous with the lining of the tympanic cavity of the middle ear. Between these layers is a layer of fibrous tissue made up of circular and radial fibres that give the membrane its stiffness and tension. The membrane is well supplied with blood vessels and sensory nerve fibres that make it acutely sensitive to pain .",
  "The cavity of the middle ear is a narrow air-filled space. A slight constriction divides it into an upper and a lower chamber, the tympanum (tympanic cavity) proper below and the epitympanum above. These chambers are also referred to as the atrium and the attic, respectively. The middle-ear space roughly resembles a rectangular room with four walls, a floor, and a ceiling. The outer (lateral) wall of the middle-ear space is formed by the tympanic membrane. The ceiling (superior wall) is a thin plate of bone that separates the middle-ear cavity from the cranial cavity and brain above. The floor (inferior wall) is also a thin bony plate, in this case separating the middle-ear cavity from the jugular vein and the carotid artery below. The back (posterior) wall partly separates the middle-ear cavity from another cavity, the mastoid antrum, but an opening in this wall leads to the antrum and to the small air cells of the mastoid process, which is the roughened, slightly bulging portion of the temporal bone just behind the external auditory canal and the auricle. In the front (anterior) wall is the opening of the eustachian tube (or auditory tube), which connects the middle ear with the nasopharynx. The inner (medial) wall, which separates the middle ear from the inner ear, or labyrinth, is a part of the bony otic capsule of the inner ear. It has two small openings, or fenestrae, one above the other. The upper one is the oval window, which is closed by the footplate of the stapes. The lower one is the round window, which is covered by a thin membrane.",
  "  Crossing the middle-ear cavity is the short ossicular chain formed by three tiny bones that link the tympanic membrane with the oval window and inner ear. From the outside inward they are the malleus (hammer), the incus (anvil), and the stapes (stirrup). The malleus more closely resembles a club than a hammer, and the incus looks more like a premolar tooth with uneven roots than an anvil. These bones are suspended by ligaments , which leave the chain free to vibrate in transmitting sound from the tympanic membrane to the inner ear.",
  "The malleus consists of a handle and a head. The handle is firmly attached to the tympanic membrane from the centre (umbo) to the upper margin. The head of the malleus and the body of the incus are joined tightly and are suspended in the epitympanum just above the upper rim of the tympanic annulus, where three small ligaments anchor the head of the malleus to the walls and roof of the epitympanum. Another minute ligament fixes the short process (crus) of the incus in a shallow depression, called the fossa incudis, in the rear wall of the cavity. The long process of the incus is bent near its end and bears a small bony knob that forms a loose ligament-enclosed joint with the head of the stapes. The stapes is the smallest bone in the body. It is about 3 mm (0.1 inch) long and weighs scarcely 3 mg (0.0001 ounce). It lies almost horizontally, at right angles to the process of the incus. Its base, or footplate, fits nicely in the oval window and is surrounded by the elastic annular ligament, although it remains free to vibrate in transmitting sound to the labyrinth.",
  "Two minuscule muscles are located in the middle ear. The longer muscle, called the tensor tympani, emerges from a bony canal just above the opening of the eustachian tube and runs backward and then outward as it changes direction in passing over a pulleylike projection of bone. The tendon of this muscle is attached to the upper part of the handle of the malleus. When contracted, the tensor tympani tends to pull the malleus inward and thus maintains or increases the tension of the tympanic membrane. The shorter, stouter muscle, called the stapedius, arises from the back wall of the middle-ear cavity and extends forward and attaches to the neck of the head of the stapes. Its reflex contractions tend to tip the stapes backward, as if to pull it out of the oval window. Thus, it selectively reduces the intensity of sounds entering the inner ear, especially those of lower frequency.",
  "The seventh cranial nerve, called the facial nerve , passes by a somewhat circuitous route through the facial canal in the petrous portion of the temporal bone on its way from the brainstem to the muscles of expression of the face. A small but important branch, the chorda tympani nerve, emerges from the canal into the middle-ear cavity and runs forward along the inner surface of the pars tensa of the membrane, passing between the handle of the malleus and the long process of the incus. Since at this point it is covered only by the tympanic mucous membrane, it appears to be quite bare. Then it resumes its course through the anterior bony wall, bringing sensory fibres for taste to the anterior two-thirds of the tongue and parasympathetic secretory fibres to salivary glands .",
  "The eustachian tube , about 31–38 mm (1.2–1.5 inches) long, leads downward and inward from the tympanum to the nasopharynx, the space that is behind and continuous with the nasal passages and is above the soft palate. At its upper end the tube is narrow and surrounded by bone. Nearer the pharynx it widens and becomes cartilaginous. Its mucous lining , which is continuous with that of the middle ear, is covered with cilia, small hairlike projections whose coordinated rhythmical sweeping motions speed the drainage of mucous secretions from the tympanum to the pharynx .",
  "The eustachian tube helps ventilate the middle ear and maintain equal air pressure on both sides of the tympanic membrane. The tube is closed at rest and opens during swallowing so that minor pressure differences are adjusted without conscious effort. During an underwater dive or a rapid descent in an airplane, the tube may remain tightly closed. The discomfort that is felt as the external pressure increases can usually be overcome by attempting a forced expiration with the mouth and nostrils held tightly shut. This maneuver, which raises the air pressure in the pharynx and causes the tube to open, is called the Valsalva maneuver, named for Italian physician-anatomist Antonio Maria Valsalva (1666–1723), who recommended it for clearing pus from an infected middle ear.",
  "  There are actually two labyrinths of the inner ear , one inside the other, the membranous labyrinth contained within the bony labyrinth. The bony labyrinth consists of a central chamber called the vestibule, the three semicircular canals, and the spirally coiled cochlea. Within each structure, and filling only a fraction of the available space, is a corresponding portion of the membranous labyrinth: the vestibule contains the utricle and saccule, each semicircular canal its semicircular duct, and the cochlea its cochlear duct. Surrounding the membranous labyrinth and filling the remaining space is the watery fluid called perilymph. It is derived from blood plasma and resembles but is not identical with the cerebrospinal fluid of the brain and the aqueous humour of the eye. Like most of the hollow organs, the membranous labyrinth is lined with epithelium (a sheet of specialized cells that covers internal and external body surfaces). It is filled with a fluid called endolymph, which has a markedly different ionic content from perilymph. Because the membranous labyrinth is a closed system, the endolymph and perilymph do not mix.",
  "The vestibular system is the apparatus of the inner ear involved in balance. It consists of two structures of the bony labyrinth, the vestibule and the semicircular canals, and the structures of the membranous labyrinth contained within them.",
  "  The two membranous sacs of the vestibule, the utricle and the saccule, are known as the otolith organs. Because they respond to gravitational forces, they are also called gravity receptors. Each sac has on its inner surface a single patch of sensory cells called a macula, which is about 2 mm (0.08 inch) in diameter. The macula monitors the position of the head relative to the vertical. In the utricle the macula projects from the anterior wall of that tubular sac and lies primarily in the horizontal plane. In the saccule the macula is in the vertical plane and directly overlies the bone of the inner wall of the vestibule. In shape it is elongated and resembles the letter J. Each macula consists of neuroepithelium, a layer that is made up of supporting cells and sensory cells, as well as a basement membrane, nerve fibres and nerve endings, and underlying connective tissue. The sensory cells are called hair cells because of the hairlike cilia—stiff nonmotile stereocilia and flexible motile kinocilia—that project from their apical ends. The nerve fibres are from the superior, or vestibular, division of the vestibulocochlear nerve . They pierce the basement membrane and, depending on the type of hair cell, either end on the basal end of the cell or form a calyx, or cuplike structure, that surrounds it.",
  "Each of the hair cells of the vestibular organs is topped by a hair bundle, which consists of about 100 fine nonmotile stereocilia of graded lengths and a single motile kinocilium. The stereocilia are anchored in a dense cuticular plate at the cell’s apex. The single kinocilium, which is larger and longer than the stereocilia, rises from a noncuticular area of the cell membrane at one side of the cuticular plate. The longest stereocilia are those closest to the kinocilium; the stereocilia decrease in length in stepwise fashion away from the kinocilium. Minute filamentous strands link the tips and shafts of neighbouring stereocilia to one another. When the hair bundles are deflected—e.g., because of a tilt of the head—the hair cells are stimulated to alter the rate of the nerve impulses that they are constantly sending via the vestibular nerve fibres to the brainstem. Covering the entire macula is a delicate acellular structure, the otolithic, or statolithic, membrane. This membrane is sometimes described as gelatinous, although it has a fibrillar pattern. The surface of the membrane is covered by a blanket of rhombohedral crystals, referred to as otoconia or statoconia, which consist of calcium carbonate in the form of calcite . These crystalline particles, which range in length from 1 to 20 μm (1 μm = 0.000039 inch), are much denser than the membrane—their specific gravity is almost three times that of the membrane and the endolymph—and thus add considerable mass to it.",
  "The vestibular hair cells are of two types: type I cells have a rounded body enclosed by a nerve calyx, and type II cells have a cylindrical body with nerve endings at the base. They form a mosaic on the surface of the maculae, with the type I cells dominating in a curvilinear area (the striola) near the centre of the macula and the cylindrical cells around the periphery. The significance of these patterns is poorly understood, but they may increase sensitivity to slight tiltings of the head.",
  "The three semicircular canals of the bony labyrinth are designated according to their position: superior, horizontal, and posterior. The superior and posterior canals are in diagonal vertical planes that intersect at right angles. Each canal has an expanded end, the ampulla, which opens into the vestibule. The ampullae of the horizontal and superior canals lie close together, just above the oval window, but the ampulla of the posterior canal opens on the opposite side of the vestibule. The other ends of the superior and posterior canals join to form a common stem, or crus, which also opens into the vestibule. Nearby is the mouth of a canal called the vestibular aqueduct, which opens into the cranial cavity. The other end of the horizontal canal has a separate opening into the vestibule. Thus, the vestibule completes the circle for each of the semicircular canals.",
  "Each of the three bony canals and its ampulla enclose a membranous semicircular duct of much smaller diameter that has its own ampulla. The membranous ducts and ampullae follow the same pattern as the canals and ampullae of the bony labyrinth, with their openings into the utricle and with a common crus for the superior and posterior ducts. Like the other parts of the membranous labyrinth, they are filled with endolymph and surrounded by perilymph. The narrow endolymphatic duct passes from the utricle through the vestibular aqueduct into the cranial cavity, carrying excess endolymph to be absorbed by the endolymphatic sac.",
  "Each membranous ampulla contains a saddle-shaped ridge of tissue called the crista, the sensory end organ that extends across it from side to side. The crista is covered by neuroepithelium, with hair cells and supporting cells. From this ridge rises a gelatinous structure, the cupula, which extends to the roof of the ampulla immediately above it, dividing the interior of the ampulla into two approximately equal parts. Like the hair cells of the maculae, the hair cells of the cristae have hair bundles projecting from their apices. The kinocilium and the longest stereocilia extend far up into the substance of the cupula, occupying fine parallel channels. Thus, the cupula is attached at its base to the crista but is free to incline toward or away from the utricle in response to the slightest flow of endolymph or a change in pressure. The tufts of cilia move with the cupula and, depending on the direction of their bending, cause an increase or a decrease in the rate of nerve impulse discharges carried by the vestibular nerve fibres to the brainstem.",
  "The cochlea contains the sensory organ of hearing. It bears a striking resemblance to the shell of a snail and in fact takes its name from the Greek word for this object. The cochlea is a spiral tube that is coiled two and one-half turns around a hollow central pillar, the modiolus. It forms a cone approximately 9 mm (0.35 inch) in diameter at its base and 5 mm in height. When stretched out, the spiral tube is approximately 30 mm in length. It is widest—2 mm—at the point where the basal coil opens into the vestibule, and it tapers until it ends blindly at the apex. The otherwise hollow centre of the modiolus contains the cochlear artery and vein, as well as the twisted trunk of fibres of the cochlear nerve. This nerve, a division of the very short vestibulocochlear nerve , enters the base of the modiolus from the brainstem through an opening in the petrous portion of the temporal bone called the internal meatus. The spiral ganglion cells of the cochlear nerve are found in a bony spiral canal winding around the central core.",
  "A thin bony shelf, the osseous spiral lamina, winds around the modiolus like the thread of a screw. It projects about halfway across the cochlear canal, partly dividing it into two compartments, an upper chamber called the scala vestibuli (vestibular ramp) and a lower chamber called the scala tympani (tympanic ramp). The scala vestibuli and scala tympani, which are filled with perilymph, communicate with each other through an opening at the apex of the cochlea, called the helicotrema, which can be seen if the cochlea is sliced longitudinally down the middle. At its basal end, near the middle ear, the scala vestibuli opens into the vestibule. The basal end of the scala tympani ends blindly just below the round window. Nearby is the opening of the narrow cochlear aqueduct, through which passes the perilymphatic duct. This duct connects the interior of the cochlea with the subdural space in the posterior cranial fossa (the rear portion of the floor of the cranial cavity).",
  "  A smaller scala, called the cochlear duct (scala media), lies between the larger vestibular and tympanic scalae; it is the cochlear portion of the membranous labyrinth. Filled with endolymph, the cochlear duct ends blindly at both ends—i.e., below the round window and at the apex. In cross section this duct resembles a right triangle. Its base is formed by the osseous spiral lamina and the basilar membrane, which separate the cochlear duct from the scala tympani. Resting on the basilar membrane is the organ of Corti, which contains the hair cells that give rise to nerve signals in response to sound vibrations. The side of the triangle is formed by two tissues that line the bony wall of the cochlea: the stria vascularis, which lines the outer wall of the cochlear duct, and the fibrous spiral ligament, which lies between the stria and the bony wall of the cochlea. A layer of flat cells bounds the stria, separating it from the spiral ligament. The hypotenuse is formed by the transparent vestibular membrane (or Reissner membrane), which consists of only two layers of flattened cells. A low ridge, the spiral limbus, rests on the margin of the osseous spiral lamina. The Reissner membrane stretches from the inner margin of the limbus to the upper border of the stria.",
  "The spiral ligament extends above the attachment of the Reissner membrane and is in contact with the perilymph in the scala vestibuli. Extending below the insertion of the basilar membrane, it is in contact with the perilymph of the scala tympani. It contains many stout fibres that anchor the basilar membrane and numerous connective-tissue cells. The structure of the spiral ligament is denser behind the stria than near the upper and lower margins. The spiral ligament, like the adjacent stria, is well supplied with blood vessels. It receives the radiating arterioles that pass outward from the modiolus in bony channels of the roof of the scala vestibuli. Branches from these vessels form a network of capillaries above the junction with the Reissner membrane that may be largely responsible for the formation of the perilymph from the blood plasma. Other branches enter the stria, and still others pass behind it to the spiral prominence. From these separate capillary networks, which are not interconnected, small veins descending below the attachment of the basilar membrane collect blood and deliver it to the spiral vein in the floor of the scala tympani.",
  "At the lower margin of the stria is the spiral prominence, a low ridge parallel to the basilar membrane that contains its own set of longitudinally directed capillary vessels. Below the prominence is the outer sulcus. The floor of the outer sulcus is lined by cells of epithelial origin, some of which send long projections into the substance of the spiral ligament. Between these so-called root cells, capillary vessels descend from the spiral ligament. This region appears to have an absorptive rather than a secretory function, and it may be involved in removing waste materials from the endolymph.",
  "In humans the basilar membrane is about 30 to 35 mm in length. It widens from less than 0.1 mm near its basal end to 0.5 mm near the apex. The basilar membrane is spanned by stiff elastic fibres that are connected at their basal ends in the modiolus. Their distal ends are embedded in the membrane but are not actually attached, which allows them to vibrate. The fibres decrease in calibre and increase in length from the basal end of the cochlea near the middle ear to the apex, so that the basilar membrane as a whole decreases remarkably in stiffness from base to apex. Furthermore, at the basal end the osseous spiral lamina is broader, the stria vascularis wider, and the spiral ligament stouter than at the apex. In contrast, however, the mass of the organ of Corti is least at the base and greatest at the apex. Thus, a certain degree of tuning is provided in the structure of the cochlear duct and its contents. With greater stiffness and less mass, the basal end is more attuned to the sounds of higher frequencies. Decreased stiffness and increased mass render the apical end more responsive to lower frequencies.",
  "Beneath the fibrillar layer of the basilar membrane is the acellular ground substance of the membrane. This layer is covered in turn by a single layer of spindle-shaped mesothelial cells, which have long processes arranged longitudinally and parallel, facing the scala tympani and forming the tympanic lamella that is in contact with the perilymph.",
  "Capillary blood vessels are found on the underside of the tympanic lip of the limbus and, in some species, including the guinea pig and humans, within the basilar membrane, beneath the tunnel. These vessels, called spiral vessels, do not enter the organ of Corti but are thought to supply most of the oxygen and other nutrients to its cells. Although the outer spiral vessel is seldom found in adult animals of certain species such as the dog, cat, and rat and is not found in the basilar membrane of every adult human, it is present in the human fetus. Its impressive diameter in the fetus suggests that it is an important channel for blood delivery to the developing organ of Corti.",
  "  Arranged on the surface of the basilar membrane are orderly rows of the sensory hair cells, which generate nerve impulses in response to sound vibrations. Together with their supporting cells they form a complex neuroepithelium called the basilar papilla, or organ of Corti. The organ of Corti is named after Italian anatomist Alfonso Corti, who first described it in 1851. Viewed in cross section, the most striking feature of the organ of Corti is the arch, or tunnel, of Corti, formed by two rows of pillar cells, or rods. The pillar cells furnish the major support of this structure. They separate a single row of larger, pear-shaped inner hair cells from three or more rows of smaller, cylindrical outer hair cells. The inner hair cells are supported and enclosed by the inner phalangeal cells, which rest on the thin outer portion, called the tympanic lip, of the spiral limbus. On the inner side of the inner hair cells and the cells that support them is a curved furrow called the inner sulcus. This is lined with more or less undifferentiated cuboidal cells.",
  "Each outer hair cell is supported by a phalangeal cell of Deiters, or supporting cell, which holds the base of the hair cell in a cup-shaped depression. From each Deiters’ cell a projection extends upward to the stiff membrane, the reticular lamina, that covers the organ of Corti. The top of the hair cell is firmly held by the lamina, but the body is suspended in fluid that fills the space of Nuel and the tunnel of Corti. Although this fluid is sometimes referred to as cortilymph, its composition is thought to be similar, if not identical, to that of the perilymph. Beyond the hair cells and the Deiters’ cells are three other types of epithelial cells, usually called the cells of Hensen, Claudius, and Boettcher, after the 19th-century anatomists who first described them. Their function has not been established, but they are assumed to help in maintaining the composition of the endolymph by ion transport and absorptive activity.",
  "Each hair cell has a cytoskeleton composed of filaments of the protein actin, which imparts stiffness to structures in which it is found. The hair cell is capped by a dense cuticular plate, composed of actin filaments, which bears a tuft of stiffly erect stereocilia, also containing actin, of graded lengths arranged in a staircase pattern. This so-called hair bundle has rootlets anchored firmly in the cuticular plate. On the top of the inner hair cells 40 to 60 stereocilia are arranged in two or more irregularly parallel rows. On the outer hair cells approximately 100 stereocilia form a W pattern. At the notch of the W the plate is incomplete, with only a thin cell membrane taking its place. Beneath the membrane is the basal body of a kinocilium, although no motile ciliary (hairlike) portion is present as is the case on the hair cells of the vestibular system.",
  "The stereocilia are about 3 to 5 μm in length. The longest make contact with but do not penetrate the tectorial membrane. This membrane is an acellular gelatinous structure that covers the top of the spiral limbus as a thin fibrillar layer, then becomes thicker as it extends outward over the inner sulcus and the reticular lamina. Its fibrils extend radially and somewhat obliquely to end at its lateral border, just above the junction of the reticular lamina and the cells of Hensen. In the upper turns of the cochlea, the margin of the membrane ends in fingerlike projections that make contact with the stereocilia of the outermost hair cells.",
  "The myelin -ensheathed fibres of the vestibulocochlear nerve fan out in spiral fashion from the modiolus to pass into the channel near the root of the osseous spiral lamina, called the canal of Rosenthal. The bipolar cell bodies of these neurons constitute the spiral ganglion. Beyond the ganglion their distal processes extend radially outward in the bony lamina beneath the limbus to pass through an array of small pores directly under the inner hair cells, called the habenula perforata. Here the fibres abruptly lose their multilayered coats of myelin and continue as thin, naked, unmyelinated fibres into the organ of Corti. Some fibres form a longitudinally directed bundle running beneath the inner hair cells and another bundle just inside the tunnel, above the feet of the inner pillar cells. The majority of the fibres (some 95 percent in the human ear) end on the inner hair cells. The remainder cross the tunnel to form longitudinal bundles beneath the rows of the outer hair cells on which they eventually terminate.",
  "The endings of the nerve fibres beneath the hair cells are of two distinct types. The larger and more numerous endings contain many minute vesicles, or liquid-filled sacs, containing neurotransmitters , which mediate impulse transmission at neural junctions. These endings belong to a special bundle of nerve fibres that arise in the brainstem and constitute an efferent system, or feedback loop, to the cochlea. The smaller and less numerous endings contain few vesicles or other cell structures. They are the terminations of the afferent fibres of the cochlear nerve, which transmit impulses from the hair cells to the brainstem ( see  The physiology of hearing: Cochlear nerve and central auditory pathways ).",
  "The total number of outer hair cells in the cochlea has been estimated at 12,000 and the number of inner hair cells at 3,500. Although there are about 30,000 fibres in the cochlear nerve, there is considerable overlap in the innervation of the outer hair cells. A single fibre may supply endings to many hair cells, which thus share a “party line.” Furthermore, a single hair cell may receive nerve endings from many fibres. The actual distribution of nerve fibres in the organ of Corti has not been worked out in detail, but it is known that the inner hair cells receive the majority of afferent fibre endings without the overlapping and sharing of fibres that are characteristic of the outer hair cells.",
  "    Viewed from above, the organ of Corti with its covering, the reticular lamina, forms a well-defined mosaic pattern. In humans the arrangement of the outer hair cells in the basal turn of the cochlea is quite regular, with three distinct and orderly rows; but in the higher turns of the cochlea the arrangement becomes slightly irregular, as scattered cells form fourth or fifth rows. The spaces between the outer hair cells are filled by oddly shaped extensions (phalangeal plates) of the supporting cells. The double row of head plates of the inner and outer pillar cells cover the tunnel and separate the inner from the outer hair cells. The reticular lamina extends from the inner border cells near the inner sulcus to the Hensen cells but does not include either of these cell groups. When a hair cell degenerates and disappears as a result of aging, disease, or noise-induced injury, its place is quickly covered by the adjacent phalangeal plates, which expand to form an easily recognized “scar.”",
  "The perilymph, which fills the space within the bony labyrinth surrounding the membranous labyrinth, is similar, but not identical, in composition to other extracellular fluids of the body, such as cerebrospinal fluid . The concentration of sodium ions in the perilymph is high (about 150 milliequivalents per litre), and that of potassium ions is low (about 5 milliequivalents per litre), as is true of other extracellular fluids. Like these fluids, the perilymph is apparently formed locally from the blood plasma by transport mechanisms that selectively allow substances to cross the walls of the capillaries. Although it is anatomically possible for cerebrospinal fluid to enter the cochlea by way of the perilymphatic duct, experimental studies have made it appear unlikely that the cerebrospinal fluid is involved in the normal production of perilymph.",
  "The membranous labyrinth is filled with endolymph, which is unique among extracellular fluids of the body, including the perilymph, in that its potassium ion concentration is higher (about 140 milliequivalents per litre) than its sodium ion concentration (about 15 milliequivalents per litre).",
  "The process of formation of the endolymph and the maintenance of the difference in ionic composition between it and perilymph are not yet completely understood. The Reissner membrane forms a selective barrier between the two fluids. Blood-endolymph and blood-perilymph barriers, which control the passage of substances such as drugs from the blood to the inner ear, appear to exist as well. Evidence indicates that the endolymph is produced from perilymph as a result of selective ion transport through the epithelial cells of the Reissner membrane and not directly from the blood. The secretory tissue called the stria vascularis, in the lateral wall of the cochlear duct, is thought to play an important role in maintaining the high ratio of potassium ions to sodium ions in the endolymph. Other tissues of the cochlea, as well as the dark cells of the vestibular organs, which must produce their own endolymph, are also thought to be involved in maintaining the ionic composition of the endolymph. Because the membranous labyrinth is a closed system, the questions of flow and removal of the endolymph are also important. The endolymph is thought to be reabsorbed from the endolymphatic sac, although this appears to be only part of the story. Other cochlear and vestibular tissues may also have important roles in regulating the volume and maintaining the composition of the inner-ear fluids.",
  " Hearing is the process by which the ear transforms sound vibrations in the external environment into nerve impulses that are conveyed to the brain, where they are interpreted as sounds. Sounds are produced when vibrating objects, such as the plucked string of a guitar , produce pressure pulses of vibrating air molecules , better known as sound waves. The ear can distinguish different subjective aspects of a sound, such as its loudness and pitch , by detecting and analyzing different physical characteristics of the waves. Pitch is the perception of the frequency of sound waves—i.e., the number of wavelengths that pass a fixed point in a unit of time. Frequency is usually measured in cycles per second, or hertz. The human ear is most sensitive to and most easily detects frequencies of 1,000 to 4,000 hertz, but at least for normal young ears the entire audible range of sounds extends from about 20 to 20,000 hertz. Sound waves of still higher frequency are referred to as ultrasonic, although they can be heard by other mammals . Loudness is the perception of the intensity of sound—i.e., the pressure exerted by sound waves on the tympanic membrane. The greater their amplitude or strength, the greater the pressure or intensity, and consequently the loudness, of the sound. The intensity of sound is measured and reported in decibels (dB), a unit that expresses the relative magnitude of a sound on a logarithmic scale. Stated in another way, the decibel is a unit for comparing the intensity of any given sound with a standard sound that is just perceptible to the normal human ear at a frequency in the range to which the ear is most sensitive. On the decibel scale, the range of human hearing extends from 0 dB, which represents a level that is all but inaudible, to about 130 dB, the level at which sound becomes painful. (For a more in-depth discussion, see  sound .)",
  "  In order for a sound to be transmitted to the central nervous system, the energy of the sound undergoes three transformations. First, the air vibrations are converted to vibrations of the tympanic membrane and ossicles of the middle ear. These in turn become vibrations in the fluid within the cochlea. Finally, the fluid vibrations set up traveling waves along the basilar membrane that stimulate the hair cells of the organ of Corti. These cells convert the sound vibrations to nerve impulses in the fibres of the cochlear nerve, which transmits them to the brainstem, from which they are relayed, after extensive processing, to the primary auditory area of the cerebral cortex, the ultimate centre of the brain for hearing. Only when the nerve impulses reach this area does the listener become aware of the sound.",
  "The outer ear directs sound waves from the external environment to the tympanic membrane. The auricle, the visible portion of the outer ear, collects sound waves and, with the concha, the cavity at the entrance to the external auditory canal, helps to funnel sound into the canal. Because of its small size and virtual immobility, the auricle in humans is less useful in sound gathering and direction finding than it is in many animals. The canal helps to enhance the amount of sound that reaches the tympanic membrane. This resonance enhancement works only for sounds of relatively short wavelength—those in the frequency range between 2,000 and 7,000 hertz—which helps to determine the frequencies to which the ear is most sensitive, those important for distinguishing the sounds of consonants.",
  "Sounds reaching the tympanic membrane are in part reflected and in part absorbed. Only absorbed sound sets the membrane in motion. The tendency of the ear to oppose the passage of sound is called acoustic impedance. The magnitude of the impedance depends on the mass and stiffness of the membrane and the ossicular chain and on the frictional resistance they offer.",
  "When the tympanic membrane absorbs sound waves, its central portion, the umbo, vibrates as a stiff cone, bending inward and outward. The greater the force of the sound waves, the greater the deflection of the membrane and the louder the sound. The higher the frequency of a sound, the faster the membrane vibrates and the higher the pitch of the sound is. The motion of the membrane is transferred to the handle of the malleus, the tip of which is attached at the umbo. At higher frequencies the motion of the membrane is no longer simple, and transmission to the malleus may be somewhat less effective.",
  "The malleus and incus are suspended by small elastic ligaments and are finely balanced, with their masses evenly distributed above and below their common axis of rotation. The head of the malleus and the body of the incus are tightly bound together, with the result that they move as a unit in unison with the tympanic membrane. At moderate sound pressures, the vibrations are passed on to the stapes, and the whole ossicular chain moves as a single mass. However, there may be considerable freedom of motion and some loss of energy at the joint between the incus and the stapes because of their relatively loose coupling. The stapes does not move in and out but rocks back and forth about the lower pole of its footplate, which impinges on the membrane covering the oval window in the bony plate of the inner ear. The action of the stapes transmits the sound waves to the perilymph of the vestibule and the scala vestibuli.",
  "In order for sound to be transmitted to the inner ear, the vibrations in the air must be changed to vibrations in the cochlear fluids. There is a challenge involved in this task that has to do with difference in impedance—the resistance to the passage of sound—between air and fluid. This difference, or mismatch, of impedances reduces the transmission of sound. The tympanic membrane and the ossicles function to overcome the mismatch of impedances between air and the cochlear fluids, and thus the middle ear serves as a transformer , or impedance matching device.",
  "Ordinarily, when airborne sound strikes the surface of a body of water, almost all of its energy is reflected; only about 0.1 percent passes into the water. In the ear this would represent a transmission loss of 30 dB, enough to seriously limit the ear’s performance, were it not for the transformer action of the middle ear. The matching of impedances is accomplished in two ways: primarily by the reduction in area between the tympanic membrane and the stapes footplate and secondarily by the mechanical advantage of the lever formed by the malleus and incus. Although the total area of the tympanic membrane is about 69 square mm (0.1 square inch), the area of its central portion that is free to move has been estimated at about 43 square mm. The sound energy that causes this area of the membrane to vibrate is transmitted and concentrated in the 3.2-square-mm area of the stapes footplate. Thus, the pressure is increased at least 13 times. The mechanical advantage of the ossicular lever (which exists because the handle of the malleus is longer than the long projection of the incus) amounts to about 1.3. The total increase in pressure at the footplate is, therefore, not less than 17-fold, depending on the area of the tympanic membrane that is actually vibrating. At frequencies in the range of 3,000 to 5,000 hertz, the increase may be even greater because of the resonant properties of the ear canal.",
  "The ossicular chain not only concentrates sound in a small area but also applies sound preferentially to one window of the cochlea, the oval window. If the oval and round windows were exposed equally to airborne sound crossing the middle ear, the vibrations in the perilymph of the scala vestibuli would be opposed by those in the perilymph of the scala tympani, and little effective movement of the basilar membrane would result. As it is, sound is delivered selectively to the oval window, and the round window moves in reciprocal fashion, bulging outward in response to an inward movement of the stapes footplate and inward when the stapes moves away from the oval window. The passage of vibrations through the air across the middle ear from the tympanic membrane to the round window is of negligible importance.",
  "Thanks to these mechanical features of the middle ear, the hair cells of the normal cochlea are able to respond, at the threshold of hearing for frequencies to which the ear is most sensitive, to vibrations of the tympanic membrane on the order of 1 angstrom (Å; 1 Å = 0.0000001 mm) in amplitude. On the other hand, when the ossicular chain is immobilized by disease, as in otosclerosis , which causes the stapes footplate to become fixed in the oval window, the threshold of hearing may increase by as much as 60 dB (1,000-fold), which represents a significant degree of impairment. Bypassing the ossicular chain through the surgical creation of a new window, as can be accomplished with the fenestration operation, can restore hearing to within 25 to 30 dB of normal. Only if the fixed stapes is removed (stapedectomy) and replaced by a tiny artificial stapes can normal hearing be approached. Fortunately, operations performed on the middle ear have been perfected so that defects causing conductive impairment often can be corrected and a useful level of hearing restored.",
  "The muscles of the middle ear, the tensor tympani and the stapedius, can influence the transmission of sound by the ossicular chain. Contraction of the tensor tympani pulls the handle of the malleus inward and, as the name of the muscle suggests, tenses the tympanic membrane. Contraction of the stapedius pulls the stapes footplate outward from the oval window and thereby reduces the intensity of sound reaching the cochlea. The stapedius responds reflexly with quick contraction to sounds of high intensity applied either to the same ear or to the opposite ear. The reflex has been likened to the blink of the eye or the constriction of the pupil of the eye in response to light and is thought to have protective value. Unfortunately, the contractions of the middle-ear muscles are not instantaneous, so that they do not protect the cochlea against damage by sudden intense noise, such as that of an explosion or of gunfire. They also fatigue rather quickly and thus offer little protection against injury sustained from high-level noise, such as that experienced in rock concerts and many industrial workplaces.",
  "There is another route by which sound can reach the inner ear: by conduction through the bones of the skull . When the handle of a vibrating tuning fork is placed on a bony prominence such as the forehead or mastoid process behind the ear, its note is clearly audible. Similarly, the ticking of a watch held between the teeth can be distinctly heard. When the external canals are closed with the fingers, the sound becomes louder, indicating that it is not entering the ear by the usual channel. Instead, it is producing vibrations of the skull that are passed on to the inner ear, either directly or indirectly, through the bone.",
  "The higher audible frequencies cause the skull to vibrate in segments, and these vibrations are transmitted to the cochlear fluids by direct compression of the otic capsule, the bony case enclosing the inner ear. Because the round window membrane is more freely mobile than the stapes footplate, the vibrations set up in the perilymph of the scala vestibuli are not canceled out by those in the scala tympani, and the resultant movements of the basilar membrane can stimulate the organ of Corti. This type of transmission is known as compression bone conduction.",
  "At lower frequencies—i.e., 1,500 hertz and below—the skull moves as a rigid body. The ossicles are less affected and move less freely than the cochlea and the margins of the oval window because of their inertia, their suspension in the middle-ear cavity, and their loose coupling to the skull. The result is that the oval window moves with respect to the footplate of the stapes, which gives the same effect as if the stapes itself were vibrating. This form of transmission is known as inertial bone conduction. In otosclerosis the fixed stapes interferes with inertial, but not with compressional, bone conduction.",
  "In persons with middle-ear disease, hearing aids with special vibrators are sometimes used to deliver sound to the mastoid process (the part of the temporal bone behind the ear); the sound is then conducted by bone to the inner ear. Bone conduction is also the basis of some of the oldest, simplest, and most useful tests in the repertoire of the otologist. These tests employ tuning forks to distinguish between conductive impairment, which affects the middle ear and is amenable to surgery , and sensorineural impairment, which affects the inner ear and the cochlear nerve and for which surgery usually is not indicated.",
  "The mechanical vibrations of the stapes footplate at the oval window creates pressure waves in the perilymph of the scala vestibuli of the cochlea. These waves move around the tip of the cochlea through the helicotrema into the scala tympani and dissipate as they hit the round window. The wave motion is transmitted to the endolymph inside the cochlear duct. As a result the basilar membrane vibrates, which causes the organ of Corti to move against the tectoral membrane, stimulating generation of nerve impulses to the brain .",
  "The vibrations of the stapes footplate against the oval window do not affect the semicircular canals or the utricle of the vestibular system unless middle-ear disease has eroded the bony wall of the lateral canal and produced an abnormal opening. In such a case loud sounds may cause transient vertigo (the Tullio phenomenon). However, laboratory evidence suggests that the saccule of mammals may retain some degree of responsiveness to intense sound, an intriguing observation because the saccule is the organ of hearing in fish, the distant ancestors of mammals. Normally only the cochlear fluids and the cochlear duct vibrate in response to alternating pressures at the oval window, because only the cochlea has the round window as a “relief valve.”",
  "  Within the cochlea the different frequencies of complex sounds are sorted out, or analyzed, and the physical energy of these sound vibrations is converted, or transduced, into electrical impulses that are transmitted to the brainstem by the cochlear nerve. The cochlea analyzes sound frequencies (distinguishes pitch ) by means of the basilar membrane, which exhibits different degrees of stiffness, or resonance, along its length.",
  "The idea of the ear as a multiresonant structure was proposed by several anatomists in the 17th and 18th centuries. In the late 19th century German physicist and physiologist Hermann von Helmholtz explicitly stated these ideas in his resonance theory of hearing. Inspired by the anatomic studies of the cochlea by Alfonso Corti, Helmholtz postulated that there was a series of resonators in the cochlea capable of analyzing complex sounds into their component frequencies. After examining various structures of the inner ear, he identified the resonators to be fibres that span the basilar membrane. The fibres vary in length like piano strings, increasing progressively from the basal end of the basilar membrane to the apex at the tip of the cochlea. Helmholtz conjectured that the length of the fibres tunes them to vibrate at specific frequencies. Although Helmholtz’s resonance theory in its original form is no longer accepted, clinical and experimental data support the closely related “place theory,” which holds that sounds of different frequency activate different regions of the basilar membrane and organ of Corti.",
  "Subsequent experiments carried out in the 20th century by Hungarian-born American physicist and physiologist Georg von Békésy showed that the way in which the cochlea analyzes frequency, or distinguishes pitch, does not occur because of a series of separately tuned resonators, as Helmholtz had theorized. Instead, pitch is distinguished because of the continuous changes that occur along the length of the basilar membrane, which increases in width and mass and decreases in stiffness from its base near the oval window to its apex. Each region of the membrane is most affected by a specific frequency of vibrations. Low-frequency sounds cause the apical end of the membrane to vibrate, and high-frequency sounds cause the basal end to vibrate. Vibrations reaching the basal end through the perilymph proceed along the membrane as traveling waves that attain their maximum amplitude at a distance corresponding to their frequency and then rapidly subside. The higher the frequency of the sound imposed, the shorter the distance the waves travel. Thus, a tone of a given frequency causes stimulation to reach a peak at a certain place on the basilar membrane. The region that vibrates most vigorously stimulates the greatest number of hair cells in that area of the organ of Corti, and these hair cells send the most nerve impulses to the auditory nerve and the brain . The brain recognizes the place on the basilar membrane, and thus the pitch of the tone, by the particular group of nerve fibres activated. For the lower frequencies—up to about 3,000 hertz—the rate of stimulation is also an important indicator of pitch. This means that the auditory nerve fibres convey information to the brain about the timing of the sound frequency as well as its place of maximum vibration on the membrane. For higher frequencies, place alone seems to be decisive.",
  " Loudness also is determined at this level by the amplitude, or height, of the vibration of the basilar membrane. As a sound increases, so does the amplitude of the vibration. This increases both the number of hair cells stimulated and the rate at which they generate nerve impulses.",
  "The hair cells located in the organ of Corti transduce mechanical sound vibrations into nerve impulses. They are stimulated when the basilar membrane, on which the organ of Corti rests, vibrates. The hair cells are held in place by the reticular lamina, a rigid structure supported by the pillar cells, or rods of Corti, which are attached to the basilar fibres. At the base of the hair cells is a network of cochlear nerve endings, which lead to the spiral ganglion of Corti in the modiolus of the cochlea. The spiral ganglion sends axons into the cochlear nerve. At the top of the hair cell is a hair bundle containing stereocilia, or sensory hairs, that project upward into the tectorial membrane, which lies above the stereocilia in the cochlear duct. (The single kinocilium, which is found on the hair cells of the vestibular system, is not found on the receptor cells of the cochlea.) When the basilar membrane moves upward, the reticular lamina moves upward and inward; when the membrane moves downward, the reticular lamina moves downward and outward. The resultant shearing forces between the reticular lamina and the tectorial membrane displace or bend the longest of the stereocilia, exciting the nerve fibres at the base of the hair cells.",
  "The mechanism the hair cell uses to convert sound into an electrical stimulus is not completely understood, but certain key features are known. One of the most important aspects of this process is the endocochlear potential, which exists between the endolymph and perilymph. This direct current potential difference is about +80 millivolts and results from the difference in potassium content between the two fluids. It is thought to be maintained by the continual transport of potassium ions from the perilymph into the cochlear duct by the stria vascularis. The endolymph, which has a high potassium level and a positive potential, is contained in the cochlear duct and thus bathes the tops of the hair cells. The perilymph, which has a low potassium level and a negative potential, is contained in the scala vestibuli and scala tympani and bathes the lower parts of the hair cells. The inside of the hair cell has a negative intracellular potential of -60 millivolts with respect to the perilymph and -140 millivolts with respect to the endolymph. This rather steep gradient, especially at the tip of the cell, is thought to sensitize the cell to the slightest sound.",
  "The stereocilia are graded in height, becoming longer on the side away from the modiolus. All the stereocilia are interlinked so that, when the taller ones are moved against the tectorial membrane, the shorter ones move as well. The mechanical movement of this hair bundle generates an alternating hair cell receptor potential. This occurs in the following manner. When the stereocilia are bent in the direction of increasing stereocilia length, ion channels in the membrane open, allowing potassium ions to move into the cell. The influx of potassium ions excites, or depolarizes, the hair cell. However, when the stereocilia are deflected in the opposite direction, the ion channels are shut and the hair cell is inhibited, or hyperpolarized. The depolarization of the cell stimulates the release of chemicals called neurotransmitters from the base of the hair cell. The neurotransmitters are absorbed by the nerve fibres located at the basal end of the hair cell, stimulating them to send an electrical signal along the cochlear nerve.",
  "The outer hair cells contain both actin and myosin, the same contractile proteins that make up muscles, and this allows the cells to contract rhythmically in response to tonal stimuli. Recent studies suggest that the cells themselves may be tuned structures. The ability of an outer hair cell to respond to a particular frequency may depend not only on its position along the length of the basilar membrane but also on its mechanical resonance, which probably varies with the length of its bundle of stereocilia and with that of its cell body. The inner hair cells are much more uniform in size. Local groups of outer hair cells not only act as detectors of low-level sound stimuli. They can act as mechanical-electrical stimulators and feedback elements, and accordingly they are believed to modify and enhance the discriminatory responses of the inner hair cells. How they do this is not understood. Because the inner hair cells rest on the bony shelf of the osseous spiral lamina rather than on the basilar membrane, they are presumably less readily stimulated by the traveling wave. Help from the outer hair cells may be required to generate the signal that the inner cells transmit synaptically to the fibres of the cochlear nerve. Experiments in animals have shown that when the outer hair cells of the basal turn have been destroyed by the ototoxic action of the antibiotic kanamycin, the inner hair cells in the same region can still respond to sound, but their thresholds are elevated by about 40 dB.",
  "Remarkably, the cochlea itself actually produces sounds. Its otacoustic emissions can be spontaneous or evoked by external acoustic stimulation. These emissions are thought to be produced by rhythmical contractions of the cochlear hair cells. Although faint, they can be recorded with a small microphone placed in the external canal; they are absent when there has been extensive loss of hair cells from the basal turn, as in cases of presbycusis or ototoxicity. While these emissions challenge some earlier concepts of the micromechanisms of cochlear function, they are proving increasingly useful in the audiological evaluation of impaired hearing, in adults as well as infants.",
  "The vestibulocochlear nerve consists of two anatomically and functionally distinct parts: the cochlear nerve, which innervates the organ of hearing, and the vestibular nerve, which innervates the organs of equilibrium. The fibres of the cochlear nerve originate from an aggregation of nerve cell bodies, the spiral ganglion, located in the modiolus of the cochlea. The neurons of the spiral ganglion are called bipolar cells because they have two sets of processes, or fibres, that extend from opposite ends of the cell body. The longer, central fibres, also called the primary auditory fibres, form the cochlear nerve, and the shorter, peripheral fibres extend to the bases of the inner and outer hair cells. They extend radially from the spiral ganglion to the habenula perforata, a series of tiny holes beneath the inner hair cells. At this point they lose their myelin sheaths and enter the organ of Corti as thin unmyelinated fibres. There are only about 30,000 of these fibres, and the greater number of them—about 95 percent—innervate the inner hair cells. The remainder cross the tunnel of Corti to innervate the outer hair cells. The longer central processes of the bipolar cochlear neurons unite and are twisted like the cords of a rope to form the cochlear nerve trunk. These primary auditory fibres exit the modiolus through the internal meatus, or passageway, and immediately enter the part of the brainstem called the medulla oblongata .",
  "The central auditory pathways extend from the medulla to the cerebral cortex. They consist of a series of nuclei (groups of nerve cell bodies in the central nervous system similar to a peripheral ganglion) connected by fibre tracts made up of their axons (processes that convey signals away from the cell bodies). This complex chain of nerve cells helps to process and relay auditory information, encoded in the form of nerve impulses, directly to the highest cerebral levels in the cortex of the brain. To some extent different properties of the auditory stimulus are conveyed along distinct parallel pathways. This method of transmission, employed by other sensory systems, provides a means for the central nervous system to analyze different properties of the single auditory stimulus, with some information processed at low levels and other information at higher levels. At lower levels of the pathway, information as to pitch, loudness, and localization of sounds is processed, and appropriate responses, such as the contraction of the intra-aural muscles, turning of the eyes and head, or movements of the body as a whole, are initiated.",
  "In the medulla oblongata the fibres of the cochlear nerve terminate when they reach a collection of nerve cells called the cochlear nucleus. The cochlear nucleus consists of several distinct cell types and is divided into the dorsal and ventral cochlear nucleus. Each cochlear nerve fibre branches at the cochlear nucleus, sending one branch to the dorsal and the other branch to the ventral cochlear nucleus.",
  "Some fibres from the ventral cochlear nucleus pass across the midline to the cells of the superior olivary complex, whereas others make connection with the olivary cells of the same side. Together, these fibres form the trapezoid body. Fibres from the dorsal cochlear nucleus cross the midline to end on the cells of the nuclei of the lateral lemniscus. There they are joined by the fibres from the ventral cochlear nuclei of both sides and from the olivary complex. The lemniscus is a major tract, most of the fibres of which end in the inferior colliculus, the auditory centre of the midbrain, although some fibres may bypass the colliculus and end, together with the fibres from the colliculus, at the next higher level, the medial geniculate body. From the medial geniculate body there is an orderly projection of fibres to a portion of the cortex of the temporal lobe.",
  "In humans and other primates the primary acoustic area in the cerebral cortex is the superior transverse temporal gyri of Heschl, a ridge in the temporal lobe, on the lower lip of the deep cleft between the temporal and parietal lobes, known as the sylvian fissure.",
  "Because about half of the fibres of the auditory pathways cross the midline while others ascend on the same side of the brain, each ear is represented in both the right and left cortex. For this reason, even when the auditory cortical area of one side is injured by trauma or stroke, binaural hearing may be little affected. Impaired hearing due to bilateral cortical injury involving both auditory areas has been reported, but it is extremely rare.",
  "Parallel with the pathway ascending from the cochlear nuclei to the cortex is a pathway descending from the cortex to the cochlear nuclei. In both pathways some of the fibres remain on the same side, while others cross the midline to the opposite side of the brain. There is also evidence of a “spur” line ascending from the dorsal cochlear nucleus to the cerebellum and another descending from the inferior colliculus to the cerebellum. The significance of these cerebral connections is not clear, but they may antedate the evolutionary development of the cerebral cortex. In general, the descending fibres may be regarded as exercising an inhibitory function by means of a sort of “negative feedback.” They also may determine which ascending impulses are to be blocked and which are allowed to pass on to the higher centres of the brain.",
  "From the superior olivary complex, a region in the medulla oblongata, there arises also a fibre tract called the olivocochlear bundle. It constitutes an efferent system, or feedback loop, by which nerve impulses, thought to be inhibitory, reach the hair cells. This system, which uses acetylcholine as a neurotransmitter, is presumably involved in sharpening, or otherwise modifying, the analysis that is made in the cochlea.",
  "Evidence of orderly spatial representations of the organ of Corti at the lower levels of the auditory pathway has been reported by many investigators. These patterns seem to be in accord with the place theory of the cochlear analysis of sound . Physiological evidence of tuning of the auditory system also has been obtained by recording with the electrical potentials from individual neurons at various levels. Most neurons of the auditory pathway show a “best frequency”—i.e., a frequency to which the individual neuron responds at minimal intensity. This finding is entirely compatible with experimental evidence of frequency tuning of the hair cells. With each increase in the intensity of the sound stimulus, the neuron is able to respond to a wider band of frequencies, thus reflecting the broad tuning of the basilar membrane. With sounds of lower frequency, the rate of impulses fired by the neuron reflects the stimulus frequency, and the response often reveals phase-locking with the stimulus; that is, the nerve fibres are stimulated at regularly recurring intervals, corresponding to a particular position or phase, of each sound wave. Increased intensity of stimulation causes a more rapid rate of responding. In general, the pitch of a sound tends to be coded in terms of which neurons are responding, and its loudness is determined by the rate of response and the total number of neurons activated.",
  "Although extensive studies have been made of the responses of single cortical neurons, the data do not yet fit any comprehensive theory of auditory analysis. Experiments in animals have indicated that the cortex is not even necessary for frequency recognition, which can be carried out at lower levels, but that it is essential for the recognition of temporal patterns of sound. It appears likely, therefore, that in humans the cortex is reserved for the analysis of more complex auditory stimuli, such as speech and music, for which the temporal sequence of sounds is equally important.",
  "Presumably it is also at the cortical level that the meaning of sounds is interpreted and behaviour is adjusted in accordance with their significance. Such functions were formerly attributed to an “auditory association area” immediately surrounding the primary area, but they probably should be thought of as involving much more of the cerebral cortex, thanks to the multiple, parallel interconnections between the various areas.",
  "The localization of sounds from a stationary source in the horizontal plane is known to depend on the recognition of minute differences in the intensity and time of arrival of the sound at the two ears. A sound that arrives at the right ear a few microseconds sooner than it does at the left or that registers a few decibels louder in that ear is recognized as coming from the right. In a real-life situation the head may also be turned to pinpoint the sound by facing it and thus canceling these differences. For low-frequency tones a difference in phase at the two ears is the criterion for localization, but for higher frequencies the difference in loudness caused by the sound shadow of the head becomes all-important. Such comparisons and discriminations appear to be carried out at brainstem and midbrain levels of the central auditory pathway. The spectral shapes of sounds have been shown to be most important for determining the elevation of a source that is not in the horizontal plane. Localization of sound that emanates from a moving source is a more complicated task for the nervous system, apparently involving the cerebral cortex and short-term memory . Experiments in animals have shown that injury to the auditory area of the cortex on one side of the brain interferes with the localization of a moving sound source on the opposite side of the body.",
  "Each cochlear nucleus receives impulses only from the ear of the same side. A comparison between the responses of the two ears first becomes possible at the superior olivary complex, which receives fibres from both cochlear nuclei. Electrophysiological experiments in animals have shown that some neurons of the accessory nucleus of the olivary complex respond to impulses from both ears. Others respond to impulses from one side exclusively, but their response is modified by the simultaneous arrival of impulses from the other side.",
  "The system appears to be capable of making the extraordinarily fine discriminations of time and intensity that are necessary for sound localization. By virtue of such bilateral neural interconnections in the brain, the two ears together can be much more effective than one ear alone in picking out a particular sound in the presence of a background of noise. They also permit attention to be directed to a single source of sound, such as one instrument in an orchestra or one voice in a crowd. This is one aspect of the “cocktail party effect,” whereby a listener with normal hearing can attend to different conversations in turn or concentrate on one speaker despite the surrounding babble. Whether the muscles within the ear play a part in filtering out unwanted sounds during such selective listening has not been established. The less-favourable aspect of the cocktail party effect is that such background noises mask dialogue, making it difficult for persons with sensorineural impairment, such as many elderly individuals, to follow a conversation. In such a situation a single hearing aid may be of little use, but one in each ear may be of more help.",
  "Before the development of electroacoustic equipment for generating and measuring sound, the available tests of hearing gave approximate answers at best. A person’s hearing could be specified in terms of the ability to distinguish the ticking of a watch or the clicking of coins or the distance at which conversational speech or a whispered voice could be understood. The examiner also might note the length of time the person could hear the gradually diminishing note of a tuning fork , comparing the performance with his own.",
  "A qualitative assessment of hearing loss can be carried out with a tuning fork. Such tests exploit the ability of sound to be conducted through the bones of the skull .",
  "In the Rinne test the sounding tuning fork is placed on the mastoid process, and the person being tested is asked to report when it is no longer heard. The examiner then removes the fork immediately and holds the prongs close to the open ear canal. The normal ear continues to hear it for about 45 seconds, and this “positive” result occurs also with incomplete sensorineural impairment of hearing. When the result is “negative” and the fork is heard longer by bone conduction than by air conduction, a conductive type of deafness is present. In the Schwabach test the presence of a sensorineural impairment is indicated when the individual being tested cannot hear the bone-conducted sound as long as the examiner with normal hearing can. The individual with a conductive hearing loss, however, can hear the fork for a longer period of time than the examiner because the conductive lesion excludes the extraneous airborne masking noise of the surroundings. A bone-conduction audiometer would give a similar result.",
  "For the Weber test, the fork is simply placed on the person’s forehead, and the examiner asks in which ear the person hears it. If a sensorineural lesion is present in one ear, the person will localize the sound in the opposite, or “better,” ear. If a conductive defect is present, the person will localize it in the “worse” ear—i.e., the one that is protected from interference by extraneous sounds. This simple test has been a valuable aid in the diagnosis of otosclerosis for many years.",
  "With the introduction of the electric audiometer in the 1930s, it became possible to measure an individual’s hearing threshold for a series of pure tones ranging from a lower frequency of 125 hertz to an upper frequency of 8,000 or 10,000 hertz. This span includes the three octaves between 500 and 4,000 hertz that are most important for speech .",
  "The audiometer consists of an oscillator or a signal generator , an amplifier , a device called an attenuator, which controls and specifies the intensity of tones produced, and an earphone or loudspeaker . The intensity range is usually 100 dB in steps of 5 dB. The “zero dB” level represents normal hearing for young adults under favourable noise -free laboratory conditions. It was established in 1964 as an international standard.",
  "In pure- tone audiometry, each ear is tested separately while the other is shielded against sound. The person being tested wears an earphone or sits in front of a loudspeaker in a quiet test chamber, having been instructed to give a hand signal whenever a brief tone is sounded. The audiologist proceeds to determine the lowest intensity for each frequency at which the person reports being just able to hear the tone 50 percent of the time. For example, one who hears the tone of 4,000 hertz only half the time at the 40-dB setting has a 40-dB hearing level for that frequency—i.e., a threshold 40 dB above the normal threshold. A graph showing the hearing level for each ear by octaves and half octaves across the frequency range of 125 to 8,000 hertz is called an audiogram. The shape of the audiogram for an individual who is hard of hearing can provide the otologist or audiologist with important information for determining the nature and cause of the hearing defect. (The audiologist is primarily concerned with measuring the degree of hearing impairment; the otologist diagnoses and treats defects and diseases of the ear by medical or surgical means.)",
  "A calibrated bone-conduction vibrator usually is furnished with the audiometer so that hearing by bone conduction also can be measured. When an individual has otosclerosis or another conductive defect of the middle ear, there may be a sizable difference between the air-conduction and bone-conduction audiograms, the so-called air-bone gap. This difference is a measure of the loss in transmission across the middle ear and indicates the maximum improvement that may be obtained through successful corrective surgery. When the defect is confined to the organ of Corti, the bone-conduction audiogram shows the same degree of loss as the air-conduction audiogram. In such cases of sensorineural impairment, surgery is seldom capable of improving hearing, but a hearing aid may be helpful.",
  "Although faint sounds may not be heard at all by the ear with a sensorineural impairment, more intense sounds may be as loud as they are to a healthy ear. This rapid increase in loudness above the threshold level is called recruitment. When the opposite ear has normal hearing, recruitment can be measured by the alternate binaural loudness balance test. The subject is asked to set the controls so that the loudness of the tone heard in the defective ear matches that of the tone heard in the normal ear. By repeating the comparison at several intensity levels, the presence or absence of recruitment can be demonstrated. When recruitment is excessive, the range of useful hearing between the threshold and the level at which loudness becomes uncomfortable or intolerable may be narrow, so that the amplification provided by a hearing aid is of limited value to the subject.",
  "Although hearing thresholds for pure tones give some indication of the person’s ability to hear speech, direct measurement of this ability is also important. Two types of tests are used most often. In one test the speech reception threshold is measured by presenting words of spondee pattern—i.e., words containing two syllables of equal emphasis, as in “railway” or “football”—at various intensity levels until the level is found at which the person can just hear and repeat half the words correctly. This level usually corresponds closely to the average of the person’s thresholds for frequencies of 500, 1,000, and 2,000 hertz. A more important measure of socially useful hearing is the discrimination score. For this test a list of selected monosyllabic words is presented at a comfortable intensity level, and the subject is scored in terms of the percentage of words heard correctly. This test is helpful in evaluating certain forms of hearing impairment in which the sounds may be audible but words remain unintelligible.",
  "Such tests are usually carried out in a quiet, sound-treated room that excludes extraneous noise. They may give an overly optimistic impression of the ability of the individual with a sensorineural impairment to understand speech in ordinary noisy surroundings. For this reason, speech tests are best carried out against a standardized noise background as well as in the quiet. A person with a conductive defect may be less disturbed by the noisy environment than a healthy subject. More elaborate tests, which often involve speech or sound localization, are available for evaluating hearing when central defects of the auditory system are suspected as a result of aging, disease, or injury. Their interpretation may be difficult, however, and the diagnostic information they furnish may be unclear.",
  "When the hearing of infants or others who are unable to cooperate in standard audiometric tests must be measured, their thresholds for pure tones can be established by electrophysiological means. One type of test is the electrocochleogram (ECoG). Electric potentials representing impulses in the cochlear nerve are recorded from the outer surface of the cochlea by means of a fine, insulated needle electrode inserted through the tympanic membrane to make contact with the promontory of the basal turn. This test provides a direct sampling of cochlear function.",
  "A noninvasive, painless, and more frequently used test is brain-stem-evoked response audiometry (BERA). In this test electrodes are pasted to the skin (one placed behind the ear) and are used to record the neural responses to brief tones. The minute potentials evoked by a train of brief sound stimuli are suitably amplified and averaged by a small computer to cancel out background activity, such as potentials from muscles or the cerebral cortex. The typical recording shows a series of five or six waves that represent the responses of successive neural centres of the auditory pathway of the brainstem and provide information about the strength and timing of their activity.",
  "A simple and objective means of testing hearing at the level of the cochlea and brainstem is supplied by impedance audiometry. Two small tubes are sealed into the external canal. Through one tube sound from a small loudspeaker is injected into the canal. The portion that is reflected from the tympanic membrane is picked up by the other tube and led to a microphone , amplifier , and recorder. When a sudden moderately intense sound is applied to the opposite ear, the stapedius muscle contracts, the impedance is increased, and the recorder shows a slight excursion as more sound is reflected. This test can provide information not only about the condition of the cochlea and the auditory pathways of the medulla but also about the facial nerve that innervates the stapedius muscle. However, it does not give an actual measurement of the acoustic impedance of the ear, representing the state of the ossicular chain and the mobility of the tympanic membrane . This information can be obtained by means of the acoustic bridge—a device that enables the examiner to listen simultaneously to a sound reflected from the tympanic membrane of the subject and a sound of equal intensity reflected in an artificial cavity, with the volume being adjusted to equal that of the external canal of the ear being tested. When the two sounds are matched by varying the acoustic impedance of the cavity, the impedance of the ear is equal to that of the cavity, which can be read directly from the scale of the instrument.",
  "Conductive defects of the middle ear, including disarticulation (separation) of the ossicular chain and immobility of the malleus or stapes, can be recognized by the characteristic changes they cause in the impedance of the ear as revealed by tympanometry. This test procedure consists in raising and lowering the air pressure in the middle ear to alter the stiffness in the tympanic membrane while measuring the changes in its compliance in terms of the amount of sound reflected from it.",
  "  Profound sensorineural deafness can occur as a result of viral or other infection, including mumps , measles , and meningitis . Rubella (German measles) in the mother during pregnancy can cause severe damage to the organ of Corti, resulting in profound hearing impairment in the child. Cochlear abnormalities may be present also as a result of genetic defects. The electrophysiological hearing tests described above—BERA and ECoG—make it possible to detect such loss in infants . In all such cases of deafness in young children, it is essential that the condition be recognized as early as possible so that appropriate counseling in matters of care and education may be obtained. As an important aid in learning to speak, surgical implantation of an electronic cochlear prosthesis ( cochlear implant ) should be considered before the child reaches school age. This device, while controversial within the deaf community, has proved effective in restoring a significant degree of hearing to many young children with congenital deafness.",
  "    The vestibular system is the sensory apparatus of the inner ear that helps the body maintain its postural equilibrium. The information furnished by the vestibular system is also essential for coordinating the position of the head and the movement of the eyes. There are two sets of end organs in the inner ear, or labyrinth: the semicircular canals, which respond to rotational movements (angular acceleration); and the utricle and saccule within the vestibule, which respond to changes in the position of the head with respect to gravity (linear acceleration). The information these organs deliver is proprioceptive in character, dealing with events within the body itself, rather than exteroceptive, dealing with events outside the body, as in the case of the responses of the cochlea to sound. Functionally these organs are closely related to the cerebellum and to the reflex centres of the spinal cord and brainstem that govern the movements of the eyes, neck, and limbs.",
  "Although the vestibular organs and the cochlea are derived embryologically from the same formation, the otic vesicle, their association in the inner ear seems to be a matter more of convenience than of necessity. From both the developmental and the structural point of view, the kinship of the vestibular organs with the lateral line system of the fish is readily apparent. The lateral line system is made up of a series of small sense organs located in the skin of the head and along the sides of the body of fishes. Each organ contains a crista, sensory hair cells, and a cupula, as found in the ampullae of the semicircular ducts. The cristae respond to waterborne vibrations and to pressure changes.",
  "The anatomists of the 17th and 18th centuries assumed that the entire inner ear, including the vestibular apparatus, is devoted to hearing. They were impressed by the orientation of the semicircular canals, which lie in three planes more or less perpendicular to one another, and believed that the canals must be designed for localizing a source of sound in space. The first investigator to present evidence that the vestibular labyrinth is the organ of equilibrium was French experimental neurologist Marie-Jean-Pierre Flourens , who in 1824 reported a series of experiments in which he had observed abnormal head movements in pigeons after he had cut each of the semicircular canals in turn. The plane of the movements was always the same as that of the injured canal. Hearing was not affected when he cut the nerve fibres to these organs, but it was abolished when he cut those to the basilar papilla (the bird’s uncoiled cochlea). It was not until almost half a century later that the significance of his findings was appreciated and the semicircular canals were recognized as sense organs specifically concerned with the movements and position of the head.",
  "Because the three semicircular canals—superior, posterior, and horizontal—are positioned at right angles to one another, they are able to detect movements in three-dimensional space. When the head begins to rotate in any direction, the inertia of the endolymph causes it to lag behind, exerting pressure that deflects the cupula in the opposite direction. This deflection stimulates the hair cells by bending their stereocilia in the opposite direction. German physiologist Friedrich Goltz formulated the “hydrostatic concept” in 1870 to explain the working of the semicircular canals. He postulated that the canals are stimulated by the weight of the fluid they contain, the pressure it exerts varying with the head position. In 1873 Austrian scientists Ernst Mach and Josef Breuer and Scottish chemist Crum Brown, working independently, proposed the “hydrodynamic concept,” which held that head movements cause a flow of endolymph in the canals and that the canals are then stimulated by the fluid movements or pressure changes. German physiologist J.R. Ewald showed that the compression of the horizontal canal in a pigeon by a small pneumatic hammer causes endolymph movement toward the crista and turning of the head and eyes toward the opposite side. Decompression reverses both the direction of endolymph movement and the turning of the head and eyes. The hydrodynamic concept was proved correct by later investigators who followed the path of a droplet of oil that was injected into the semicircular canal of a live fish. At the start of rotation in the plane of the canal, the cupula was deflected in the direction opposite to that of the movement and then returned slowly to its resting position. At the end of rotation it was deflected again, this time in the same direction as the rotation, and then returned once more to its upright stationary position. These deflections resulted from the inertia of the endolymph, which lags behind at the start of rotation and continues its motion after the head has ceased to rotate. The slow return is a function of the elasticity of the cupula itself.",
  "These opposing deflections of the cupula affect the vestibular nerve in different ways, which have been demonstrated in experiments involving the labyrinth removed from a cartilaginous fish. The labyrinth, which remained active for some time after its removal from the animal, was used to record vestibular nerve impulses arising from one of the ampullar cristae. When the labyrinth was at rest there was a slow, continuous, spontaneous discharge of nerve impulses, which was increased by rotation in one direction and decreased by rotation in the other. In other words, the level of excitation rose or fell depending on the direction of rotation.",
  "The deflection of the cupula excites the hair cells by bending the cilia atop them: deflection in one direction depolarizes the cells; deflection in the other direction hyperpolarizes them. Electron-microscopic studies have shown how this polarization occurs. The hair bundles in the cristae are oriented along the axis of each canal. For example, each hair cell of the horizontal canals has its kinocilium facing toward the utricle, whereas each hair cell of the superior canals has its kinocilium facing away from the utricle. In the horizontal canals, deflection of the cupula toward the utricle—i.e., bending of the stereocilia toward the kinocilium—depolarizes the hair cells and increases the rate of discharge. Deflection away from the utricle causes hyperpolarization and decreases the rate of discharge. In superior canals these effects are reversed.",
  "The gravity receptors that respond to linear acceleration of the head are the maculae of the utricle and saccule. The left and right utricular maculae are in the same, approximately horizontal, plane and, because of this position, are more useful in providing information about the position of the head and its side-to-side tilts when a person is in an upright position. The saccular maculae are in parallel vertical planes and probably respond more to forward and backward tilts of the head.",
  "Both pairs of maculae are stimulated by shearing forces between the otolithic membrane and the cilia of the hair cells beneath it. The otolithic membrane is covered with a mass of minute crystals of calcite (otoconia), which add to the membrane’s weight and increase the shearing forces set up in response to a slight displacement when the head is tilted. The hair bundles of the macular hair cells are arranged in a particular pattern—facing toward (in the utricle) or away from (in the saccule) a curving midline—that allows detection of all possible head positions. These sensory organs, particularly the utricle, have an important role in the righting reflexes and in reflex control of the muscles of the legs , trunk, and neck that keep the body in an upright position. The role of the saccule is less completely understood. Some investigators have suggested that it is responsive to vibration as well as to linear acceleration of the head in the sagittal (fore and aft) plane. Of the two receptors, the utricle appears to be the dominant partner. There is evidence that the mammalian saccule may even retain traces of its sensitivity to sound inherited from the fishes, in which it is the organ of hearing.",
  "The relation between the vestibular apparatus of the two ears is reciprocal. When the head is turned to the left, the discharge from the left horizontal canal is decreased, and vice versa. Normal posture is the result of their acting in cooperation and in opposition. When the vestibular system of one ear is damaged, the unrestrained activity of the other causes a continuous false sense of turning ( vertigo ) and rhythmical, jerky movements of the eyes ( nystagmus ), both toward the uninjured side. When the vestibular hair cells of both inner ears are injured or destroyed, as can occur during treatment with the antibiotics gentamicin or streptomycin , there may be a serious disturbance of posture and gait ( ataxia ) as well as severe vertigo and disorientation. In younger persons the disturbance tends to subside as reliance is placed on vision and on proprioceptive impulses from the muscles and joints as well as on cutaneous impulses from the soles of the feet to compensate for the loss of information from the semicircular canals. Recovery of some injured hair cells may occur.",
  "Routine tests of vestibular function traditionally have involved stimulation of the semicircular canals to elicit nystagmus and other vestibular ocular reflexes. Rotation, which can cause vertigo and nystagmus, as well as temporary disorientation and a tendency to fall, stimulates the vestibular apparatus of both ears simultaneously. Because otoneurologists are usually more interested in examining the right and left ears separately, they usually employ temperature change as a stimulant. Syringing the ear canal with warm water at 44 °C (111 °F) or with cool water at 30 °C (86 °F) elicits nystagmus by setting up convection currents in the horizontal canal. The duration of the nystagmus may be timed with a stopwatch, or the rate and amplitude of the movements of the eyes can be accurately recorded by picking up the resulting rhythmical variations in the corneoretinal direct current potentials, using electrodes pasted to the skin of the temples—a diagnostic process called electronystagmography. An abnormal vestibular apparatus usually yields a reduced response or no response at all.",
  "The vestibular system may react to unaccustomed stimulation from the motion of an aircraft, a ship , or a land vehicle to produce a sense of unsteadiness, abdominal discomfort, nausea , and vomiting . Effects not unlike motion sickness , with vertigo and nystagmus, can be observed in the later stages of acute alcoholic intoxication. Vertigo accompanied by hearing loss is a prominent feature of the periodic attacks experienced by patients with Ménière disease , which, until the late 19th century, was confused with epilepsy . It was referred to as apoplectiform cerebral congestion and was treated by purging and bleeding. Other forms of vertigo may present the otoneurologist with more difficult diagnostic problems.",
  "Since the advent of space exploration , interest in experimental and clinical studies of the vestibular system has greatly increased. Investigators are concerned particularly about its performance when persons are exposed to the microgravity of spaceflight , as compared with the Earth ’s gravitational field for which it evolved. Investigations include the growing use of centrifuges large enough to rotate human subjects, as well as ingeniously automated tests of postural equilibrium for evaluating the vestibulospinal reflexes. Some astronauts have experienced relatively minor vestibular symptoms on returning from spaceflight. Some of these disturbances have lasted for several days, but none have become permanent.",
  "A useful introduction to the study of the human ear and hearing is Teri A. Hamill and Lloyd L. Price , The Hearing Sciences , 2nd ed. (2014). An exploration of the relationship between sound and the brain is Jan Schnupp , Israel Nelken , and Andrew King , Auditory Neuroscience: Making Sense of Sound (2011). The physics of sound and the relevance of sound to the human ear, hearing, and sound perception are addressed in William J. Mullin et al., Fundamentals of Sound with Applications to Speech and Hearing (2003).",
  "A well-illustrated chapter on the anatomy of the ear may be found in Don W. Fawcett , A Textbook of Histology , 12th ed. (1994)."
]