[
  "  colour , also spelled color , the aspect of any object that may be described in terms of hue, lightness, and saturation. In physics , colour is associated specifically with electromagnetic radiation of a certain range of wavelengths visible to the human eye . Radiation of such wavelengths constitutes that portion of the electromagnetic spectrum known as the visible spectrum—i.e., light .",
  " Vision is obviously involved in the perception of colour. A person can see in dim light, however, without being able to distinguish colours. Only when more light is present do colours appear. Light of some critical intensity, therefore, is also necessary for colour perception. Finally, the manner in which the brain responds to visual stimuli must also be considered. Even under identical conditions, the same object may appear red to one observer and orange to another. Clearly, the perception of colour depends on vision, light, and individual interpretation, and an understanding of colour involves physics , physiology , and psychology .",
  "  An object appears coloured because of the way it interacts with light. The analysis of this interaction and the factors that determine it are the concerns of the physics of colour. The physiology of colour involves the eye’s and the brain’s responses to light and the sensory data they produce. The psychology of colour is invoked when the mind processes visual data, compares it with information stored in memory, and interprets it as colour.",
  "This article concentrates on the physics of colour. For an overview of the primary colours, with their basic secondary and tertiary mixtures, usefully notated as the 12 segments of a circle, see colour wheel . For a discussion of colour as a quality of light, see  light and electromagnetic radiation . For the physiological aspects of colour vision, see  eye: Colour vision . See also  painting for a discussion of the psychological and aesthetic uses of colour.",
  "   Aristotle viewed colour to be the product of a mixture of white and black, and this was the prevailing belief until 1666, when Isaac Newton ’s prism experiments provided the scientific basis for the understanding of colour. Newton showed that a prism could break up white light into a range of colours, which he called the spectrum ( see  figure ), and that the recombination of these spectral colours re-created the white light. Although he recognized that the spectrum was continuous, Newton used the seven colour names red, orange, yellow, green, blue, indigo, and violet for segments of the spectrum by analogy with the seven notes of the musical scale.",
  "Newton realized that colours other than those in the spectral sequence do exist, but he noted that",
  "all the colours in the universe which are made by light, and depend not on the power of imagination, are either the colours of homogeneal lights [i.e., spectral colours], or compounded of these.",
  "Newton also recognized that",
  "rays, to speak properly, are not coloured. In them there is nothing else than a certain power…to stir up a sensation of this or that colour.",
  "The unexpected difference between light perception and sound perception clarifies this curious aspect of colour. When beams of light of different colours, such as red and yellow, are projected together onto a white surface in equal amounts, the resulting perception of the eye signals a single colour (in this case, orange) to the brain, a signal that may be identical to that produced by a single beam of light. When, however, two musical tones are sounded simultaneously, the individual tones can still be easily discerned; the sound produced by a combination of tones is never identical to that of a single tone. A tone is the result of a specific sound wave, but a colour can be the result of a single light beam or a combination of any number of light beams.",
  "A colour can, however, be precisely specified by its hue, saturation, and brightness —three attributes sufficient to distinguish it from all other possible perceived colours. The hue is that aspect of colour usually associated with terms such as red, orange, yellow, and so forth. Saturation (also known as chroma or tone) refers to relative purity. When a pure, vivid, strong shade of red is mixed with a variable amount of white, weaker or paler reds are produced, each having the same hue but a different saturation. These paler colours are called unsaturated colours. Finally, light of any given combination of hue and saturation can have a variable brightness (also called intensity or value), which depends on the total amount of light energy present.",
  "Newton demonstrated that colour is a quality of light. To understand colour, therefore, it is necessary to know something about light. As a form of electromagnetic radiation, light has properties in common with both waves and particles. It can be thought of as a stream of minute energy packets radiated at varying frequencies in a wave motion. Any given beam of light has specific values of frequency, wavelength, and energy associated with it. Frequency, which is the number of waves passing a fixed point in space in a unit of time, is commonly expressed in units of hertz (1 Hz = 1 cycle per second). Wavelength is the distance between corresponding points of two consecutive waves and is often expressed in units of metres—for instance, nanometres (1 nm = 10 −9 metre). The energy of a light beam can be compared to that possessed by a small particle moving at the velocity of light, except that no particle having a rest mass could move at such a velocity. The name  photon  , used for the smallest quantity of light of any given wavelength, is meant to encompass this duality, including both the wave and particle characteristics inherent in wave mechanics and quantum mechanics . The energy of a photon is often expressed in units of electron volts (1 eV = 1.602 × 10 −12  erg ); it is directly proportional to frequency and inversely proportional to wavelength.",
  "Light is not the only type of electromagnetic radiation—it is, in fact, only a small segment of the total electromagnetic spectrum—but it is the one form the eye can perceive. Wavelengths of light range from about 400 nm at the violet end of the spectrum to 700 nm at the red end ( see ). (The limits of the visible spectrum are not sharply defined but vary among individuals; there is some extended visibility for high-intensity light.) At shorter wavelengths the electromagnetic spectrum extends to the ultraviolet radiation region and continues through X-rays , gamma rays , and cosmic rays . Just beyond the red end of the spectrum are the longer wave infrared radiation rays (which can be felt as heat), microwaves , and radio waves. Radiation of a single frequency is called monochromatic. When this frequency falls in the range of the visible spectrum, the colour perception produced is that of a saturated hue.",
  "Colours of the spectrum are called chromatic colours; there are also nonchromatic colours such as the browns, magentas, and pinks. The term achromatic colours is sometimes applied to the black-gray-white sequence. According to some estimates, the eye can distinguish some 10 million colours, all of which derive from two types of light mixture: additive and subtractive. As the names imply, additive mixture involves the addition of spectral components, and subtractive mixture concerns the subtraction or absorption of parts of the spectrum.",
  " Additive mixing occurs when beams of light are combined. The colour circle, first devised by Newton, is still widely used for purposes of colour design and is also useful when the qualitative behaviour of mixing beams of light is considered. Newton’s colour circle combines the spectral colours red, orange, yellow, green, cyan, indigo, and blue-violet with the nonspectral colour magenta (a mixture of blue-violet and red light beams), as shown in the figure . White is at the centre and is produced by mixing light beams of approximately equal intensities of complementary colours (colours that are diametrically opposed on the colour circle), such as yellow and blue-violet, green and magenta, or cyan and red. Intermediate colours can be produced by mixing light beams, so mixing red and yellow gives orange, red and blue-violet gives magenta, and so on.",
  "The three additive primary colours are red, green, and blue; this means that, by additively mixing the colours red, green, and blue in varying amounts, almost all other colours can be produced, and, when the three primaries are added together in equal amounts, white is produced.",
  " Additive mixing can be demonstrated physically by using three slide projectors fitted with filters so that one projector shines a beam of saturated red light onto a white screen, another a beam of saturated blue light, and the third a beam of saturated green light. Additive mixing occurs where the beams overlap (and thus are added together), as shown in the figure (left) . Where red and green beams overlap, yellow is produced. If more red light is added or if the intensity of the green light is decreased, the light mixture becomes orange. Similarly, if there is more green light than red light, a yellow-green is produced. The RGB colour model , one of the three main colour models, is an additive model used in digital devices and light-based media to create a gamut of colours from just red, green, and blue.",
  "Subtractive colour mixing involves the absorption and selective transmission or reflection of light. It occurs when colorants (such as pigments or dyes ) are mixed or when several coloured filters are inserted into a single beam of white light. For example, if a projector is fitted with a deep red filter, the filter will transmit red light and absorb other colours. If the projector is fitted with a strong green filter, red light will be absorbed and only green light transmitted. If, therefore, the projector is fitted with both red and green filters, all colours will be absorbed and no light transmitted, resulting in black. Similarly, a yellow pigment absorbs blue and violet light while reflecting yellow, green, and red light (the green and red additively combining to produce more yellow). Blue pigment absorbs primarily yellow, orange, and red light. If the yellow and blue pigments are mixed, green will be produced since it is the only spectral component that is not strongly absorbed by either pigment.",
  "Because additive processes have the greatest gamut when the primaries are red, green, and blue, it is reasonable to expect that the greatest gamut in subtractive processes will be achieved when the primaries are, respectively, red-absorbing, green-absorbing, and blue-absorbing. The colour of an image that absorbs red light while transmitting all other radiations is blue-green, often called cyan. An image that absorbs only green light transmits both blue light and red light, and its colour is magenta. The blue-absorbing image transmits only green light and red light, and its colour is yellow. Hence, the subtractive primaries are cyan, magenta, and yellow ( see  figure, right ).",
  "No concepts in the field of colour have traditionally been more confused than those just discussed. This confusion can be traced to two prevalent misnomers: the subtractive primary cyan, which is properly a blue-green, is commonly called blue; and the subtractive primary magenta is commonly called red. In these terms, the subtractive primaries become red, yellow, and blue; and those whose experience is confined for the most part to subtractive mixtures have good cause to wonder why the physicist insists on regarding red, green, and blue as the primary colours. The confusion is at once resolved when it is realized that red, green, and blue are selected as additive primaries because they provide the greatest colour gamut in mixtures. For the same reason, the subtractive primaries are, respectively, red-absorbing (cyan), green-absorbing (magenta), and blue-absorbing (yellow).",
  "  The measurement of colour is known as colorimetry . A variety of instruments are used in this field. The most sophisticated, the spectrophotometers, analyze light in terms of the amount of energy present at each spectral wavelength. The emittance curves for light sources ( see  figure ) are typical spectrophotometer results, as is the reflectance curve of the paint pigment known as emerald green, as shown in the figure .",
  "It is difficult to describe the colour of a specific spectral energy distribution. Since the eye perceives only a single colour for any given energy distribution, it is necessary to express colour measurements in a perception-related way. Several systems exist, and some are outlined below.",
  "The tristimulus system is based on visually matching a colour under standardized conditions against the three primary colours—red, green, and blue; the three results are expressed as X , Y , and Z , respectively, and are called tristimulus values. The tristimulus values of the emerald-green pigment are X = 22.7, Y = 39.1, and Z = 31.0. These values specify not only colour but also visually perceived reflectance, since they are calculated in such a way that the Y value equals a sample’s reflectivity (39.1 percent in this example) when visually compared with a standard white surface by a standard (average) viewer under average daylight. The tristimulus values can also be used to determine the visually perceived dominant spectral wavelength (which is related to the hue) of a given sample; the dominant wavelength of the emerald-green pigment is 511.9 nm.",
  " W E R A B C Such data can be graphically represented on a standard ( see also the location of emerald green on a chromaticity diagram ). Standardized by the Commission Internationale d’Éclairage (CIE) in 1931, the chromaticity diagram is based on the values x , y , and z , where x = X /( X + Y + Z ), y = Y /( X + Y + Z ), and z = Z /( X + Y + Z ). Note that x + y + z = 1; thus, if two values are known, the third can always be calculated and the z value is usually omitted. The x and y values together constitute the chromaticity of a sample. Light and dark colours that have the same chromaticity (and are therefore plotted at the same point on the two-dimensional chromaticity diagram) are distinguished by their different Y values (luminance, or visually perceived brightness).",
  "When their x and y coefficients are plotted on a chromaticity diagram, the spectral colours from 400 nm to 700 nm follow a horseshoe-shaped curve; the nonspectral violet-red mixtures fall along the straight line joining the 400-nm point to the 700-nm point. All visible colours fall within the resulting closed curve, as shown in the standard . Points along the circumference correspond to saturated colours; pale unsaturated colours appear closer to the centre of the diagram. The achromatic point is the central point at x =  1  3  , y =  1  3  (shown as W in the figure ), where visually perceived white is located (as well as the pure grays and black, which vary only in the magnitude of the luminance Y ).",
  "A straight line connecting any two points representing beams of light includes all the points representing colours formed by adding various amounts of the two beams. If the line passes through the achromatic point, the colours represented by its endpoints, when additively combined in the appropriate amounts, must form white; therefore, all lines passing through the achromatic point terminate on the closed curve in saturated complementary colours.",
  "By plotting the calculated x = 0.245 and y = 0.421 of the emerald-green pigment at point E on the chromaticity diagram, as shown in the figure , and extending a line through it from the achromatic point W to the saturated spectral boundary, it is possible to determine the dominant wavelength of the pigment colour, 511.9 nm. The colour of the pigment is the visual equivalent of adding white light and light of 511.9 nm in amounts proportional to the lengths n (the distance between points E and W ) and m (the distance between E and the point of the dominant wavelength). The purity equals 100 n /( m + n ) percent—in this case, 22.8 percent. A purity of 100 percent corresponds to a pure saturated spectral colour and 0 percent to the achromatic colours (white, gray, and black).",
  "The colour of a specific red apple of Y = 13.0, x = 0.460, y = 0.287 has its x and y values plotted at R , as shown in the figure . The line from the achromatic point W intersects the chromaticity diagram boundary at a saturated nonspectral purple-red at P . The dominant colour designation is then obtained by extrapolating the line in the opposite direction to a saturated spectral colour and is given as “complementary dominant wavelength 495 nm,” or 495 c . The colour of this apple is therefore the visual equivalent of a mixture of white light and the 495 c saturated purple-red in the intensity ratio of the distances p to q with a purity of 100 p /( p + q ) percent.",
  "Light from incandescent sources, further described below, falls on the solid curve marked with temperatures, following the sequence saturated red to saturated orange to unsaturated yellow to white to unsaturated bluish white for an infinite temperature indicated as ∞. The points A , B , and C on the curve are CIE standard illuminants that approximate, respectively, a 100-watt incandescent filament lamp at a colour temperature of about 2,850 K, noon sunlight (about 4,800 K), and average daylight (about 6,500 K).",
  "   Calculating chromaticity and luminance is a scientific method of determining a colour, but, for the rapid visual determination of the colour of objects, a colour atlas such as the Munsell Book of Color is often used. In this system colours are matched to printed colour chips from a three-dimensional colour solid whose parameters are hue, value (corresponding to reflectance), and chroma (corresponding to purity, or saturation). These three parameters are illustrated schematically in the figure . The central vertical axis provides a 10-step value scale extending from black at the bottom to white at the top. There are 100 hues divided into 10 groups around the vertical axis; each group has a colour name and consists of 10 subdivisions assigned a number from 1 to 10. The chroma scale starts at 0 at the vertical axis and extends radially outward from 10 to 18 steps depending on hue and value. The red apple discussed earlier would be designated 10RP 4/10 in the Munsell system, indicating a specific reddish purple hue 10RP, a value of 4, and a chroma of 10. Interpolated values are used to give more precise designations, so the emerald-green pigment can be specified as 5.0G 6.7/11.2.",
  "  A system that is useful when such precision is not required is the ISCC-NBS (Inter-Society Color Council–National Bureau of Standards) Centroid Color Charts. It has 267 numbered colour designations and uses descriptive terms such as very pale purple, light yellowish brown, and grayish blue; the red apple is 258 (moderate purplish red) in this system, and the emerald-green pigment is 139 (vivid green). Other colour atlases include the Ostwald colour system, based on mixtures of white, black, and a high chroma colour; the Maerz and Paul dictionary of colour; the Plochere colour system; and the Ridgway colour standards.",
  "According to the law of energy conservation , energy can be converted from one form to another, but it cannot be created or destroyed. Consequently, when a photon of light is absorbed by matter, usually by an atom, molecule, or ion or by a small grouping of such units, the photon disappears and its energy is gained by the matter. Similarly, when matter emits light, it loses the energy carried away by the photons. A given atom or molecule cannot emit light of any arbitrary energy, since quantum theory explains that only certain energy states are possible for a given system.",
  "An example of permitted energy levels is shown at the left in the for the trivalent chromium ion present in a crystal of aluminum oxide; this is the colorant that provides the red colour of the gemstone ruby . Present in this energy-level scheme is the ground state, designated 4  A  2 ; this is the energy state of the chromium ion in ruby when in the dark. When illuminated by white light, either a photon of energy 2.2 eV or a photon of energy 3.0 eV can be absorbed, raising the system to the 4  T  2 or 4  T  1 energy levels, respectively. (In this system light cannot be absorbed into the level 2  E because of certain quantum limitations, designated selection rules.) These two energy transitions, broadened by the thermal atomic vibrations at room temperature into absorption bands, correspond to absorption of the violet and green-yellow parts of white light passing through the ruby, as shown at the centre in the . The remaining transmitted light consists of the strong red and weak blue parts of the spectrum, resulting in the deep red ruby colour with a slight purple overtone.",
  "The chromium ion in ruby now contains excess energy, but the selection rules permit return to the ground state only through the intermediate 2  E energy level, as shown at left in the . Part of the absorbed energy appears as a slight warming of the ruby. The other part is emitted as a photon producing a bright red fluorescence (best seen when the ruby is illuminated with ultraviolet radiation in the dark). The ruby has now returned to the ground state, and energy has been conserved. This is just one explanation of the occurrence of colour. Although all occurrences or causes of colour involve the excitation of electrons, this article, to simplify explanation, classifies the physical and chemical causes of colour into 15 groups. The first three involve transitions among the energy levels of excitations, vibrations, and rotations as explained by quantum theory. The next four involve modifications of this approach covered by the ligand field and molecular orbital theories. The following four involve the energy band formalism of solid state physics, and the final four are explained by geometrical and physical optics theory.",
  "Incandescent light is produced when hot matter releases parts of its thermal vibration energy as photons. At medium temperatures, say 800 °C (1,500 °F), the object’s radiation energy reaches a peak in the infrared, with only a small intensity at the red end of the visible spectrum. As the temperature is raised, the peak moves toward and finally into the visible region. At successively higher temperatures the object becomes “red-hot,” then orange, yellow, and finally “white-hot”; the very hottest of stars have a bluish-white colour. This sequence of colours is known as the blackbody radiation sequence. Examples of incandescence include daylight, candlelight, and light from tungsten filament lamps, flashbulbs, the carbon arc, and pyrotechnic devices such as flares and fireworks ( see  figure ).",
  "Gas excitation involves the emission of light by a chemical element present as a gas or vapour. When a gas such as neon or a vaporized element such as sodium or mercury is excited electrically, the electrical energy raises the atoms into high energy states, from which they decay back to ground state with the emission of photons. This leads to the red light seen in neon tubes and the yellow and blue light seen in sodium and mercury vapour lamps, respectively. The same yellow sodium light is emitted when sodium atoms are thermally excited by being heated in a gas flame. In addition to being produced electrically or by chemical reactions, gas excitations can also result from interaction with energetic particles, as in auroras , where energetic particles emitted in solar storms excite gases high in the Earth’s atmosphere to produce various colour effects.",
  "All molecules have some vibration or rotation energy as a result of chemical bonding, but the energy involved is too low to interact directly with visible light. The frequency of vibration can be increased, however, by strengthening the chemical bonding involving very light atoms. For example, the bond between hydrogen and oxygen is stronger in liquid water and solid ice than in an isolated H 2 O molecule. The corresponding increase in vibration frequencies allows some absorption at the red end of the spectrum and produces the pale blue colour characteristic of pure water and ice when seen in bulk.",
  "Most chemical compounds are colourless when pure; examples include sodium chloride (ordinary table salt), aluminum oxide, naphthalene (moth flakes), and diamond . In these compounds all electrons are present in pairs. Such paired electrons are particularly stable and require very high energies to become unpaired and form excited energy levels. Only ultraviolet light is energetic enough to be absorbed, which explains the absence of visible light absorptions and the absence of colour. The compounds of a number of metals—most commonly iron , chromium , nickel , cobalt , and manganese —do, however, produce coloured salts. These metals are the transition elements, which contain unpaired electrons in their compounds. Excited energy levels are readily formed by these unpaired electrons, resulting in the absorption of photons and the production of colour.",
  "Aluminum oxide, also known as corundum or colourless sapphire when pure, can serve as an example. In this compound each trivalent aluminum ion is surrounded by six oxygens in the configuration of a slightly irregular octahedron. The electric field at the aluminum site of this octahedral arrangement of oxygens is known as the ligand field. (An older term, implying a simpler approach, was crystal field.) If aluminum oxide contains chromium as an impurity, so that one out of every 100 aluminums is replaced by a chromium, which has unpaired electrons, then the ligand field produces a change in the energy levels that an isolated chromium ion would have. This gives the specific energy level scheme, shown at the left in the, which leads to the light absorption curve at the centre of the figure and produces the red colour (as well as the red fluorescence) of the chromium-containing aluminum oxide, also known as the gemstone ruby, as described above.",
  "Similarly, if chromium replaces 1 or 2 percent of the aluminum in the compound beryllium aluminum silicate, a combination also known as the gemstone emerald , then the ligand field has the same geometry but is somewhat weaker, a result of the effect of the berylliums and silicons on the strength of aluminum-oxygen bonding. This produces small shifts in some of the absorption energy levels compared with ruby. These shifts have resulted in the almost total elimination of the red transmission and an intensification of the blue-green transmission, leading to an emerald-green colour. The 2  E energy level has not shifted; accordingly, red ruby and green emerald show the same red fluorescence.",
  "Other such transition metal impurities cause the colours of red iron ore and the gemstones yellow citrine and blue-to-green aquamarine (all coloured by a small percentage of iron impurity).",
  "The transition metal may be present not as an impurity but as an essential part of the substance. An example is chromium oxide, also known as the pigment chrome green, in which the relatively weak ligand field of the chromium-oxygen bonding at the chromiums produces colour in a similar manner to that in the emerald discussed above. Additional examples are the copper-containing blue-to-green gem materials malachite , azurite , and turquoise , as well as the patina on copper statues, the red iron ore hematite , and the cobalt-glass pigment smalt.",
  "All dyes and most pigments , whether natural or synthetic, are complex organic compounds whose molecular structures include a “colour-bearing” group known as a chromophore, usually a short conjugated system (a chain of atoms connected by alternating single and double bonds). The bonding electrons holding the molecule together can be viewed as belonging to the whole molecule. Simple conjugated chains have electronic transitions that absorb radiation only in the ultraviolet range of the spectrum. If, however, the chain is long, the resulting transitions between molecular orbital energy levels require less energy, and absorption shifts to longer wavelengths. The carotenes are naturally occurring examples of extended conjugated systems; they absorb some light in the violet or blue range of the spectrum and therefore appear yellow or orange in colour. The same effect occurs if the number of electrons present on a conjugated chain is modified by the addition of groups of atoms known as auxochromes. Auxochromes can be either electron acceptors or electron donors. Nitrophenylenediamine compounds contain both types of auxochromes. They absorb in the blue part of the spectrum and are often used in hair dyes because the small size of the molecules allows them to penetrate into hair easily.",
  "Organic dyes occur widely in the plant and animal kingdoms as well as in the modern synthetic dye and pigment industry. Just as with ligand-field energy levels, some of the absorbed energy may be reemitted in the form of fluorescence.",
  "Aluminum oxide containing a few hundredths of 1 percent of titanium is colourless. If it contains a similar amount of iron, a very pale yellow colour may be seen. If both impurities are present together, the aluminum oxide has a magnificent deep blue colour and is known as the gemstone sapphire . The colour is the result of charge transfer, in which the absorption of light energy allows an electron to move from one ion to another, resulting in a temporary change in the valence state of both ions: Fe 2+ + Ti 4+ → Fe 3+ + Ti 3+ . This process requires energy; since the energy corresponds to an absorption in the yellow region of the spectrum, the complementary colour blue results.",
  "Other forms of charge transfer lead to the black of the iron oxide magnetite ; the brilliant blue colour of potassium ferric ferrocyanide, the pigment Prussian blue ; the yellow-to-orange chromates and dichromates; and the deep blue gemstone lapis lazuli , which has the same composition as the pigment ultramarine .",
  " The valence electrons, which in other substances produce bonding between individual atoms or small groups of atoms, are shared equally by all the atoms in a piece of a metal. These delocalized electrons are thus able to move over the whole piece of metal and provide the metallic lustre and good electrical and thermal conductivities of metals and alloys. Band theory explains that in such a system individual energy levels are replaced by a continuous region called a band, as in the density-of-states diagram for copper metal shown in the figure . This diagram shows that the number of electrons that can be accommodated in the band at any given energy varies; in copper the number declines as the band approaches being filled with electrons. The number of electrons in the copper fill the band to the level shown, leaving some empty space at higher energies.",
  "When a photon of light is absorbed by an electron near the top of the energy band, the electron is raised to a higher available energy level within the band. The light is so intensely absorbed that it can penetrate to a depth of only a few hundred atoms, typically less than a single wavelength. Because the metal is a conductor of electricity, this absorbed light, which is, after all, an electromagnetic wave, induces alternating electrical currents on the metal surface. These currents immediately reemit the photon out of the metal, thus providing the strong reflection of a polished metal surface.",
  "The efficiency of this process depends on certain selection rules. If the efficiency of absorption and reemission is approximately equal at all optical energies, then the different colours in white light will be reflected equally well, leading to the “silvery” colour of polished silver and iron surfaces. In copper the efficiency of reflection decreases with increasing energy; the reduced reflectivity at the blue end of the spectrum results in a reddish colour. Similar considerations explain the yellow colour of gold and brass .",
  " E  g  In a number of substances a band gap appears in the density of states diagram ( see  figure ). This can happen, for example, when there are an average of exactly four valence electrons per atom in a pure substance, resulting in a completely full lower band, called the valence band, and an exactly empty upper band, the conduction band. Because there are no electron energy levels in the gap between the two bands, the lowest energy light that can be absorbed corresponds to arrow A in the figure; this represents the excitation of an electron from the top of the valence band up to the bottom of the conduction band and corresponds to the band-gap energy designated E   g  . Light of any higher energy can also be absorbed, as indicated by the arrows B and C .",
  "If the substance has a large band gap, such as the 5.4 eV of diamond, then no light in the visible spectrum can be absorbed, and the substance appears colourless when pure. Such large band-gap semiconductors are excellent insulators and are more usually treated as ionic or covalently bonded materials.",
  "The pigment cadmium yellow (cadmium sulfide, also known as the mineral greenockite ) has a smaller band gap of 2.6 eV, which permits absorption of violet and some blue but none of the other colours. This leads to its yellow colour. A somewhat smaller band gap that permits absorption of violet, blue, and green produces the colour orange; a yet smaller band gap as in the 2.0 eV of the pigment vermilion (mercuric sulfide, the mineral cinnabar ) results in all energies but the red being absorbed, which leads to a red colour. All light is absorbed when the band-gap energy is less than the 1.77-eV (700-nm) limit of the visible spectrum; narrow band-gap semiconductors, such as the lead sulfide galena, therefore absorb all light and are black. This sequence of colourless, yellow, orange, red, and black is the precise range of colours available in pure semiconductors.",
  "If an impurity atom, often called a dopant , is present in a semiconductor (which is then designated as doped) and has a different number of valence electrons than the atom it replaces, extra energy levels can be formed within the band gap. If the impurity has more electrons, such as a nitrogen impurity (five valence electrons) in a diamond crystal (consisting of carbons , each having four valence electrons), a donor level is formed. Electrons from this level can be excited into the conduction band by the absorption of photons; this occurs only at the blue end of the spectrum in nitrogen-doped diamond, resulting in a complementary yellow colour. If the impurity has fewer electrons than the atom it replaces, such as a boron impurity (three valence electrons) in diamond, a hole level is formed. Photons can now be absorbed with the excitation of an electron from the valence band into the hole level. In boron-doped diamond this occurs only at the yellow end of the spectrum, resulting in a deep blue colour as in the famous Hope diamond .",
  "Some materials containing both donors and acceptors can absorb ultraviolet or electrical energy to produce visible light. For example, phosphor powders, such as zinc sulfide containing copper and other impurities, are used as a coating in fluorescent lamps to convert the plentiful ultraviolet energy produced by the mercury arc into fluorescent light. Phosphors are also used to coat the inside of a television screen, where they are activated by a stream of electrons ( cathode rays ) in cathodoluminescence, and in luminous paints, where they are activated by white light or by ultraviolet radiation, which causes them to display a slow luminous decay known as phosphorescence . Electroluminescence results from electrical excitation, as when a phosphor powder is deposited onto a metallic plate and covered with a transparent conducting electrode to produce lighting panels.",
  "Injection electroluminescence occurs when a crystal contains a junction between differently doped semiconducting regions. An electric current will produce transitions between electrons and holes in the junction region, releasing energy that can appear as near-monochromatic light, as in the light-emitting diodes (LEDs) widely used on display devices in electronic equipment. With a suitable geometry, the emitted light can also be monochromatic and coherent as in semiconductor lasers .",
  "A colour centre often involves a solid that is missing an atom, such as sodium chloride, an ionic crystal that consists of a three-dimensional array of positively charged sodium ions and negatively charged chloride ions. When a negative chloride ion is missing from the crystal, electrical neutrality can be maintained if a free electron occupies the spot vacated by the chloride ion, forming an F-centre (after the German Farbe , “colour”). This replacement electron can be viewed as providing a trapping energy level within the large band gap.",
  "Some form of relatively high energy, such as ultraviolet radiation or high-energy X-rays or gamma rays, can then be used to promote an electron from the valence band into the trap, which contains excited energy levels such as that designated E   a  in the . The E   a  level for the sodium chloride F-centre occurs at 2.7 eV and can absorb blue light, leading to a yellow-brown colour; such a defect is called a colour centre. The electron in this excited energy level is still within the trap. Only by supplying energy corresponding to E   b  can the electron leave the trap and return via the conduction band directly to the valence band. This can happen if the crystal is heated, resulting in bleaching of the colour centre. If E   b  is about the same size as E   a  , bleaching can occur merely while the material is being illuminated, leading to optical bleaching. If E   b  is sufficiently small, the material may even fade in the dark at room temperature. This occurs in self-darkening sunglasses: the ultraviolet energy present in sunlight produces darkening, and room temperature leads to fading as soon as ultraviolet light is no longer present.",
  "In his 1666 experiment, shown in the figure , Newton discovered what is now called dispersion or dispersive refraction . He showed that a light beam is bent, or refracted, as it passes from one medium to another—e.g., from air into glass. The natures of the two media as well as the wavelength of the light involved determine the degree of refraction, with shorter wavelengths bending more than longer wavelengths. Dispersion in a faceted diamond produces coloured flashes of light, in drops of water in the atmosphere it produces primary and secondary rainbows , and in ice crystals in thin clouds it produces a variety of halos and arcs around the Sun and Moon.",
  "Dispersion has its origin in absorption. Even a colourless, transparent substance, such as glass, absorbs electromagnetic radiation in the ultraviolet (derived from the unpairing of paired electrons and their further excitation) and in the infrared (from the vibrations of atoms, molecules, and larger structural units). It is a combination of these two effects that produces dispersion: only a vacuum has no absorptions and therefore no dispersion.",
  "A rope can be snapped so that a wave movement travels from one end to the other; the motion of the wave can be from side to side, up and down, or in any direction perpendicular to the rope. Similarly, an unpolarized light wave travels in a single direction but vibrates in random directions perpendicular to its travel. When a light wave vibrates in only one direction, it is called polarized .",
  "Light can be polarized in passing through certain substances (such as a crystal of calcium carbonate, the mineral calcite , or a sheet of polarizing film) that block out all waves except those vibrating in a particular direction. Polarized white light can interact with various doubly refracting materials (ones in which the index of refraction varies according to the direction in which the light waves passing through it vibrate) to produce colour. This technique is often used to view rocks or structural models; the colours produced are then studied to determine mineral composition or to analyze stress.",
  "When light strikes fine particles or an irregular surface, it is deflected in all directions and is said to be scattered. When the scattering particles are very small compared to the wavelength of light, the intensity of the scattered light is related to that of the incident light by the inverse fourth power of the wavelength ( Rayleigh scattering ). As a result, light at the blue end of the spectrum is scattered much more intensely than that at the red end.",
  "The light from the Sun is scattered by dust particles and clusters of gas molecules, and the scattered blue rays seen against the dark background of outer space cause the sky to appear blue. At sunrise and sunset, when sunlight travels the farthest, almost all of the blue rays are scattered, and the light that reaches the Earth directly is seen as predominantly red or orange. Scattering also causes that epitome of rare occurrences, the blue Moon (seen when forest fires produce clouds composed of small droplets of organic compounds). Most blue and green bird feathers involve scattering, as do many animal and some vegetable blues. Scattering also produces the blue colour of eyes, particularly the intense blue eyes of most infants, whose yellow-to-dark-brown pigments such as melanin have not yet all been formed so that only blue is seen against the dark interior of the eye.",
  "If the size of the scattering particles approaches the wavelength of light or exceeds it, the complex Mie scattering theory applies and explains colours other than blue; because white light contains all visible wavelengths, it is scattered at the largest sizes, as in fog and clouds.",
  "Two light waves of the same wavelength can interact under appropriate circumstances so as to reinforce each other if they are in phase or to cancel each other if they are out of phase. If a beam of light falls on a thin film, such as an oil slick on a puddle of water, part of the beam is reflected from the front of the oil film and part from the back. Depending on the thickness of the film, the two reflected beams can reinforce or cancel.",
  "When monochromatic light falls on a film of tapering thickness, a series of dark and light bands, known as interference fringes, is produced. With white light the sequence of overlapping light and dark bands from the spectral colours leads to Newton’s colours. The film appears black or gray where it is thinnest and the light waves cancel; as it becomes progressively thicker, it appears white, then yellow, orange, red, violet, blue, green, yellow, orange-red, violet, and so on. Newton’s colours can also be seen in cracks in glass or in crystals, in a soap bubble, and in antireflection coatings such as on camera lenses.",
  "A large number of structural colorations in biological systems also derives from thin film interference. These structures usually feature multiple layers and are frequently backed by a dark layer of melanin, which intensifies the colour by absorbing the nonreflected light. Such colorations are usually iridescent; the colours appear metallic and change with orientation. Examples include pearl and mother-of-pearl, the transparent wings of houseflies and dragonflies, the scales on beetles and butterflies, and the feathers of hummingbirds and peacocks. The eyes of many nocturnal animals contain multilayer structures that improve night vision and can produce iridescent reflections in the dark.",
  " Interference is also involved in diffraction , another phenomenon that produces colour. Diffraction is the term used to describe the spreading of light at the edges of an obstacle and the subsequent interference that occurs. When a monochromatic beam of light falls on a single edge, a sequence of light and dark bands is produced, and with white light a sequence of colours much like the Newton colour sequence appears ( see  photograph ).",
  "A diffraction grating consists of a regular two- or three-dimensional array of objects or openings that scatter light according to its wavelength over a wide range of angles. As these deflected waves interact, they reinforce one another in some directions to produce intense spectral colours. This effect can be seen by looking at a distant streetlight or flashlight through a black cloth umbrella. Diffraction arrays that reveal spectral colours in direct sunlight exist on the wings of some beetles and the skins of some snakes. Perhaps the most outstanding natural diffraction grating, however, is the gemstone opal . Electron microscope photographs reveal that an opal has a regular three-dimensional array of equal-size spheres, about 250 nm (0.00001 inch) in diameter, which produce the diffraction.",
  "  When a person views an opaque coloured object, it is only the light reflected from the object that can activate the visual process in the eye and brain. Because different illuminants have different spectral energy distributions, as shown in the figure , a given object in these illuminations will reflect different energy distributions. Yet the eye and brain are such superb systems that they are able to compensate for such differences, and normal-appearing colours are perceived, a phenomenon called colour constancy.",
  "Colour constancy does not apply, however, when there are subtle differences in colour. If, for example, two orange objects, one coloured by an orange pigment, the other by a combination of red and yellow pigments, match precisely in daylight, in the light of a tungsten lamp one may appear more reddish than the other. Because of this effect, called metamerism, it is always necessary to follow precisely the illumination and viewing conditions specified when comparing a sample colour with one in a colour atlas.",
  "The intensity of illumination also affects colour perception. At very low light levels, blue and green objects appear brighter than red ones compared with their relative brightness in stronger illumination, an effect known as the Purkinje shift for its discoverer, the Czech physiologist Jan Evangelista Purkinje . At higher levels of illumination, there is a related shift in hues, called the Bezold-Brücke effect, such that most colours appear less red or green and more blue or yellow as the intensity of illumination increases.",
  "If a bright spot of white light is projected onto a screen uniformly illuminated with a pale blue light, an effect known as simultaneous colour contrast makes the white light appear pale yellow and the blue light seem grayer than if the two were viewed separately. The complementary hue is induced by the adjacent illumination. Successive colour contrast, which occurs when a person stares at one colour and then shifts to another, produces the same effect. A person who stares at a pattern of colours for some time and then looks at a white area sees a negative afterimage of the pattern in complementary hues. This effect, also called chromatic adaptation, is what causes browns to appear reddish to someone who has just viewed a green lawn. Thus, even when the colour of a given object is measured and its physical cause identified, visual effects can prevent the precise perception of that colour from being specified. Some of these effects can be explained fairly simply by changes in the sensitivity of the eye’s receptors to different colours as intensity changes, by fatigue in specific receptors, or by receptor inhibition; others are not understood. In fact, scientists did not know the process by which the eye and brain perceive colour until the early 1960s and even now do not understand all the details.",
  "One of the most successful theories of colour vision, the trichromatic theory, was first proposed around 1801 by Thomas Young , an English physician, and refined about 50 years later by the German scientist Hermann von Helmholtz . Based on experiments in colour matching, this theory postulates three types of colour receptors in the eye. The actual existence of such receptor cells, known as cones (from their shape), was finally confirmed in the early 1960s. The three types of cones have maximum sensitivities in the blue, green, and red regions of the spectrum, with absorption peaks near 445 nm, 535 nm, and 565 nm, respectively. These three sets are often designated as S, M, and L for their sensitivity to short, medium, and long wavelengths. The trichromatic theory explains that colour vision results from the relative intensity of response of the S, M, and L cones. (Equal stimulation of all three gives the perception of white.) There is obviously a close connection between this trichromatic theory and the tristimulus value system.",
  "One of the trichromatic theory’s strengths is that the existence of several kinds of colour blindness can be simply explained as the lack of function of one or more sets of the cones. If one set of cones does not function, dichromatism results. People with deuteranopia (M set missing) or protanopia (L set missing) perceive only blue and yellow. In the much rarer tritanopia the S cones are missing, and only green and red are perceived. Persons who have no functioning cone system suffer from the extremely rare monochromatism and can perceive only grays.",
  "Although the trichromatic theory seems to explain much about colour vision, other theories have also been supported and studied, especially the opponent process theory. First proposed by the German physiologist Ewald Hering in 1878, this approach presumes that colour vision involves three mechanisms, each responding to a pair of opposites—namely, light–dark, red–green, and blue–yellow. It is based on many psychophysical observations, including the fact that blue and yellow (and also red and green) cannot coexist in any perceived colour; there are no bluish yellows (or reddish greens). Several of the contrast and afterimage effects can be explained very simply by this approach.",
  "It is now recognized that the trichromatic and opponent process theories are not incompatible. They have been combined in a number of zone theories, which postulate that the cones function in a trichromatic manner in one zone, while in another zone the signals from the cones are combined in neural cells so as to produce one achromatic (white–black) and two chromatic (blue–yellow and green–red) signals, which are then interpreted in the brain. Although it is clear that zone theories, encompassing both trichromatic and opponent colour theories, are fully successful in explaining the many aspects of colour perception, there are still details that remain to be worked out.",
  "The most important aspect of colour in daily life is probably the one that is least defined and most variable. It involves aesthetic and psychological responses to colour and influences art, fashion, commerce, and even physical and emotional sensations. One example of the link between colour and emotion is the common perception that red, orange, yellow, and brown hues are “warm,” while the blues, greens, and grays are “cold.” The red, orange, and yellow hues are said to induce excitement, cheerfulness, stimulation, and aggression; the blues and greens security, calm, and peace; and the browns, grays, and blacks sadness, depression, and melancholy. It must be remembered, however, that the psychological perception of colour is subjective, and only general comments about its features and uses can be made.",
  "Like colour terminology, colour harmony, colour preferences, colour symbolism, and other psychological aspects of colour are culturally conditioned, and they vary considerably with both place and historical period. One cross-cultural study showed that American and Japanese concepts of warm and cold colours are essentially the same, but that in Japan blue and green hues are perceived to be “good” and the red-purple range “bad,” while in the United States the red-yellow-green range is considered “good” and oranges and red-purples “bad.” The colour of mourning is black in the West, yet other cultures use white, purple, or gold for this purpose. Many languages contain expressions that use colour metaphorically (common examples in English include “green with envy,” “feeling blue,” “seeing red,” “purple passion,” “white lie,” and “black rage”) and therefore cannot always be translated literally into other languages because the colour may lose its associated symbolic meaning.",
  "Colour symbolism serves important roles in art, religion, politics, and ceremonials, as well as in everyday life. Its strong emotional connotations can affect colour perception so that, for example, an apple- or heart-shaped figure cut from orange paper may seem to have a redder hue than a geometric figure cut from the same paper because of the specific psychological meaning that is associated with the shape.",
  "In addition to emotional associations, factors that affect colour perception include the observer’s age, mood, and mental health. People who share distinct personal traits often share colour perceptions and preferences. For example, schizophrenics have been reported to have abnormal colour perception, and very young children learning to distinguish colours usually show a preference for red or orange. Many psychologists believe that analyzing an individual’s uses of and responses to colour can reveal information about the individual’s physiological and psychological condition. It has even been suggested that specific colours can have a therapeutic effect on physical and mental disabilities.",
  "Although these medical benefits are still in question, colour has been shown to cause definite physical and emotional reactions in humans and in some animals. Rooms and objects that are white or in light shades of “cool” colours may appear to be larger than those that are in intense dark or “warm” colours; black or very dark colours have a slimming, or shrinking, effect, as is well known to designers and decorators. A “cool” room decorated in a pale blue requires a higher thermostat setting than a “warm” room painted a pale orange in order to achieve the same sensation of warmth. People who view a display of unusual colours produced by special illumination may experience headaches and nervous disorders; tasty wholesome food served under such conditions appears repulsive and may even induce illness. Some colours induce a feeling of pleasure in the observer. When an affectively positive, or pleasurably perceived, colour is viewed after a less-pleasant colour, it produces more pleasure than when viewed by itself, an effect known as affective contrast enhancement.",
  "The effect of combinations of colours on an observer depends not only on the individual effects of the colours but also on the harmony of the colours combined and the composition of the pattern. Artists and designers have been studying the effects of colours for centuries and have developed a multitude of theories on the uses of colour. The number and variety of these theories demonstrate that no universally accepted rules apply; the perception of colour depends on individual experience.",
  " Isaac Newton , Optics; or, A Treatise of the Reflexions, Refractions, Inflexions, and Colours of Light , 4th ed. (1730, reissued 1979), the beginnings of the scientific study of colour; Johann Wolfgang von Goethe , Goethe’s Theory of Colours (1840, reissued 1975; originally published in German, 1810), with excellent observations explained by an untenable theory; David L. MacAdam (ed.), Sources of Color Science (1970), covering theories developed in all periods but omitting Goethe and including only a little Newton; Ralph Merrill Evans , An Introduction to Color (1948, reissued 1965), an authoritative, highly readable introduction, with emphasis on technical applications; and Enid Verity , Color Observed (1980), a readable general introduction. A bibliography of colour studies is given in Mary Buckley , Color Theory: A Guide to Information Sources (1975). Current research on the subject, together with discussions of applications, is found in the magazines Color Research and Application (quarterly), Inter-Society Color Council News (bimonthly), and Journal of the Optical Society of America; Part A, Optics and Image Science (monthly).",
  " W.D. Wright , The Measurement of Colour , 4th ed. (1969), an authoritative outline of the trichromatic system; Deane B. Judd and Günter Wyszecki , Color in Business, Science, and Industry , 3rd ed. (1975), an authoritative work for the specialist; and Faber Birren , A Grammar of Color: A Basic Treatise on the Color System of Albert H. Munsell (1969), a revision of the 1921 work. Sets of colour chips used as identifiers are collected in Munsell Book of Color (1929– ), a loose-leaf publication. See also Kenneth L. Kelly and Deane B. Judd , Color: Universal Language and Dictionary of Names (1976), a system of simple colour names with cross-references to thousands of commonly used names; Fred W. Billmeyer, Jr. , and Max Saltzman , Principles of Color Technology , 2nd ed. (1981), a highly technical but readable text with an annotated bibliography; Günter Wyszecki and W.S. Stiles , Color Science: Concepts and Methods, Quantitative Data and Formulae , 2nd ed. (1982), an advanced text; Deane B. Judd , Contributions to Color Science (1979); and David L. MacAdam , Color Measurement: Theme and Variations , 2nd rev. ed. (1985).",
  " R. Daniel Overheim and David L. Wagner,  Light and Color (1982), a brief survey; Francis A. Jenkins and Harvey E. White , Fundamentals of Optics , 4th ed. (1976); Leslie E. Orgel , An Introduction to Transition-Metal Chemistry: Ligand-Field Theory , 2nd ed. (1966); and Keith McLaren , The Colour Science of Dyes and Pigments (1983), authoritative intermediate to advanced texts. Kurt Nassau , The Physics and Chemistry of Color: The Fifteen Causes of Color (1983), is a comprehensive up-to-date treatment.",
  " G. Hugh Begbie , Seeing and the Eye: An Introduction to Vision (1969, reprinted 1973), a survey for the general reader; Gerald S. Wasserman , Color Vision: An Historical Introduction (1978); and Tom N. Cornsweet , Visual Perception (1970), more detailed treatments; Ralph Merrill Evans , The Perception of Color (1974); and Robert M. Boynton , Human Color Vision (1979), comprehensive advanced texts. Edward C. Carterette and Morton P. Friedman (eds.), Handbook of Perception , vol. 5 (1975), contains 12 chapters, written at the advanced level, on all aspects of colour perception.",
  " Samuel J. Williamson and Herman Z. Cummins , Light and Color in Nature and Art (1983), a readable, wide-ranging intermediate-level textbook; Johannes Itten , The Art of Color: The Subjective Experience and Objective Rationale of Color (1961, reprinted 1973; originally published in German, 1961), an exposition of an influential aesthetic theory; M.E. Chevreul , The Principles of Harmony and Contrast of Colors and Their Applications to the Arts (1854, reissued 1981; originally published in French, 1839), with notes by Faber Birren; Faber Birren , Principles of Color: A Review of Past Traditions and Modern Theories of Color Harmony (1969), an introduction, and his History of Color in Painting: With New Principles of Color Expression (1965), an authoritative treatment; and George A. Agoston , Color Theory and Its Application in Art and Design (1979), a broad review valuable as a reference work."
]