[
  "  geography , the study of the diverse environments, places, and spaces of Earth’s surface and their interactions. It seeks to answer the questions of why things are as they are, where they are. The modern academic discipline of geography is rooted in ancient practice, concerned with the characteristics of places, in particular their natural environments and peoples, as well as the relations between the two. Its separate identity was first formulated and named some 2,000 years ago by the Greeks, whose geo and graphein were combined to mean “earth writing” or “earth description.” However, what is now understood as geography was elaborated before then, in the Arab world and elsewhere. Ptolemy , author of one of the discipline’s first books, Guide to Geography (2nd century ce ), defined geography as “a representation in pictures of the whole known world together with the phenomena which are contained therein.” This expresses what many still consider geography’s essence—a description of the world using maps (and now also pictures, as in the kind of “popular geographies” exemplified by  National Geographic Magazine  )—but, as more was learned about the world, less could be mapped, and words were added to the pictures.",
  "To most people, geography means knowing where places are and what they are like. Discussion of an area’s geography usually refers to its topography—its relief and drainage patterns and predominant vegetation, along with climate and weather patterns—together with human responses to that environment, as in agricultural, industrial, and other land uses and in settlement and urbanization patterns.",
  "Although there was a much earlier teaching of what is now called geography, the academic discipline is largely a 20th-century creation, forming a bridge between the natural and social sciences. The history of geography is the history of thinking about the concepts of environments, places, and spaces. Its content covers an understanding of the physical reality we occupy and our transformations of environments into places that we find more comfortable to inhabit (although many such modifications often have negative long-term impacts). Geography provides insights into major contemporary issues, such as globalization and environmental change, as well as a detailed appreciation of local differences; changes in disciplinary interests and practices reflect those issues.",
  "The history of geography has two main parts: the history of exploration and mapmaking and the development of the academic discipline.",
  " bce  As people travel, they encounter different environments and peoples. Such variations are intellectually stimulating: Why do people and places differ? Stores of knowledge were built up about such new and exotic places, as demonstrated by the Greek philosopher and world traveler Herodotus in the 5th century bce . That knowledge became known as geography, a term first used as the title of Eratosthenes of Cyrene ’s book Geographica in the 3rd century bce . Such was the volume of knowledge compiled thereafter that Strabo’s Geography , published three centuries later, comprised 17 volumes. Its first two provided a wide-ranging review of previous writings, and the other 15 contained descriptions of particular parts of what was then the known world. Soon thereafter Ptolemy collated a large amount of information about the latitude and longitude of places in his seminal work.",
  "  The Greeks and Romans not only accumulated a great body of knowledge about Earth but also developed the sciences of astronomy and mapmaking, which helped them accurately locate places. However, during western Europe’s Migration period (Dark Ages), much of that wisdom was lost, but the study of geography—notably cartography—was nurtured in the Arab world. This material became known to western Europeans during medieval times, partly through their contacts with the Muslim world during the Crusades . As the Europeans linked this new material with what. they could rediscover in ancient Greek and Roman work, they frequently stressed misinformation derived from the latter, notably in Ptolemy’s inaccurate maps. From then on, as Europeans explored more of the world, increasing numbers of scholars collated new information and transmitted it to wider audiences.",
  " Theatrum orbis terrarum Theatrum orbis terrarum  A key feature of geographical information is that it is localized, relating to individual parts of Earth’s surface. Geography involves recording such information, in particular on maps—hence its close links with cartography . For centuries the locations of places were only inexactly known. Where to plot information on maps was frequently debated, as was drawing and demarcating boundaries around claimed territories. These debates were only resolved with more accurate and standardized cartographic practices. Meanwhile, collections of maps were assembled and published in atlases, a term first used by the 16th-century Flemish surveyor and cartographer Gerardus Mercator (Gerhard de Cremer) for his collection of maps of northern Europe, published in 1595; the first collection of maps of the world, Epitome of the Theatre of the World (1570), was produced by Mercator’s contemporary, the Belgian cartographer Abraham Ortelius . The science of surveying was employed to make detailed large-scale maps of the land surface; notable was the work of the Cassini family, in France, spanning more than a century, which was the basis for the world’s first national atlas, published in 1791.",
  "Thus, the evolving practice of geography involved mapping the world, drawing outlines of what heretofore were terrae incognitae, and filling them in with details about their physical environments and the people inhabiting them. Such geographical advances depended on improvements not only in cartography but also in astronomy , which was vital for navigation. Methods for determining latitude and longitude and measuring elevations and distances were refined and were of great value to navigators and explorers and their sponsors. Many expeditions, such as those of James Cook in the second half of the 18th century, conducted scientific experiments that enabled advances in navigation and cartography and collected samples of flora and fauna that were used to classify knowledge about the natural world—as in the pioneering work of the 18th-century French naturalist Georges-Louis Leclerc, comte de Buffon . These links between geography, exploration, cartography, and astronomy have been maintained, appearing as the first sections of many contemporary atlases (with maps of the heavens along with terrestrial phenomena such as climate).",
  "As information accumulated, a new branch of geography was established by the late Middle Ages , called chorography (or chorology). Books describing the then known world were used in geographical instruction at universities and elsewhere. Geography was not a separate discipline but was taught within established subjects such as mathematics and natural philosophy, in large part because it was of great importance to nation building and commerce. Among the early geography books were Nathaniel Carpenter’s Geography Delineated Forth in Two Bookes (1625) and the German scholar Bernhardus Varenius ’s Geographia Generalis (1650), which was revised and republished several times in the following century. Canadian geographer O.F.G. (George) Sitwell’s catalog lists 993 different books in “special” (i.e., systematic) geography published between 1481 and 1887 in the English language; Lesley Cormack identified more than 550 geography books in the libraries of the Universities of Cambridge and Oxford in the period from 1580 to 1620.",
  "  Geography was practiced and taught largely because its information was valuable—notably for traders, those who invested in them, and the statesmen who supported both groups. By the early 19th century there was great demand for information and knowledge about the world. To aid commercial enterprises aimed at exploiting its resources and peoples, governments became involved in colonial ventures, annexing land beyond their frontiers, providing administrators and military protection, and encouraging settlement. All such endeavours required geographical information, including accurate maps. Increasingly, governments became directly involved in these activities, as with the U.S. government’s sponsorship of major expeditions to the country’s expanding western frontier and the establishment of national mapping agencies around the world.",
  "Geographical societies were established in many European and North American cities in the early 19th century to share and disseminate information. Among the first were those founded in Paris (1821), Berlin (1828), London (1830), St. Petersburg (1845), and New York City (1851). Many of the European societies had royal patronage and strong support from the mercantile, diplomatic, and military classes. They collated and published information, sponsored expeditions, and held regular meetings, at which returning explorers might present their findings or participate in debates over technical issues such as mapping. These societies were central to the 19th-century mercantile and imperial ethos.",
  "Geography’s original characteristics were formulated by a small number of 19th-century French and German scholars, who strongly influenced subsequent developments in the United Kingdom and the United States. Since 1945, while retaining its focus on people, places, and environments, the discipline has expanded and changed considerably. Geography is one of the few academic disciplines, particularly in Europe, to have been established in universities as a result of pressure to produce people who could teach it in schools. As the demand for geographical information increased, more people required a foundation of geographical knowledge. There was also growing recognition of the role geography could play in creating national identities, making people aware of their particular situations through contrasts with environments and peoples elsewhere. Geographical knowledge was important to citizenship, especially if it supposedly showed the superiority of one’s own people and environment.",
  "Geography’s links with mercantilism , imperialism , and citizenship were the basis of claims for geographical instruction in schools. For example, geographical societies lobbied successfully for their subject’s inclusion in the curricula associated with universal school education, especially in northwestern Europe. Specialist bodies, such as the Geographical Association in the United Kingdom, continued to promote the discipline’s educational role.",
  "Sustaining the teaching of geography in schools required programs to train teachers and institutions where geographical knowledge could be codified and its scholarship advanced. Geography needed a presence in universities to give it academic credibility, and societies petitioned to secure it there. Some of this lobbying was successful by the end of the 19th century—the height of European imperialism. In Prussia, for example, a royal decree in 1875 established professorships of geography in 10 universities. In the Netherlands, the Royal Dutch Geographical Society was founded in 1873, largely to sponsor major expeditions to the Dutch East Indies . The society’s first endowed chair, at a private university in Amsterdam, was specifically in “colonial geography.” In Russia, St. Petersburg’s Imperial Russian Geographical Society promoted the discipline in a variety of ways, establishing it early at Moscow State University . The Italian Geographical Society was founded in 1867, following the creation of the first university professorships in 1859; it too promoted “exploratory” geography and the teaching of geography in schools.",
  "In the United Kingdom in the late 1880s, after such courses had been discontinued at the University of London , the Royal Geographical Society convinced Cambridge and Oxford to provide instruction in geography, with the society funding instruction for several decades (though degree courses were not introduced until the 1920s and ’30s). As more British universities were founded, they too were pressed to provide instruction in geography. At some, private donations secured the appointment of lecturers. At others, a need for geography instruction was recognized in cognate disciplines, such as economics , geology , and history , although few of those appointed to do the teaching had any formal training in the discipline. This was also the case with the first professors of geography, appointed in the early 1930s at Cambridge and Oxford—Frank Debenham and Kenneth Mason, respectively.",
  "Many of the first geography teachers were located in departments of disciplines that introduced geography teaching, but as the demand for courses grew—mainly from students who intended to teach the subject in schools—separate geography departments and degree programs were soon established. By 1945 there was a geography department in nearly every British university and in many of the universities and university colleges throughout the British Empire .",
  "  Geography’s 19th-century research directions were set by a few influential individuals, although not all of them were even formally associated with the discipline. Many of its roots emanated from several continental European geographers, some of whom owed their inspiration to the teaching of philosophers such as Immanuel Kant , who wrote about geography in Critique of Pure Reason (1781). Especially influential were the German scholars Alexander von Humboldt (1769–1859), Carl Ritter (1779–1859), and Friedrich Ratzel (1844–1904) and French geographer Paul Vidal de la Blache (1845–1918).",
  "Humboldt’s interests were stimulated by the Germans Johann Reinhold Forster and his son, Georg Forster , who on James Cook’s second voyage had collated botanical and climatological data. Humboldt synthesized a vast amount of information (much of it on his travels, including five years in Central and South America) to illustrate environmental variation, noting differences in agricultural practices and patterns of human settlement that reflected the interactions of elevation, temperature, and vegetation. His work emphasized field collection of data and their synthesis through maps, leading to inductive generalizations regarding environmental characteristics and their links with human activity. Materials assembled from a wide range of sources were the basis for his major published work, the five-volume Kosmos .",
  "Whereas Humboldt laid the groundwork for what later became known as systematic geography, Ritter focused on regional geography, the study of the connections between phenomena in places. This involved defining regions, or separate areas with distinct assemblages of phenomena. He relied on secondary data sources in compiling his 19-volume Die Erdkunde im Verhältniss zur Natur und zur Geschichte des Menschen (“Earth Science in Relation to Nature and the History of Man”), which he never finished.",
  "  Ratzel, whose early studies were in biology and anthropology , was much influenced by Darwinian thinking when linking human societies to their physical environments. His two-volume Anthropogeographie (1882–91) related the course of history to Earth’s physical features, illustrating the principle of survival of the fittest. His later Politische geographie (1897) utilized Darwinian arguments to characterize nation-states, which he treated as organisms that struggle for land ( Lebensraum , or “living space”), only the strongest being able to expand territorially.",
  "When geography was institutionalized at German universities in the late 19th century, however, there were no formally trained geographers, and the first professors had backgrounds in such disciplines as history, mathematics , geology, biology, or journalism . Their new discipline, which was conceived as a general Earth science, embraced systematic materials from those in which they had been trained. They created a unity for geography around the regional concept, building on foundations laid by Humboldt and Ritter. Field research outside Germany was deemed a crucial part of training, and each student spent a year overseas. Regular meetings involving several hundred German geographers—the Deutscher Geographentag—were held in the late 19th century, and these have continued to the present day. A separate Association of Academic Geographers was formed in the early 20th century, by which time several important geographical journals were in production.",
  "  In France the discipline had roots in history and mapping. The first major practitioner was Paul Vidal de la Blache , who had trained as a geographer and was appointed to the Sorbonne in 1898, where he maintained close links with the Annales school of historians. Vidal focused on defining and describing regions, or what he called pays —relatively small homogeneous areas—whose distinctive genres de vie (“modes of life”) resulted from the interactions of people with their physical milieux. Unlike some of his German contemporaries, notably Ratzel, he did not see those interactions as predominantly determined by the physical environment. Instead, he promoted what became known as possibilism, where the environment offers a range of options, and people choose how to modify nature according to their cultural and technological inheritances. As the contemporary historian Lucien Febvre put it, “nowhere necessities…everywhere possibilities.” Vidal’s major contributions were his Tableau de la géographie de la France (1903; “Outline of the Geography of France”), an introduction to the multivolume Histoire de la France , and the 15-volume Géographie universelle (1927–48). Many of his students wrote dissertations on individual pays , the study of which dominated French geography throughout the first half of the 20th century.",
  "Developments in continental Europe during the late 19th century provided the foundation for an academic discipline to emerge in the English-speaking world, where the new intellectual concerns were integrated with the established traditions in exploration and cartography. The first International Geographical Congress was held in Antwerp , Belgium, in 1871; several more congresses were convened on the Continent before the first meetings in London (1895) and the United States (1904), and thus the notion was perpetuated, at least among some, that geography was still a “European” discipline. The International Geographical Union (IGU) was founded in 1922.",
  "As a separate academic discipline, therefore, geography emerged out of a demand for teaching knowledge about the world’s environments and peoples. From small and diverse beginnings, it was established in the academic community as a subject and developed associated institutions, such as learned societies to promote the discipline and journals in which geographers could publish their work, and its relevance grew to be recognized worldwide. In 1964, 70 countries sent delegates to the International Geographical Congress in London; now some 100 countries—through national committees for the discipline—are affiliated with the IGU. Geographers became academics in the full sense of the 20th-century university as they began to pursue research and original investigations.",
  "In the United States, where each state was responsible for providing elementary, secondary, and higher education, there was no coordinated pressure for geography instruction. Instead, the creation of geography programs reflected particular local situations. In a number of universities, geography courses were offered for students in geology departments; in others, their origins lay in the universities’ schools of business and commerce—as was the case at the University of California, Berkeley, where the country’s first separate department of geography was created in 1898 within the College of Commerce. Out of these programs—and the courses included in teacher education at normal schools (many of which became state colleges and universities), as well as university education departments—emerged several geography departments, including graduate programs, such as those at the University of Chicago and at Clark University in Worcester, Massachusetts. By 1945 about 30 universities in the United States had geography graduate programs. However, the discipline remained relatively weak, and in subsequent decades several departments were closed and undergraduate degree programs discontinued. Notable were the closures at several Ivy League schools (the exception being Dartmouth College in Hanover, New Hampshire) and other private institutions, such as Northwestern University (Evanston, Illinois; in 1987) and, most conspicuously, the University of Chicago (1986)—although Harvard University (Cambridge, Massachusetts) established a Center for Geographic Analysis in 2006.",
  "European scholars considerably influenced the emerging discipline in the United Kingdom and North America, where institutionalization into the academic structures came somewhat later. Scholars, some of whom studied in Germany or France, promoted different aspects of the discipline. Foremost in the United States was William Morris Davis , a geologist at Harvard University who published prolifically on landscape evolution (later called geomorphology , or the study of landforms). He argued strongly for education in geography, promoting an approach derived from German environmental determinism: human behaviour is strongly conditioned by environmental factors, so the study of physical geography should be the basis for understanding human activity. Davis was the principal author of an 1892 report on the teaching of geography, which recommended replacing the rote learning that characterized the discipline in American schools at that time with a more scientific approach based on physical geography but including “the physical influences by which man and the creatures of the Earth are so profoundly affected.”",
  "This approach was soon rejected as flawed by most geographers in the United States, who adopted a regional approach; areal variations in human activities, notably land uses, in their environmental settings were described, and homogeneous regions were defined. Richard Hartshorne codified this approach. His monograph, The Nature of Geography (1939; reprinted 1976), was much influenced by the work of German authors—notably Alfred Hettner —and it conceived the discipline’s defining characteristics. Geography, he concluded, is",
  "a science that interprets the realities of areal differentiation of the world as they are found, not only in terms of the differences in certain things from place to place, but also in terms of the total combination of phenomena in each place, different from those at every other place.",
  "Systematic geography focused on individual phenomena. But regional geography, or the study of the “total combination of phenomena” in places, was “the ultimate purpose of geography”—a task later redefined as “the highest form of the geographer’s art.” According to a leading British geographer, Sidney William Wooldridge, in The Geographer as Scientist: Essays on the Scope and Nature of Geography (1956, reprinted 1969), regional geography aimed",
  "to gather up the disparate strands of the systematic studies, the geographical aspects of other disciplines, into a coherent and focused unity, to see nature and nurture, physique and personality as closely related and interdependent elements in specific regions.",
  "According to this view, all geographers—whatever their systematic interests in particular classes of phenomena—should be regional specialists who appreciate the full complexity of phenomena combinations. Many of Hartshorne’s contemporaries identified themselves as regional geographers and published major texts, such as Preston E. James in his renowned Latin America (1942). Many introductory texts, such as James’s An Outline of Geography (1935), used regional divisions of the world as organizing templates, though the regions were usually defined at much larger scales than the Vidalian pays .",
  "Although regional geography dominated U.S. geographical practices in the first half of the 20th century, it was not universally adopted. Its major challenge was an approach—widely known as cultural geography—associated with Carl Sauer (1889–1975), a University of Chicago geography graduate, and the associates and students whom he led at the University of California, Berkeley, from 1923 to 1957. Sauer was also strongly influenced by the Germans, but he emphasized the study of landscape changes produced by the impress of different cultural groups on environments, with particular reference to rural Latin America. What became known as the Berkeley school used field, documentary, and other evidence to explore societal evolution in its environmental context, much of which apparently involved diffusion from core “culture areas.”",
  "These two approaches dominated U.S. geography for several decades, with considerable conflict between what were seen as the “Midwest” and “West Coast” definitions—which, respectively, were predominantly economic and cultural; Hartshorne’s Perspective on the Nature of Geography (1959, reissued 1968) partly reconciled the two, allowing for historical studies such as Sauer’s. Not all American geographers followed one or the other, however. Some stressed systematic interests, as with early economic geographers such as J. Russell Smith, who worked in the Department of Geography and Industry at the University of Pennsylvania and published his Industrial and Commercial Geography in 1913. Economic or commercial geography courses were quite common in economics departments at American universities then, but with a shift in the focus of academic economics to a more analytical and statistical (or mathematical) approach, the links had nearly disappeared by 1920.",
  "Also prominent in the early 20th century was Isaiah Bowman , president (1935–48) of Johns Hopkins University . A geology graduate of Harvard, where he was taught by William Morris Davis, Bowman did his early work on physical geography and pioneer settlement in South America. As director of the American Geographical Society (1915–35), he oversaw cartographic and other geographical work preparatory to the Paris Peace Conference (1919–20), which he attended, following World War I.",
  "  Two early influential geographers in the United Kingdom were both associated with the School of Geography at the University of Oxford. Halford John (later Sir Halford) Mackinder , appointed in 1887, was trained in the natural sciences and history and felt the need to prove his geographical credentials by climbing Mount Kenya in 1899. He is best known for his contributions to political geography; his concept of the “heartland”—the centre of the Eurasian landmass—as the pivotal area in world geopolitics influenced much Western political strategy for more than half a century. He later became a politician and diplomat. Mackinder actively promoted geographical education in schools. His 1887 paper to the Royal Geographical Society defined geography as the scientific study of the interrelationship between society and the environment. In addition, he convened the meeting in 1893 that founded the Geographical Association, which aimed to be a society for teachers of geography at all levels and became a successful lobby for the discipline.",
  "Andrew John Herbertson took over the department at the University of Oxford after Mackinder. He drew on European roots and emphasized regional study, using climatic and other parameters to define regions at the global scale; others developed the regional concept, using a wider range of phenomena, at smaller scales (echoing the French work on pays ). Regional geography remained at the core of the discipline in the United Kingdom until the 1950s, as promoted in The Spirit and Purpose of Geography (1953) by Sidney William Wooldridge and Gordon East.",
  "Other influential early individuals included L. Dudley (later Sir Dudley) Stamp, a geologist by training who spent most of his career in the geography department of the London School of Economics . He directed a land-utilization survey of Britain in the 1930s, mobilizing some 250,000 students to map the country’s land use. This material proved invaluable in agricultural planning during World War II, during which Stamp was involved in major government inquiries into land use, and was a foundation for his promotion of applied geography and geographers’ contributions to the postwar extension of urban and rural planning activities. He also published many textbooks, stimulated interest in other areas (such as medical geography), and promoted collaboration through the IGU, of which he was president from 1960 until his death in 1966. Wooldridge was also trained as a geologist and worked in the King’s College, London, geography department, where he was a major force in the development of physical geography in Britain—notably geomorphology, through his interpretations of Davis’s ideas.",
  " Historic Byways and Highways of Old England  Another British geographer who influenced the discipline considerably through his own work and that of collaborators and graduate students was Henry Clifford (later Sir Clifford) Darby. The first to obtain a Ph.D. in geography at Cambridge, he pioneered work in historical geography through studies of landscape change and the detailed geography of England as displayed by the Domesday Book (1086). Darby and his followers established a strong and continuing presence for historical geography early in the discipline’s development in the United Kingdom.",
  "For the first half of the 20th century, therefore, the core of European and American geographical scholarship involved identifying and describing areal variations of the Earth’s environments and their exploitation by human societies and, to a lesser extent, accounting for the creation of distinctive places (regions). This knowledge was valuable for general education and was deployed in the two World Wars for military purposes. Geographers’ skills in interpreting cartographic and aerial photographic information were also substantially employed.",
  "The focus on integration and regional synthesis slowly declined, however, and geographers increasingly identified themselves by their systematic special interests rather than a regional concentration. This created outward-looking forces within the discipline for the remainder of the century; individual specialists developed links with cognate disciplines (e.g., geomorphologists with geologists), creating research foci at interdisciplinary border areas that were then taught in specialist courses. The systematic slowly replaced the regional at the discipline’s core, a shift associated with a major division within the discipline, between physical geographers, who increasingly identified themselves as environmental scientists, and human geographers, whose allegiance was to the social sciences.",
  "By the end of the 1930s, the links between geographers in continental Europe and the English-speaking countries were weakening. This in part reflected the political situation, but it also resulted from the growth of the discipline and the development of particular approaches to the subject in Britain and the United States, as well as postwar transatlantic contacts. After 1945 European links were not strongly renewed, and for some decades there was relatively little contact between English-speaking and other geographers. The main exceptions were with the four Scandinavian countries and the Netherlands, where human geography has long had a close link with the professional planning discipline; much of the geographical research produced in those countries has been published in English. Meanwhile, British and North American geographers came closer together. Many students from the United Kingdom undertook graduate work in North America, for example, with a considerable number of them taking university posts there, including in Canada, which had only a few geography departments before the Canadian Association of Geographers was founded in 1950.",
  "In Germany, to many the heartland of academic geography, the discipline had to recover after the war from its association with Nazi ideology—in particular the use of the school of geopolitics ( Geopolitik ) to underpin Nazi policies of territorial expansion (for Lebensraum [“living space”]). Initially, the small remaining number of geographers returned to pre-1930s roots in the study of landscapes—notably geomorphology and settlement patterns—but, with the rapid growth of the universities since the 1960s, greater pluralism emerged, and Anglo-American disciplinary changes slowly infiltrated. In France the discipline experienced a major crisis after widespread student rebellions there in 1968. Some French geographers were attracted to what became known as the “new” geography, which was being promoted elsewhere, but others resisted, championing instead a particular view of spatial organization that incorporated the traditional humanistic concerns of French geography. Farther east, in the Soviet Union and the countries of eastern Europe, the direction of research in geography—as in other disciplines—was subordinated to state priorities. There physical geography became dominant, and for several decades links with the West were limited.",
  "The then-established views regarding the nature of geography were set out in two large volumes in the early 1950s: Geography in the Twentieth Century (1951), edited by Griffith Taylor, and American Geography: Inventory and Prospect (1954), edited by Preston James and Clarence Jones. However, by then there was growing unease in North America and the United Kingdom with the dominant orientation of the discipline. It was seen as overemphasizing vertical (or society-environment) relationships and largely ignoring the horizontal (or spatial) relationships that characterized societies in which movement and exchange were so important. Geographers, it was argued, should pay more attention to spatial organization of economic, social, and political activities across the environmental backdrops. Too much effort was spent, as George Kimble expressed it,",
  "drawing boundaries that don’t exist around areas that don’t matter…from the air it is the links in the landscape that impress the observer, not the boundaries.",
  "Studies of areal functional organization were inaugurated, both for their intrinsic interest and because of their value; one pioneer, Robert Dickinson, argued that functional regions around towns and cities should be used to define regional and local government areas.",
  "There was also a growing belief that the methods for defining regions were out of line with the scientific approaches characterizing other disciplines. Some felt that geographers had not contributed well to the war effort: Edward A. Ackerman, a professor of geography at the University of Chicago from 1948 to 1955 (and later head of the Carnegie Foundation), claimed that those working in the U.S. government’s intelligence service had only a weak understanding of their material and portrayed them as “more or less amateurs in the subjects on which they published.” He argued that geographers should follow not only the natural sciences but also most of the social sciences and should adopt more-rigorous research procedures.",
  "Although there were moves in those directions in a number of places, the arguments were focused in 1953 by a paper in the prestigious Annals of the Association of American Geographers that strongly criticized what Ackerman called the “Hartshornian [i.e., regional] orthodoxy.” Kurt Schaefer, a German-trained geographer at the University of Iowa , argued that science is characterized by its explanations. These involve laws, or generalized statements of observed regularities, that identify cause-and-effect relationships. According to Schaefer, “to explain the phenomena one has described means always to recognize them as instances of laws”; for him the major regularities that geographers study relate to spatial patterns (the horizontal relationships identified above), and so “geography has to be conceived as the science concerned with the formulation of the laws governing the spatial distribution of certain features on the earth’s surface.”",
  "Schaefer codified what an increasing number of geographers were thinking, identifying a need for a major reorientation of—if not revolution in—its practices. The main thrusts occurred elsewhere. One of the most influential early centres was the University of Washington in Seattle, led by William Garrison and Edward Ullman. Their students, such as Brian Berry, William Bunge, Richard Morrill, and Waldo Tobler, became leading protagonists of the new geography, which rapidly spread to other universities in the United States, such as Northwestern, Chicago, and Ohio State in Columbus. It soon reached the United Kingdom, with initial centres at Cambridge and Bristol.",
  "Much inspiration for these shifts came from economists, sociologists, and other social scientists, who were developing theories of spatial organization and using quantitative methods to test their hypotheses. The human geographers who followed their lead promoted in their practices what became known as the “quantitative and theoretical revolution.” So too did physical geographers, who, for example, switched their focus from simply describing landforms to searching for scientific explanations of how they were created.",
  "Three main arguments underpinned this paradigm shift in geographical practice. The first was that geography should become more scientifically rigorous, adopting the experimental science model (positivism) already in use by economists. The goal included deductive reasoning, which led to hypothesis testing with the goal of producing explanatory laws. The second was that such rigour required quantitative methods to provide precise descriptions and exact, reproducible research findings—unequivocal lawlike statements. Finally, with such a shift in disciplinary practices, the applied value of geographical work would be appreciated—in, for example, environmental and city and regional planning. Geography should be the science of spatial arrangements and environmental processes. Success in this promotion of geography as a science was crucial in winning recognition for the discipline in the United States from the National Science Foundation in the 1960s, initially as part of a Geography and Regional Science Program.",
  "The success of those promoting change was assisted by the expansion of higher education. More students were going to colleges and universities, and new institutions were being founded. More geographers were needed to teach the subject, and many of those who were recruited preferred the novel approaches. The “revolutions” were to a considerable extent generational. The larger number of practicing geographers also precluded a small number of individuals imposing their views on the discipline; instead, there was encouragement to experiment and explore new topics and approaches. Furthermore, universities were increasingly emphasizing their research as well as teaching roles, and the new generations of geographers were more active as researchers than their predecessors. So more was done by more people, leading to greater specialization. Soon geography increasingly fragmented into specialist subdisciplines.",
  "As a consequence of these changes, physical geography moved away from inductive accounts of environments and their origins and toward analysis of physical systems and processes. Interest in the physiography of the Earth’s surface was replaced by research on how the environment works.",
  "  The clearest example of this shift came in geomorphology, which was by far the largest component of physical geography. The dominant model for several decades was developed and widely disseminated by William Morris Davis , who conceived an idealized normal cycle of erosion in temperate climatic regions involving the erosive power of running water. His followers used field and cartographic evidence to underpin accounts of how landscapes were formed: they constructed what geographers in the United Kingdom called “denudation chronologies.” Davis recognized a number of other cycles outside temperate climatic areas in glaciated, desert, and periglacial and mountain areas, as well as in coastal and limestone areas. Each of these separate cycles had its own characteristic landforms. Because of long-term global climatic change, however, they may have characterized the now-temperate areas at different periods. For geomorphologists working in temperate regions, particular interest focused on the advance and retreat of glaciers during the Pleistocene Epoch (about 2,600,000 to 11,700 years ago). Landscape interpretation in many such areas involved identifying the influence of glaciations and the consequences of global warming , more recently a subject of considerable scientific interest. By the 1950s a major criticism of this work was that it was based on untested assumptions regarding landscape-forming processes. How does running water erode rocks? Only answering such questions could explain landform creation, and seeking those answers called for scientific measurement.",
  "  There were three other main groups of physical geographers, two of whose work was also much influenced by the concepts of evolution. Workers in biogeography studied plants and, to a lesser extent, animals. The geography of plants reflects environmental conditions, especially climate and soils; biogeographical regions are characterized by those conditions and their floral assemblages, which produce patterns based on latitude and elevation. It was argued that those assemblages evolve toward climax communities. Whatever specific vegetation types initially occupy an area, competition between plants for available resources will lead to those most suited to the prevailing conditions eventually becoming dominant. Such conditions may change and a new cycle be initiated because of either short-term climatic fluctuations or human-induced environmental changes.",
  "  The study of soils, or pedology , was concerned with the thin mantle of weathered material on the Earth’s surface that sustains plant and animal life. World regions were identified based on underlying rocks and the operative physical and chemical weathering processes. Climatic conditions were important influences on soil types, with local variations reflecting differences in surface deposits and topography. As with landforms and plant communities, it was assumed that soils evolve toward a steady state, as weathering proceeds and characteristic soil profiles emerge for each region.",
  "  Finally, there was climatology , or the study of major world climatic systems and their associated local weather patterns in space and time. Much of the work was descriptive, identifying major climatic regions and relating them to solar and earth geometry. Others investigated the generation of seasonal and local weather patterns through the movements of weather systems, such as cyclones and anticyclones.",
  "These approaches dominated physical geography until the 1960s, when they were largely replaced. The new programs had three main aspects: greater emphasis on studying processes rather than outcomes, adoption of analytical procedures to measure and assess those processes and the associated forms, and integration of the processes into a focus on entire environmental systems. Many of the early changes involved detailed measurement of physical forms; deductive modeling based on physical properties developed later. Their integration into process-response models involved a reorientation of physical geography every bit as extensive as that in human geography. Physical geographers increasingly identified themselves as environmental scientists, using the basic concepts of physics, chemistry, and biology and the methods of mathematics to advance the understanding of how the environment works and how it produces its characteristic features.",
  "  The systems concept was a significant element of these changes. Climates, landforms, soils, and plant and animal ecology were conceived as being interrelated, with each having an impact on the other. The systems could be divided into subsystems with separate but linked characteristics and processes. Drainage basins became major units of study, for example, and were subdivided into the channels along which water is carried and the valley slopes whose form is created by the moving water. Geographers were introduced to the importance of studying systems by the work of a number of American geologists, such as Stanley Schumm and Arthur Strahler. However, the lack of interest in time and change—as expressed in Hartshorne’s Nature —meant that little work had been done on physical geography in the United States for decades. The influential geographers included Briton Richard Chorley, who taught at the University of Cambridge after studying with Strahler in New York, and George Dury, who was trained in the United Kingdom but spent much of his career in Australia and the United States. These major protagonists introduced systems thinking and the study of processes to British physical geography, which was then reexported to American geography from the 1970s on, where locally trained individuals such as Melvin G. Marcus played key pioneering roles.",
  "In human geography, the new approach became known as “locational” or “spatial analysis” or, to some, “spatial science.” It focused on spatial organization, and its key concepts were embedded into the functional region—the tributary area of a major node, whether a port, a market town, or a city shopping centre. Movements of people, messages, goods, and so on, were organized through such nodal centres. These were structured hierarchically, producing systems of places—cities, towns, villages, etc.—whose spatial arrangement followed fundamental principles. One of the most influential models for these principles was developed by German geographer Walter Christaller in the early 1930s, though it attracted little attention for two decades.",
  "  Christaller’s central-place theory modeled settlement patterns in rural areas—the number and size of different places, their spacing, and the services they provided—according to principles of least-cost location. The assumption was that individuals want to minimize the time and cost involved in journeys to shops and offices, and thus the needed facilities should be both as close to their homes as possible and clustered together so that they can make as many purchases as possible in the same place. Likewise, businesses will want to maximize turnover, with people spending as much as possible on goods and services and as little as possible on transport. An efficient distribution of service centres was in the interest of both suppliers and consumers. Christaller showed that this required a hexagonal distribution of centres across a uniform plane (i.e., one that had no topographical barriers), with the smaller centres (providing fewer services) nested within the market areas of the larger.",
  "  Other works by non-geographers provided similar stimuli. Economists such as Edgar Hoover, August Lösch (who produced a theory similar to Christaller’s), Tord Palander, and Alfred Weber suggested that manufacturing industries be located to minimize both input costs (including the costs of transporting raw materials to a plant) and distribution costs (getting the final goods to market). Least-cost location was the goal, which could be modeled as a form of spatial economics. Efficient spatial organization involved minimizing movement costs, which was represented by an adaptation of the physicists’ classical gravity model. The amount of movement between two places should be a function of their size and the distance between them; i.e., size generates interaction, whereas distance attenuates it.",
  "These hypothesized patterns stimulated much searching for order in the distribution of economic activities and movements between places. Use of the intervening areas between the nodes and channels was also investigated within the same paradigm. A 19th-century German landowner-economist, Johann Heinrich von Thünen , had modeled the location of agricultural production, involving a zonal patterning of activities consistent with minimizing the costs of transporting outputs to markets with the highest-intensity activities closest to the nodes and channels. Economists adapted this to the organization of land uses within cities: these, and the associated land values, should be zonally organized, with housing density decreasing away from the centre and the major routes radiating from it.",
  "Finally, there was the issue of change within such spatial systems, on which the work of Swedish geographer Torsten Hägerstrand was seminal. He added spatial components to sociological and economic models of the diffusion of information. According to Hägerstrand, the main centres of innovation tend to be the largest cities, from which new ideas and practices spread down the urban hierarchies and across the intervening nonurban spaces according to the least-cost principles of distance-decay models. Later studies validated his model, with the best examples provided by the spread of infectious and contagious diseases.",
  "The models of patterns and flows were synthesized to describe urban systems at two main scales: systems of cities, in which places were depicted as nodes in the organizational template, and cities as systems, focusing on their internal organization. The goal was not just to describe those systems and their operations but also to model them (statistically and mathematically), thus producing general knowledge about the spatial organization of society rather than just specific knowledge about individual places. Location-allocation models suggested both optimum locations for facilities and efficient flows between them. A new discipline, regional science, was launched by economist Walter Isard to study such systems and promote the application of the knowledge acquired. It failed to gain separate status within universities, but many geographers still participate in its conferences and publish in its journals.",
  "By the late 1960s these new practices were synthesized in influential innovative textbooks on both sides of the North Atlantic. Notable examples included Peter Haggett’s Locational Analysis in Human Geography (1965), Richard Chorley and Haggett’s Models in Geography (1967), Ron Abler, John Adams, and Peter Gould’s Spatial Organization (1971), and Richard L. Morrill’s The Spatial Organization of Society (1970). Each emphasized the theme earlier pronounced by Wreford Watson that “geography is a discipline in distance.”",
  "The early models made relatively simple assumptions regarding human behaviour; the principle of least effort predominated, with monetary considerations preeminent, and it was assumed that decisions were based on complete information. These were later relaxed, and more-realistic models of spatial behaviour were based on observed decision making in which the acquisition and use of information in spatial contexts took centre stage. Distance was one constraint on behaviour; it was not absolute, however, but manipulable, as patterns of accessibility could be changed. And as the behavioral contexts were altered, the learning and decision-making processes within them also changed, and the spatial organization of society was continually restructured.",
  "As research practices changed, so too did teaching. The earlier focus on field observation, map interpretation, and regional definition was replaced, and research methods for collecting and analyzing data—particularly statistical analysis—became compulsory elements in degree programs. New subdisciplines—notably urban geography—came rapidly to the fore, as systematic specialisms displaced regional courses from the core of many curricula. Other parts of the discipline—economic, social, political, and historical—were influenced by the theoretical and quantitative revolutions. What became known as a “new” human geography was created, initially at a few institutions in the United States and the United Kingdom but rapidly spread through the other Anglophone countries and later to a variety of other countries.",
  "  The map was long the geographer’s main tool, with map construction and interpretation being the major practical skills taught in degree programs. Mapmaking involved knowledge of surveying and projections, in addition to the arts of depicting point, line, and area data on maps. Map interpretation involved their use not only in the field for location but also in the laboratory for identifying landscape and other features, with map comparison used to identify associations among distributions and to define regions with multiple criteria. Alongside the map—especially after World War II—geographers increasingly used aerial photography to supplement these landscape-interpretation skills.",
  "  By the end of the 20th century, very little of this material remained in degree curricula; mapping skills were seldom a significant part of the geography student’s education. Mapmaking was moved from the field and drawing board to the laboratory and keyboard, using remotely sensed imagery, geographical positioning systems (e.g., the Global Positioning System [ GPS ]), and computers. So was the production of maps to display patterns of interest to geographers; standard computer software packages provided geographers with their illustrative material without any need to use pen and ink.",
  "  The analysis of remotely sensed images—initially from airplanes but increasingly from spacecraft—assumed considerable importance in some areas of geographical research, especially physical geography. Images provided immediate, regular, and frequent information on parts of the world that were difficult to access physically, making it possible not only to produce detailed maps but also to make estimations of environmental conditions (such as biomass volume, soil wetness, and river sediment loads) and to assess short-term changes. Such images are the only source of data at the global scale and are increasingly important for modeling environmental changes.",
  "Much experimentation was required to realize the potential uses of the massive volume of data provided from spacecraft sensors, and remote-sensing techniques became important tools; radar, for example, circumvented the problem of generating images in cloudy areas. The techniques for producing these newer images were largely the province of physics, mathematics, and computer science. Geographers were concerned with their use in understanding and managing the environment, with field studies providing the ground data against which image assessments could be evaluated, and developing remote-sensing methods for various tasks, such as estimating precipitation in desert areas.",
  "The use of remote-sensing data was substantially confined to physical geographers, but the use of mathematics—another addition to the geographers’ skill sets—was used more widely and, for a time, was propounded by some as a means to integrate human and physical geography. Scientific rigour was associated with quantification; identities and relationships had to be expressed numerically because of the precision and unambiguity of mathematical statements and the replicability of results expressed in those terms. Mathematical procedures were adopted to model integrated systems, with statistical methods deployed to test hypotheses regarding system components, such as the relationship between land values and distance from a city centre, or the steepness and stability of a range of slopes.",
  "Geographers initially assumed that they could adapt standard statistical procedures to their particular problems, exploring the validity and viability of a range of approaches (from econometrics, biometrics, psychometrics, and sociometrics). The greatest emphasis in these pioneering applications and textbooks was placed on methods associated with the general linear model—e.g., regression, correlation, analysis of variance, and factor analysis—but specific spatial statistical procedures for analyzing point and line patterns were also explored.",
  "Geographers soon realized that spatial data present specific analytical problems that require particular treatment and for which standard procedures have to be modified. A wide range of issues in geostatistics was identified, such as the problems of spatial autocorrelation in analyzing all spatial data, the modifiable areal unit problem and associated ecological fallacies in human geography, and the means of estimating values on maps from what is known about neighbouring sites. Analyzing spatial data has been enormously facilitated by developments in computer power and algorithms. Advancements in computational skills have allowed geographers to not only address previously intractable problems but also provide a means for thinking about problems that were not even considered before technology enabled them.",
  "The major technological advance of the late 20th century in this regard was one that, although not specific to geography in its wide range of applications, has had particular resonance for geographers. Geographic information systems ( GIS ) are combined hardware and software systems for the capture, storage, checking, integration, manipulation, display, and analysis of spatially referenced (geocoded) data. The data (i.e., information with coordinate referencing, such as latitude and longitude) are input into these systems and displayed in two- or three-dimensional maps and other diagrammatic forms. Two or more maps can be overlaid and integrated for analysis—such as a relief map and a map of wells—even if they are compiled on different spatial grids. If geocoding schemes can be made compatible, separate data sets can be combined, analyzed, and displayed. This is technically demanding in many circumstances because of the issues involved in the interpolation of values for particular points from partial data. GIS facilitates modeling of processes in both space and time and has been the focus of much research investment. It has a massive range of potential applications in a wide range of areas, such as the planning of public facilities and services.",
  "The development of GIS and their applicability is a significant focus of contemporary geographical work. Major public initiatives in the late 1980s in both the United States and the United Kingdom—the National Center for Geographic Science and the Regional Research Laboratories, respectively—have allowed research to expand considerably, with geographers at the centre of major components of the information sector (i.e., those who produce and disseminate information). Instruction in GIS operation and use is now a core component of many degree programs. Many universities offer specialist qualifications in GIS, and conferences of GIS users are by far the largest regular gatherings involving geographers. To some this modern expression of cartography comprises a geographic information science, part of a larger field of geoinformatics; it provides many geography graduates with a heavily demanded key skill, and its research and applications potential offers a secure foundation for the discipline’s future.",
  "Once the switch from inductive reasoning based on field evidence to deductive modeling and field-testing had been generally accepted within physical geography, change in that section of the discipline became more gradual and progressive rather than punctuated by significant advances. The last decades of the 20th century were marked by greater sophistication in modeling, data collection, and analysis—by a deepening of the discipline and a greater integration of its parts. Increasingly, physical geographers identified themselves as earth systems scientists, and their peer group became practitioners in a wide range of sciences, rather than other (especially, but not only, human) geographers. Physical geographers have retained distinctiveness in this wider enterprise through their abilities at handling spatial data and the problems of collecting and analyzing field data—skills increasingly deployed in large multidisciplinary projects.",
  "Such continuity was not so readily apparent in human geography, whose practitioners have generated almost constant debate over its nature and methods without any one approach becoming dominant. As a result, human geography has become more fragmented than physical geography. This has been facilitated by continued growth in the number of practicing geographers, especially in the United Kingdom, where the discipline’s popularity and strength in the universities has ensured the needed resources.",
  "New practices in human geography have been closely linked to parallel changes in the social sciences, in some of which the quantitative-positivist approach has come under attack. The arguments were extended to the spatial-analysis approach with its geometric emphasis. By reducing all decision making to economic criteria, subject to immutable laws regarding least costs, profit maximization, and distance minimizing, geographers, it was claimed, were ignoring (even denigrating) the role of culture and individuality in human behaviour. By proposing to use those laws as bases for spatial planning, they were simply reproducing the status quo of capitalist domination; and by assuming universal patterns of behaviour, it was argued, they were patronizing those who chose to operate differently.",
  "Stimulating and growing out of these arguments were three main strands of work. In the first, geographers led by David Harvey (who was Cambridge-trained but worked largely in the United States) explored Marxist thinking. This involved not only the workings of the economy—to which they added an important spatial dimension—but also the class conflict underpinning Marxian analyses and the consequent unequal distribution of power. The positivist aspects of locational analysis were attacked as largely irrelevant; they assumed constant conditions for economic decision making and, thus, universal laws of behaviour, whereas for Marxist scholars continuous change was the norm.",
  "A popular alternative approach for some of a generally Marxist persuasion was critical realism. This accepts that there are general tendencies within capitalism but contends that they are only realized when implemented by individuals making decisions in local contexts: the profit motive is general, but individual entrepreneurs decide how to pursue it. The outcomes then change the local contexts—for example, by changing the maps of economic activity within which decisions are made, so that the contingent circumstances for future decisions also change—and there can be no general laws of outcomes, only of basic processes. This argument was forcefully made by the British geographer Doreen Massey. Furthermore, decision makers learn from the consequences of previous decisions. There is a continuous interplay between context and decision maker (or between structure and agency). Realists can explain why events have occurred—why a factory is located at a particular site—but not as examples of general laws of location. For them, explanation means accounting for specific events in context, relating how decision makers react to circumstances in order to meet imperatives within the constraints of their particular situations (what they know, what they believe their competitors will do, and how they manipulate that knowledge).",
  "Marxist-inspired approaches to understanding spatial arrangements covered a wide range of issues, many relating to inequalities in society. Access to various goods and services—e.g., housing and health care—is a function of class position, not only locally and regionally but also nationally and internationally. The geography of development, embracing not only wealth and income but also the quality of life and life chances, reflects a global economic system that varies at several levels.",
  "Marxism is more than a mode of analysis based on axioms regarding capitalist economic systems: it has an associated politics. Many geographers inspired by this approach in the context of the world situation in the 1960s and ’70s were attracted to the politics and adopted the term “radical geography.” Others accepted the power of Marxist-inspired analysis without also agreeing with the associated socialist agenda. From these twin positions, a more broadly based critical geography emerged that identified spatial problems of contemporary societies and their causes and promoted solutions, while at the same time meeting principles of social justice and ethical practice.",
  "This critical geography also drew on a second strand of work, which developed out of writings on gender and the growth of feminist scholarship. Feminist geographers contended that geography was a male-dominated discipline whose concerns reflected masculinist epistemologies. Women were subordinated and largely ignored in geography, and feminists pointed out the gender divisions and campaigned to remove bias against women. In spatial science, for example, they showed how patterns of accessibility discriminated against women in labour markets, demonstrating how space had been manipulated to promote male interests and in the process had become part of society’s definition of gender roles.",
  "Feminists also contended that gender is one of the multiple positions that individuals occupy within a society, rejecting the predominant class position at the core of Marxian analyses. From this foundation emerged wider concerns with identity and positionality, embracing not only gender divisions but also ethnic and national distinctions, as well as sexual orientation and other criteria on which individuals’ identities are based—such as the position of those in postcolonial societies. Thus, gender had to be subdivided to recognize the different positions (and politics) of white and black women, of women in societies with developed and developing economies, and in various religions. Appreciating those divisions—plus the many hybrid positions that emerge through, for example, the mixing of peoples in multiethnic cities—requires appreciating discrimination and difference. To many, this cannot be achieved by the abstract theorizing of either spatial science or Marxian analysis. It requires interpretative methodologies aimed at understanding through empathy, gained through a variety of qualitative research methods, such as participant observation, focus groups, in-depth interviewing, and the examination of archived resources. These enable access to not only how people interpret their place in the world and act accordingly but also to how they create worlds within which to act, at all spatial levels from the smallest (their individual bodies) outward.",
  "An example of such analyses is critical geopolitics. Political geography was a marginal subdiscipline for several decades after World War II, with geopolitical thinking disparaged because of its association with the work of geographers in 1930s Nazi Germany. Its revival involved regaining an appreciation of how influential political thinkers and politicians develop and propagate mental maps of the world as structures for action. These mental maps are created by key thinkers, adopted by politicians, and disseminated by various media. They form contexts for developing political strategies and determining tactics, to which the wider population’s attitudes are molded. The world of politics is a world of mental maps and of dominant views that underpin behaviour: we act in perceived worlds that intersect with, but are often more powerful than, real worlds, which are composed of physical phenomena.",
  "Such work came to be associated with another major development in the social sciences: postmodernism . This concept maintains that there are no absolute truths, so no grand theories can provide universal explanations and guides to action. Truths are the beliefs on which people act, and there are multiple truths of which none can claim primacy, although the value of competing truths in any context can be assessed ethically, according to local conceptions of right and wrong. People learn their truths from others—through either direct or indirect sources. Therefore, much learning takes place in contexts, and, since most people live relatively spatially constrained lives, those contexts are territorially defined. They are the places and areas within which people interact and learn—their homes and neighbourhoods, their schools and universities, their workplaces, and the formal organizations in which they participate—and that they create and maintain through local interactions.",
  "This appreciation of the role of context put the concept of place on centre stage in much human geographical research, displacing space from the primary position it occupied for several decades. It differs from the former regional tradition in which environmental features dominated. Places are defined more fluidly: they are made, remade, and dissolved by people; they may overlap, or they may be bounded and defended. Places occupy core positions in human existence and everyday lives. People learn attitudes and behaviour patterns in places where they interact with others and to which they ascribe meanings—a theme developed by humanistic geographers over several decades, as in books on topics such as Topophilia: A Study of Environmental Perceptions, Attitudes, and Values (1974), by Yi-fu Tuan. Their identities and their politics are associated with the nature of their places. As people learn and change themselves, so too do they change their environments. Furthermore, as critical geopolitics illustrates, such place making involves not only creating an identity for one’s home area but also separate identities for those of other areas. Geographers have been stimulated by Edward Said’s  Orientalism (1979), which portrays how Western societies created images of the East in opposition to themselves. These images, portrayed in literature and other media, are the basis for attitudes toward many non-Western cultures, presenting “the other” as not only different but also inferior and thus not deserving equal treatment and respect—as was exemplified in Derek Gregory’s seminal The Colonial Present: Afghanistan, Palestine, Iraq (2004).",
  "This revived interest in places is a feature of the third contemporary strand, with geographers engaged in the field of cultural studies, which encompasses scholars from the humanities and social sciences studying human action in context. Such work ranges over many aspects of behaviour, including the microscale of the individual body, and seeks to understand the meanings that underpin actions—many of which are never recorded during the processes of everyday life—and how communities and groups identify with places and spaces. The relationships between people and nature are also being reconsidered, breaking down artificial boundaries between these long-considered opposites. New approaches for interrogating actions are being explored: geography quite literally studies where events take place, and the impact of those events is reflected in places’ characters. Indeed, such is the contribution of geography to cultural studies that some identify a “spatial turn” within the humanities.",
  "There has also been an increasing stream of work on the interactions between human societies and physical environments—long a central concern for some geographers, as illustrated by Clarence Glacken’s magisterial treatment of Western interpretations of nature in Traces on the Rhodian Shore: Nature and Culture in Western Thought from Ancient Times to the End of the Eighteenth Century (1967). Human abuse and despoliation of the environment are important themes introduced in their modern context by a pioneering American conservationist, George Perkins Marsh , in Man and Nature (1864), but they were minor concerns among most geographers until the late 20th century.",
  "One significant example of work on the interaction of human society and nature was stimulated by Gilbert White, a geography graduate of the University of Chicago. White returned to Chicago in the 1950s to lead a major research program on floodplains and their management, assessing people’s views of the risks of floodplain use and evaluating the influence of flood insurance on their actions. From that foundation, White and his coworkers pioneered research into a wide range of environmental hazards and risk taking and the development of sustainable environmental management strategies, and they were also involved in government and international agency programs.",
  "When environmental concerns moved to centre stage politically and publicly in the 1970s, relatively few geographers were working on society-nature interrelationships; topics that they considered within their discipline’s purview were being commandeered by biologists, earth scientists, and sociologists, for example, and new subject areas such as environmental history. Over time, four main themes—environmental influences on human activities, the impact of humans on environmental processes, environmental conservation, and environmental management—formed a growing corpus of geographical work on environmental issues. One area of interest has been environmental attitudes and ideologies and environmental meanings and understandings within different societies. Others have studied environmental politics, environmentalism as a basis for political action, environmental policy making, policy assessment (as with environmental risk analyses), and the role and interpretation of environmental risks and hazards in human decision making.",
  "Some see the environmental focus as a means not only of establishing the relevance of geography to pressing public concerns but also of reintegrating physical and human geography. There has been some coming together but little close engagement between the two subdisciplines, largely because they define knowledge quite differently. The scientific foundations of modern physical geography sit uneasily with the qualitative and critical research methods of many human geographers. Nevertheless, interest in the society-nature nexus has increased and has given the discipline a clear identity within the sciences.",
  "The academic discipline of geography is extremely broad in subject matter and approaches; it contains specialists covering diverse subjects but sharing concerns over places, spaces, and environments. Indeed, the discipline is now fragmented into a substantial number of separate subcommunities among some of which there is relatively little contact. The Association of American Geographers has more than 50 separate specialty groups, for example, catering to its members’ particular interests. Some physical geographers have stronger links outside their discipline than within it. The International Geographical Union—based in Rome at the “Home of Geography,” provided by the Italian Geographical Society—has some two dozen commissions and about a dozen study groups.",
  "Given this diversity of interests, encapsulating the contemporary discipline in only a small number of categories is difficult. The main division continues to be between physical and human geography, each of which contains subdivisions and even sub-subdivisions.",
  "Since the reorientation after 1970 of physical geography to the study of systems of natural environmental processes, there have been major changes in both research and teaching. Much research now involves large, tightly focused collaborative programs of careful measurement, modeling, and analysis. It is much more demanding and expensive in resources than previously: equipping field expeditions and laboratories and learning related techniques necessarily generates specialization. This is facilitated and integrated by major international interdisciplinary programs, such as those associated with the United Nations Educational, Scientific, and Cultural Organization ( UNESCO ) and the European Union (EU), as well as national research councils and major government research bodies such as National Aeronautics and Space Administration (NASA). Typical of this shift has been the relative demise of the study of landforms. There are now two main research communities within geomorphology: those who study contemporary processes and those who investigate environmental change and landscape evolution since the beginning of the Quaternary Period (about 2.6 million years ago).",
  "  The importance of water in erosion plus the transport and deposition of sedimentary materials is reflected by work in geographical hydrology. This relative emphasis on water in contemporary physical geography undoubtedly indicates the concentration of English-speaking geographers working in temperate latitudes. There is also substantial work in glaciology, reflecting ice’s role in creating many current temperate environments, as well as—especially in the case of polar ice—in contemporary climatic change. Similarly, much work is being done on dryland areas, a consequence of political as well as intellectual interest in desertification and land degradation.",
  "Other areas of the natural environment attract less attention. There are few large research teams in biogeography. Remotely sensed data are used to map land cover, however, to estimate biomass and model ecosystems for work on biodiversity and the carbon cycle, and to chart disturbances generated both naturally and by human-induced events (e.g., bushfires). The geography of soils is only a minor field of study, with some work on erosion and reclamation. Advances in climatology involve extremely large-scale computer modeling from global to local focus, based on understanding atmospheric physics and meteorology; relatively little of this involves geographers, whose main contributions concern physical, synoptic, and applied climatology and climatic impacts (i.e., on agriculture). These three subdisciplines remain part of many geography degree programs, however; indeed, geography departments offer more introductory work on various aspects of the environment, at all scales, than do most other sciences.",
  "  Physical geography now concentrates on the Earth’s surface processes, therefore, involving field and laboratory investigations of contemporary processes and the reconstruction of past environments, especially the relatively recent past (which includes collaboration with archaeologists). These are integrated in research programs into past, contemporary, and future environmental changes. Concern about global warming and climate change, sea-level changes, extreme environmental events, and the loss of biodiversity stimulated modeling of environmental systems involving the interactions among the Earth’s hydrological, ecological, and atmospheric components. Building large models of these systems and their complex interrelationships involves teams seeking not only to understand their operations but also to predict environmental futures as bases for public policy making at global, international, national, and local scales. Research reconstructing past environments puts current processes and changes into longer-term perspective.",
  "The methods employed by physical geographers are those of environmental scientists more generally; knowledge of relevant work in physics, chemistry, biology, and mathematics is necessary, and applications increasingly involve working with engineers. Geographers have developed particular areas of expertise within environmental science, as with the analysis of remotely sensed data. Processing the massive databases produced daily involves major geocomputation expertise to address these questions: What is where? How much is there? What condition is it in?",
  "Since 1945 human geography has contained five main divisions. The first four—economic, social, cultural, and political—reflect both the main areas of contemporary life and the social science disciplines with which geographers interact (i.e., economics , sociology , anthropology , and political science and international relations , respectively); the fifth is historical geography . All five have remained central, being joined in the mid- to late 20th century by concentrations on particular types of areas, notably urban. Research interests in specific regions have declined, and relatively few geographers now identify themselves as experts on a particular part of the world.",
  "Economic geography has a long pedigree. Its traditional focus has been the distribution of various productive activities—with subdivisions into, for example, the geography of agriculture, industrial geography, and the geography of services—and patterns of trade such as transport geography. Such concentrations were strengthened by the move into spatial analysis. Relatively little work in that mold is now undertaken, however, and the models of idealized economic landscapes that dominated in the 1960s and ’70s are now rarely deployed or taught. Part of the change reflects economic shifts, notably the extension of globalization . Transport costs have decreasing significance for many location decisions, relative to labour and other costs. Instead, the decision making of transnational corporations dominates the changing global pattern of activity, reflecting a wide range of political as well as economic concerns regarding the profitability of investing in different countries and regions. Much contemporary work studies company locational decision-making processes, the regulatory regimes of individual states (including policies designed to attract and retain investment), and their impact on the pattern of economic activity.",
  "Economic and cultural worlds are closely intertwined. Many individual economic decisions in advanced industrial countries—e.g., what to buy, where to eat, and where to take vacations—reflect not needs but rather culturally induced preferences, which change rapidly, in part responding to advertising and media discussions of tastes and fashions. To some commentators, this generates a significant shift in the major features of capitalist production and consumption. It is moving away from mass products manufactured on large assembly lines toward myriad small niche markets with factories having relatively short production lines and rapid changes in the details of their products. Economic geographers investigate how markets for goods and services are culturally created and changed and the implications for both where production occurs and where jobs are created and destroyed.",
  "  Political geography also has a considerable pedigree, although it attracted little attention during the mid-20th century. Its main concerns are with the state and its territory—with states’ external relations and the relationships between governments and citizens. The geography of conflict incorporates both local conflicts, over such matters as land use and environmental issues, and international conflicts, including the growth of nationalism and the creation of new states. Electoral geography is a small subfield, concerned with voting patterns and the translation of votes into legislative seats through the deployment of territorially defined electoral districts.",
  "Social geography concentrates on divisions within society, initially class, ethnicity, and, to a lesser extent, religion; however, more recently others have been added, such as gender, sexual orientation, and age. Mapping where different groups are concentrated is a common activity, especially within urban areas, as is investigating the related inequalities and conflicts. Such mappings are complemented by more-detailed studies of the role of place and space in social behaviour—as with studies of the geography of crime and of educational provision—and in how mental representations of those geographies are created and transmitted.",
  " E. coli E. coli  Other subdisciplines associated with social geography are sometimes seen as separate. Population geography is largely concerned with the three main demographic characteristics of fertility, mortality, and migration; investigations using census and other data are complemented by detailed case studies of decision making, such as whether and where to migrate and how relevant information is received and processed. Medical geography focuses on patterns of disease and death—of how diseases spread, for example, and how variations in morbidity and mortality rates reflect local environments—and on geographies of health care provision.",
  "In its original manifestations, cultural geography had close links with anthropology, especially in the work of Sauer’s Berkeley school. This has been superseded by a wider appreciation of the interrelationships among people and societies as well as between people and their environments. Cultures are sets of beliefs transmitted in various ways. Many involve texts, not only written but also visual and constructed (e.g., works of art and architecture) and aural (e.g., soundscapes); some may never be recorded but are transitory moments in people’s movements and expressions. Interpreting them involves deconstructing what people say and do, activities that bring geographers into contact with the humanities as well as the social sciences in developing appreciations of meanings in texts and actions, including the landscapes and townscapes—large and small, personal and intimate, as well as grand and public—created in the process.",
  "Places are central to this diverse range of contemporary work, especially in the study of cultural change, which involves mixing people from different backgrounds and areas as they move through space. Cultures are fluid and continually renegotiated, as are the spaces they create and occupy. Many negotiations involve conflict and the exercise of power—for example, the imperial strategies in the construction of 19th- and 20th-century worlds and postcolonial responses to others’ worldviews imposed on them.",
  "  One of the most popular fields of study from the 1960s to the ’80s was urban geography, under the banner of which much pioneering work in the locational analysis approach was conducted. Cities and towns were field laboratories for testing models of least-cost decision making. When those models were dismissed as oversimplifying complex realities and the search for spatial laws about cities declined, interest turned to contemporary concerns regarding urban areas and life. Cities are major globalization nodes, economic power being centralized in a small number of world cities ( London , New York City , and Tokyo are usually placed at the top of city hierarchies).",
  "Given that the majority of people in the industrialized world live in cities, it is not surprising that urban geography has received much more attention than rural geography. Relatively little work was done on aspects of rural areas other than agriculture before the 1970s, just when, according to some, much of the particularity of rural areas was disappearing as many features of urban society were reaching into the countryside. To others, however, issues unique to rural, low-density areas call for a separate rural geography; although typical urban problems such as poverty, homelessness, social exclusion, and access to public facilities are also characteristic of rural low-density areas, particular issues there include the society-nature relationships, common images of the “rural,” and the role of tourism in reinvigorating rural economies.",
  "Historical geography has retained its identity and distinction, although historical geographers have not distanced themselves from changes elsewhere in the discipline, with which their focus on interpreting the past from available evidence resonates. The developments in locational analysis stimulated some new ways to study available data. For others, the later developments, especially in cultural geography, coincided with their deployment of a wide range of nonquantitative sources to reconstruct the real and imagined, as well as the abstract (spatial analysis), worlds of the past; issues of postcolonialism have attracted the attention of historical geographers as well as those interested in current cultural issues. Detailed analyses of particular places and times are complemented by major syntheses—such as Donald Meinig’s four-volume The Shaping of America: A Geographical Perspective on 500 Years of History (1986–2002).",
  "A great range of sources is now used in such endeavours, not only maps but also, for example, travelers’ writings about worlds they have encountered. Within this enterprise is a rejuvenated interest in the history of geography itself, not merely as a means of better appreciating where the discipline has come from but also of illustrating the importance of place and context in its evolution; geography, like so much else, is a range of practices that emerged and evolved in response to local stimuli. Geographers have produced particular forms of knowledge that have been significantly influenced by how people have encountered the world.",
  "Historical geographers have long investigated landscape change. Their work now informs investigations of global environmental changes as well as illustrating past human-induced environmental modifications. Other research evaluates contemporary environmental changes and their implications not only for environmental futures but also for individual life chances.",
  "Such studies occupy the intersection of physical and human geography, although relatively little work involves collaboration among human and physical geographers. For the latter, it involves incorporating human-induced changes to models of environmental processes and systems. Human geographers’ concerns range widely, from pragmatically applied work on environmental policy and management through political ecology to explorations of culture-nature interrelations.",
  "Changes in what a discipline studies are closely interwoven with changes in how its research is undertaken. Some substantive changes have been technologically driven: without new facilities, advances would not have been possible, perhaps not conceivable. In others, technical developments were responses to the research questions.",
  "Physical geography has experienced two parallel sets of methodological changes since 1970. The first involved closer alliances with other scientific disciplines, engaging with the physical, chemical, and biological bases for understanding physical matter and processes together with the mathematical methods necessary for their analysis. The second involved technical developments in field and laboratory measurement and data analysis. These two have come to pervade all work in physical geography, which has become technically sophisticated and whose progress has depended almost entirely on such skills.",
  "Virtually all work in physical geography shares a belief in what is known as the “real” world—that which can be observed, measured, and generalized upon, even if the appreciation of particular events and landforms requires setting general principles within particular contexts. The laws of physics can be used to generalize about atmospheric processes, for example, but only an appreciation of how they interact in specific, local circumstances can account for the weather at a place on a given day. Immanent laws operate in local, contingent circumstances, involving highly complex interactions whose analysis requires sophisticated mathematical skills in analyzing nonlinear, often chaotic, relationships.",
  "A much wider range of approaches is deployed within human geography; different theories of knowledge and reality inspire different types of work. The tenets of positivism still underpin some work in many areas: there is order in the world that can be observed, measured, analyzed, and generalized, even if there are no general laws of human behaviour awaiting discovery. Other work is based on theories of knowledge that claim an inseparability of observer and observed (or subject and object) and dispute the existence of real worlds independent of their inhabitants’ imagined worlds. We cannot apprehend an external world but only perceived worlds. Geographical research based on these premises deploys means of identifying those worlds, the processes involved in their creation, and the behaviour within them. It then has to transmit that derived understanding to others—what is sometimes termed a “double hermeneutic.”",
  "These various approaches pervade most of contemporary human geography. With the exception of cultural geography, quantitative methods are used to analyze and identify regularities in data sets large and small, taking advantage of technical advances, such as with methods of artificial intelligence for classifying individuals and areas.",
  "Nonquantitative approaches can be found throughout the various subdisciplines. These involve obtaining information in rigorous ways from individuals regarding their mental maps of the world and how these underpin behaviour. Means of interviewing individuals and groups to elicit information dominate the qualitative procedures that involve interpersonal interaction. Research material is also sought in a variety of other ways, through, for example, participant observation in case studies of communities and events. But information gathering extends well beyond interacting, directly or indirectly, with living people. Learning about the roles of places, spaces, and environments in the lives of individuals, groups, communities, and even entire societies near as well as far and past as well as present involves interrogating many information sources. Most common are written texts, analyzed for the meanings they can reveal. Other documents, such as maps, also reveal much, as do works of art. Ways of deconstructing meanings are commonly used in cultural and historical geography and in other subdisciplines too, as with the meanings attached to exotic foods in economic geography.",
  "Research involves not only observing, recording, and analyzing the world but also transmitting acquired understandings and explanations to others. In quantitative analyses, this involves using mathematical notation and procedures—a language that many claim is unambiguous but whose use nearly always involves interpretation in vernacular languages, with meanings often contested. In qualitative work, nearly all of the reporting is done through the medium of written language. Having studied texts to reach understandings, researchers then deploy the same media to present them to others and thereby place their readers in the same situation of having to derive meanings from the textual material. The research process thus involves continued interpretation and reinterpretation of textual and other materials, including research reports. Unlike the apparently incontestable clear statements of quantitatively expressed research findings, research in much contemporary human geography involves continued debate over meanings and interpretations.",
  "One tool long considered central to geographical work is the map. Automation of map production has been accompanied by a decline of research in this area; one of the few continuing fields concerns map legibility—the degree to which different symbols and shading succeed in transmitting messages. Its replacement as a central tool is GIS, a visualization medium with massive capacity for facilitating a wide range of research investigations. It offers not only sophisticated procedures for manipulating spatial data but also new ways of presenting visual data, including three-dimensional images of the world, at all scales. Geographic information science incorporates the traditional disciplines of cartography, geodesy, and photogrammetry with modern developments in remote sensing, the Global Positioning System ( GPS ), geostatistics, and geocomputation in activities that bring forward geographers’ eternal interest in maps as sophisticated means of representing, analyzing, and viewing the Earth’s great diversity.",
  "One area that some have set apart from the various subdisciplinary divisions concerns the application of geographical scholarship. Geography was always applied, long before it became an identified academic discipline; much geographical knowledge was created for specific purposes. Since the discipline was established, individuals have used their knowledge in a wide range of contexts and for various types of clients. Outside of universities, some of those trained as geographers have applied their skills in a range of sectors; the U.S. State Department had an Office of the Geographer for much of the 20th century, for example, providing the president with daily briefings.",
  "For the first half of the 20th century, the development of geography as an academic discipline was closely associated with its educational role, especially in the preparation of teachers and of teaching materials. Increasingly, however, geographers responded to societal changes—especially the extending role of the state—by promoting their discipline as a potential contributor in a range of activities. Some, like L. Dudley Stamp, argued that geographers’ factual knowledge regarding environments and places plus their understanding of spatial organization principles should be applied in town, city, country, and regional planning. This could just involve information provision, but increasingly it was argued that geographical analyses could inform the understanding of current patterns and trends and the preparation of plans for the future.",
  "Such geographical involvement expanded in the late 20th century as pressures grew on universities to orient their work more to societal needs and to undertake applied research for public- and private-sector sponsors. Within human geography, for example, the locational analysis paradigm was adapted to commercial applications. Models of least-cost (and hence economically most efficient) location were used to predict the best sites for facilities, such as supermarkets and hospitals. Classifications of residential areas within cities were adapted to identify districts dominated by people with particular lifestyles toward which niche-market advertising could be directed; this substantial activity is widely termed geodemographics. Qualitative research findings and methods have been deployed in resolving conflicts over proposed land uses at particular sites.",
  "Physical geographers’ understanding of environmental processes has been directed to applied ends to meet concerns over environmental issues; much public policy takes these issues into account when pursuing goals such as sustainable development. Four types of applied work have been identified: description and auditing of contemporary environmental conditions; identification and analysis of environmental impacts, mainly of human action, actual and proposed; evaluation of the value of particular environments for specified future uses; and prediction and design of environmental works.",
  "Some of these studies are relatively small-scale, such as tracing the diffusion of pollutants through water channels, identifying mineral deposits within local ecosystems, and monitoring local environmental changes and processes. Others involve larger-scale activities, such as models of climate change used to predict future ice-sheet melting, sea levels, and limits of cultivation of various plants. The scientific research may feed wider debates over policy formulation or may incorporate action plans—for conserving specific landscapes (such as wetlands or coasts) or managing a river catchment—as shown through the work of physical geographer William L. Graf, who chaired such interdisciplinary National Research Council studies as Strategies for America’s Watersheds (1999) and Dam Removal: Science and Decision-Making (2002).",
  "The study of geography has changed considerably since its 19th-century institutionalization as an academic discipline, but several basic metaphors have been constant foundations of its endeavours. The first is of the world as a mosaic of patterns and forms, a complex map of myriad small areas with particular characteristics reflecting the interaction of environmental conditions and human activities. Much geographical scholarship has involved mapping that mosaic in all its variety and detail and conveying the observed areal differentiation of the Earth’s surface to a wide audience. A second metaphor is of the world as a machine, comprising a large number of complexly interacting systems in which everything is both cause and effect; identifying and representing those systems is the basis for understanding cause and effect in environmental and human systems.",
  "A third metaphor presents the world as an organism, in which the whole is greater than the sum of the parts but which, in turn, comprises a large number of subsidiary organisms and local regions with similar characteristics. Researchers have identified these organic elements, places in which the concurrent presence of various phenomena creates something more than just the sum of their parts—hence the French notion of characteristic genres de vie for each pays . Associated with this is the world as a text metaphor, in which the landscape is among the texts interpreted to appreciate its creators’ intentions and cultures. Finally, and linked to the previous two, there is the metaphor of the world as an arena, with places as the contexts within which events occur: places are the contexts for learning and behaviour.",
  "These metaphors are not mutually exclusive, and combinations of one or more are common. They are the contexts—or worldviews—within which scholarship is undertaken. Their relative importance varies over time and space; geography is a wide range of related academic practices reflecting local conditions in which geographers (individually and collectively) respond to their contexts. There may be common features—concerns reflecting the key concepts of environment, space and place, for example, and concentration on particular metaphors—but also local emphases and absences. In pre-Soviet Russia, for example, physical geographers stressed climatic variations and their influences on soils rather than on landforms as was typical elsewhere, and during the Soviet era human geography was largely absent, with just a few economic concerns of relevance to national planning having been studied.",
  "Much international variation in geographical practices is set within the map of separate language realms. Each major national school has influenced the practice of geography in a number of others, some through their imperial projects. German and French influences have been strong in different parts of the Iberian world: in Latin America, German geographers influenced early development in Argentina, with a Catalan geographer having considerable influence in Venezuela and a Spaniard inaugurating developments in Panama. Japanese geography initially reflected German influences, in part refracted through American interpretations, especially at Berkeley; after 1945, physical and human geography were almost completely separated in Japan, with American influence dominating the latter. There has been growing concern internationally regarding the dominant role of English—and hence geographers in Anglophone countries—in the discipline’s discourse.",
  "Even within individual language realms, however, significant differences between the United Kingdom and the United States reflect important local contexts, despite many commonalities reflecting the substantial interchange across the Atlantic during the last half century. A major basis of those differences is geography’s role in their educational systems.",
  "The paucity of geographic education in schools in the United States was highlighted in the second half of the 20th century by the geographical ignorance of many Americans. Changing this situation was a cause taken up by several bodies. In the 1960s and ’70s the National Science Foundation funded programs to upgrade science teaching, which included the American Association of Geographers’ High School Geography Project. In the last decade of the 20th century, the National Geographic Society (internationally known for its National Geographic Magazine ) committed substantial resources to promote geography in the country’s schools, as well as launching a television channel to carry educational materials about human-environment interactions.",
  "These major differences between the two countries are reflected in the pattern of specialisms within geography departments. In the United States, for example, there has been an increasing awareness that students can be attracted to undergraduate geography courses that provide training in marketable skills. Many departments have identified GIS as an important skills package, and increasing numbers of faculty appointments are of GIS specialists. In the United Kingdom such pressures are less, and cultural geography is more important; indeed, it dominates human geography in some departments, with spatial analysis having only a minor place in the curriculum. Furthermore, because geography degree programs in Britain are built on much deeper foundations of geographical exposure, there is less pressure to cover a full range of subdisciplinary specialisms. In addition, given the importance of prescribed research excellence in the funding of universities there, the current tendency is to build up specialist research teams in certain areas only.",
  "There is thus a geography of geography as an academic discipline, as these national particularities are reproduced many times over. There are also differences within countries. Few departments (even the largest in the United Kingdom) cover the full range of the current subdisciplines in their teaching programs, for example, let alone in their research concentrations. Most specialize, reflecting the interests of senior staff at particular times in their development and institutional decisions on resource allocation. Thus, the practice of geography as an academic discipline itself reflects its own fundamental precepts. There are general features that apply to most geography programs but also particularities that reflect local characteristics and individual decision making. In geography, as in so much else, place matters.",
  "In many ways, geography as practiced today is unrecognizable from the academic discipline that was being created at the end of the 19th century. And yet the underlying basic concepts—of environments, spaces, and places—remain at the disciplinary core. Geography continues to illuminate major aspects of the human condition through people’s interactions with their natural and social milieux. The discipline was created to address issues of what is where and why. It still does just that.",
  "A general introduction to the discipline is provided by Alastair Bonnett , What Is Geography? (2007). An overview of the history of geography is Geoffrey J. Martin , All Possible Worlds: A History of Geographical Ideas , 4th ed. (2005). David N. Livingstone , The Geographical Tradition: Episodes in the History of a Contested Enterprise (1992), is a more analytical study. Collections covering the discipline in various countries include R.J. Johnston and P. Claval (eds.), Geography Since the Second World War: An International Survey (1984); and Gary S. Dunbar (ed.), Geography: Discipline, Profession, and Subject Since 1870: An International Survey (2001). Charles W.J. Withers , Placing the Enlightenment: Thinking Geographically About the Age of Reason (2007), covers the earlier, preprofessional era of geographical scholarship; of which useful bibliographies include O.F.G. Sitwell , Four Centuries of Special Geography (1993), a catalog of books for the period 1481–1887; and Lesley B. Cormack , Charting an Empire (1997), describing the geography collections at the Universities of Oxford and Cambridge.",
  "A good discussion of physical geography is K.J. Gregory , The Changing Nature of Physical Geography (2000); and, of human geography, R.J. Johnston and J.D. Sidaway , Geography and Geographers: Anglo-American Human Geography Since 1945 , 6th ed. (2004). In addition, R.J. Johnston et al. (eds.), The Dictionary of Human Geography , 4th ed. (2000); and David S.G. Thomas and Andrew Goudie (eds.), The Dictionary of Physical Geography , 3rd ed. (2000), provide comprehensive definitions and coverage, including substantial essays.",
  "Coverage of geography in the United States is given in Gary L. Gaile and Cort J. Willmott (eds.), Geography in America (1989), and in Geography in America at the Dawn of the 21st Century (2004), their centenary volume on the discipline there. A comparable volume for British geography is R.J. Johnston and Michael Williams (eds.), A Century of British Geography (2003). A set of essays with an alternative view of American geography is Ronald F. Abler , Melvin G. Marcus , and Judy M. Olson (eds.), Geography’s Inner Worlds: Pervasive Themes in Contemporary American Geography (1992).",
  "Collections of essays that provide overviews of various subdisciplines within human geography include Kay Anderson et al. (eds.), Handbook of Cultural Geography (2003); John Agnew , Katharyne Mitchell , and Gerard Toal (eds.), A Companion to Political Geography (2003); Kevin R. Cox , Murray Low , and Jenny Robinson (eds.), Handbook of Political Geography (2007); Gordon L. Clark , Maryann P. Feldman , and Meric S. Gertler (eds.), The Oxford Handbook of Economic Geography (2000); and Eric S. Sheppard and Trevor J. Barnes (eds.), A Companion to Economic Geography (2000). A series of short books also provides useful introductions: John Agnew , Making Political Geography (2002); Adrian Bailey , Making Population Geography (2005); Roderick P. Neumann , Making Political Ecology (2005); and Victoria A. Lawson , Making Development Geography (2007).",
  "The intersection of cultural and economic geography is covered in Roger Lee and Jane Wills (eds.), Geographies of Economies (1997); and globalization is treated in Peter Dicken , Global Shift: Mapping the Changing Contours of the World Economy , 5th ed. (2007). A useful study of urban geography is Blair Badcock , Making Sense of Cities (2002); and, of historical geography, is Robin A. Butlin , Historical Geography: Through the Gates of Space and Time (1993).",
  "The history of geomorphology is surveyed in Richard J. Chorley , Antony J. Dunn , and Robert P. Beckinsale , The History of the Study of Landforms , 3 vol. (1964–91); and, more briefly, in Barbara A. Kennedy , Inventing the Earth: Ideas on Landscape Development Since 1740 (2005). Bruce L. Rhoads and Colin E. Thorn (eds.), The Scientific Nature of Geomorphology (1996); and a symposium in the Annals of the Association of American Geographers , vol. 89, no. 4 (December 1999), survey the contemporary discipline’s philosophy; as does Robert Inkpen , Science, Philosophy, and Physical Geography (2005). Michael A. Summerfield , Global Geomorphology: An Introduction to the Study of Landforms (1991); Jonathan D. Phillips , Earth Surface Systems: Complexity, Order, and Scale (1999); J.J. Lowe and M.J.C. Walker , Reconstructing Quaternary Environments , 2nd ed. (1997); Martin J. Siegert , Ice Sheets and Late Quaternary Environmental Change (2001); and Rodger Grayson and Günter Blöschl (eds.), Spatial Patterns in Catchment Hydrology: Observations and Modelling (2001), are good introductions to geomorphology and its component parts.",
  "On human-environment interrelationships, the classic volumes are William L. Thomas et al. (eds.), Man’s Role in Changing the Face of the Earth (1956, reissued 1971); and B.L. Turner II et al. (eds.), The Earth as Transformed by Human Action (1990). Work by physical geographers is brought together in Olav Slaymaker (ed.), Geomorphology, Human Activity, and Global Environmental Change (2000); Olav Slaymaker and Tom Spencer , Physical Geography and Global Environmental Change (1998); Richard Huggett et al., Physical Geography: A Human Perspective (2004); and Andrew Goudie and Heather Viles , The Earth Transformed: An Introduction to Human Impacts on the Environment (1997). The classic text on human responses to the environment is T. O’Riordan , Environmentalism , 2nd rev. ed. (1981). Richard Huggett , Geographies of Nature: Societies, Environments, Ecologies (2007), provides a contemporary perspective on society-nature relations; as does Noel Castree , Nature (2005).",
  "Among introductory textbooks, H.J. de Blij and Peter O. Muller , Geography: Realms, Regions, and Concepts , 13th ed. (2008), is typical of the large number of regional geography texts used in North America; and Jerome D. Fellmann , Arthur Getis , and Judith Getis , Human Geography: Landscapes of Human Activities , 10th ed. (2008), pays greater attention to the spatial analysis approach. Terry G. Jordan-Bychkov and Mona Domosh , The Human Mosaic: A Thematic Introduction to Cultural Geography , 9th ed. (2003); and Philip W. Porter and Eric S. Sheppard , A World of Difference: Society, Nature, Development (1998), illustrate cultural and economic approaches. Peter Haggett , Geography: A Global Synthesis (2001), is a comparable book written from a British perspective. Two other examples of British introductory human geography textbooks are Paul Cloke , Philip Crang , and Mark Goodwin (eds.), Introducing Human Geographies , 2nd ed. (2005); and Peter Daniels et al. (ed.), An Introduction to Human Geography: Issues for the 21st Century , 2nd ed. (2005). Introductory textbooks on physical geography include Robert W. Christopherson , Geosystems: An Introduction to Physical Geography , 5th ed. (2003); and David Briggs et al., Fundamentals of the Physical Environment , 2nd ed. (1997).",
  "There are many textbooks on geographical methods, including Rob Kitchin and Nicholas J. Tate , Conducting Research in Human Geography: Theory, Methodology, and Practice (2000); Melanie Limb and Claire Dwyer , Qualitative Methodologies for Geographers: Issues and Debates (2001); A. Stewart Fotheringham , Chris Brunsdon , and Martin Charlton , Quantitative Geography: Perspectives on Spatial Data Analysis (2000); and Peter A. Rogerson , Statistical Methods for Geography , 2nd ed. (2006). Among those on physical geography are John P. Wilson and John C. Gallant (eds.), Terrain Analysis: Principles and Applications (2000); on Geographic Information Systems, Paul A. Longley et al. (eds.), Geographical Information Systems: Principles, Techniques, Applications, and Management , 2nd ed., 2 vol. (1999); and Paul A. Longley et al., Geographic Information Systems and Science , 2nd ed. (2005); and on remote sensing, Thomas M. Lillesand , Ralph W. Kiefer , and Jonathan W. Chapman , Remote Sensing and Image Interpretation , 6th ed. (2008); and Paul M. Mather , Computer Processing of Remotely Sensed Images: An Introduction , 3rd ed. (2004).",
  " National Research Council (U.S.), Rediscovering Geography Committee , Rediscovering Geography: New Relevance for Science and Society (1997), makes the case for geography’s role within the U.S. scientific community and institutions. Two British journals, Progress in Human Geography (bimonthly) and Progress in Physical Geography (bimonthly), provide annual progress reports on all of the major subdisciplines within geography; as does the online journal Geography Compass (bimonthly). Geography in schools and society is surveyed more widely in Eleanor Rawling , Changing the Subject: The Impact of National Policy on School Geography, 1980–2000 (2001); Susan Schulten , The Geographical Imagination in America, 1880–1950 (2001); and Rex Walford , Geography in British Schools, 1850–2000: Making a World of Difference (2001)."
]