[
  " scale , in music , any graduated sequence of notes , tones , or intervals dividing what is called an octave .",
  "The specific selection of different tones in any piece of music generally reveals a pattern of relationships among its pitches that can be expressed as a series of fixed distances (intervals) from one pitch to another within the span of an octave. The interval relationships among pitches of a scale are its essential feature, and a particular pattern of intervals defines every scale. Other aspects of pitch usage in music—such as range (distance from the highest pitch used to the lowest), emphasis placed on certain pitches, or the simultaneous (harmonic) and successive (melodic) occurrence of tones—do not alter the identity of the scale, although they may be essential in describing its function.",
  "Although the number of different scales that can be formulated is theoretically nearly infinite, particular scales tend to become conventionalized within any given culture or musical tradition. The scale of a single piece of music may therefore be characteristic of the tone system of a whole culture. In general, the simplest scales can be found in very old music and in the music of nonliterate cultures, while the most complex scales occur in the world’s most advanced cultures.",
  "Scales have proven to be important in the analysis of folk music and the music of nonliterate cultures, but scholars have been obliged to deduce the scales through a study of the actual music, since the creators of the music were not cognizant of scales as theoretical concepts. By contrast, music of the most highly developed cultures (variously described as classical music, art music, cultivated music, and high-culture music) is created in full awareness of rules or conventions pertaining to scale usage.",
  "In view of the wide range of possibilities, a surprisingly small number of scale types predominate throughout the world. The intervals found in non-Western music often approximate rather closely the basic whole-step and half-step intervals that are used in Western music. Variations from Western intervals are often expressed as measurements in cents (100 cents = one half step in equal temperament, the pattern of 12 equal half steps used in Western music). The task of identifying scales in non-Western music is complicated further by the occasional appearance of highly variable intervals or by singing techniques that produce sounds whose pitches cannot be specified accurately through conventional notation, like the “tumbling strains” (falling melodies) described by German musicologist Curt Sachs in the singing of Australian Aboriginal peoples .",
  "Although music performed only on one pitch does exist, the study of scales properly begins with the occurrence of at least two different pitches. Scales consisting of only one or two intervals (i.e., two or three pitches) can be found throughout the world in monophonic music (that consisting of a single unharmonized melodic line), though they are perhaps most numerous in Ceylon, eastern Siberia, California Indian cultures, and in regions near the Ural Mountains . Such scales commonly display a narrow range in which the pitches are separated by a half step, a whole step, or a minor third (one and one-half steps, as, C–E♭). Larger skips in two- and three-note scales do occur but are less frequent. Some simple scales have probably acquired additional pitches through a tendency to fill in large skips with intervening pitches. Another process by which scales may have expanded is the transposition within a single melody of one characteristic melodic motive (identifiable fragment) to a different pitch level, thus creating additional scale degrees.",
  "Occasionally, primitive melodies apparently generated by motivic transposition also contain evidence of emphasis on particular pitches. An example is a melody that has been arranged so that the pitches G and C are consistently reiterated.",
  "The melodic “weight” given to those two pitches could not have been achieved by the simple transposition of motives. Further, weighted scales may also give prominence to certain pitches by using them as range limits or by placing a particular pitch at the ends of sections or the end of a piece.",
  "Scales function somewhat differently in the art-music traditions of highly sophisticated cultures, since they are not only a means of description and analysis but are also pre-existent assumptions for the composer or performer. Within those cultures, knowledge of the characteristics and requirements of various scales is often perpetuated by written treatises on music theory as well as by oral communication from generation to generation. The existence of professional composers and performers also encourages continuity in musical knowledge, even though some cultures, like those of the Western world, advocate continuous change in musical practices within acceptable limits. Through gradual evolutionary processes, the nature of scales and their functions may change radically over a period of several centuries.",
  "Highly developed, complex systems governing the use of scales exist in a variety of cultures, principally in the Far East, India, Iran, the Muslim world, and the West. The differences in musical styles among those cultures are indeed great, yet there are some similarities in the manner in which scales function in each instance. Each culture has a number of basic scales (interval patterns), called grāma in India, dastgah in Iran, maqām in Muslim cultures. Generally, a basic scale is used to produce a number of different modes , or bases for melodic construction, in which the intervallic structure of the scale remains intact while primary and secondary melodic importance is attached to different pitch degrees. This hierarchy in which modes are generated by basic scale types consequently produces a greater number of modes than there are basic scales. The terms maqām and dastgah also are used to refer to such modes; the corresponding Indian term is jāti . In some art-music traditions the modes serve as the basis for an even larger number of specific melody types , which may again be elaborated further by improvisation in performance. In India the basic melodies are called rāgas ; in Iran they are gūsheh . Although Western art music has a system of scales and modes, the melody types are not used as systematically or as consciously as they are in some of the non-Western traditions.",
  "Pentatonic (five-note) scales are used more widely than any other scale formation. In fact, Western art music is one of the few traditions in which pentatonic scales do not predominate. Their frequency is especially notable in the Far East and in European folk music. The most common varieties of pentatonic scales use major seconds and minor thirds, with no half steps (anhemitonic). A representative type could be spelled C–D–E–G–A, for example. The pentatonic scale is so pervasive that melodies exhibiting tetratonic (four-note) scales often appear to be pentatonic with one pitch omitted. Hexatonic (six-note) scales appear rather rarely in folk music and nonliterate cultures. Examples that are known often seem to be fragments of the seven-note Western diatonic scale.",
  "Heptatonic scales are especially prominent in the world’s art-music traditions. The tone systems of India, Iran, and the West are entirely heptatonic, and seven-note scales are also present in the art music of some cultures that do not use such scales exclusively (e.g., the ritsu scale in Japan and the pelog scale in Java).",
  "With some exceptions in both the distant and the recent past, Western art music has been based largely on one heptatonic scale, known as the diatonic scale. The origins of this scale can be traced to ancient Greece, and it has been formulated to some extent according to acoustical principles. Since the octave in Western music is normally divided into 12 equal half steps, the characteristic intervals of the diatonic scale can be constructed upon any one of the 12 pitches. Such transpositions of the scale are known as keys .",
  "Before the 17th century, as many as 12 different mode permutations of the diatonic scale were in common use, but only two modes—now called major and minor—have been in general use during most of the past 300 years. The diatonic scale itself consists of five whole steps (W) and two half steps (H), with the half steps dividing the whole steps into groups of two or three. The major scale uses the sequence W–W–H–W–W–W–H, as shown in the first of the following examples, while the intervals in the minor scale are W–H–W–W–H–W–W, as in the second.",
  "In actual music the minor scale is usually altered in one of two ways to create greater emphasis on particular pitches. In the harmonic minor scale (the third example shown) the seventh note is raised one half step, and in the melodic minor scale (the fourth example) both the sixth and seventh notes are raised by one half step in ascending patterns while they are left unaltered in descending patterns (the fifth example).",
  " ",
  "In the 19th and 20th centuries, composers made increasing use of pitches lying outside the diatonic scale, and that tendency stimulated the development of a variety of novel scale systems as alternatives to the diatonic scale. Principles for composition within the chromatic scale (consisting of all of the 12 half steps within the octave) were first articulated by Austrian-born composer Arnold Schoenberg early in the 20th century. Other scales have also been employed on an experimental basis. The whole-tone scale (comprising six whole steps) was used prominently by French composer Claude Debussy and others, especially in France and England. Microtonal scales, requiring intervals smaller than the conventional half step, also appeared sporadically in the 20th century. Among microtonal structures, the most important, perhaps, have been scales calling for quarter tones (equal to half the distance of a half step).",
  "The word scale is sometimes used to describe musical passages consisting of a succession of consecutive scale degrees in ascending or descending patterns. It is also used to describe scalelike exercises that are practiced for the development of technical proficiency on a musical instrument . Scale can refer in rare instances to the ordering of some musical element other than pitch. An example is the term Klangfarbenmelodie , used in some music to denote a carefully arranged succession of different tone colours.",
  " Curt Sachs , The Wellsprings of Music , ed. by Jaap Kunst (1965), a systematic study of rudimentary scale types throughout the world and their evolution; Bruno Nettl , Music in Primitive Culture (1956), a concise and authoritative introduction to scale types and their geographical distribution; William P. Malm , Music Cultures of the Pacific, the Near East, and Asia (1967), lucid summaries of scale systems in non-Western art-music traditions; John L. Dunk , The Structure of the Musical Scale (1940), a thorough description of the diatonic scale; Antoine Auda , Les Gammes musicales (1947), a classic, comprehensive study of the history of scales in Western art music."
]