[
  " rhythm , in music , the placement of sounds in time. In its most general sense, rhythm (Greek rhythmos , derived from rhein , “to flow”) is an ordered alternation of contrasting elements. The notion of rhythm also occurs in other arts (e.g., poetry , painting , sculpture , and architecture ) as well as in nature (e.g., biological rhythms).",
  "Attempts to define rhythm in music have produced much disagreement, partly because rhythm has often been identified with one or more of its constituent, but not wholly separate, elements, such as accent, metre, and tempo. As in the closely related subjects of verse and metre, opinions differ widely, at least among poets and linguists, on the nature and movement of rhythm. Theories requiring “periodicity” as the sine qua non of rhythm are opposed by theories that include in it even nonrecurrent configurations of movement, as in prose or plainchant.",
  "Unlike a painting or a piece of sculpture, which are compositions in space, a musical work is a composition dependent upon time . Rhythm is music’s pattern in time. Whatever other elements a given piece of music may have (e.g., patterns in pitch or timbre ), rhythm is the one indispensable element of all music. Rhythm can exist without melody , as in the drumbeats of so-called primitive music, but melody cannot exist without rhythm. In music that has both harmony and melody, the rhythmic structure cannot be separated from them. Plato’s observation that rhythm is “an order of movement” provides a convenient analytical starting point.",
  "The unit division of musical time is called a beat . Just as one is aware of the body’s steady pulse , or heartbeat, so in composing, performing, or listening to music one is aware of a periodic succession of beats.",
  "The pace of the fundamental beat is called tempo (Italian: “time”). The expressions slow tempo and quick tempo suggest the existence of a tempo that is neither slow nor fast but rather “moderate.” A moderate tempo is assumed to be that of a natural walking pace (76 to 80 paces per minute) or of a heartbeat (72 per minute). The tempo of a piece of music indicated by a composer is, however, neither absolute nor final. In performance it is likely to vary according to the performer’s interpretative ideas or to such considerations as the size and reverberation of the hall, the size of the ensemble, and, to a lesser extent, the sonority of the instruments. A change within such limits does not affect the rhythmic structure of a work.",
  "The tempo of a work is never inflexibly mathematical. It is impossible to adhere in a musical manner to the metronomic beat for any length of time. In a loosely knit passage a tautening of tempo may be required; in a crowded passage a slackening may be needed. Such modifications of tempo, known as tempo rubato —i.e., “robbed time”—are part of the music’s character. Rubato needs the framework of an inflexible beat from which it can depart and to which it must return.",
  "The mind apparently seeks some organizing principle in the perception of music, and if a grouping of sounds is not objectively present it imposes one of its own. Experiments show that the mind instinctively groups regular and identical sounds into twos and threes, stressing every second or third beat, and thus creates from an otherwise monotonous series a succession of strong and weak beats.",
  "In music such grouping is achieved by actual stress—i.e., by periodically making one note stronger than the others. When the stress occurs at regular intervals, the beats fall into natural time measures. Although in European music the concept of time measures reaches back to a remote age, only since the 15th century have they been indicated by means of bar lines. Thus, the terms measure and bar are often used interchangeably.",
  "The time measure is indicated at the opening of a piece by a time signature —e.g.,  2  4  ,  4  8  ,  3  4  ,  6  8  . The length of each beat in a measure may be a time unit of short or long duration:   ",
  "The signature  4  1  (above) means that the whole note (1) is the unit in each measure, and there are four (4) of them to each measure. In the second illustration,  4  2  , the half note (2) is the unit of measurement, with four of them (4) to each measure, and so on.",
  "The two basic types of time measure have either two or three beats and admit of many different notations.   ",
  "“Four time,” or “common time,” is really a species of duple time allied to “two time,” as it can hardly be thought of without a subsidiary stress at the half measure—i.e., on the third beat—thus:   ",
  "Duple, triple, and quadruple time measures—i.e., those in which there are two, three, and four beats to a measure—are known as simple time. The division of each of the component beats into three produces compound time:   ",
  "More-complex times, such as the quintuple,  5  4  , usually fall into groups of 3 + 2, as in “Mars” from Gustav Holst ’s suite The Planets and in the second movement of Tchaikovsky ’s Sixth Symphony . Rimsky-Korsakov , in Sadko , and Stravinsky , in Le Sacre du printemps , use 11 as a unit. Ravel ’s piano trio opens with a signature of  8  8  with the internal organization 3 + 2 + 3. Folk song and folk dance, particularly from eastern Europe, influenced the use of asymmetrical time measures, as in the “Bulgarian Rhythm” pieces in  7  8  and  5  8  in Bartók ’s Mikrokosmos .",
  " The combinations of long (—) and short ([breve]) syllables are known in prosody as feet. The system of notating the musical equivalents of feet derives from the application of prosody to music. The foundations for European music were laid in ancient Greece, where classical music and poetry were regarded as parts of a single art. These principles were adopted by the Romans and were transmitted, by way of Latin poetry, to medieval Europe. The feet of classical poetry and their equivalents in music are shown in the Table . And in late antiquity St. Augustine (354–430), in De musica , added more.",
  " Until the 12th century, church music was virtually limited to unadorned plainchant. The early composers found that polyphony required a rhythmical organization to keep the parts together, so rhythmic metre was adopted ( see  Table ). Compared with a hypothetical flow of beats equal in stress, metre adds significance to what was merely a forward flow in time—though the continuation of a metrical pattern may itself become monotonous. Thus, metre, though “rhythmic” by comparison with pulse, is not the whole of rhythm. The 13th-century musicians often varied the rhythmic modes by combining several of them simultaneously in different parts of polyphonic composition.",
  "Theoretically, metre appears to be without stress accent, and certainly much polyphonic music of a later period, such as the masses of Giovanni Pierluigi da Palestrina , has an almost stressless flow. Yet these works reveal a subtle rhythmical organization. At a later period metre and time measure cannot be wholly separated. In their “purest” forms they may be extremes, but in music predominantly of one type, the other element is rarely wholly absent, though on an instrument such as the organ, actual dynamic stress is impossible. After all, metres like the spondee, ♩♩, and the dispondee, ♩♩♩♩, need an accent on the first beat to keep their identity. Notwithstanding the opposite tendencies of metrical organization and stress accent, however, some metre is obviously subject to stress, so that metre and time measure become very closely linked, as in the scherzo of Beethoven ’s Ninth Symphony , where a measure has a strong first beat and at the same time follows a metre.",
  "In broad terms, the time framework of music is composed of tempo, time measure, metre, and period; and its rhythmical life hangs on rubato, musical motif (which may already include cross accent), and metrical variation, as well as on asymmetry and balance of phrase. Whereas the former are more or less measured and rational, the latter are organically inspired and numerically irrational—the very life of the music.",
  "Rhythm is, therefore, not any one of these rational or formal features, nor is it composed solely of a combination of these factors. Yet rhythm requires the background of a rational framework in order that it may be fully perceived, but this framework need not embrace all the rational factors described above.",
  "Thus, plainchant, as it is known in modern times, makes no use at all of measure or of regular metre but is supremely rhythmical in conception; its “free” rhythms are felt. Whereas so much music has for its framework a regular repetition of underlying accent, whether stress or durational, the framework of plainchant is irregular. Its rhythm belongs to the Latin tongue and springs from the correct accentuation of the text and the dynamic quality inherent in the word grouping.",
  "Thus far, music’s structure in time has been examined separately from its structure in tone, but no such separation is really possible. Melody and rhythm are intimately connected. Moreover, various styles of music tend to standardize their melodic cadences and, with them, their time divisions (e.g., Mozart ’s melodic rhythm is much more regular than Prokofiev ’s).",
  "In music employing harmony, the rhythmic structure is inseparable from harmonic considerations. The time pattern controlling the change of harmonies is called harmonic rhythm. In 17th- and 18th-century music, harmony tends to limit rhythmic subtleties and flexibility of the melodic elements (as well as determining the basic type of melody) in regard to stress accents. It is, therefore, no accident that the polyphonic music of Indonesia and Southeast Asia, like much European music, exhibits certain four-square melodic tendencies. By contrast, the music of India and the Perso-Arab world employs a melody instrument or voice performing in a given metre offset by a drum playing cross rhythms or (in the Arab world) a quite different metre. With no harmony (except a drone) to impede its flow, the rhythm can reach a structure of great subtlety and complexity.",
  "In European music the great variety of styles derives its relation to melody from different concepts of rhythm. They include the strict rhythmic modes of the 13th century, the free oratorical speech-rhythms of the Renaissance , the almost stressless flow of Renaissance polyphony, the strong body rhythms of the Baroque , the freedom of the late Romantics, and the primitivistic rhythms of the 20th century with composite and ever-changing time signatures.",
  "Thus, study of musical history shows a varying attitude toward rhythm, sometimes closer to strict rule, sometimes to “freedom,” as the temper of the times and the relative influence of poetry, dance, and folk music decree. Plato’s definition of rhythm as “an order of movement” might, therefore, be expanded. As a determining factor in the vitality of music, rhythm may be described as “an inspired organic order of movement” communicating intelligibly to the senses. From the analytical viewpoint, it operates in the rational framework described, which it varies in terms of rubato, motif, and so on. Ultimately, rhythm is the organic process of music in time; it is music’s direction in time. The quality of rhythm is the quality of life; however vitally composers conceive their music, they must depend upon performers to recreate it rhythmically.",
  "Various aspects of rhythm are discussed in Peter Hampton Phillips , The Rhythm Book: Studies in Rhythmic Reading and Principles (1995); William Rothstein , Phrase Rhythm in Tonal Music (1989); and Jason Martineau , The Elements of Music: Melody, Rhythm, & Harmony (2008).",
  " Curt Sachs , Rhythm and Tempo (1953), the most comprehensive work on rhythm in music, ranges over many non-Western cultures as well as over the successive periods of Western musical history. Detailed rhythmical analyses of Western music since the 17th century appear in Grosvenor W. Cooper and Leonard B. Meyer , The Rhythmic Structure of Music (1960). Studies of special periods are available in Charles F. Abdy Williams , The Aristoxenian Theory of Musical Rhythm (1911); W.F. Jackson Knight , St. Augustine’s De Musica: A Synopsis (1949); William G. Waite , The Rhythm of Twelfth-Century Polyphony, Its Theory and Practice (1954); Philip F. Radcliffe , “The Relation of Rhythm and Tonality in the Sixteenth Century,” Proceedings of the Musical Association , 57:73–97 (1931); and Henry D. Cowell , New Musical Resources (1930, reprinted 1969). Particular applications of rhythm have been studied in Charles F. Abdy Williams , The Rhythm of Song (1925); and William Thomson , The Rhythm of Speech (1923). Aesthetic aspects are considered in Margaret Glyn , The Rhythmic Conception of Music (1907); and Mathis Lussy , Le Rythme musical , 3rd ed. rev. (1897; abridged Eng. trans., A Short Treatise on Musical Rhythm , 1909). Émile Jaques-Dalcroze , Le Rythme, la musique et l’éducation (1920; Eng. trans., Rhythm, Music and Education , 1921), is the pioneer work in its aspect of the field; musical rhythm has been put in wider perspective by Elsie Fogerty , Rhythm (1937)."
]