[
  "  Mars , fourth planet in the solar system in order of distance from the Sun and seventh in size and mass. It is a periodically conspicuous reddish object in the night sky. Mars is designated by the symbol ♂.",
  "Sometimes called the Red Planet, Mars has long been associated with warfare and slaughter. It is named for the Roman god of war. As long as 3,000 years ago, Babylonian astronomer-astrologers called the planet Nergal for their god of death and pestilence. The planet’s two moons, Phobos (Greek: “Fear”) and Deimos (“Terror”), were named for two of the sons of Ares and Aphrodite (the counterparts of Mars and Venus , respectively, in Greek mythology ).",
  "In recent times Mars has intrigued people for more-substantial reasons than its baleful appearance. The planet is the second closest to Earth , after Venus , and it is usually easy to observe in the night sky because its orbit lies outside Earth’s. It is also the only planet whose solid surface and atmospheric phenomena can be seen in telescopes from Earth. Centuries of assiduous studies by earthbound observers, extended by spacecraft observations since the 1960s, have revealed that Mars is similar to Earth in many ways. Like Earth, Mars has clouds , winds , a roughly 24-hour day, seasonal weather patterns, polar ice caps, volcanoes , canyons , and other familiar features. There are intriguing clues that billions of years ago Mars was even more Earth-like than today, with a denser, warmer atmosphere and much more water — rivers , lakes , flood channels, and perhaps oceans . By all indications Mars is now a sterile frozen desert. However, close-up images of dark streaks on the slopes of some craters during Martian spring and summer suggest that at least small amounts of water may flow seasonally on the planet’s surface, and radar reflections from a possible lake under the south polar cap suggest that water may still exist as a liquid in protected areas below the surface. The presence of water on Mars is considered a critical issue because life as it is presently understood cannot exist without water. If microscopic life-forms ever did originate on Mars, there remains a chance, albeit a remote one, that they may yet survive in these hidden watery niches. In 1996 a team of scientists reported what they concluded to be evidence for ancient microbial life in a piece of meteorite that had come from Mars, but most scientists have disputed their interpretation.",
  "Since at least the end of the 19th century, Mars has been considered the most hospitable place in the solar system beyond Earth both for indigenous life and for human exploration and habitation. At that time, speculation was rife that the so-called canals of Mars —complex systems of long, straight surface lines that very few astronomers had claimed to see in telescopic observations—were the creations of intelligent beings. Seasonal changes in the planet’s appearance, attributed to the spread and retreat of vegetation, added further to the purported evidence for biological activity. Although the canals later proved to be illusory and the seasonal changes geologic rather than biological, scientific and public interest in the possibility of Martian life and in exploration of the planet has not faded.",
  "During the past century Mars has taken on a special place in popular culture. It has served as inspiration for generations of fiction writers from H.G. Wells and Edgar Rice Burroughs in the heyday of the Martian canals to Ray Bradbury in the 1950s and Kim Stanley Robinson in the ’90s. Mars has also been a central theme in radio, television, and film, perhaps the most notorious case being Orson Welles ’s radio-play production of H.G. Wells’s novel War of the Worlds , which convinced thousands of unwitting listeners on the evening of October 30, 1938, that beings from Mars were invading Earth. The planet’s mystique and many real mysteries remain a stimulus to both scientific inquiry and human imagination to this day.",
  "    Mars is the fourth planet out from the Sun . It moves around the Sun at a mean distance of 228 million km (140 million miles), or about 1.5 times the distance of Earth from the Sun. Because of Mars’s relatively elongated orbit , the distance between Mars and the Sun varies from 206.6 million to 249.2 million km (128.4 million to 154.8 million miles). Mars orbits the Sun once in 687 Earth days, which means that its year is nearly twice as long as Earth’s. At its closest approach, Mars is less than 56 million km (35 million miles) from Earth, but it recedes to almost 400 million km (250 million miles) when the two planets are on opposite sides of the solar system.",
  "Mars is easiest to observe when it and the Sun are in opposite directions in the sky—i.e., at opposition —because it is then high in the sky and shows a fully lighted face. Successive oppositions occur about every 26 months. Oppositions can take place at different points in the Martian orbit. Those best for viewing occur when the planet is closest to the Sun, and so also to Earth, because Mars is then at its brightest and largest. Close oppositions occur roughly every 15 years.",
  "  Mars spins on its axis once every 24 hours 37 minutes, making a day on Mars only a little longer than an Earth day. Its axis of rotation is inclined to its orbital plane by about 25°, and, as for Earth, the tilt gives rise to seasons on Mars. The Martian year consists of 668.6 Martian solar days, called sols. Because of the elliptical orbit, southern summers are shorter (154 Martian days) and warmer than those in the north (178 Martian days). The situation is slowly changing, however, such that 25,000 years from now the northern summers will be the shorter and warmer ones. In addition, the obliquity, or tilt, of the axis is slowly changing on a roughly one-million-year timescale. During the present epochs the obliquity may range from close to zero, at which times Mars has no seasons, to as high as 45°, when seasonal differences are extreme. Over hundred-million-year timescales the obliquity may reach values as high as 80°.",
  "Mars is a small planet, larger than only Mercury and slightly more than half the size of Earth. It has an equatorial radius of 3,396 km (2,110 miles) and a mean polar radius of 3,379 km (2,100 miles). The mass of Mars is only one-tenth the terrestrial value, and its gravitational acceleration of 3.72 metres (12.2 feet) per second per second at the surface means that objects on Mars weigh a little more than a third of their weight on Earth’s surface. Mars has only 28 percent of the surface area of Earth, but, because more than two-thirds of Earth is covered by water, the land areas of the two planets are comparable. For additional orbital and physical data, see the .",
  "Mars was an enigma to ancient astronomers, who were bewildered by its apparently capricious motion across the sky—sometimes in the same direction as the Sun and other celestial objects (direct, or prograde, motion), sometimes in the opposite direction ( retrograde motion ). In 1609 the German astronomer Johannes Kepler used the superior naked-eye observations of the planet by his Danish colleague Tycho Brahe to empirically deduce its laws of motion and so pave the way for the modern gravitational theory of the solar system. Kepler found that the orbit of Mars was an ellipse along which the planet moved with nonuniform but predictable motion. Earlier astronomers had based their theories on the older Ptolemaic idea of hierarchies of circular orbits and uniform motion.",
  "The earliest telescopic observations of Mars in which the disk of the planet was seen were those of the Italian astronomer Galileo in 1610. The Dutch scientist and mathematician Christiaan Huygens is credited with the first accurate drawings of surface markings. In 1659 Huygens made a drawing of Mars showing a major dark marking on the planet now known as Syrtis Major. The Martian polar caps were first noted by the Italian-born French astronomer Gian Domenico Cassini about 1666.",
  "Visual observers subsequently made many key discoveries. The rotation period of the planet was discovered by Huygens in 1659 and measured by Cassini in 1666 to be 24 hours 40 minutes—in error by only 3 minutes. The tenuous Martian atmosphere was first noted in the 1780s by the German-born British astronomer William Herschel , who also measured the tilt of the planet’s rotation axis and first discussed the seasons of Mars. In 1877 Asaph Hall of the U.S. Naval Observatory discovered that Mars has two natural satellites. Telescopic observations also documented many meteorological and seasonal phenomena that occur on Mars, such as various cloud types, the growing and shrinking of the polar caps, and seasonal changes in the colour and extent of the dark areas.",
  "The first known map of Mars was produced in 1830 by Wilhelm Beer and Johann Heinrich von Mädler of Germany. The Italian astronomer Giovanni Virginio Schiaparelli prepared the first modern astronomical map of Mars in 1877, which contained the basis of the system of nomenclature still in use today. The names on his map are in Latin and are formulated predominantly in terms of the ancient geography of the Mediterranean area. This map also showed, for the first time, indications of an interconnecting system of straight lines on the bright areas that he described as canali (Italian: “channels”). Schiaparelli is usually credited with their first description, but his fellow countryman Pietro Angelo Secchi developed the idea of canali in 1869. In the late 19th century the American astronomer Percival Lowell established an observatory in Flagstaff, Arizona, specifically to observe Mars, and he produced ever-more-elaborate maps of the Martian canals until his death in 1916.",
  "  To the Earth-based telescopic observer, the Martian surface outside the polar caps is characterized by red-ochre-coloured bright areas on which dark markings appear superimposed. In the past, the bright areas were referred to as deserts, and the majority of large dark areas were originally called maria (Latin: “oceans” or “seas”; singular mare ) in the belief that they were covered by expanses of water. No topography can be seen from Earth-based telescopes . What is observed are variations in the brightness of the surface or changes in the opacity of the atmosphere.",
  "The dark markings cover about one-third of the Martian surface, mostly in a band around the planet between latitudes 10° and 40° S. Their distribution is irregular, and their gross pattern has been observed to change over timescales of tens to hundreds of years. The northern hemisphere has only three such major features—Acidalia Planitia, Syrtis Major, and a dark collar around the pole—which were once considered to be shallow seas or vegetated regions. It is now known that many of Mars’s dark areas form and change as winds move dark sand around the surface or sweep areas free of bright dust. Many of the bright areas are regions of dust accumulation. The canals that figured so prominently on maps made from telescopic observations around the turn of the 20th century are not visible in close-up spacecraft images. They were almost certainly imaginary features that observers thought they saw while straining to make out objects close to the limit of resolution of their telescopes. Other features, such as the “wave of darkening” and the “blue haze” described by early observers at the telescope, are now known to result from a combination of the viewing conditions and changes in the reflective properties of the surface.",
  "  For telescopic observers the most striking regular changes on Mars occur at the poles. With the onset of fall in a particular hemisphere, clouds develop over the relevant polar region, and the cap, made of frozen carbon dioxide , begins to grow. The smaller cap in the north ultimately extends to 55° latitude, the larger one in the south to 50° latitude. In spring the caps recede. During summer the northern carbon dioxide cap disappears completely, leaving behind a small water-ice cap. In the south a small residual cap composed of carbon dioxide ice and water ice lingers over the summer.",
  "The composition of the seasonal polar caps was the subject of debate for nearly 200 years. One early hypothesis—that the caps were made of water ice—can be traced to English astronomer William Herschel , who imagined them to be just like those on Earth. In 1898 an Irish scientist, George J. Stoney , questioned this theory and suggested that the caps might consist of frozen carbon dioxide, but evidence to support the idea was not available until Dutch American astronomer Gerard Kuiper’s 1947 detection of carbon dioxide in the atmosphere.",
  "In 1966 American scientists Robert Leighton and Bruce Murray published the results of a numerical model of the thermal environment on Mars that raised considerable doubt about the water-ice hypothesis. Their calculations indicated that, under Martian conditions, atmospheric carbon dioxide would freeze at the poles, and the growth and shrinkage of their model carbon dioxide caps mimicked the observed behaviour of the actual caps. The model predicted that the seasonal caps were relatively thin, only a few metres deep near the poles and thinning toward the equator. Although based on simplifications of the actual conditions on Mars, their results were later confirmed by thermal and spectral measurements taken by the twin Mariner 6 and 7 spacecraft when they flew by Mars in 1969.",
  "  Early telescopic observers noted instances in which Martian surface features were temporarily obscured. They observed both white and yellow obscurations that were correctly interpreted as due to condensed gas and dust, respectively. Telescopic observers also noted periodic disappearances of all dark markings, usually around southern summer. Again they were correctly interpreted as the result of global dust storms. Spacecraft observations have confirmed that hazes, clouds, and fogs commonly veil the surface.",
  "The Dutch American astronomer Gerard P. Kuiper ascertained from telescopic observations in 1947 that the Martian atmosphere is composed mainly of carbon dioxide. The atmosphere is very thin, exerting less than 1 percent of Earth’s atmospheric pressure at the surface. Surface pressures range over a factor of 15 because of the large altitude variations in Mars’s topography. Only small amounts of water are present in the atmosphere today. If it all precipitated out, it would form a layer of ice crystals only 10 micrometres (0.0004 inch) thick, which could be gathered into a solid block of ice not much larger than a medium-sized terrestrial iceberg. Despite the small amount of water present, the atmosphere is near saturation, and water-ice clouds are common.",
  "Low-lying clouds and fogs are often observed within topographic depressions—i.e., valleys or craters. Thin clouds are common at the morning terminator (the dividing line between the lit and unlit portions of the planet’s disk), and orographic clouds, produced when moist air is lifted over elevated terrain and cooled, form around prominent topographic features such as craters and volcanoes. In winter, westward-moving spiral-shaped storm systems, similar to those on Earth, are seen regularly at midlatitudes. Most of these clouds—in particular, the white clouds seen by the early observers—are composed of water ice.",
  "Dust storms are common on Mars. They can occur at any time but are most frequent in southern spring and summer, when Mars is passing closest to the Sun and surface temperatures are at their highest. Most of the storms are regional in extent and last a few weeks. Every second or third year, however, the dust storms become global. At their peak, dust is carried so high in the atmosphere that only the summits of the loftiest volcanoes—up to 21 km (13 miles) above the planet’s mean radius—are visible.",
  "  Although too small to be observed from Earth, dust devils ( see  whirlwind ) have been seen from Mars orbit and at the various spacecraft landing sites. Narrow tracks, thought to be caused by dust devils, are also visible in high-resolution images taken from orbit.",
  "The characteristic temperature in the lower atmosphere is about 200 kelvin s (K; −100 °F, −70 °C), which is generally colder than the average daytime surface temperature of 250 K (−10 °F, −20 °C). These values are in the same range as those experienced on Earth in Antarctica during winter. In summer above a very dark surface, daytime temperatures can peak at about 290 K (62 °F, 17 °C). Above the turbulent layer close to the surface, temperature decreases with elevation at a rate of about 1.5 K (2.7 °F, 1.5 °C) per km (about 2.4 K [4.3 °F, 2.4 °C] per mile) of altitude.",
  "Unlike that of Earth, the atmosphere of Mars experiences large seasonal variations in pressure as carbon dioxide, the main constituent, “snows out” at the winter pole and returns directly to a gas (sublimes) in the spring. Because the southern winter cap is more extensive than the northern, atmospheric pressure reaches a minimum during southern winter when the southern cap is at its largest. The pressure varies annually by 26 percent as some 7.9 trillion metric tons of carbon dioxide leave and reenter the atmosphere seasonally. This is equivalent to a thickness of at least 23 cm (9 inches) of solid carbon dioxide (dry ice) or several metres of carbon dioxide snow averaged over the vast area of the seasonal polar caps.",
  "Carbon dioxide constitutes 95.3 percent of the atmosphere by weight ( see the ), nine times the quantity now in Earth’s much more massive atmosphere. Much of Earth’s carbon dioxide, however, is chemically locked in sedimentary rocks; the amount in the Martian atmosphere is less than a thousandth of the terrestrial total. The balance of the Martian atmosphere consists of molecular nitrogen , water vapour, and noble gas es ( argon , neon , krypton , and xenon ). There are also trace amounts of gases that have been produced from the primary constituents by photochemical reactions, generally high in the atmosphere; these include molecular oxygen , carbon monoxide , nitric oxide , and small amounts of ozone .",
  "The lower atmosphere supplies gas to the planet’s ionosphere , where densities are low, temperatures are high, and components separate by diffusion according to their masses. Various constituents in the top of the atmosphere are lost to space, which affects the isotopic composition of the remaining gases. For example, because hydrogen is lost preferentially over its heavier isotope deuterium , Mars’s atmosphere contains five times more deuterium than Earth’s.",
  "  Although water is only a minor constituent of the Martian atmosphere (a few molecules per 10,000 at most), primarily because of low atmospheric and surface temperatures, it plays an important role in atmospheric chemistry and meteorology . The Martian atmosphere is effectively saturated with water vapour, yet there is no liquid water present on the surface. The temperature and pressure of the planet are so low that water molecules can exist only as ice or as vapour. Little water is exchanged daily with the surface despite the very cold nighttime surface temperatures.",
  "  Water vapour is mixed uniformly up to altitudes of 10–15 km (6–9 miles) and shows strong latitudinal gradients that depend on the season. The largest changes occur in the northern hemisphere. During summer in the north, the complete disappearance of the carbon dioxide cap leaves behind a water-ice cap. Sublimation of water from the residual cap results in a strong north-to-south concentration gradient of water vapour in the atmosphere. In the south, where a small carbon dioxide cap remains in summer and only a small amount of water ice has been detected, a strong water vapour gradient does not normally develop in the atmosphere.",
  "The atmospheric water vapour is believed to be in contact with a much larger reservoir in the Martian soil . Subsurface layers of ice seem to be ubiquitous on Mars at latitudes poleward of 40°; the very low subsurface temperatures would prevent the ice from subliming. The 2001 Mars Odyssey spacecraft confirmed that ice is present within a metre of the surface at latitudes higher than 60°, and the Phoenix lander found ice below the surface at 68° N, but it is not known how deep the ice layer extends. Images taken by the Mars Reconnaissance Orbiter showed new impact craters at latitudes between 40° N and 60° N that had exposed the subsurface water ice up to a depth of 74 cm (29 inches). In contrast, at low latitudes ice is unstable, and any ice present in the ground would tend to sublime into the atmosphere.",
  "Isotopic measurements suggest that larger amounts of carbon dioxide, nitrogen, and argon were present in the atmosphere in the past and that Mars may have lost much of its inventory of volatile substances early in its history, either to space or to the ground (i.e., locked up chemically in rocks). Mars once had a much thicker atmosphere that was mostly lost to space through the solar wind and the Sun’s ultraviolet radiation, which were much more intense in the early solar system.",
  "Methane has also been detected in Mars’s atmosphere. The Curiosity rover observed a seasonal variation in methane, but measurements from orbiters have shown only sporadic variations or even a complete absence of methane. This contradiction suggests that some process removes the methane observed near the surface before it spreads through the atmosphere. Volcanoes and meteorites have been ruled out as origins for the methane, which leaves chemical reactions between rock and water or metabolism by possible Martian microorganisms as possible sources.",
  "The vertical structure of the Martian atmosphere—that is, the relation of temperature and pressure to altitude—is determined partly by a complicated balance of several energy-transport mechanisms and partly by the way energy from the Sun is introduced into the atmosphere and lost by radiation to space.",
  "Two factors control the vertical structure of the lower atmosphere—its composition of almost pure carbon dioxide and its content of large quantities of suspended dust. Because carbon dioxide radiates energy efficiently at Martian temperatures, the atmosphere can respond rapidly to changes in the amount of solar radiation received. The suspended dust absorbs large quantities of heat directly from sunlight and provides a distributed source of energy throughout the lower atmosphere.",
  "Surface temperatures depend on latitude and fluctuate over a wide range from day to night. At the Viking 1 and Pathfinder landing sites (both about 20° N latitude), the temperatures at roughly human height above the surface regularly varied from a low near 189 K (−119 °F, −84 °C) just before sunrise to a high of 240 K (−28 °F, −33 °C) in the early afternoon. This temperature swing is much larger than that which occurs in desert regions on Earth. The variation is greatest very close to the ground and occurs because the thin, dry atmosphere allows the surface to radiate its heat quickly during the night. During dust storms this ability is impaired, and the temperature swing is reduced. Above altitudes of a few kilometres, the daily variation is damped out, but other oscillations appear throughout the atmosphere as a result of the direct input of solar energy. These temperature and pressure oscillations, sometimes called tides because they are regular, periodic, and synchronized with the position of the Sun, give the Martian atmosphere a very complex vertical structure.",
  "The cooling of the atmosphere with altitude at a rate of 1.5 K per km continues upward to about 40 km (25 miles), at which level (called the tropopause) the temperature becomes a roughly constant 140 K (−210 °F, −130 °C). This rate, measured by the Viking (and later Pathfinder) spacecraft as they descended through the atmosphere, was unexpectedly low; scientists had anticipated it to be near 5 K per km. This rate is significantly lower than that expected for clear air because of the large amount of suspended dust.",
  "Above 100 km (60 miles), the structure of the atmosphere is determined by the tendency of the heavier molecules to concentrate below the lighter ones. This diffusive separation process overcomes the tendency of turbulence to mix all the constituents together. At these high altitudes, absorption of ultraviolet light from the Sun dissociates and ionizes the gases and leads to complex sequences of chemical reactions. The top of the atmosphere has an average temperature of about 300 K (80 °F, 27 °C).",
  "The global pattern of atmospheric circulation on Mars shows many superficial similarities to that of Earth, but the root causes are very different. Among these differences are the atmosphere’s ability to adjust rapidly to local conditions of solar heat input; the lack of oceans, which on Earth have a large resistance to temperature changes; the great range in altitude of the surface ( see below  Character of the surface ); the strong internal heating of the atmosphere because of suspended dust; and the seasonal deposition and release of a large part of the Martian atmosphere at the poles.",
  "  Near-surface winds at the Viking and Pathfinder landing sites were usually regular in behaviour and generally light. Average speeds were typically less than 2 metres per second (4.5 miles per hour), although gusts up to 40 metres per second (90 miles per hour) were recorded. Other observations, including streaks of windblown dust and patterns in dune fields and in the many varieties of clouds, have provided additional clues about surface winds.",
  "Global circulation models, which incorporate all the factors understood to influence the behaviour of the atmosphere, predict a strong dependence of winds on the Martian seasons because of the large horizontal temperature gradients associated with the edge of the polar caps in the fall and winter. Strong jet stream s with eastward velocities above 100 metres per second (225 miles per hour) form at high latitudes in winter. Circulation is less dramatic in spring and fall, when light winds predominate everywhere. On Mars, unlike on Earth, there is also a relatively strong north-south circulation that transports the atmosphere to and from the winter and summer poles. The general circulation pattern is occasionally unstable and exhibits large-scale wave motions and instabilities: a regular series of rotating high- and low-pressure systems was clearly seen in the pressure and wind records at the Viking lander sites.",
  "Smaller-scale motions and oscillations, driven both by the Sun and by surface topography, are ubiquitous. For example, at the Viking and Pathfinder landing sites, the winds change in direction and speed throughout the day in response to the position of the Sun and the local slope of the land.",
  "Turbulence is an important factor in raising and maintaining the large quantity of dust found in the Martian atmosphere. Dust storms tend to begin at preferred locations in the southern hemisphere during the southern spring and summer. Activity is at first local and vigorous (for reasons yet to be understood), and large amounts of dust are thrown high into the atmosphere. If the amount of dust reaches a critical quantity, the storm rapidly intensifies, and dust is carried by high winds to all parts of the planet. In a few days the storm has obscured the entire surface, and visibility has been reduced to less than 5 percent of normal. The intensification process is evidently short-lived, as atmospheric clarity begins to return almost immediately, becoming normal typically in a few weeks.",
  "  The character of the Martian terrain has been well established from spacecraft photography and altimetry. Almost the entire planet has been photographed from orbit at a resolution of 20 metres (66 feet) and selected areas at resolutions as high as 20 cm (8 inches). In addition, the laser altimeter on Mars Global Surveyor measured surface elevations for the entire planet, averaged over a circle 300 metres (1,000 feet) across to a vertical accuracy of 1 metre (3.3 feet).",
  "  Many maps have been made to illustrate topography, geology, temperature, mineral distributions, and a variety of other data. After Mariner 9 the prime meridian on Mars—the equivalent of the Greenwich meridian on Earth—was defined as passing through a small crater named Airy-0 within the larger crater Airy. Longitude was measured in degrees that increase to the west of this meridian completely around the planet. Later some scientists expressed a preference for a coordinate system with longitude that increases to the east of the prime meridian. Consequently, maps of Mars were published with either or both of these systems.",
  "Despite its small size, Mars has significantly more relief than Earth. The lowest point on the planet, within the Hellas impact basin, is 8 km (5 miles) below the reference level. The highest point, at the summit of the volcano Olympus Mons , is 21 km (13 miles) above the reference level. The elevation range is thus 29 km (18 miles), compared with about 20 km (12.4 miles) on Earth—i.e., from the bottom of the Mariana Trench to the top of Mount Everest . Because Mars has no oceans, a reference level for elevations had to be defined in terms other than sea level. In the early 1970s the elevation at which the atmospheric pressure is 6.l millibars (about 0.006 of the sea-level pressure on Earth) was set as the reference. When Mars Global Surveyor acquired more-accurate elevation data, a better reference was needed, and the planet’s mean radius of 3,389.51 km (2,106.14 miles) was chosen.",
  "One of the most striking aspects of the Martian surface is the contrast between the southern and northern hemispheres. Most of the southern hemisphere is high-standing and heavily cratered, resembling the battered highlands of the Moon . Most of the northern hemisphere is low-lying and sparsely cratered. The difference in mean elevation between the two hemispheres is roughly 6 km (3.7 miles). The topographic boundary between the hemispheres is not parallel to the equator but roughly follows a great circle inclined to it by about 30°. In some places the boundary is broad and irregular; in other places there are steep cliffs. Some of the most intensely eroded areas on Mars occur along the boundary. Landforms there include outflow channels, areas of collapse called chaotic terrain, and an enigmatic mix of valleys and ridges known as fretted terrain. Straddling the boundary in the western hemisphere is the Tharsis rise, a vast volcanic pile 4,000 km (2,500 miles) across and 8 km (5 miles) above the reference level at its centre. It stands 12 km (7.5 miles) above the northern plains and more than 2 km (1.2 miles) above the surrounding cratered southern highlands. On or near the Tharsis rise are the planet’s largest volcanoes ( see below  Tharsis and Elysium ). Conspicuously absent in either hemisphere are the types of landforms that on Earth result from plate tectonics —for example, long linear mountain chains similar to the Andes, oceanic trenches, or a global system of interconnected ridges.",
  "The hemispheric dichotomy most likely formed when a large asteroid collided with Mars very early in its history. The resulting northern hemisphere impact crater measures roughly 8,500 by 10,700 km (5,300 by 6,600 miles) across; the object that crashed into Mars would have been more than 2,000 km (1,200 miles) across. Gravity data acquired by Mars Global Surveyor suggest that the Martian crust is much thicker under the southern highlands than under the northern plains ( see below  The interior ).",
  "The number of very large craters in the southern highlands implies a substantial age for the surface. Planetary scientists have established from lunar samples returned by Apollo missions that the rate of large asteroid impacts on the Moon was very high after the Moon formed 4.5 billion years ago and then declined rapidly between 3.8 billion and 3.5 billion years ago. Surfaces that formed before the decline are heavily cratered; those that formed after are less so. Mars very likely had a similar cratering history. Thus, the southern highlands almost certainly survive from more than 3.5 billion years ago.",
  "  The southern terrain possesses several distinctive types of craters—huge impact basins; large, partially filled craters with shallow, flat floors and eroded rims; smaller, fresh-looking bowl-shaped craters like those on the Moon; and rampart and pedestal craters. Hellas , the largest impact basin on Mars, is 8 km (5 miles) deep and about 7,000 km (4,350 miles) across, including the broad elevated ring surrounding the depression. Most of the craters measuring tens to hundreds of kilometres across are highly eroded in contrast to much smaller craters that formed on the younger plains, which are barely eroded. The contrast indicates that erosion rates were much higher on early Mars. It is one piece of evidence that the climate on early Mars was very different from what it has been for most of the planet’s subsequent history.",
  "  Most Martian craters look different from those on the Moon. A rampart crater is so named because the lobes of ejecta—the material thrown out from the crater and extending around it—are bordered with a low ridge, or rampart. The ejecta apparently flowed across the ground, which may indicate that it had a mudlike consistency. Some scientists have conjectured that the mud formed from a mixture of impact debris and water that was present under the surface. Around a pedestal crater, the ejected material forms a steep-sided platform, or pedestal, with the crater situated inside its border. The pedestal appears to have developed when wind carved away the surface layer of the surrounding region while leaving intact that portion protected by the overlying ejecta.",
  "    High-resolution Viking images revealed an additional characteristic of the ancient southern terrain—the pervasive presence of networks of small valleys that resemble terrestrial drainage systems created by flowing water. Examples include Nirgal Vallis , located in the southern hemisphere north of the Argyre impact basin, and Nanedi Vallis, located just north of the equator near the east end of Valles Marineris. Scientists have proposed two alternative mechanisms for their formation—either the runoff of rainfall on the surface or erosion by the outflow of groundwater that seeped onto the surface. In either case, warm climatic conditions may have been required for their formation. A major surprise of the Mars Global Surveyor mission was observation of small fresh-appearing gullies on steep slopes at high latitudes. These features strongly resemble water-worn gullies in Earth’s desert regions. They probably were formed by the melting of ice driven from the poles and deposited at lower latitudes during periods of high obliquity ( see below  Polar sediments, ground ice, and glaciers ).",
  "  The smaller number of impact craters on the plains compared with the southern highlands indicates that they formed after the decline in impact rates between 3.8 and 3.5 billion years ago. The plains can be divided into two broad areas: the volcanic plains of Tharsis composed largely of lava flows and the northern plains. The northern plains have remarkably little relief. They encompass all the terrain within 30° of the pole except for the layered terrains immediately around the pole. Three broad lobes extend to lower latitudes. These include Chryse Planitia and Acidalia Planitia (centred on 30° W longitude), Amazonis Planitia (160° W), and Utopia Planitia (250° W). The only significant relief in this huge area is a large ancient impact basin, informally called the Utopia basin (40° N, 250° W).",
  "Several different types of terrain have been recognized within the northern plains. In knobby terrain, numerous small hills are separated by smooth plains. The hills appear to be remnants of an ancient cratered surface now almost completely buried by younger material that forms the plains. Various plains have a polygonal fracture pattern that resembles landforms found in permafrost regions on Earth. Others have a peculiar thumbprintlike texture, possibly indicative of the former presence of stagnant ice.",
  "The origin of the low-lying northern plains remains controversial. Parts appear to be formed of lava, like the lunar maria. But some scientists have proposed that they were formerly occupied by ocean-sized bodies of water that were fed by large floods and that the surface of the plains is composed of sediments.",
  "Results from the Mars Exploration Rovers and from spectrometers on orbiting spacecraft show that the ancient highlands are compositionally distinct from the younger plains. The rover Spirit landed on a basalt plain that may be typical of plains. The rocks on the plains are mostly typical basalts with only thin alteration rinds high in sulfur , chlorine , and other volatile elements. The rinds probably formed by interaction of the basalts with acid fogs. The rover then traveled into the older Columbia Hills, where the rocks are very different. They are mostly basalts and impact breccias , but many are pervasively altered and rich in sulfates and hydrated minerals. Soils consisting almost entirely of sulfates or silica are also present. Many of the rocks appear to have been permeated by warm volcanic fluids or to have been weathered as a result of warm surface conditions. This mix of rocks and soils may be typical of the highlands in general. The results from orbit tell a similar story. Globally, the plains consist mostly of primary, unaltered basaltic minerals such as olivine and pyroxene . In contrast, alteration minerals such as clays are common throughout the ancient cratered terrain. The results indicate that surface conditions changed dramatically around 3.7 billion years ago. Prior to that time, warm and wet conditions were common and resulted in extensive rock alteration; after that time such conditions were rare, and rock alteration was minor.",
  "Most of the ancient cratered terrain is dissected by networks of dry valleys, mostly 1–2 km (0.6–1.2 miles) across and up to 2,000 km (1,200 miles) long. In outline they resemble terrestrial river systems. The valleys almost certainly formed by slow erosion of running water. Many local lowlands have a valley entering and a valley leaving, indicating that the lowland formerly contained a lake. Layered deposits, possibly deposited in lakes, commonly underlie these areas, and deltas are commonly observed where valleys enter the lowlands . Valley networks are rare, although not absent, in the younger, more sparsely cratered areas. Discovery of the valleys in the 1970s was a surprise because of the difficulty of having liquid water at the surface under present conditions. Their common presence in the heavily cratered terrain is another indicator that conditions on early Mars were much warmer and wetter than they are today.",
  "  Large flood channels, termed outflow channels, are observed incised into the Martian surface in several areas. The channels are much larger than the valley networks, generally being tens of kilometres across and hundreds of kilometres long. Most emerge full-sized from rubble-filled depressions and continue downslope into the northern plains or the Hellas basin in the south. Many of the largest drain from the south and west into Chryse Planitia. These are true channels in that they were once completely filled with flowing water, as opposed to most river valleys, which have never been close to full but contain a much smaller river channel. The peak discharges of the floods that cut the larger outflow channels are estimated to have been a hundred to a thousand times the peak discharge of the Mississippi River —truly enormous events. Some of the floods appear to have formed by catastrophic release of water from lakes. Others formed by explosive eruptions of groundwater. The outflow channels are younger than the valley networks and probably mostly formed when conditions were similar to those that prevail today. Recent discovery of very young outflow channels suggests that they could form today by eruption of groundwater from below the kilometre-thick permanently frozen ground.",
  "      Close to the equator, centred on 70° W longitude, are several enormous interconnected canyons collectively called Valles Marineris . Individual canyons are roughly 200 km (125 miles) across. At the centre of the system, several canyons merge to form a depression 600 km (375 miles) across and as much as 9 km (5.6 miles) deep—about five times the depth of the Grand Canyon . The entire system is more than 4,000 km (2,500 miles) in length, or about 20 percent of Mars’s circumference, almost the width of the United States. At several places within the canyons are thick, sulfate-rich sedimentary sequences, which suggest that lakes may have formerly occupied the canyons. Some of the lakes may have drained catastrophically to the east to form large outflow channels that start at the canyons’ eastern end. In contrast to the Grand Canyon, which formed by erosion, the Valles Marineris formed mainly by faulting, although they have been enlarged by erosion.",
  "  The canyons of Valles Marineris terminate to the west near the crest of the Tharsis rise, a vast bulge on the Martian surface more than 8,000 km (5,000 miles) across and 8 km (5 miles) high at its centre. Near the top of the rise are three of the planet’s largest volcanoes—Ascraeus Mons, Arsia Mons, and Pavonis Mons—which tower 18, 17, and 14 km (11.2, 10.5, and 8.7 miles), respectively, above the mean radius. Just off the rise to the northwest is the planet’s tallest volcano, Olympus Mons , 700 km (400 miles) across and almost 22 km (14 miles) above the surrounding plains. To the north is the largest volcano in areal extent, Alba Patera. It is 2,000 km (1,250 miles) across but only 7 km (4.3 miles) in height. Between these giant landforms are several smaller volcanoes and lava plains. Tharsis itself is a vast pile of volcanic rock, and although it had largely formed by 3.7 billion years ago, it has been a centre of volcanic activity ever since.",
  "  The presence of the Tharsis rise has caused stresses within, and deformation of, the crust. A vast system of fractures radiating from Tharsis and compressional ridges arrayed around the rise are evidence of this process. The radial faulting around Tharsis appears to have contributed to the formation of the Valles Marineris system.",
  "Another volcanic rise is located in the northern region of Elysium at about 215° W longitude. The Elysium rise is much smaller than Tharsis, being only 2,000 km across and 6 km (3.7 miles) high, and is also the site of several volcanoes.",
  "At each pole is a stack of finely layered water-ice-rich sediments about 3 km (2 miles) thick and only a few tens of millions of years old. The layering is exposed around the periphery of the sediments and in valleys that spiral out from the poles. In winter the sediments are covered with carbon dioxide frost, but they are exposed in summer. At the north pole they extend southward to 80° latitude. At the south pole their extent is less clearly defined, but they appear to extend farther from the pole than in the north. The layering is believed to result from variations in the proportion of dust and ice, probably caused by changes in the tilt of the rotational axis (obliquity). At high obliquities water ice is driven off from the poles, probably causing the residual water-ice caps to disappear entirely and the ice to be deposited at lower latitudes. At low obliquities the water-ice caps are at their maximum. Obliquity variations also affect the incidence of dust storms and deposition of dust at the poles. The deposits have a young age because they have all accumulated since the last period of high obliquity when the previous sediments were removed. One peculiarity of the sediments at the north pole is that they are surrounded by, and perhaps rest upon, a vast dune field rich in the sulfate mineral  gypsum .",
  "  Under present conditions, at latitudes higher than 40°, ground ice is permanently stable at depths less than 1 metre (3 feet) below the surface because temperatures there never get above the frost point. Above 60° latitude the ice is shallow enough to have been detected from orbit. Ice was also found just below the surface by the Phoenix lander at 68° N. At latitudes higher than 40°, recent impact craters have excavated the surface to depths of more than 2 metres (7 feet), revealing the ground ice. There are also numerous surface features caused by the presence of abundant ground ice. These include polygonally fractured ground similar to that found in terrestrial permafrost regions and a general softening of the terrain, probably caused by ice-abetted flow of the near-surface materials. A striking characteristic of the 40°–60°-latitude bands indicative of ice is the presence of debris aprons at the base of most steep slopes. Materials shed from the slopes appear to have flowed tens of kilometres away from the slopes, and ground-penetrating radar shows that the aprons contain large fractions of ice.",
  "During periods of high obliquity, ice driven from the poles accumulated on the surface at lower latitudes, possibly to form glaciers. Modeling of atmospheric circulation suggests that the preferred sites for ice accumulation during these periods are the western slopes of the Tharsis volcanoes and northeast of the Hellas basin. All these locations are rich in flow features and morainelike landforms, which suggests that glaciers were indeed formerly present.",
  "The radar instrument aboard the Mars Express spacecraft detected a possible lake of liquid water beneath the south polar ice cap. Because the temperature of the ground beneath the polar cap is believed to be about −68 °C (−90 °F), the water in the lake would have to be extremely salty.",
  "  The north polar region also contains the largest area of sand dunes on Mars. The dunes, which occupy the northern part of the plain known as Vastitas Borealis , form a band that almost completely encircles the north polar remnant cap. Interlayering of sand and seasonal carbon dioxide snow can be seen in some locations, indicating that the dunes are active on at least a seasonal timescale.",
  "Seismic data collected by the InSight lander revealed that the interior of Mars has three layers: the crust, the mantle, and the core. The crust is between 24 and 72 km (15 and 45 miles) thick. Below that is the mantle, which is roughly 1,500 km (930 miles) thick and more iron-rich than Earth’s mantle. The iron-nickel core is molten, has a radius of 1,830 km (1,140 miles), and has a density between 5.7 and 6.3 grams per cubic cm, which implies that the core is more than 18 percent sulfur.",
  "Isotopic data from meteorites determined to have come from Mars ( see below  Meteorites from Mars ) demonstrate unequivocally that the planet differentiated—separated into a metal-rich core and rocky mantle—at the end of the planetary accretion period 4.5 billion years ago. The planet has no detectable magnetic field that would indicate convection (heat-induced flow) in the core today. Large regions of magnetized rock have been detected in the oldest terrains, however, which suggests that very early Mars did have a magnetic field but that it disappeared as the planet cooled and the core solidified.",
  "Mars is almost certainly volcanically active today, although at a very low level. Some Martian meteorites, which are all volcanic rocks, show ages as young as a few hundred million years, and some volcanic surfaces on the planet are so sparsely cratered that they must be only tens of millions of years old. Thus, Mars was volcanically active in the geologically recent past, which implies that its mantle is warm and undergoing melting locally.",
  "Mars’s gravitational field is very different from Earth’s. On Earth, excesses and deficits of mass in the surface crust, corresponding to the presence of large mountains and ocean deeps, respectively, tend to be offset by compensating masses at depth ( isostatic compensation ). Thus, the pull of gravity on Earth is the same on high mountains as it is over the ocean. This is also true for Mars’s oldest terrains, such as the Hellas basin and the southern highlands. The younger terrains, such as the Tharsis and Elysium domes, however, are only partly compensated. Associated with both of these regions are gravity highs—that is, places where the measured gravity is significantly higher than elsewhere because of the large mass of the domes. (Similar areas, called mascon s, have been detected and mapped on Earth’s Moon.)",
  "Because the gravity over the southern highlands is roughly the same as that over the low-lying northern plains, the southern highlands must be underlain by a thicker crust of material that is less dense than the mantle below it. Estimates of the thickness of the Martian crust range from only 3 km (2 miles) under the Isidis impact basin, which is just north of the equator and east of Syrtis Major, to more than 90 km (60 miles) at the south end of the Tharsis rise.",
  "Scientists have identified more than 300 meteorites that have come from Mars. Suspicions about their origin were first raised when meteorites that appeared to be volcanic rocks were found to have ages of about 1.3 billion years instead of the 4.5 billion years of all other meteorites. These rocks had to have come from a body that was geologically active in the comparatively recent past, and Mars was the most likely candidate. The rocks also have similar ratios of oxygen isotopes, which are distinctively different from those of Earth rocks, lunar rocks, and other meteorites. A Martian origin was finally proved when it was found that several of them contained trapped gases with a composition identical to that of the Martian atmosphere as measured by the Viking landers. The rocks are thought to have been ejected from the Martian surface by large impacts. They then went into solar orbit for several million years before falling on Earth. Claims in the mid-1990s of finding evidence for past microscopic life in one of the meteorites, called ALH84001 , have been viewed skeptically by the general science community ( see below  The question of life on Mars ).",
  "  Little was learned about the two moons of Mars, Phobos and Deimos , after their discovery in 1877 until orbiting spacecraft observed them a century later. Viking 1 flew to within 100 km (60 miles) of Phobos and Viking 2 to within 30 km (20 miles) of Deimos.",
  "Phobos revolves around Mars once every 7 hours 39 minutes. It moves in an exceptionally close orbit at a mean distance of about 6,000 km (3,700 miles) from the surface—less than twice the planet’s radius. It is so near that, without internal strength, it would be torn apart by gravitational (tidal) forces ( see  Roche limit ). These forces also slow the motion of Phobos and may ultimately cause the satellite to collide with Mars, possibly in less than 100 million years. Deimos suffers the opposite fate. It moves in a more distant orbit, and tidal forces are causing it to recede from the planet. Phobos and Deimos are not visible from all locations on the planet because of their small size, proximity to Mars, and near-equatorial orbits.",
  "  Both moons are irregular chunks of rock, roughly ellipsoidal in shape. Phobos is the larger of the two. Phobos’s rugged surface is totally covered with impact craters. The largest, the crater Stickney, is about half as wide as the satellite itself. Its surface also exhibits a widespread system of linear fractures, or grooves, many of which are geometrically related to Stickney. In contrast, the surface of Deimos appears smooth, as its many craters are almost completely buried by fine debris, and it shows no fracture system. The difference in appearance between the two moons is thought to be related to the final disposition of the debris produced by impacts. In the case of the inner, more massive Phobos, the ejected material either fell back to the surface or, if it left the satellite with enough velocity to go into space, subsequently fell on Mars. For the more-distant, smaller Deimos, debris thrown off the satellite remained in orbit until it was recaptured, sifting down to blanket its surface.",
  "The albedo , or reflectivity, of the surfaces of both moons is very low, similar to that of the most primitive types of meteorites. One theory of the origin of the moons is that they are asteroid s that were captured when Mars was forming.",
  "  Since the beginning of the space age, Mars has been a focus of planetary exploration for three main reasons: (1) it is the most Earth-like of the planets; (2) other than Earth, it is the planet most likely to have developed indigenous life; and (3) it will probably be the first extraterrestrial planet to be visited by humans. Between 1960 and 1980 the exploration of Mars was a major objective of both the U.S. and Soviet space programs. U.S. spacecraft successfully flew by Mars ( Mariner s 4, 6, and 7), orbited the planet (Mariner 9 and Vikings 1 and 2), and placed lander modules on its surface ( Viking s 1 and 2). Three Soviet probes (Mars 2, 3, and 5) also investigated Mars, two of them reaching its surface. Mars 3 was the first spacecraft to soft-land an instrumented capsule on the planet, on December 2, 1971; it landed during a planetwide dust storm and returned data for about 20 seconds.",
  "Mariner 9, the first spacecraft to orbit another planet, was placed around Mars in November 1971 and operated until October 1972. It returned a wide variety of spectroscopic, radio-propagation, and photographic data. Some 7,330 pictures covering 80 percent of the surface demonstrated a history of widespread volcanism, ancient erosion by water, and reshaping of extensive areas of the surface by internal forces.",
  "    The central theme of the Viking missions was the search for extraterrestrial life . No unequivocal evidence of biological activity was found ( see below  The question of life on Mars ), but the various instruments on the two orbiters and two landers returned detailed information concerning Martian geology, meteorology, and the physics and chemistry of the upper atmosphere. Vikings 1 and 2 were placed into orbit during June and August 1976, respectively. Lander modules descended to the surface from the orbiters after suitable sites were found. Viking 1 landed in the region of Chryse Planitia (22° N, 48° W) on July 20, 1976, and Viking 2 landed 6,500 km (4,000 miles) away in Utopia Planitia (48° N, 226° W) on September 3, 1976.",
  "In 1988 Soviet scientists launched a pair of spacecraft, Phobos 1 and 2, to orbit Mars and make slow flyby observations of its two satellites. Phobos 1 failed during the yearlong flight, but Phobos 2 reached Mars in early 1989 and returned several days of observations of both the planet and Phobos before malfunctioning.",
  "  Amid failures of several U.S. spacecraft missions to Mars in the 1990s, Mars Pathfinder successfully set down in Chryse Planitia (19° N, 33° W) on July 4, 1997, and deployed a robotic wheeled rover called Sojourner on the surface. This was followed by Mars Global Surveyor , which reached Mars in September 1997 and systematically mapped various properties of the planet from orbit for several years beginning in March 1999. These included Mars’s gravity and magnetic fields, surface topography, and surface mineralogy. The spacecraft also carried cameras for making both wide-angle and detailed images of the surface at resolutions down to 1.5 metres (5 feet).",
  "   Mars Odyssey safely entered Mars orbit in October 2001 and started mapping other properties, including the chemical composition of the surface, the distribution of near-surface ice, and the physical properties of near-surface materials. Neutron measurements suggested that the polar regions above latitude 60° contain huge subsurface reservoirs of water ice. Mars Odyssey also discovered caves on a volcano by using its infrared cameras to show that the temperatures of the cave entrances, which appeared as dark circular features, did not change as much as the surrounding surface.",
  "A wave of spacecraft converged on Mars in late 2003 and early 2004 with mixed outcomes. Nozomi , launched by Japan in 1998 on a leisurely trajectory, was the first to reach the vicinity of the planet, but malfunctions prevented it from being put into Mars orbit. In mid-2003 the European Space Agency’s Mars Express was launched on a half-year journey to the Red Planet. Carrying instruments to study the atmosphere, surface, and subsurface, it entered Mars orbit on December 25; however, its British lander, Beagle 2, which was to examine the rocks and soil for signs of past or present life, failed to establish radio contact after having landed on the Martian surface the same day. Within weeks of its arrival, the Mars Express orbiter detected vast fields of water ice as well as carbon dioxide ice at the south pole and confirmed that the southern summer remnant cap, like the northern one, contains permanently frozen water. It also detected large sulfur-rich deposits, mainly in Valles Marineris, and clay minerals in the heavily cratered terrains.",
  "  Also launched in mid-2003 was the U.S. Mars Exploration Rover mission, which comprised twin robotic landers, Spirit and Opportunity. Spirit touched down in Gusev Crater (15° S 175° E) on January 3, 2004. Three weeks later, on January 24, Opportunity landed in Meridiani Planum (2° S 6° W), on the opposite side of the planet. The six-wheeled rovers, each equipped with cameras and a suite of instruments that included a microscopic imager and a rock-grinding tool, analyzed the rocks, soil, and dust around their landing sites, which had been chosen because they appeared to have been affected by water in Mars’s past. Both rovers found evidence of past water. Perhaps the most dramatic was the discovery by Opportunity of rocks that appeared to have been laid down at the shoreline of an ancient body of salty water. Each rover was designed for a nominal 90-day mission but functioned well past that time. Spirit and Opportunity stopped transmitting to Earth in March 2010 and June 2018, respectively. Opportunity had covered 45 km (28 miles) over 14 years, which were records for distance driven and mission time spent on another planet.",
  "In 2005 the U.S. launched the Mars Reconnaissance Orbiter, carrying an imaging system with a resolution of 20 cm (8 inches), a spectrometer to determine surface composition, and a ground-penetrating radar. The imaging system took photographs of dark streaks that appeared to be salty water flowing downhill after it had melted during the Martian spring. The spectrometer revealed that clay minerals and other alteration products indicative of a warm distant past are common in the ancient cratered terrains, while the radar determined the thickness of the ice at the poles and detected glaciers elsewhere.",
  "  In 2008 the U.S. probe Phoenix landed in the north polar region of Mars. Phoenix carried a small chemical laboratory to study the arctic soil. It found water ice underneath the surface of Mars and alkaline soil.",
  "  The U.S. Mars Science Laboratory rover, called Curiosity, landed in Gale crater in 2012. Weighing about 900 kg (2,000 pounds) and measuring about 3 metres (10 feet) long, it was the heaviest and longest rover on Mars. Gale crater is at a low elevation, so if Mars ever had surface water, it would have pooled there. Aeolis Mons (also called Mount Sharp), the crater’s central mountain, consists of many layers of sedimentary rock that were laid down over much of Mars’s geological history. Curiosity took pictures of water-transported gravel, which suggests that at one time Gale crater was likely the floor of an ancient stream. Curiosity also found that early Mars could have supported life. It discovered traces of organic molecules preserved in rock layers 3.5 billion years old and that the amount of methane in the Martian atmosphere varies with the seasons.",
  "In September 2014 two probes entered Martian orbit. The U.S. Mars Atmosphere and Volatile Evolution (MAVEN) probe studied the upper atmosphere and found that Mars had lost most of its early atmosphere to the Sun’s ultraviolet radiation and solar wind. India’s Mars Orbiter Mission (MOM) probe was that country’s first to reach another planet. Its instruments included a colour camera, an ultraviolet spectrometer, and a sensor for methane.",
  "The ExoMars mission was a joint project of the European Space Agency and Russia. The first part of the mission arrived at Mars in October 2016 and consisted of two spacecraft—the Trace Gas Orbiter (TGO) and the Schiaparelli lander. Schiaparelli ejected its parachute early and crashed into the surface. The TGO mapped the vertical distribution of dust and water vapour in the atmosphere. It did not detect any methane, which conflicted with Curiosity’s detection and suggests that some process destroys methane before it spreads throughout the atmosphere.",
  "The U.S. InSight ( In terior exploration using S eismic I nvestigations, G eodesy, and H eat T ransport) lander touched down on Elysium Planitia in November 2018. InSight placed a seismometer on the surface that made the first detections of quakes on Mars and revealed the planet’s internal structure. The lander also deployed a probe that burrowed into the ground to study heat flow in the soil. However, the probe seemed to have hit some underground obstacle, such as a rock or gravel, because it stopped before reaching the desired depth. The same rocket that launched InSight also carried two “CubeSats,” small satellites whose basic unit is a modular cube measuring roughly 10 cm (4 inches) square per side. Each of the InSight CubeSats, called Mars Cube One (MarCO), consisted of six such units. The first CubeSats to be launched to another planet, they relayed communications to Earth from InSight during its landing.",
  "    In February 2021 three missions arrived at Mars. The United Arab Emirates orbiter Hope carried a camera and infrared and ultraviolet spectrometers to study the Martian atmosphere. The Chinese mission Tianwen-1 consisted of an orbiter and a small rover, Zhurong, which landed on Mars on May 14. The American Mars 2020 mission carried the Perseverance rover, which had a drill designed to collect core samples that could be taken to Earth for analysis. Perseverance landed on February 18 in Jezero crater near a dried-up river delta and was designed to search for signs of ancient microbial life. The rover also carried a small helicopter, Ingenuity, which on April 19, 2021, became the first machine to fly through the skies of another planet when it ascended to a height of 3 metres (10 feet).",
  "Future missions scheduled to arrive at Mars include the second part of the ExoMars mission, the Rosalind Franklin rover. Rosalind Franklin will arrive in the late 2020s and will carry a drill that can reach 2 metres (6 feet) underground to collect soil samples for onboard analysis.",
  "From the beginnings of telescopic observations of Mars, people have speculated about whether life could have started on the planet and what that life might be like. Early observers were concerned mostly with intelligent life, but the focus now is on life’s origin, microbial communities, and limits to their survival.",
  "Views on the prospects for life on Mars have varied greatly in recent decades. In the 1960s the possibility that changes seen at the telescope could have a biological cause led to Mariner 9’s attempts to monitor surface changes in 1972 and to the launching of the Viking landers to Mars in 1975. The Viking spacecraft had an array of sophisticated experiments to detect metabolism and organic molecules . The negative results from these experiments resulted in considerable pessimism that continued through the 1980s for the prospects for life.",
  "However, several factors subsequently contributed to a more optimistic view. The first is recognition that life can survive in a far wider range of conditions than was formerly thought possible, including near deep-sea vents at temperatures well over 1,000 °C (1,800 °F), in basaltic rocks deep below the surface, and in very saline and acid environments. The second is the discovery that on Earth  life started very quickly, possibly before the end of heavy bombardment, which possibly indicates that the origin of life is not an extremely low-probability event but rather will follow if the right conditions are present. The third is mounting evidence that conditions on early Mars, when life arose on Earth, were Earth-like. A fourth factor is recognition that Earth and Mars exchange materials. As indicated above, more than 30 pieces of Mars have been found on Earth, despite the difficulty of distinguishing Mars rocks from Earth rocks. It is more difficult to get Earth rocks to Mars. Nevertheless, during the period of heavy bombardment, when life may have already started on Earth and conditions on Mars were Earth-like, pieces of Earth may have been transported to Mars. Thus, life may have originated independently on Mars or been seeded from Earth.",
  "In 1996 the scientific world was shocked when a group of scientists announced that they had found evidence of life in a Martian meteorite. In support of their conclusion, they listed (1) bacteria -like objects in electron microscope imagery, (2) detection of hydrocarbons , (3) mineral assemblages that were not produced in chemical equilibrium, and (4) magnetic particles similar to those produced by some terrestrial bacteria. The announcement triggered a vigorous scientific debate into the validity of the claims. The scientific consensus now is that there are plausible abiological explanations for all the observations and that the claims are likely invalid.",
  "  Despite this setback, the main driver of the Mars exploration program is still the search for life. Because liquid water is so essential for life, the initial focus has been on the search for evidence of warm conditions that would enable the persistence of liquid water. The evidence for such conditions at least on early Mars is now compelling, and there is some evidence that liquid water sometimes flows on the surface in a few places. The exploration thrust will likely shift to search for more-direct evidence such as organic remains and isotopic signatures. It could be argued that the best strategy is to look for fossil remains from the early period in Mars’s history when conditions were more Earth-like. But the Martian meteorite debate and disagreements about early terrestrial life point to the difficulty of finding compelling evidence of microbial fossil life. Alternatively, it could be argued that the best strategy is to look for present-day life in niches, such as warm volcanic regions or the intermittent flows of what may be briny water, in the hope that life, if it ever started on Mars, would survive where conditions were hospitable.",
  "Human exploration is still decades away despite optimism when the Apollo program ended in the early 1970s that Mars exploration would soon follow. The technical difficulties of getting people to Mars and back, while challenging, are not overwhelming. The main difficulty has been in coming up with a compelling rationale that would justify the tremendous costs and risks. Advocates have argued that exploring Mars and extending human reach beyond Earth - Moon space needs no practical rationale; to explore is an essential part of being human. Others have argued that practical benefits such as economic stimulus, scientific discovery, and technology feedback would result. Nevertheless, despite numerous strong advocates, human exploration of Mars now seems farther from reality than in the 1970s.",
  "  Several studies have been undertaken to determine how human missions to Mars might be implemented. There are two basic classes of missions that follow from the orbital motions of Mars and Earth. In opposition -class missions, the round-trip time is 500–600 days, with 30 days spent on Mars. For conjunction -class missions, the round-trip time is about 900 days, and the time spent on Mars may be as much as 550 days. Most studies conclude that the short stay time for opposition-class missions could not justify the cost and effort of getting there and that, despite the greater resources needed, a conjunction-class mission is preferred.",
  "There are many variants on how such a mission might be implemented. In some scenarios a cargo ship is sent ahead of the humans to establish a robotically operated base, and the humans follow, possibly years later. In other variants all the resources needed accompany the crew. Another issue is the extent to which resources at Mars could be used for supporting people during their stay and for making oxidants and propellants for the return trip. In situ resource units (ISRUs) could be sent to Mars well ahead of the people to extract and store both oxygen from the atmosphere and hydrogen from water, using solar or nuclear power. People would not be launched from Earth until adequate resources for mission success had accumulated at Mars. To save fuel, the atmosphere at both Mars and Earth could be used to decelerate (aerobrake) the outgoing and incoming spacecraft, respectively; an additional option is direct entry. Another issue is what the astronauts would do at Mars. Should they stay close to a base and operate remote robots at various locations around the planet, or should they go on extended trips from the base and explore, thereby incurring the risk of being stranded?",
  "One issue that is not so readily susceptible to quantitative engineering analysis is crew health. Long times in space have various physiological effects. The circulatory and vestibular systems are affected, and bones tend to demineralize. Countermeasures to minimize degradation in human performance would have to be devised. The crew would also experience psychological pressures from several hundred days in a confined space far from Earth with no other company. Radiation effects would also be significant, particularly if solar storms occurred during the two–three year trip.",
  "Planetary protection is another issue. The first concern is scientific: Mars should not be contaminated with terrestrial materials before the potential for indigenous life has been adequately assessed. Robotic spacecraft sent to Mars are subject to rigorous cleanliness requirements, and parts that touch the surface are sterilized to minimize the possibility of interfering with the detection of indigenous life. Clearly, similar protective measures cannot be followed for human missions. The second issue concerns back contamination. International protocols require that materials returned from Mars be quarantined until they have been proved to be safe. The astronauts may similarly have to be quarantined. Fortunately, most of the planetary-protection issues should be resolvable well ahead of human missions by robotic return of Martian samples.",
  " Donald Goldsmith , The Hunt for Life on Mars (1997), describes the events that led to the controversial claims for evidence of life in the Martian meteorite ALH84001. John Noble Wilford , Mars Beckons: The Mysteries, the Challenges, the Expectations of Our Next Great Adventure in Space (1990), provides a general introduction. All aspects of Mars science are addressed in Hugh H. Kieffer et al. (eds.), Mars (1992), a huge, comprehensive technical summary of existing knowledge. Victor R. Baker , The Channels of Mars (1982), is a well-illustrated discussion of how these features came about and their implications for the history of Mars. Michael H. Carr , The Surface of Mars (1981), is a profusely illustrated survey of scientists’ perception of Mars after the Viking missions, and Water on Mars (1996) discusses the role that water has played in the evolution of the Martian surface. Volumes of papers detailing the results of the various Mars spacecraft missions appear in the Journal of Geophysical Research : for Viking, 82, no. 28 (1977); for Mars Pathfinder, 104, no. E4 (1999); and for Mars Global Surveyor, 106, no. E4 (2001). These results are summarized in several excellent papers in Nature 412:207–253 (July 12, 2001)."
]