[
  "  Sun ,  star around which Earth and the other components of the solar system revolve. It is the dominant body of the system, constituting more than 99 percent of its entire mass. The Sun is the source of an enormous amount of energy, a portion of which provides Earth with the light and heat necessary to support life .",
  "The Sun is classified as a G2 V star, with G2 standing for the second hottest stars of the yellow G class—of surface temperature about 5,800 kelvins (K)—and the V representing a main sequence, or dwarf , star, the typical star for this temperature class. (G stars are so called because of the prominence of a band of atomic and molecular spectral lines that the German physicist Joseph von Fraunhofer designated G.) The Sun exists in the outer part of the Milky Way Galaxy and was formed from material that had been processed inside a supernova . The Sun is not, as is often said, a small star. Although it falls midway between the biggest and smallest stars of its type, there are so many dwarf stars that the Sun falls in the top 5 percent of stars in the neighbourhood that immediately surrounds it.",
  "      The radius of the Sun, R  ☉ , is 109 times that of Earth , but its distance from Earth is 215 R  ☉ , so it subtends an angle of only  1  2  ° in the sky, roughly the same as that of the Moon . By comparison, Proxima Centauri , the next closest star to Earth, is 250,000 times farther away, and its relative apparent brightness is reduced by the square of that ratio, or 62 billion times. The temperature of the Sun’s surface is so high that no solid or liquid can exist there; the constituent materials are predominantly gaseous atoms , with a very small number of molecules . As a result, there is no fixed surface. The surface viewed from Earth, called the photosphere , is the layer from which most of the radiation reaches us; the radiation from below is absorbed and reradiated, and the emission from overlying layers drops sharply, by about a factor of six every 200 kilometres (124 miles). The Sun is so far from Earth that this slightly fuzzy surface cannot be resolved, and so the limb (the visible edge) appears sharp.",
  "The mass of the Sun, M  ☉ , is 743 times the total mass of all the planets in the solar system and 330,000 times that of Earth. All the interesting planetary and interplanetary gravitational phenomena are negligible effects in comparison to the force exerted by the Sun. Under the force of gravity , the great mass of the Sun presses inward, and to keep the star from collapsing, the central pressure outward must be great enough to support its weight. The density at the Sun’s core is about 100 times that of water (roughly six times that at the centre of Earth), but the temperature is at least 15,000,000 K, so the central pressure is at least 10,000 times greater than that at the centre of Earth, which is 3,500 kilobars. The nuclei of atoms are completely stripped of their electrons , and at this high temperature they collide to produce the nuclear reactions that are responsible for generating the energy vital to life on Earth.",
  "While the temperature of the Sun drops from 15,000,000 K at the centre to 5,800 K at the photosphere, a surprising reversal occurs above that point; the temperature drops to a minimum of 4,000 K, then begins to rise in the chromosphere , a layer about 7,000 kilometres high at a temperature of 8,000 K. During a total eclipse the chromosphere appears as a pink ring. Above the chromosphere is a dim, extended halo called the corona , which has a temperature of 1,000,000 K and reaches far past the planets. Beyond a distance of 5 R  ☉ from the Sun, the corona flows outward at a speed (near Earth) of 400 kilometres per second (km/s); this flow of charged particles is called the solar wind .",
  "The Sun is a very stable source of energy; its radiative output, called the solar constant , is 1.366 kilowatts per square metre at Earth and varies by no more than 0.1 percent. Superposed on this stable star, however, is an interesting 11-year cycle of magnetic activity manifested by regions of transient strong magnetic fields called sunspots .",
  "The energy radiated by the Sun is produced during the conversion of hydrogen (H) atoms to helium (He). The Sun is at least 90 percent hydrogen by number of atoms, so the fuel is readily available. Since one hydrogen atom weighs 1.0078 atomic mass units and a single helium atom weighs 4.0026, the conversion of four hydrogen atoms to one helium atom yields 0.0294 mass unit, which are all converted to energy, 6.8 million electron volts (MeV, 1 MeV = 1.6 × 10 −6 erg), in the form of gamma (γ) rays or the kinetic energy of the products. If all the hydrogen is converted, 0.7 percent of the mass becomes energy, according to the Einstein formula E = mc  2 , in which E represents the energy, m is the mass, and c is the speed of light . A calculation of the time required to convert all the hydrogen in the Sun provides an estimate of the length of time for which the Sun can continue to radiate energy. In only about 10 percent of the Sun are the temperatures high enough to sustain fusion reactions. Converting 0.7 percent of the 2 × 10 32 grams of hydrogen into energy that is radiated at 4 × 10 33 ergs per second permits the Sun to shine for 3 × 10 17 seconds, or 10 billion years at the present rate.",
  "The process of energy generation results from the enormous pressure and density at the centre of the Sun, which makes it possible for nuclei to overcome electrostatic repulsion. (Nuclei are positive and thus repel each other.) Once in some billions of years a given proton ( 1 H, in which the superscript represents the mass of the isotope ) is close enough to another to undergo a process called inverse beta decay , in which one proton becomes a neutron and combines with the second to form a deuteron ( 2 D). This is shown symbolically on the first line of equation 1, in which e  − is an electron and ν is a subatomic particle known as a neutrino .   ",
  "While this is a rare event, hydrogen atoms are so numerous that it is the main solar energy source. Subsequent encounters (listed on the second and third lines) proceed much faster: the deuteron encounters one of the ubiquitous protons to produce helium-3 ( 3 He), and these in turn form helium-4 ( 4 He). The net result is that four hydrogen atoms are fused into one helium atom. The energy is carried off by gamma-ray photons (γ) and neutrinos, ν. Because the nuclei must have enough energy to overcome the electrostatic barrier, the rate of energy production varies as the fourth power of the temperature.",
  "Equation 1 shows that for every two hydrogen atoms converted, one neutrino of average energy 0.26 MeV carrying 1.3 percent of the total energy released is produced. This produces a flux of 8 × 10 10 neutrinos per square centimetre per second at Earth . The first experiment designed to detect solar neutrinos was built in the 1960s by American scientist Raymond Davis (for which he won the Nobel Prize for Physics in 2002) and carried out deep underground in the Homestake gold mine in Lead, South Dakota, U.S. The solar neutrinos in equation 1 had an energy (less than 0.42 MeV) that was too low to be detected by this experiment; however, subsequent processes produced higher energy neutrinos that Davis’s experiment could detect. The number of these higher energy neutrinos observed was far smaller than would be expected from the known energy-generation rate, but experiments established that these neutrinos did in fact come from the Sun. This discrepancy became known as the solar neutrino problem . One possible reason for the small number detected was that the presumed rates of the subordinate process are not correct. Another, more intriguing, possibility was that the neutrinos produced in the core of the Sun interact with the vast solar mass and change to a different kind of neutrino that cannot be observed. The existence of such a process would have great significance for nuclear theory, for it requires a small mass for the neutrino. In 2002 results from the Sudbury Neutrino Observatory, nearly 2,100 metres (6,800 feet) underground in the Creighton nickel mine near Sudbury, Ontario, Canada, showed that the solar neutrinos did change their type and thus that the neutrino had a small mass. These results solved the solar neutrino problem.",
  "In addition to being carried away as neutrinos, which simply disappear into the cosmos, the energy produced in the core of the Sun takes two other forms as well. Some is released as the kinetic energy of product particles, which heats the gases in the core, while some travels outward as gamma-ray photons until they are absorbed and reradiated by the local atoms. Because the nuclei at the core are completely ionized, or stripped of their electrons, the photons are simply scattered there into a different path. The density is so high that the photons travel only a few millimetres before they are scattered. Farther out the nuclei have electrons attached, so they can absorb and reemit the photons, but the effect is the same: the photons take a so-called random walk outward until they escape from the Sun. The distance covered in a random walk is the average distance traveled between collisions (known as the mean free path) multiplied by the square root of the number of steps, in which a step is an interval between successive collisions. As the average mean free path in the Sun is about 10 centimetres (4 inches), the photon must take 5 × 10 19 steps to travel 7 × 10 10 centimetres. Even at the speed of light this process takes 170,000 years, and so the light seen today was generated long ago. The final step from the Sun’s surface to Earth, however, takes only eight minutes.",
  "As photons are absorbed by the outer portion of the Sun, the temperature gradient increases and convection occurs. Great currents of hot plasma , or ionized gas, carry heat upward. These mass motions of conducting plasma in the convective zone, which constitutes approximately the outer 30 percent of the Sun, may be responsible for the sunspot cycle. The ionization of hydrogen plays an important role in the transport of energy through the Sun. Atoms are ionized at the bottom of the convective zone and are carried upward to cooler regions, where they recombine and liberate the energy of ionization. Just below the surface, radiation transport again becomes efficient, but the effects of convection are clearly visible in the photosphere.",
  "  The Sun has been shining for 4.6 billion years. Considerable hydrogen has been converted to helium in the core, where the burning is most rapid. The helium remains there, where it absorbs radiation more readily than hydrogen. This raises the central temperature and increases the brightness. Model calculations conclude that the Sun becomes 10 percent brighter every billion years; hence it must now be at least 40 percent brighter than at the time of planet formation. This would produce an increase in Earth’s temperature, but no such effect appears in the fossil record . There were probably compensating thermostatic effects in the atmosphere of Earth, such as the greenhouse effect and cloudiness. The young Sun may also have been more massive, and thus more luminous, and would have lost its early mass through the solar wind. The increase in solar brightness can be expected to continue as the hydrogen in the core is depleted and the region of nuclear burning moves outward. At least as important for the future of Earth is the fact that tidal friction will slow down Earth’s rotation until, in four billion years, its rotation will match that of the Moon, turning once in 30 of our present days.",
  "The evolution of the Sun should continue on the same path as that taken by most stars . As the core hydrogen is used up, the nuclear burning will take place in a growing shell surrounding the exhausted core. The star will continue to grow brighter, and when the burning approaches the surface, the Sun will enter the red giant phase, producing an enormous shell that may extend as far as Venus or even Earth. Fortunately, unlike more massive stars that have already reached this state, the Sun will require billions of years to reach this state.",
  "The structure of a star is uniquely determined by its mass and chemical composition. Unique models are constructed by varying the assumed composition with the known mass until the observed radius, luminosity, and surface temperature are matched. The process also requires assumptions about the convective zone. Such models can now be tested by the new science known as helioseismology.",
  "Helioseismology is analogous to geoseismology: frequencies and wavelengths of various waves at the Sun’s surface are measured to map the internal structure. On Earth the waves are observed only after earthquakes , while on the Sun they are continuously excited, probably by the currents in the convective zone. While a wide range of frequencies are observed, the intensity of the oscillation patterns, or modes, peaks strongly at a mode having a period of five minutes. The surface amplitudes range from a few centimetres per second to several metres per second. The modes where the entire Sun expands and contracts or where sound waves travel deeply through the Sun, only touching the surface in a few nodes (i.e., points of no vibration), make it possible to map the deep Sun. Modes with many nodes are, by contrast, limited to the outer regions. Every mode has a definite frequency determined by the structure of the Sun. From a compilation of thousands of mode frequencies, one can develop an independent solar model, which reproduces the observed oscillations quite well. The frequencies of the modes vary slightly with the sunspot cycle.",
  "  As the Sun rotates, one half is moving toward us, and the other away. This produces a splitting in the frequencies of the modes (owing to the Doppler shift from the two halves of the Sun). Because the different modes reach different depths in the Sun, the rotation at different depths can be mapped. The interior below the convective zone rotates as a solid body. At the surface rotation is fastest at the equator and slowest at the poles. This differential rotation is easily visible as sunspots rotate across the solar surface, and it has been known since the first telescopic studies. At the equator the sunspots rotate at a 25-day rate, and at high latitudes at a 28- or 29-day rate. The differential rotation, apparently generated by the convective zone, is thought to play an important role in the generation of the magnetic field of the Sun. Much is not understood, however, for many solar features show less differential rotation.",
  "  Although there are no fires on the surface of the Sun, the photosphere seethes and roils, displaying the effects of the underlying convection . Photons flowing from below, trapped by the underlying layers, finally escape. This produces a dramatic drop in temperature and density. The temperature at the visible surface is about 5,800 K but drops to a minimum about 4,000 K at approximately 500 kilometres above the photosphere. The density, about 10 −7 gram per cubic centimetre (g/cm 3 ), drops a factor of 2.7 every 150 kilometres. The solar atmosphere is actually a vacuum by most standards; the total density above any square centimetre is about 1 gram, about 1,000 times less than the comparable mass in the atmosphere of Earth . One can see through the atmosphere of Earth but not through that of the Sun because the former is shallow, and the molecules absorb only radiation that lies outside of the visible spectrum. The hot photosphere of the Sun, by contrast, contains an ion called negative hydrogen , H − , a hydrogen nucleus with two electrons attached. The H − ion absorbs radiation voraciously through most of the spectrum.",
  "  The photosphere is the portion of the Sun seen in ordinary light . Its image reveals two dominant features, a darkening toward the outermost regions, called limb darkening, and a fine rice-grain-like structure called granulation. The darkening occurs simply because the temperature is falling; when one looks at the edge of the Sun, one sees light from higher, cooler, and darker layers. The granules are convective cells that bring energy up from below. Each cell measures about 1,500 kilometres across. Granules have a lifetime of about 25 minutes, during which hot gas rises within them at speeds of about 300 metres per second. They then break up, either by fading out or by exploding into an expanding ring of granules. The granules occur all over the Sun. It is believed that the explosion pattern shapes the surrounding granules in a pattern called mesogranulation, although the existence of that pattern is in dispute. A larger, undisputed pattern called supergranulation is a network of outward velocity flows, each about 30,000 kilometres across, which is probably tied to the big convective zone rather than to the relatively small granules. The flow concentrates the surface magnetic fields to the supergranulation-cell boundaries, creating a network of magnetic-field elements.",
  "The photospheric magnetic fields extend up into the atmosphere, where the supergranular pattern dominates the conducting gas . While the temperature above the average surface areas continues to drop, it does not fall as rapidly as at the network edges, and a picture of the Sun at a wavelength absorbed somewhat above the surface shows the network edges to be bright. This occurs throughout the ultraviolet .",
  "   Fraunhofer was the first to observe the solar spectrum, finding emission in all colours with many dark lines at certain wavelengths. He assigned letters to these lines, by which some are still known, such as the D-lines of sodium , the G-band, and the K-lines of ionized calcium . But it was the German physicist Gustav R. Kirchhoff who explained the meaning of the lines, explaining that the dark lines formed in cooler upper layers, absorbing the light emerging from below. By comparing these lines with laboratory data, we can identify the elements responsible and their state of ionization and excitation.",
  "The spectral lines seen are those expected to be common at 6,000 K, where the thermal energy of each particle is about 0.5 volt. The most abundant elements, hydrogen and helium, are difficult to excite, while atoms such as iron , sodium , and calcium have many lines easily excited at this temperature. When Cecilia Payne, a British-born graduate student studying at Harvard College Observatory in Cambridge , Massachusetts, U.S., recognized the great abundance of hydrogen and helium in 1925, she was persuaded by her elders to mark the result as spurious; only later was the truth recognized. The strongest lines in the visible spectrum are the H- and K- (Fraunhofer’s letters) lines of ionized calcium. This happens because calcium is easily ionized, and these lines represent transitions in which energy is absorbed by ions in the ground, or lowest energy, state. In the relatively low density of the photosphere and higher up, where atoms are only illuminated from below, the electrons tend to fall to the ground state, since excitation is low. The sodium D-lines are weaker than Ca K because most of the sodium is ionized and does not absorb radiation.",
  "The intensity of the lines is determined by both the abundance of the particular element and its state of ionization, as well as by the excitation of the atomic energy level involved in the line. By working backward one can obtain the abundance of most of the elements in the Sun. This set of abundances occurs with great regularity throughout the universe; it is found in such diverse objects as quasars , meteorites , and new stars. The Sun is roughly 90 percent hydrogen by number of atoms and 9.9 percent helium. The remaining atoms consist of heavier elements, especially carbon , nitrogen , oxygen , magnesium , silicon , and iron, making up only 0.1 percent by number.",
  "The ordinary solar spectrum is produced by the photosphere; during an eclipse the brilliant photosphere is blocked out by the Moon and three objects are visible: (1) a thin, pink ring around the edge of the Sun called the chromosphere , (2) a pearly, faint halo extending a great distance, known as the corona , and (3) pink clouds of gas called prominences suspended above the surface. When flash spectra (spectra of the atmosphere during an eclipse) were first obtained, astronomers found several surprising features. First, instead of absorption lines they saw emission lines (bright lines at certain wavelengths with nothing between them). This effect arises because the chromosphere is transparent between the spectrum lines, and only the dark sky is seen. Second, they discovered that the strongest lines were due to hydrogen, yet they still did not appreciate its high abundance. Finally, the next brightest lines had never been seen before; because they came from the Sun, the unknown source element came to be called helium. Later, helium was found on Earth.",
  "  The chromosphere represents the dynamic transition between the cool temperature minimum of the outer photosphere and the diffuse million-degree corona above. It derives its name and pink colour from the red Hα line of hydrogen at 6562.8 angstroms (Å); 1 Å = 10 −10 metre. Because this line is so strong, it is the best means for studying the chromosphere. For this reason special monochromators are widely used to study the Sun in a narrow wavelength band. Because density decreases with height more rapidly than magnetic field strength, the magnetic field dominates the chromospheric structure, which reflects the extension of the photospheric magnetic fields. The rules for this interplay are simple: every point in the chromosphere where the magnetic field is strong and vertical is hot and hence bright, and every place where it is horizontal is dark. Supergranulation, which concentrates the magnetic field on its edges, produces a chromospheric network of bright regions of enhanced magnetic fields.",
  "The most prominent structures in the chromosphere, especially in the limb, are the clusters of jets, or streams, of plasma called spicules . Spicules extend up to 10,000 kilometres above the surface of the Sun. Because it strongly emits the high-excitation lines of helium, the chromosphere was originally thought to be hot. But radio measurements, a particularly accurate means of measuring the temperature, show it to be only 8,000 K, somewhat hotter than the photosphere. Detailed radio maps show that hotter regions coincide with stronger magnetic fields. Both hot and cold regions extend much higher than one might expect, tossed high above the surface by magnetic and convective action.",
  "  When astronomers observe the Sun from space at ultraviolet wavelengths, the chromosphere is found to emit lines formed at high temperatures, spanning the range from 10,000 to 1,000,000 K. The whole range of ionization of an atom can be found: for example, oxygen I (neutral) is found in the photosphere, oxygen II through VI (one to five electrons removed) in the chromosphere, and oxygen VII and VIII in the corona. This entire series occurs in a height range of about 5,000 kilometres. An image of the corona obtained at ultraviolet wavelengths has a much more diffuse appearance as compared with lower temperature regions, suggesting that the hot material in the magnetic elements spreads outward with height to occupy the entire coronal space. Interestingly, the emission of helium, which was the original clue that the temperature increased upward, is not patchy but uniform. This occurs because the helium atoms are excited by the more diffuse and uniform X-ray emission from the hot corona.",
  "The structure of the chromosphere changes drastically with local magnetic conditions. At the network edges, clusters of spicules project from the clumps of magnetic field lines. Around sunspots, larger field clumps called plage occur ( see below ), where there are no spicules, but where the chromosphere is generally hotter and denser. In the areas of prominences the magnetic field lines are horizontal and spicules are absent.",
  "    Another important set of unknown lines revealed during an eclipse came from the corona, and so its source element was called coronium. In 1940 the source of the lines was identified as weak magnetic dipole transitions in various highly ionized atoms such as iron X (iron with nine electrons missing), iron XIV, and calcium XV, which can exist only if the coronal temperature is about 1,000,000 K. These lines can only be emitted in a high vacuum. The strongest are from iron, which alerted investigators to its high abundance, nearly equal to that of oxygen. Later it was found that there had been errors in prior photospheric determinations.",
  "  While the corona is one million times fainter than the photosphere in visible light (about the same as the full Moon at its base and much fainter at greater heights), its high temperature makes it a powerful source of extreme ultraviolet and X-ray emission. Loops of bright material connect distant magnetic fields. There are regions of little or no corona called coronal holes. The brightest regions are the active regions surrounding sunspots. Hydrogen and helium are entirely ionized, and the other atoms are highly ionized. The ultraviolet portion of the spectrum is filled with strong spectral lines of the highly charged ions. The density at the base of the corona is about 4 × 10 8 atoms per cubic centimetre, 10 13 times more tenuous than the atmosphere of Earth at its base. Because the temperature is high, the density drops slowly, by a factor of e (2.718) every 50,000 kilometres.",
  " Radio telescope s are particularly valuable for studying the corona because radio waves will propagate only when their frequency exceeds the so-called plasma frequency of the local medium. The plasma frequency varies according to the density of the medium, and so measurements of each wavelength tell us the temperature at the corresponding density. At higher frequencies (above 1,000 MHz) electron absorption is the main factor, and at those frequencies the temperature is measured at the corresponding absorbing density. All radio frequencies come to us from above the photosphere; this is the prime way of determining atmospheric temperatures.",
  "Similarly, all of the ultraviolet and X-ray emission of the Sun comes from the chromosphere and corona, and the presence of such layers can be detected in stars by measuring their spectra at these wavelengths.",
  "The conductivity of a hot ionized plasma is extremely high, and the coronal temperature decreases only as the  2  7  power of the distance from the Sun. Thus, the temperature of the interplanetary medium is still more than 200,000 K near Earth. While the gravitational force of the Sun can hold the hot material near the surface, at a distance of 5 R  ☉ the gravitational force is 25 times less, but the temperature is only 40 percent less. Therefore, a continuous outflow of particles known as the solar wind occurs, except where hindered by magnetic fields. The solar wind flows along a spiral path dictated by magnetic fields carried out from the Sun into the interplanetary medium.",
  "There are two solar winds: a fast, uniform, and steady wind, blowing at 800 km (500 miles) per second, and a slow, gusty, and sporadic wind, with about half the speed of the fast one. The two winds originate at different places on the Sun and accelerate to terminal velocity at different distances from it. The distribution of the two solar wind sources depends on the 11-year solar activity cycle.",
  "Where magnetic fields are strong, the coronal material cannot flow outward and becomes trapped; thus the high density and temperature above active regions is due partly to trapping and partly to heating processes, mostly solar flares . Where the magnetic field is open, the hot material escapes, and a coronal hole results. Analysis of solar wind data shows that coronal holes at the equator are associated with high-velocity streams in the solar wind, and recurrent geomagnetic storms are associated with the return of these holes.",
  "  The solar wind drags magnetic field lines out from the surface. Traveling at a speed of 500 kilometres per second, particles will reach the orbit of Saturn in one solar rotation—27 days—but in that time period the source on the Sun will have gone completely around. In other words, the magnetic field lines emanating from the Sun describe a spiral. It takes four days for the solar wind to arrive at Earth, having originated from a point that has rotated about 50° west (13° per day) from its original position facing Earth. The magnetic field lines, which do not break, maintain this path, and the plasma moves along them. The solar wind flow has a continual effect on the upper atmosphere of Earth. The total mass, magnetic field, and angular momentum carried away by the solar wind is insignificant, even over the lifetime of the Sun. A higher level of activity in the past, however, might have played a role in the Sun’s evolution, and stars larger than the Sun are known to lose considerable mass through such processes.",
  "As the solar wind spreads out into an increasing volume, its density and pressure become less. Eventually the pressure of the solar wind becomes comparable to that of the interstellar medium. The termination shock, where the solar wind slows because it encounters the interstellar medium, has been measured at about 94 and 84 AU by the Voyager 1 and 2 spacecraft, respectively. (For comparison, Neptune is the farthest planet from the Sun at a distance of 30 AU.)",
  "Since the discovery of the nature of the corona, such low-density superhot plasmas have been identified throughout the universe: in the atmospheres of other stars, in supernova remnants , and in the outer reaches of galaxies . Low-density plasmas radiate so little that they can reach and maintain high temperatures. By detecting excess helium absorption or X-ray emission in stars like the Sun, researchers have found that coronas are quite common. Many stars have coronas far more extensive than that of the Sun.",
  "It is speculated that the high coronal temperature results from boundary effects connected with the steeply decreasing density at the solar surface and the convective currents beneath it. Stars without convective activity do not exhibit coronas. The magnetic fields facilitate a “crack-of-the-whip” effect, in which the energy of many particles is concentrated in progressively smaller numbers of ions. The result is the production of the high temperature of the corona. The key factor is the extremely low density, which hampers heat loss. The corona is a harder vacuum than anything produced on Earth.",
  "  A wonderful rhythm in the ebb and flow of sunspot activity dominates the atmosphere of the Sun. Sunspots , the largest of which can be seen even without a telescope , are regions of extremely strong magnetic field found on the Sun’s surface. A typical mature sunspot is seen in white light to have roughly the form of a daisy. It consists of a dark central core, the umbra, where the magnetic flux loop emerges vertically from below, surrounded by a less-dark ring of fibrils called the penumbra, where the magnetic field spreads outward horizontally.",
  "   George Ellery Hale observed the sunspot spectrum in the early 20th century with his new solar telescope and found it similar to that of cool red M-type stars observed with his new stellar telescope. Thus, he showed that the umbra appears dark because it is quite cool, only about 3,000 K, as compared with the 5,800 K temperature of the surrounding photosphere . The spot pressure , consisting of magnetic and gas pressure, must balance the pressure of its surroundings; hence the spot must somehow cool until the inside gas pressure is considerably lower than that of the outside. Owing to the great magnetic energy present in sunspots, regions near the cool spots actually have the hottest and most intense activity. Sunspots are thought to be cooled by the suppression of their strong fields with the convective motions bringing heat from below. For this reason, there appears to be a lower limit on the size of the spots of approximately 500 kilometres. Smaller ones are rapidly heated by radiation from the surroundings and destroyed.",
  "Although the magnetic field suppresses convection and random motions are much lower than in the surroundings, a wide variety of organized motions occur in spots, mostly in the penumbra, where the horizontal field lines permit detectable horizontal flows. One such motion is the Evershed effect, an outward flow at a rate of one kilometre per second in the outer half of the penumbra that extends beyond the penumbra in the form of moving magnetic features. These features are elements of the magnetic field that flow outward across the area surrounding the spot. In the chromosphere above a sunspot, a reverse Evershed flow appears as material spirals into the spot; the inner half of the penumbra flows inward to the umbra.",
  "Oscillations are observed in sunspots as well. When a section of the photosphere known as a light bridge crosses the umbra, rapid horizontal flow is seen. Although the umbral field is too strong to permit motion, rapid oscillations called umbral flashes appear in the chromosphere just above, with a 150-second period. In the chromosphere above the penumbra, so-called running waves are observed to travel radially outward with a 300-second period.",
  "  Most frequently, sunspots are seen in pairs, or in groups of pairs, of opposite polarity, which correspond to clusters of magnetic flux loops intersecting the surface of the Sun. Sunspots of opposite polarity are connected by magnetic loops that arch up into the overlying chromosphere and low corona. The coronal loops can contain dense, hot gas that can be detected by its X-ray and extreme ultraviolet radiation .",
  "  The members of a spot pair are identified by their position in the pair with respect to the rotation of the Sun; one is designated as the leading spot and the other as the following spot. In a given hemisphere (north or south), all spot pairs typically have the same polar configuration—e.g., all leading spots may have northern polarity, while all following spots have southern polarity ( see below ). A new spot group generally has the proper polarity configuration for the hemisphere in which it forms; if not, it usually dies out quickly. Occasionally, regions of reversed polarity survive to grow into large, highly active spot groups. An ensemble of sunspots, the surrounding bright chromosphere, and the associated strong magnetic field regions constitute what is termed an active region. Areas of strong magnetic fields that do not coalesce into sunspots form regions called plages, which are prominent in the red Hα line and are also visible in continuous light near the limb.",
  "The emergence of a new spot group emphasizes the three-dimensional structure of the magnetic loop. First we see a small brightening (called an emerging flux region [EFR]) in the photosphere and a greater one in the chromosphere. Within an hour, two tiny spots of opposite polarity are seen, usually with the proper magnetic polarities for that hemisphere. The spots are connected by dark arches (arch filaments) outlining the magnetic lines of force. As the loop rises, the spots spread apart and grow, but not symmetrically. The preceding spot moves westward at about 1 kilometre per second, while the follower is more or less stationary. A number of additional small spots, or pores, appear. The preceding pores then merge into a larger spot, while the following spot often dies out. If the spots separate farther, an EFR remains behind in the centre, and more flux emerges. But large growth usually depends on more EFRs, i.e., flux loops emerging near the main spots. In every case the north and south poles balance, since there are no magnetic monopoles.",
  "Solar activity tends to occur over the entire surface of the Sun between +/−40° latitude in a systematic way, supporting the idea that the phenomenon is global. While there are sizable variations in the progress of the activity cycle, overall it is impressively regular, indicating a well-established order in the numbers and latitudinal positions of the spots. At the start of a cycle, the number of groups and their size increase rapidly until a maximum in number (known as sunspot maximum) occurs after about two or three years and a maximum in spot area about one year later. The average lifetime of a medium-sized spot group is about one solar rotation, but a small emerging group may only last a day. The largest spot groups and the greatest eruptions usually occur two or three years after the maximum of the sunspot number. At maximum there might be 10 groups and 300 spots across the Sun, but a huge spot group can have 200 spots in it. The progress of the cycle may be irregular; even near the maximum the number may temporarily drop to low values.",
  "  The sunspot cycle returns to a minimum after approximately 11 years. At sunspot minimum there are at most a few small spots on the Sun, usually at low latitudes, and there may be months with no spots at all. New-cycle spots begin to emerge at higher latitudes, between 25° and 40°, with polarity opposite the previous cycle. The new-cycle spots at high latitude and old-cycle spots at low latitude may be present on the Sun at once. The first new-cycle spots are small and last only a few days. Since the rotation period is 27 days (longer at higher latitudes), these spots usually do not return, and newer spots appear closer to the equator. For a given 11-year cycle, the magnetic polarity configuration of the spot groups is the same in a given hemisphere and is reversed in the opposite hemisphere. The magnetic polarity configuration in each hemisphere reverses in the next cycle. Thus, new spots at high latitudes in the northern hemisphere may have positive polarity leading and negative following, while the groups from the previous cycle, at low latitude, will have the opposite orientation. As the cycle proceeds, the old spots disappear, and new-cycle spots appear in larger numbers and sizes at successively lower latitudes. The latitude distribution of spots during a given cycle occurs in a butterfly-like pattern called the butterfly diagram",
  "Since the magnetic polarity configuration of the sunspot groups reverses every 11 years, it returns to the same value every 22 years, and this length is considered to be the period of a complete magnetic cycle. At the beginning of each 11-year cycle, the overall solar field, as determined by the dominant field at the pole, has the same polarity as the following spots of the previous cycle. As active regions are broken apart, the magnetic flux is separated into regions of positive and negative sign. After many spots have emerged and died out in the same general area, large unipolar regions of one polarity or the other appear and move toward the Sun’s corresponding pole. During each minimum the poles are dominated by the flux of the following polarity in that hemisphere, and that is the field seen from Earth. But if all magnetic fields are balanced, how can the magnetic fields be separated into large unipolar regions that govern the polar field? No answer has been found to this question. Owing to the differential rotation of the Sun, the fields approaching the poles rotate more slowly than the sunspots, which at this point in the cycle have congregated in the rapidly rotating equatorial region. Eventually the weak fields reach the pole and reverse the dominant field there. This reverses the polarity to be taken by the leading spots of the new spot groups, thereby continuing the 22-year cycle.",
  "While the sunspot cycle has been quite regular for some centuries, there have been sizable variations. In the period 1955–70 there were far more spots in the northern hemisphere, while in the 1990 cycle they dominated in the southern hemisphere. The two cycles that peaked in 1946 and 1957 were the largest in history. The English astronomer E. Walter Maunder found evidence for a period of low activity, pointing out that very few spots were seen between 1645 and 1715. Although sunspots had been first detected about 1600, there are few records of spot sightings during this period, which is called the Maunder minimum . Experienced observers reported the occurrence of a new spot group as a great event, mentioning that they had seen none for years. After 1715 the spots returned. This period was associated with the coldest period of the long cold spell in Europe that extended from about 1500 to 1850 and is known as the Little Ice Age. However, cause and effect have not been proved. There is some evidence for other such low-activity periods at roughly 500-year intervals. When solar activity is high, the strong magnetic fields carried outward by the solar wind block out the high-energy galactic cosmic rays approaching Earth, and less carbon-14 is produced. Measurement of carbon-14 in dated tree rings confirms the low activity at this time. Still, the 11-year cycle was not detected until the 1840s, so observations prior to that time were somewhat irregular.",
  "The origin of the sunspot cycle is not known. Because there is no reason that a star in radiative equilibrium should produce such fields, it is reasoned that relative motions in the Sun twist and enhance magnetic flux loops. The motions in the convective zone may contribute their energy to magnetic fields, but they are too chaotic to produce the regular effects observed. The differential rotation, however, is regular, and it could wind existing field lines in a regular way; hence, most models of the solar dynamo are based on the differential rotation in some respect. The reason for the differential rotation also remains unknown.",
  "Besides sunspots, there exist many tiny spotless dipoles called ephemeral active regions, which last less than a day on average and are found all over the Sun rather than just in the spot latitudes. The number of active regions emerging on the entire Sun is about two per day, while ephemeral regions occur at a rate of about 600 per day. Therefore, even though the ephemeral regions are quite small, at any one time they may constitute most of the magnetic flux erupting on the Sun. However, because they are magnetically neutral and quite small, they probably do not play a role in the cycle evolution and the global field pattern.",
  "   Prominences are among the most beautiful of solar phenomena. They are the analogues of clouds in Earth’s atmosphere , but they are supported by magnetic fields, rather than by thermal currents as clouds are. Because the plasma of ions and electrons that makes up the solar atmosphere cannot cross magnetic field lines in regions of horizontal magnetic fields, material is supported against gravity . This occurs at the boundaries between one magnetic polarity and its opposite, where the connecting field lines reverse direction. Thus, prominences are reliable indicators of sharp field transitions. (The fields are either up or down; tilted fields are unusual.) As with the chromosphere, prominences are transparent in white light and, except during total eclipses , must be viewed in Hα. At eclipse the red Hα line lends a beautiful pink to the prominences visible at totality. The density of prominences is much lower than that of the photosphere; there are few collisions to generate radiation. Prominences absorb radiation from below and emit it in all directions, a process called pure scattering . The visible light emitted toward Earth at the limb has been removed from the upward beam, so the prominences appear dark against the disk. But the sky is darker still, so they appear bright against the sky. The temperature of prominences is 5,000–50,000 K. In the past, when radiative processes were not well understood, prominences seen dark against the disk were called filaments.",
  "  There are two basic types of prominences: (1) quiescent, or long-lived, and (2) transient. The former are associated with large-scale magnetic fields, marking the boundaries of unipolar magnetic regions or sunspot groups. Because the large unipolar plates are long-lived, the quiescent prominences are as well. These prominences may have varied forms—hedgerows, suspended clouds, or funnels—but they always take the form of two-dimensional suspended sheets. Stable filaments often become unstable and erupt, but they may also just fade away. Few quiescent prominences live more than a few days, but new ones may form on the magnetic boundary.",
  "The equilibrium of the longer lived prominences is indeed curious. While one might expect them to eventually fall down, they always erupt upwards. This is because all unattached magnetic fields have a tremendous buoyancy and attempt to leave the Sun. When they do escape, they produce not only a splendid sight but also a transient shock wave in the corona called a coronal mass ejection, which can cause important geomagnetic effects.",
  "Transient prominences are an integral part of solar activity. Sprays are the disorganized mass of material ejected by a flare. Surges are collimated streams of ejecta connected with small flares. In both cases some of the material returns to the surface. Loop prominences are the aftermath of flares. In the flare process a barrage of electrons heats the surface to millions of degrees and a hot (more than 10 million K), dense coronal cloud forms. This emits very strongly, cooling the material, which then, since there is no magnetic support, descends to the surface in elegant loops, following the magnetic lines of force.",
  "The spectrum of prominences seen against the sky reflects their history. Quiescent prominences have no source of energy except some conduction from the corona , which is a small effect because heat cannot cross the field lines. The spectrum is similar to the chromosphere, except in the chromosphere, spicule motions produce broad lines, while the prominence lines are quite narrow until they erupt, indicating little internal motion. Surges and sprays also usually display low excitation because they are often cool material seized and ejected by magnetic forces. Loop prominences, on the other hand, are cooling from a very hot post-flare coronal condensation and have just become visible. Thus, they show high-excitation lines of ionized helium and strong ultraviolet emission, as befits a gas at 30,000 to 100,000 K.",
  "  The most spectacular phenomenon related to sunspot activity is the solar flare , which is an abrupt release of magnetic energy from the sunspot region. Despite the great energy involved, most flares are almost invisible in ordinary light because the energy release takes place in the transparent atmosphere, and only the photosphere, which relatively little energy reaches, can be seen in visible light. Flares are best seen in the Hα line, where the brightness may be 10 times that of the surrounding chromosphere, or 3 times that of the surrounding continuum. In Hα a big flare will cover a few thousandths of the Sun’s disk, but in white light only a few small bright spots appear. The energy released in a great flare can reach 10 33 ergs, which is equal to the output of the entire Sun in 0.25 second. Most of this energy is initially released in high-energy electrons and protons, and the optical emission is a secondary effect caused by the particles impacting the chromosphere.",
  "  There is a wide range of flare size, from giant events that shower Earth with particles to brightenings that are barely detectable. Flares are usually classified by their associated flux of X-rays having wavelengths between one and eight angstroms: C n , M n , or X n for flux greater than 10 −6 , 10 −5 , and 10 −4 watts per square metre (W/m 2 ), respectively, where the integer n gives the flux for each power of 10. Thus, M3 corresponds to a flux of 3 × 10 −5 W/m 2 at Earth. This index is not linear in flare energy since it measures only the peak, not the total, emission. The energy released in the three or four biggest flares each year is equivalent to the sum of the energies produced in all the small flares. A flare can be likened to a giant natural synchrotron accelerating vast numbers of electrons and ions to energies above 10,000 electron volts (keV) and protons to more than a million electron volts (MeV). Almost all the flare energy initially goes into these high-energy particles, which subsequently heat the atmosphere or travel into interplanetary space. The electrons produce X-ray bursts and radio bursts and also heat the surface. The protons produce gamma-ray lines by collisionally exciting or splitting surface nuclei . Both electrons and protons propagate to Earth; the clouds of protons bombard Earth in big flares. Most of the energy heats the surface and produces a hot (40,000,000 K) and dense cloud of coronal gas, which is the source of the X-rays. As this cloud cools, the elegant loop prominences appear and rain down to the surface.",
  "The kinds of particles produced by flares vary somewhat with the place of acceleration. There are not enough particles between the Sun and Earth for ionizing collisions to occur, so they preserve their original state of ionization. Particles accelerated in the corona by shock waves show a typical coronal ionization of 2,000,000 K. Particles accelerated in the flare body show a much higher ionization and remarkably high concentrations of He 3 , a rare He isotope with only one neutron .",
  "Because flares generally occur in strong magnetic fields, it was natural to look for magnetic changes associated with them. The Russian astronomer A.B. Severny was the first to apply the newly developed Babcock magnetograph to this task. He found that the optical flares occur along neutral lines—i.e., boundaries between regions of opposite magnetic polarity. Actually this property is dictated by the fact that flares occur above the surface, that the energy flows down along lines of force, and that all magnetic lines of force have two ends, leading from north to south poles.",
  "Because flare-monitoring telescopes were generally poor, it was not until 1960 that the German astronomer Horst Künzel recognized that a special kind of spot, called a δ spot, was responsible for most flares. While most sunspots have a single magnetic polarity, a δ spot has two or more umbras of opposite polarity within the same penumbra. Squeezing these spots together leads to a steep magnetic gradient, which stores energy and produces flares. Originally it was very difficult to detect the magnetic changes because it is the transverse (horizontal) component of the field that changes, and the horizontal field, perpendicular to the line of sight, is most difficult to measure. Most magnetographs are built for occasional use, but since the flare cannot be predicted, continuous observation is required. Change in the horizontal field can be measured with an ordinary continuous magnetograph when the flare is at the edge of the Sun, so the transverse field points at Earth and is easily measured. Magnetic fields have a minimum energy state called a potential field, which is smooth and without steep gradients. When the field is twisted or sheared by material motion, additional energy is stored in electrical currents sustaining these fields, and the energy is cataclysmically released in flares. Impulsive flares are accompanied by outward explosion and ejection of material; the material may be carried away with the erupting magnetic field or may be ejected by the high pressure in the flare. The highest recorded speed is 1,500 kilometres per second, but 100–300 kilometres per second is more typical. Great clouds of coronal material are blown out; these make up a substantial fraction of the solar wind.",
  "Since the main energy release in flares is the acceleration of electrons, imaging this process shows where it takes place. While the data are sketchy, it appears that the initial energy release is above the magnetic neutral line. The electrons travel down field lines and produce bright ribbons on the surface, from which material boils up and produces the soft X-ray source, a cloud with a temperature up to 50,000,000 K. The energetic protons bombard the surface and produce a number of important nuclear reactions , which radiate gamma rays in both lines and a continuum . Among the most important lines are the positron-electron annihilation line at 0.5 MeV and the neutron-proton capture (forming a deuteron ) at 2.2 MeV, as well as a number of nuclear excitation lines produced by protons incident on heavier nuclei. These lines are a powerful tool for flare analysis.",
  "Most of the great flares occur in a small number of superactive large sunspot groups. The groups are characterized by a large cluster of spots of one magnetic polarity surrounded by the opposite polarity. Although the occurrence of flares can be predicted from the presence of such spots, researchers cannot predict when these mighty regions will emerge from below the surface, nor do they know what produces them. Those that we see form on the disk usually develop complexity by successive eruption of different flux loops. This is no accident, however; the flux loop is already complex below the surface.",
  " Discovery  Besides providing light and heat, the Sun affects Earth through its ultraviolet radiation, the steady stream of the solar wind, and the particle storms of great flares. The near-ultraviolet radiation from the Sun produces the ozone layer , which in turn shields the planet from such radiation. The other effects, which give rise to effects on Earth called space weather , vary greatly. The soft (long-wavelength) X-rays from the solar corona produce those layers of the ionosphere that make short-wave radio communication possible. When solar activity increases, the soft X-ray emission from the corona (slowly varying) and flares (impulsive) increases, producing a better reflecting layer but eventually increasing ionospheric density until radio waves are absorbed and shortwave communications are hampered. The harder (shorter wavelength) X-ray pulses from flares ionize the lowest ionospheric layer (D-layer), producing radio fade-outs. Earth’s rotating magnetic field is strong enough to block the solar wind, forming the magnetosphere, around which the solar particles and fields flow. On the side opposite to the Sun, the field lines stretch out in a structure called the magnetotail. When shocks arrive in the solar wind, a short, sharp increase in the field of Earth is produced. When the interplanetary field switches to a direction opposite Earth’s field, or when big clouds of particles enter it, the magnetic fields in the magnetotail reconnect and energy is released, producing the aurora borealis (northern lights). Each time a big coronal hole faces Earth , the solar wind is fast, and a geomagnetic storm occurs. This produces a 27-day pattern of storms that is especially prominent at sunspot minimum. Big flares and other eruptions produce coronal mass ejections , clouds of energetic particles that form a ring current around the magnetosphere , which produces sharp fluctuations in Earth’s field, called geomagnetic storms. These phenomena disturb radio communication and create voltage surges in long-distance transmission lines and other long conductors.",
  "Perhaps the most intriguing of all terrestrial effects are the possible effects of the Sun on the climate of Earth. The Maunder minimum seems well established, but there are few other clear effects. Yet most scientists believe an important tie exists, masked by a number of other variations.",
  "Because charged particles follow magnetic fields, corpuscular radiation is not observed from all big flares but only from those favourably situated in the Sun’s western hemisphere. The solar rotation makes the lines of force from the western side of the Sun (as seen from Earth) lead back to Earth, guiding the flare particles there. These particles are mostly protons because hydrogen is the dominant constituent of the Sun. Many of the particles are trapped in a great shock front that blows out from the Sun at 1,000 kilometres per second. The flux of low-energy particles in big flares is so intense that it endangers the lives of astronauts outside the terrestrial magnetic field.",
  " Istoria e dimostrazioni intorno alle macchie solari e loro accidenti  Rosa Ursina   The existence of features on the Sun was known from the records of sunspots observed by ancient astronomers with the naked eye; however, no systematic studies were made of such features until the telescope was invented in the early 17th century. The Italian scientist Galileo Galilei and the German mathematician Christoph Scheiner were among the first to make telescopic observations of sunspots. Scheiner’s drawings in the Rosa Ursina are of almost modern quality, and there was little improvement in solar imaging until 1905. In the 1670s the British astronomer John Flamsteed and the French astronomer Gian Domenico Cassini calculated the distance to the Sun. Sir Isaac Newton set forth the role of the Sun as the centre of attraction of the known planetary system.",
  "  While the quality of observations was good, consistent observation was lacking. The sunspot cycle , a huge effect, was not discovered until 1843 by Samuel Heinrich Schwabe . The German amateur astronomer was looking for a planet inside the orbit of Mercury and made careful daily drawings to track its passage across the face of the Sun. Instead he found that the number of sunspots varied with a regular period. The Swiss astronomer Rudolf Wolf confirmed Schwabe’s discovery by searching through previous reports of sunspots and established the period as 11 years. Wolf also introduced what is termed the Zurich relative sunspot number, a value equal to the sum of the spots plus 10 times the number of groups, which is still used today. Much of the work at this time was carried out by wealthy amateurs such as Richard Christopher Carrington of Britain , who built a private observatory and discovered the differential rotation and the equatorward drift of activity during a sunspot cycle. He also was the first (with another Englishman, R. Hodgson) to observe a solar flare . Photographic monitoring began in 1860, and soon spectroscopy was applied to the Sun, so the elements present and their physical state could begin to be investigated. In the early part of the 19th century, Fraunhofer mapped the solar spectrum. At the end of the 19th century, spectroscopy carried out during eclipses revealed the character of the atmosphere, but the million-degree coronal temperature was not established until observations of coronal spectral lines were made in 1940 by the German astrophysicist Walter Grotrian.",
  "In 1891, while he was a senior at the Massachusetts Institute of Technology in Cambridge, Massachusetts, George Ellery Hale invented the spectroheliograph, which can be used to take pictures of the Sun in any single wavelength. After using the instrument on the great Yerkes refractor in Williams Bay, Wisconsin, U.S., Hale developed the Mount Wilson Observatory in California and built the first solar tower telescopes there. Prior to the construction of the Mount Wilson facility, all solar observatories were located in cloudy places, and long-term studies were not possible. Hale discovered the magnetic fields of sunspots by observing the splitting of their spectral lines into a number of components; this splitting, known as the Zeeman effect , occurs in the presence of a strong magnetic field. By continuously studying the spots for two cycles, he discovered, with the American astronomer Seth Barnes Nicholson , the law of sunspot polarities. Later, in 1953, the American father-and-son team of astronomers Harold and Horace Babcock , working with the same instruments, developed the magnetograph, with which the polar field was detected. In the 1930s the French astronomer Bernard Lyot introduced the coronagraph , which made possible spectral observations of the corona when the Sun is not in eclipse, and the birefringent filter, which permitted two-dimensional monochromatic images. With the Lyot filter, cinematography of the solar activity of magnetic and velocity fields became a reality. In the 1960s the American astronomer Robert Leighton modified Hale’s spectroheliograph so that it could measure both velocities and magnetic fields and with it discovered solar oscillations.",
  "After 1950, new observatories were established in areas that were less cloudy. By 1960 astronomers realized that these sites not only had to be clear but that they also had to have stable air. By locating observatories near lakes and by employing electronic imaging and vacuum telescopes, astronomers were able to make new, higher-resolution observations. In 1969 the movement began with the Aerospace Corporation Observatory (now the San Fernando Observatory) and the Big Bear Solar Observatory, both in California. Free of ground effects, these observatories achieved a new level of stable images and were soon followed by lake-sited solar observatories in India and China.",
  "An entirely new dimension of solar studies was initiated by the space age. With one or two exceptions, all of the important spectral lines from the chromosphere and corona are in the ultraviolet , and since the photosphere is relatively weak in the ultraviolet, it is easy to disentangle the images of the upper layer from the powerful visible radiation of the photosphere. Moreover, satellites sampling the solar particles have the ability to monitor directly solar waves and particles that do not reach the ground. However, the task is not easy. Ultraviolet optics demanded special coatings and films (now charge-coupled devices) for observing. Special solar trackers were required to keep the image steady, and good telemetry was needed for the large data flow. For the corona, special coronagraphs were developed, with a series of occulting disks in front of an ultraclean lens. For X-rays , a high rate of photon detections per unit time was required to avoid early problems with pulse pile-up. The development of instruments to study the Sun also benefited the creation of satellites that explored beyond the solar system .",
  "The U.S. Orbiting Solar Observatory series of satellites (OSO 1–8, launched from 1962 to 1975) made the first observations of X-rays and gamma rays from solar flares . They also were the first to observe gamma rays emitted from nuclear reactions in flares and to use an externally occulted coronagraph to view coronal mass ejections. A huge advance in resolution came with Skylab , a manned U.S. space station that used leftover hardware from the Apollo project. Skylab produced the first high-resolution images in the ultraviolet lines as well as the first X-ray images of the corona. The Skylab images displayed the coronal holes for the first time, and the timing of their disk passage showed their role as a source of high-speed solar wind streams and geomagnetic disturbances.",
  "  The next important spacecraft was the U.S. Solar Maximum Mission (SMM), launched in 1980. New technological developments permitted greatly improved data, particularly on the solar-cycle dependence of the solar constant . Hard X-ray data could be obtained without saturation. In 1981 SMM’s attitude control system malfunctioned, and the SMM mission was suspended until 1984 when it was repaired by the space shuttle  Challenger .",
  "Japan launched two very successful satellites, Hinotori and Yohkoh , in 1981 and 1991, respectively. Hinotori obtained the first measurements of a superthermal (30,000,000–40,000,000 K) cloud produced by solar flares, which is the source of the soft X-ray burst accompanying all solar flares. Yohkoh produced continuous images of the corona in soft X-rays, detected and located hard X-ray bursts, and produced important soft X-ray spectra.",
  "  The European Space Agency spacecraft Ulysses , launched in 1990, was the first space probe to travel in a polar orbit around the Sun. It discovered that the solar wind speed does not increase continuously toward the poles but rather levels off at high latitudes at 750 kilometres (450 miles) per second.",
  "There are several satellites actively observing the Sun. The U.S. satellites Solar and Heliospheric Observatory (SOHO) and Transition Region and Coronal Explorer (TRACE), launched in 1995 and 1998, respectively, have produced many important results. SOHO can observe the Sun continuously, and, among its many discoveries, it has found that sunspots are shallow and that the solar wind flows outward by waves in vibrating magnetic field lines. TRACE is a powerful tool for exploring the chromosphere-corona interface and has found that much of the heating in the corona takes place at its base. The Japanese spacecraft Hinode , launched in 2006, discovered magnetic waves in the solar chromosphere that drive the solar wind. The two spacecraft of the U.S. Solar Terrestrial Relations Observatory (STEREO) mission, also launched in 2006, form a 90° angle with the Sun in order to make stereoscopic images of it. The U.S. satellite Solar Dynamics Observatory (SDO), launched in 2010, carries three instruments that observe the Sun every 10–50 seconds to study changes that previously launched satellites were not able to observe.",
  "Popular works on the Sun include Michael J. Carlowicz and Ramon E. Lopez , Storms from the Sun: The Emerging Science of Space Weather (2002); Leon Golub and Jay M. Pasachoff , Nearest Star: The Surprising Science of Our Sun (2001); Kenneth R. Lang , The Cambridge Encyclopedia of the Sun (2001), and The Sun from Space , 2nd ed. (2009). Works of a more technical nature include Peter Foukal , Solar Astrophysics , 2nd ed. (2004); and Markus J. Aschwanden , Physics of the Solar Corona , 2nd ed. (2006)."
]