[
  " comet , a small body orbiting the Sun with a substantial fraction of its composition made up of volatile ices. When a comet comes close to the Sun, the ices sublimate (go directly from the solid to the gas phase) and form, along with entrained dust particles, a bright outflowing atmosphere around the comet nucleus known as a coma. As dust and gas in the coma flow freely into space, the comet forms two tails, one composed of ionized molecules and radicals and one of dust. The word comet comes from the Greek κομητης ( kometes ), which means “long-haired.” Indeed, it is the appearance of the bright coma that is the standard observational test for whether a newly discovered object is a comet or an asteroid .",
  "  Comets are among the most-spectacular objects in the sky, with their bright glowing comae and their long dust tails and ion tails. Comets can appear at random from any direction and provide a fabulous and ever-changing display for many months as they move in highly eccentric orbits around the Sun.",
  "Comets are important to scientists because they are primitive bodies left over from the formation of the solar system . They were among the first solid bodies to form in the solar nebula , the collapsing interstellar cloud of dust and gas out of which the Sun and planets formed. Comets formed in the outer regions of the solar nebula where it was cold enough for volatile ices to condense. This is generally taken to be beyond 5 astronomical units (AU; 748 million km, or 465 million miles), or beyond the orbit of Jupiter . Because comets have been stored in distant orbits beyond the planets, they have undergone few of the modifying processes that have melted or changed the larger bodies in the solar system. Thus, they retain a physical and chemical record of the primordial solar nebula and of the processes involved in the formation of planetary systems.",
  "A comet is made up of four visible parts: the nucleus, the coma, the ion tail, and the dust tail. The nucleus is a solid body typically a few kilometres in diameter and made up of a mixture of volatile ices (predominantly water ice) and silicate and organic dust particles. The coma is the freely escaping atmosphere around the nucleus that forms when the comet comes close to the Sun and the volatile ices sublimate, carrying with them dust particles that are intimately mixed with the frozen ices in the nucleus. The dust tail forms from those dust particles and is blown back by solar radiation  pressure to form a long curving tail that is typically white or yellow in colour. The ion tail forms from the volatile gases in the coma when they are ionized by ultraviolet photons from the Sun and blown away by the solar wind . Ion tails point almost exactly away from the Sun and glow bluish in colour because of the presence of CO + ions.",
  "Comets differ from other bodies in the solar system in that they are generally in orbits that are far more eccentric than those of the planets and most asteroids and far more inclined to the ecliptic (the plane of Earth ’s orbit). Some comets appear to come from distances of over 50,000 AU, a substantial fraction of the distance to the nearest stars . Their orbital periods can be millions of years in length. Other comets have shorter periods and smaller orbits that carry them from the orbits of Jupiter and Saturn inward to the orbits of the terrestrial planets. Some comets even appear to come from interstellar space, passing around the Sun on open, hyperbolic orbits, but in fact are members of the solar system.",
  "  Comets are typically named for their discoverers, though some comets (e.g., Halley and Encke ) are named for the scientists who first recognized that their orbits were periodic. The International Astronomical Union (IAU) prefers a maximum of two discoverers to be in a comet’s name. In some cases where a comet has been lost (its orbit was not determined well enough to predict its return), the comet is named for the original discoverer and also the observer(s) who found it again. A designation of “C/” before a comet’s name denotes that it is a long-period comet (period greater than 200 years), while “P/” denotes that the comet is periodic; i.e., it returns at regular, predictable intervals of fewer than 200 years. A designation of “D/” denotes that the comet is deceased or destroyed, such as D/Shoemaker-Levy 9 , the comet whose components struck Jupiter in July 1994. Numbers appearing before the name of a comet denote that it is periodic; the comets are numbered in the order that they are confirmed to be periodic. Comet “1P/Halley” is the first comet to be recognized as periodic and is named after English astronomer Edmond Halley , who determined that it was periodic. The designation “I” is used for interstellar objects such as ‘Oumuamua and Comet Borisov.",
  "In 1995 the IAU implemented a new identification system for each appearance of a comet, whether it is periodic or long-period. The system uses the year of the comet’s discovery, the half-month in the year denoted by a letter A through Y (with I omitted to avoid confusion), and a number signifying the order in which the comet was found within that half-month. Thus, Halley’s Comet is designated 1P/1682 Q1 when Halley saw it in August 1682, but 1P/1982 U1 when it was first spotted by astronomers before its predicted perihelion (point when closest to the Sun) passage in 1986. This identification system is similar to that now used for asteroid discoveries, though the asteroids are so designated only when they are first discovered. (The asteroids are later given official catalog numbers and names.) Formerly, a number after the name of a periodic comet denoted its order among comets discovered by that individual or group, but for new comets there would be no such distinguishing number.",
  "The Greek philosopher Aristotle thought that comets were dry exhalations of Earth that caught fire high in the atmosphere or similar exhalations of the planets and stars . However, the Roman philosopher Seneca thought that comets were like the planets, though in much larger orbits. He wrote:",
  "The man will come one day who will explain in what regions the comets move, why they diverge so much from the other stars, what is their size and their nature.",
  "Aristotle’s view won out and persisted until 1577, when Danish astronomer Tycho Brahe attempted to use parallax to triangulate the distance to a bright comet. Because he could not measure any parallax, Brahe concluded that the comet was very far away, at least four times farther than the Moon .",
  "Brahe’s student, German astronomer Johannes Kepler , devised his three laws of planetary motion using Brahe’s meticulous observations of Mars but was unable to fit his theory to the very eccentric orbits of comets. Kepler believed that comets traveled in straight lines through the solar system . The solution came from English scientist Isaac Newton , who used his new law of gravity to calculate a parabolic orbit for the comet of 1680. A parabolic orbit is open, with an eccentricity of exactly 1, meaning the comet would never return. (A circular orbit has an eccentricity of 0.) Any less-eccentric orbits are closed ellipses , which means a comet would return.",
  "  Newton was friends with English astronomer Edmond Halley , who used Newton’s methods to determine the orbits for 24 observed comets, which he published in 1705. All the orbits were fit with parabolas because the quality of the observations at that time was not good enough to determine elliptical or hyperbolic orbits (eccentricities greater than 1). But Halley noted that the comets of 1531, 1607, and 1682 had remarkably similar orbits and had appeared at approximately 76-year intervals. He suggested that it was really one comet in an approximately 76-year orbit that returned at regular intervals. Halley predicted that the comet would return again in 1758. He did not live to see his prediction come true, but the comet was recovered on Christmas Day, 1758, and passed closest to the Sun on March 13, 1759. The comet was the first recognized periodic comet and was named in Halley’s honour, Comet Halley .",
  "Halley also speculated whether comets were members of the solar system or not. Although he could only calculate parabolic orbits, he suggested that the orbits were actually eccentric and closed, writing:",
  "For so their Number will be determinate and, perhaps, not so very great. Besides, the Space between the Sun and the fix’d Stars is so immense that there is Room enough for a Comet to revolve tho’ the period of its Revolution be vastly long.",
  "  The German astronomer Johann Encke was the second person to recognize a periodic comet. He determined that a comet discovered by French astronomer Jean-Louis Pons in 1818 did not seem to follow a parabolic orbit. He found that the orbit was indeed a closed ellipse. Moreover, he showed that the orbital period of the comet around the Sun was only 3.3 years, still the shortest orbital period of any comet on record. Encke also showed that the same comet had been observed by French astronomer Pierre Méchain in 1786, by British astronomer Caroline Herschel in 1795, and by Pons in 1805. The comet was named in Encke’s honour, as Comet Halley was named for the astronomer who described its orbit.",
  "Encke’s Comet soon presented a new problem for astronomers. Because it returned so often, its orbit could be predicted precisely based on Newton’s law of gravity, with effects from gravitational perturbations by the planets taken into account. But Encke’s Comet repeatedly arrived about 2.5 hours too soon. Its orbit was slowly shrinking. The problem became even more complex when it was discovered that other periodic comets arrived too late. Those include the comets 6P/D’Arrest, 14P/Wolf 1, and even 1P/Halley, which typically returns about four days later than a purely gravitational orbit would predict.",
  "Several explanations were suggested for this phenomenon, such as a resisting interplanetary medium that caused the comet to slowly lose orbital energy. However, that idea could not explain comets whose orbits were growing, not shrinking. German mathematician and astronomer Friedrich Bessel suggested that expulsion of material from a comet near perihelion was acting like a rocket motor and propelling the comet into a slightly shorter- (or longer-) period orbit each time it passed close to the Sun. History would prove Bessel right.",
  "As the quality of the observations and mathematical techniques to calculate orbits improved, it became obvious that most comets were on elliptical orbits and thus were members of the solar system. Many were recognized to be periodic. But some orbit solutions for long-period comets suggested that they were slightly hyperbolic, suggesting that they came from interstellar space. That problem would not be solved until the 20th century.",
  "Another interesting problem for astronomers was a comet discovered in 1826 by the Austrian military officer and astronomer Wilhelm, Freiherr (baron) von Biela . Calculation of its orbit showed that it, like Encke’s Comet, was a short-period comet; it had a period of about 6.75 years. It was only the third periodic comet to be confirmed. It was identified with a comet observed by French astronomers Jacques Lebaix Montaigne and Charles Messier in 1772 and by Pons in 1805, and it returned, as predicted, in 1832. In 1839 the comet was too close in the sky to the Sun and could not be observed, but it was seen again on schedule in November 1845. On January 13, 1846, American astronomer Matthew Maury found that there was no longer a single comet: there were two, following each other closely around the Sun. The comets returned as a pair in 1852 but were never seen again. Searches for the comets in 1865 and 1872 were unsuccessful, but a brilliant meteor shower appeared in 1872 coming from the same direction from which the comets should have appeared. Astronomers concluded that the meteor shower was the debris of the disrupted comets. However, they were still left with the question as to why the comet broke up. That recurring meteor shower is now known as the Andromedids, named for the constellation in the sky where it appears to radiate from, but is also sometimes referred to as the Bielids.",
  "The study of meteor showers received a huge boost on November 12 and 13, 1833, when observers saw an incredible meteor shower, with rates of hundreds and perhaps thousands of meteors per hour. That shower was the Leonids, so named because its radiant (or origin) is in the constellation Leo . It was suggested that Earth was encountering interplanetary debris spread along the Earth-crossing orbits of yet unknown bodies in the solar system. Further analysis showed that the orbits of the debris were highly eccentric.",
  "American mathematician Hubert Newton published a series of papers in the 1860s in which he examined historical records of major Leonid meteor showers and found that they occurred about every 33 years. That showed that the Leonid particles were not uniformly spread around the orbit. He predicted another major shower for November 1866. As predicted, a large Leonid meteor storm occurred on November 13, 1866. In the same year, Italian astronomer Giovanni Schiaparelli computed the orbit of the Perseid meteor shower, usually observed on August 10–12 each year, and noted its strong similarity to the orbit of Comet Swift-Tuttle (109P/1862 O1) discovered in 1862. Soon after, the Leonids were shown to have an orbit very similar to Comet Tempel-Tuttle (55P/1865 Y1), discovered in 1865. Since then the parent comets of many meteoroid streams have been identified, though the parent comets of some streams remains a mystery.",
  "Meanwhile, the study of comets benefitted greatly from the improvement in the quality and size of telescopes and the technology for observing comets. In 1858 English portrait artist William Usherwood took the first photograph of a comet, Comet Donati (C/1858 L1), followed by American astronomer George Bond the next night. The first photographic discovery of a comet was made by American astronomer Edward Barnard in 1892, while he was photographing the Milky Way . The comet, which was in a short-period orbit, was known as D/Barnard 3 because it was soon lost, but it was recovered by Italian astronomer Andrea Boattini in 2008 and is now known as Comet Barnard/Boattini (206P/2008 T3). In 1864 Italian astronomer Giovanni Donati was the first to look at a comet through a spectroscope , and he discovered three broad emission bands that are now known to be caused by long-chain carbon  molecules in the coma. The first spectrogram (a spectrum recorded on film) was of Comet Tebbutt (C/1881 K1), taken by English astronomer William Huggins on June 24, 1881. Later the same night, an American doctor and amateur astronomer, Henry Draper, took spectra of the same comet. Both men later became professional astronomers.",
  "  Some years before the appearance of Comet Halley in 1910, the molecule cyanogen was identified as one of the molecules in the spectra of cometary comae. Cyanogen is a poisonous gas derived from hydrogen cyanide (HCN), a well-known deadly poison. It was also detected in Halley’s coma as that comet approached the Sun in 1910. That led to great consternation as Earth was predicted to pass through the tail of the comet. People panicked, bought “comet pills,” and threw “end-of-the-world” parties. But when the comet passed by only 0.15 AU away on the night of May 18–19, 1910, there were no detectable effects.",
  "  The 20th century saw continued progress in cometary science. Spectroscopy revealed many of the molecules, radicals, and ions in the comae and tails of comets. An understanding began to develop about the nature of cometary tails, with the ion (Type I) tails resulting from the interaction of ionized molecules with some form of “corpuscular radiation,” possibly electrons and protons , from the Sun, and the dust (Type II) tails coming from solar radiation pressure on the fine dust particles emitted from the comet.",
  "Astronomers continued to ask, “Where do the comets come from?” There were three schools of thought: (1) that comets were captured from interstellar space, (2) that comets were erupted out of the giant planets, or (3) that comets were primeval matter that had not been incorporated into the planets. The first idea had been suggested by French mathematician and astronomer Pierre Laplace in 1813, while the second came from another French mathematician-astronomer, Joseph Lagrange . The third came from English astronomer George Chambers in 1910.",
  "The idea of an interstellar origin for comets ran into some serious problems. First, astronomers showed that capture of an interstellar comet by Jupiter , the most massive planet, was a highly unlikely event and probably could not account for the number of short-period comets then known. Also, no comets had ever been observed on truly hyperbolic orbits. Some long-period comets did have orbit solutions that were slightly hyperbolic, barely above an eccentricity of 1.0. But a truly hyperbolic comet approaching the solar system with the Sun’s velocity relative to the nearby stars of about 20 km (12 miles) per second would have an eccentricity of 2.0.",
  "In 1914 Swedish-born Danish astronomer Elis Strömgren published a special list of cometary orbits. Strömgren took the well-determined orbits of long-period comets and projected them backward in time to before the comets had entered the planetary region. He then referenced the orbits to the barycentre (the centre of mass) of the entire solar system. He found that most of the apparently hyperbolic orbits became elliptical. That proved that the comets were members of the solar system. Orbits of that type are referred to as “original” orbits, whereas the orbit of a comet as it passes through the planetary region is called the “osculating” (or “instantaneous”) orbit, and the orbit after the comet has left the planetary region is called the “future” orbit.",
  "The idea of comets erupting from giant planets was favoured by the Soviet astronomer Sergey Vsekhsvyatsky based on similar molecules having been discovered in both the atmospheres of the giant planets and in cometary comae. The idea helped to explain the many short-period comets that regularly encountered Jupiter. But the giant planets have very large escape velocities, about 60 km (37 miles) per second in the case of Jupiter, and it was difficult to understand what physical process could achieve those velocities. So Vsekhsvyatsky moved the origin sites to the satellites of the giant planets, which had far lower escape velocities. However, most scientists still did not believe in the eruption model. The discovery of volcanos on Jupiter’s large satellite Io by the Voyager 1 spacecraft in 1979 briefly resurrected the idea, but Io’s composition proved to be a very poor match to the composition of comets.",
  "Another idea about cometary origins was promoted by the English astronomer Raymond Lyttleton in a research paper in 1951 and a book, The Comets and Their Origin , in 1953. Because it was known that some comets were associated with meteor showers observed on Earth, the “sandbank” model suggested that a comet was simply a cloud of meteoritic particles held together by its own gravity. Interplanetary gases were adsorbed on the surfaces of the dust grains and escaped when the comet came close to the Sun and the particles were heated. Lyttleton went on to explain that comets were formed when the Sun and solar system passed through an interstellar dust cloud. The Sun’s gravity focused the passing dust in its wake, and these subclouds then collapsed under their own gravity to form the cometary sandbanks.",
  "One problem with that theory was that Lyttleton estimated that the gravitational focusing by the Sun would bring the particles together only about 150 AU behind the Sun and solar system. But that did not agree well with the known orbits of long-period comets, which showed no concentration of comets that would have formed at that distance or in that direction. In addition, the total amount of gases that could be adsorbed on a sandbank cloud was not sufficient to explain the measured gas production rates of many observed comets.",
  "In 1948 Dutch astronomer Adrianus van Woerkom, as part of his Ph.D. thesis work at the University of Leiden, examined the role of Jupiter’s gravity in changing the orbits of comets as they passed through the planetary system. He showed that Jupiter could scatter the orbits in energy, leading to either longer or shorter orbital periods and correspondingly to larger or smaller orbits. In some cases the gravitational perturbations from Jupiter were sufficient to change the previously elliptical orbits of the comets to hyperbolic, ejecting them from the solar system and sending them into interstellar space. Van Woerkom also showed that because of Jupiter, repeated passages of comets through the solar system would lead to a uniform distribution in orbital energy for the long-period comets, with as many long-period comets ending in very long-period orbits as in very short-period orbits. Finally, van Woerkom showed that Jupiter would eventually eject all the long-period comets to interstellar space over a time span of about one million years. Thus, the comets needed to be resupplied somehow.",
  "Van Woerkom’s thesis adviser was the Dutch astronomer Jan Oort , who had become famous in the 1920s for his work on the structure and rotation of the Milky Way Galaxy. Oort became interested in the problem of where the long-period comets came from. Building on van Woerkom’s work, Oort closely examined the energy distribution of long-period comet original orbits as determined by Strömgren. He found that, as van Woerkom had predicted, there was a uniform distribution of orbital energies for most energy values. But, surprisingly, there was also a large excess of comets with orbital semimajor axes (half of the long axis of the comet’s elliptical orbit) larger than 20,000 AU.",
  "Oort suggested that the excess of orbits at very large distances could only be explained if the long-period comets came from there. He proposed that the solar system was surrounded by a vast cloud of comets that stretched halfway to the nearest stars. He showed that gravitational perturbations by random passing stars would perturb the orbits in the comet cloud, occasionally sending a comet into the planetary region where it could be observed. Oort referred to those comets making their first passage through the planetary region as “new” comets. As the new comets pass through the planetary region, Jupiter’s gravity takes control of their orbits, spreading them in orbital energy, and either capturing them to shorter periods or ejecting them to interstellar space.",
  "Based on the number of comets seen each year, Oort estimated that the cloud contained 190 billion comets; today that number is thought to be closer to one trillion comets. Oort’s hypothesis was all the more impressive because it was based on accurate original orbits for only 19 comets. In his honour, the cloud of comets surrounding the solar system is called the Oort cloud .",
  "Oort noticed that the number of long-period comets returning to the planetary system was far less than what his model predicted. To account for that, he suggested that the comets were physically lost by disruption (as had happened to Biela’s Comet). Oort proposed two values for the disruption rate of comets on each perihelion passage, 0.3 and 1.9 percent, which both gave reasonably good results when comparing his predictions with the actual energy distribution, except for an excess of new comets at near-zero energy.",
  "In 1979 American astronomer Paul Weissman (the author of this article) published computer simulations of the Oort cloud energy distribution using planetary perturbations by Jupiter and Saturn and physical models of loss mechanisms such as random disruption and formation of a nonvolatile crust, based on actual observations of comets. He showed that a very good agreement with the observed energy distribution could be obtained if new comets were disrupted about 10 percent of the time on the first perihelion passage from the Oort cloud and about 4 percent of the time on subsequent passages. Also, comet nuclei developed nonvolatile crusts, cutting off all coma activity, after about 10–100 returns, on average.",
  "In 1981 American astronomer Jack Hills suggested that in addition to the Oort cloud there was also an inner cloud extending inward toward the planetary region to about 1,000 AU from the Sun. Comets are not seen coming from this region because their orbits are too tightly bound to the Sun; stellar perturbations are typically not strong enough to change their orbits significantly. Hills hypothesized that only if a star came very close, even penetrating through the Oort cloud, could it excite the orbits of the comets in the inner cloud, sending a shower of comets into the planetary system.",
  "But where did the Oort cloud come from? At large distances on the order of 10 4 –10 5 AU from the Sun, the solar nebula would have been too thin to form large bodies like comets that are several kilometres in diameter. The comets had to have formed much closer to the planetary region. Oort suggested that the comets were thrown out of the asteroid belt by close encounters with Jupiter. At that time it was not known that most asteroids are rocky, carbonaceous, or iron bodies and that only a fraction contain any water.",
  "Oort’s work was preceded in part by that of the Estonian astronomer Ernst Öpik. In 1932 Öpik published a paper examining what happened to meteors or comets scattered to very large distances from the Sun, where they could be perturbed by random passing stars. He showed that the gravitational tugs from the stars would raise the perihelion distances of most objects to beyond the most distant planet. Thus, he predicted that there would be a cloud of comets surrounding the solar system. However, Öpik said little about the comets returning to the planetary region, other than that some comets could be thrown into the Sun by the stars during their evolution outward to the cloud. Indeed, Öpik concluded:",
  "comets of an aphelion distance exceeding 10,000 a.u., are not very likely to occur among the observable objects, because of the rapid increase of the average perihelion distance due to stellar perturbations.",
  "Öpik also failed to make any comparison between his results and the known original orbits of the long-period comets.",
  "Oort’s paper, published in 1950, revolutionized the field of cometary dynamics. Two months later a paper on the nature of the cometary nucleus by Fred Whipple would do the same for cometary physics. Whipple combined many of the ideas of the day and suggested that the cometary nucleus was a solid body made up of volatile ices and meteoritic material. That was called the “icy conglomerate” model but also became more popularly known as the “dirty snowball.”",
  "Whipple provided proof for his model in the form of the shrinking orbit of Encke’s Comet. Whipple believed that, as Bessel had suggested, rocket forces from sublimating ices on the sunlit side of the nucleus would alter the comet’s orbit. For a nonrotating solid nucleus, the force would push the nucleus away from the Sun, appearing to lessen the effect of gravity. But if the comet nucleus was rotating (as most solar system bodies do) and if the rotation pole was not perpendicular to the plane of the comet’s orbit, both tangential forces (forward or backward along the comet’s direction of motion) and out-of-plane forces (up or down) could result. The effect was helped by the thermal lag caused by the Sun continuing to heat the nucleus surface after local noontime, just as temperatures on Earth are usually at their maximum a few hours after local noon.",
  "Thus, Whipple explained the slow shrinking of Encke’s orbit as the result of tangential forces that were pointed opposite to the comet’s direction of motion, causing the comet nucleus to slow down, slowly shrinking the orbit. That model also explained periodic comets whose orbits were growing, such as D’Arrest and Wolf 1, depending on the direction of the nuclei’s rotation poles and the direction in which the nuclei were rotating. Because the rocket force results from the high activity of the comet nucleus near perihelion, the force does not change the perihelion distance but rather the aphelion distance, either raising or lowering it.",
  "Whipple also pointed out that the loss of cometary ices would leave a layer of nonvolatile material on the surface of the nucleus, making sublimation more difficult, as the heat from the Sun needed to filter down through multiple layers to where there were fresh ices. Furthermore, Whipple suggested that the solar system’s zodiacal dust cloud came from dust released by comets as they passed through the planetary system.",
  "Whipple’s ideas set off an intense debate over whether the nucleus was a solid body or not. Many scientists still advocated Lyttleton’s idea of a sandbank nucleus, simply a cloud of meteoritic material with adsorbed gases. The question would not be put definitively to rest until the first spacecraft encounters with Halley’s Comet in 1986.",
  "Solid proof for Whipple’s nongravitational force model came from English astronomer Brian Marsden, a colleague of Whipple’s at the Smithsonian Astrophysical Observatory in Cambridge, Massachusetts. Marsden was an expert on comet and asteroid orbits and tested Whipple’s icy conglomerate model against the orbits of many known comets. Using a computer program that determined the orbits of comets and asteroids from observations, Marsden added a term for the expected rocket effect when the comet was active. In this he was aided by Belgian astronomer Armand Delsemme, who carefully calculated the rate of water ice sublimation as a function of a comet’s distance from the Sun.",
  "When one calculates an orbit for an object, the calculation usually does not fit all the observed positions of the object perfectly. Small errors creep into the observed positions for many reasons, such as not knowing the exact time of the observations or finding the positions using an out-of-date star catalog. So every orbit fit has a “mean residual,” which is the average difference between the observations and the comet’s predicted position based on the newly determined orbit. Mean residuals of less than about 1.5 arc seconds are considered a good fit.",
  "When Marsden calculated the comet orbits, he found that he could obtain smaller mean residuals if he included the rocket force in his calculations. Marsden found that for a short-period comet, the magnitude of the rocket force was typically only a few hundred-thousandths of the solar gravitational attraction, but that was enough to change the time when the comet would return. Later, Marsden and colleagues computed the rocket forces for long-period comets and found that there too the mean residuals were reduced. For the long-period comets, the rocket force was typically a few ten-thousandths of the solar gravitational attraction. Long-period comets tend to be far more active than short-period comets, and thus for them the force is larger.",
  "A further interesting result of Marsden’s work was that when he performed his calculations on apparently hyperbolic comet orbits, the resulting eccentricities often changed from hyperbolic to elliptical. Very few comets were left with hyperbolic original orbits, and all of those were only slightly hyperbolic. Marsden had provided further proof that all long-period comets were members of the solar system.",
  "In 1951 the Dutch American astronomer Gerard Kuiper published an important paper on where the comets had formed. Kuiper was studying the origin of the solar system and suggested that the volatile molecules, radicals, and ions observed in cometary comae and tails (e.g., CH, NH, OH, CN, CO + , CO 2  + , N 2  + ) must come from ices frozen in the solid nucleus (e.g., CH 4 , NH 3 , H 2 O, HCN, CO, CO 2 , and N 2 ). But those ices could only condense in the solar nebula where it was very cold. So he suggested that comets had formed at 38–50 AU from the Sun, where mean temperatures were only about 30–45 K (−243 to −228 °C, or −406 to −379 °F).",
  "Kuiper suggested that the solar nebula did not end at the orbit of what was then considered the most distant planet, Pluto , at about 39 AU, but that it continued on to about 50 AU. He believed that at those large distances from the Sun neither the density of solar nebula material nor the time was enough to form another planet. Rather, he suggested that there would be a belt of smaller bodies—i.e., comets—between 38 and 50 AU. He also suggested that Pluto would dynamically eject comets from that region to distant orbits, forming the Oort cloud.",
  "  Astronomers have since discovered that Pluto is too small to have done that job (or even to be considered a planet), and it is really Neptune at 30 AU that defines the outer boundary of the planetary system. Neptune is large enough to slowly scatter comets both inward to short-period orbits and outward to the Oort cloud, along with some help from the other giant planets.",
  "Kuiper’s 1951 paper did not achieve the same fame as those by Oort and Whipple in 1950, but astronomers occasionally followed up his ideas. In 1968 Egyptian astronomer Salah Hamid worked with Whipple and Marsden to study the orbits of seven comets that passed near the region of Kuiper’s hypothetical comet belt beyond Neptune. They found no evidence of gravitational perturbations from the belt and set upper limits on the mass of the belt of 0.5 Earth masses out to 40 AU and 1.3 Earth masses out to 50 AU.",
  "The situation changed in 1980 when Uruguayan astronomer Julio Fernández suggested that a comet belt beyond Neptune would be a good source for the short-period comets. Up until that time it was thought that short-period comets were long-period comets from the Oort cloud that had dynamically evolved to short-period orbits because of planetary perturbations, primarily by Jupiter. But astronomers who tried to simulate that process on computers found that it was very inefficient and likely could not supply new short-period comets fast enough to replace the existing ones that either were disrupted, faded away, or were perturbed out of the planetary region.",
  "Fernández recognized that a key element in understanding the short-period comets was their relatively low-inclination orbits. Typical short-period comets have orbital inclinations up to about 35°, whereas long-period comets have completely random orbital inclinations from 0° to 180°. Fernández suggested that the easiest way to produce a low-inclination short-period comet population was to start with a source that had a relatively low inclination. Kuiper’s hypothesized comet belt beyond Neptune fit this requirement. Fernández used dynamical simulations to show how comets could be perturbed by larger bodies in the comet belt, on the order of the size of Ceres , the largest asteroid (diameter of about 940 km [580 miles]), and be sent into orbits that could encounter Neptune. Neptune then could pass about half of the comets inward to Uranus , with the other half being sent outward to the Oort cloud. In that manner, comets could be handed down to each giant planet and finally to Jupiter, which placed the comets in short-period orbits.",
  "Fernández’s paper renewed interest in a possible comet belt beyond Neptune. In 1988 American astronomer Martin Duncan and Canadian astronomers Thomas Quinn and Scott Tremaine built a more complex computer simulation of the trans-Neptunian comet belt and again showed that it was the likely source of the short-period comets. They also proposed that the belt be named in honour of Gerard Kuiper, based on the predictions of his 1951 paper. As fate would have it, the distant comet belt had also been predicted in two lesser-known papers in 1943 and 1949 by a retired Irish army officer and astronomer, Kenneth Edgeworth. Therefore, some scientists refer to the comet belt as the Kuiper belt , while others call it the Edgeworth-Kuiper belt.",
  "  Astronomers at observatories began to search for the distant objects. In 1992 they were finally rewarded when British astronomer David Jewitt and Vietnamese American astronomer Jane Luu found an object well beyond Neptune in an orbit with a semimajor axis of 43.9 AU, an eccentricity of only 0.0678, and an inclination of only 2.19°. The object, officially designated (15760) 1992 QB1, has a diameter of about 200 km (120 miles). Since 1992 more than 1,500 objects have been found in the Kuiper belt, some almost as large as Pluto. In fact, it was the discovery of that swarm of bodies beyond Neptune that led to Pluto being recognized in 2006 as simply one of the largest bodies in the swarm and no longer a planet. (The same thing happened to the largest asteroid Ceres in the mid-19th century when it was recognized as simply the largest body in the asteroid belt and not a true planet.)",
  "In 1977 American astronomer Charles Kowal discovered an unusual object orbiting the Sun among the giant planets. Named 2060 Chiron , it is about 200 km (120 miles) in diameter and has a low-inclination orbit that stretches from 8.3 AU (inside the orbit of Saturn) to 18.85 AU (just inside the orbit of Uranus). Because it can make close approaches to those two giant planets, the orbit is unstable on a time span of several million years. Thus, Chiron likely came from somewhere else. Even more interesting, several years later Chiron began to display a cometary coma even though it was still very far from the Sun. Chiron is one of a few objects that appear in both asteroid and comet catalogs; in the latter it is designated 95 P/Chiron.",
  "Chiron was the first of a new class of objects in giant-planet-crossing orbits to be discovered. The searches for Kuiper belt objects have also led to the discovery of many similar objects orbiting the Sun among the giant planets. Collectively they are now known as the Centaur objects . About 300 such objects have now been found, and more than a few also show sporadic cometary activity.",
  "The Centaurs appear to be objects that are slowly diffusing into the planetary region from the Kuiper belt. Some will eventually be seen as short-period comets, while most others will be thrown into long-period orbits or even ejected to interstellar space.",
  "In 1996 European astronomers Eric Elst and Guido Pizarro found a new comet, which was designated 133P/Elst-Pizarro. But when the orbit of the comet was determined, it was found to lie in the outer asteroid belt with a semimajor axis of 3.16 AU, an eccentricity of 0.162, and an inclination of only 1.39°. A search of older records showed that 133P had been observed previously in 1979 as an inactive asteroid. So it is another object that was catalogued as both a comet and an asteroid.",
  "The explanation for 133P was that, given its position in the asteroid belt, where maximum solar surface temperatures are only about −48 °C (−54 °F), it likely acquired some water in the form of ice from the solar nebula. Like in comets, the ices near the surface of 133P sublimated early in its history, leaving an insulating layer of nonvolatile material covering the ice at depth. Then a random impact from a piece of asteroidal debris punched through the insulating layer and exposed the buried ice. Comet 133P has shown regular activity at the same location in its orbit for at least three orbits since it was discovered.",
  "Twelve additional objects in asteroidal orbits have been discovered since that time, most of them also in the outer main belt. They are sometimes referred to as “main belt comets,” though the more recently accepted term is “active asteroids.”",
  "The latter half of the 20th century saw a massive leap forward in the understanding of the solar system as a result of spacecraft visits to the planets and their satellites. Those spacecraft collected a wealth of scientific data close up and in situ. The anticipated return of Halley’s Comet in 1986 provided substantial motivation to begin using spacecraft to study comets.",
  "The first comet mission (of a sort) was the International Cometary Explorer (ICE) spacecraft’s encounter with Comet 21P/Giacobini-Zinner on September 11, 1985. The mission had originally been launched as part of a joint project by the U.S. National Aeronautics and Space Administration (NASA) and the European Space Agency (ESA) known as the International Sun-Earth Explorer (ISEE). The mission consisted of three spacecraft, two of them, ISEE-1 and -2, in Earth orbit and the third, ISEE-3, positioned in a heliocentric orbit between Earth and the Sun, studying the solar wind in Earth’s vicinity.",
  "In 1982 and 1983 engineers maneuvered ISEE-3 to accomplish several gravity-assist encounters with the Moon , which put it on a trajectory to encounter 21P/Giacobini-Zinner. The spacecraft was targeted to pass through the ion tail of the comet, about 7,800 km (4,800 miles) behind the nucleus at a relative velocity of 21 km (13 miles) per second, and returned the first in situ measurements of the magnetic field, plasma, and energetic particle environment inside a comet’s tail. Those measurements confirmed the model of the comet’s ion tail first put forward in 1957 by the Swedish physicist (and later Nobel Prize winner) Hannes Alfvén. It also showed that H 2 O + was the most common ion in the plasma tail, consistent with the Whipple model of an icy conglomerate nucleus. However, ICE carried no instruments to study the nucleus or coma of the comet.",
  "In 1986 five spacecraft were sent to encounter Halley’s Comet. They were informally known as the Halley Armada and consisted of two Japanese spacecraft, Suisei and Sakigake (Japanese for “comet” and “pioneer,” respectively); two Soviet spacecraft, Vega 1 and 2 (a contraction of Venus-Halley using Cyrillic spelling); and an ESA spacecraft, Giotto (named after the Italian painter who depicted the Star of Bethlehem as a comet in a fresco painted in 1305–06).",
  "Suisei flew by Halley on March 8, 1986, at a distance of 151,000 km (94,000 miles) on the sunward side and produced ultraviolet images of the comet’s hydrogen corona, an extension of the visible coma seen only in ultraviolet light. It also measured the energetic particle environment in the solar wind ahead of the comet. Sakigake’s closest approach to the comet was on March 11, 1986, at a distance of 6.99 million km (4.34 million miles), and it made additional measurements of the solar wind.",
  "Before flying past Halley’s Comet, the two Soviet spacecraft had flown by Venus and had each dropped off landers and balloons to study that planet. Vega 1 flew through the Halley coma on March 6, 1986, to within 8,889 km (5,523 miles) of the nucleus and made numerous measurements of the coma gas and dust composition, plasma and energetic particles, and magnetic field environment. It also returned the first picture ever of a solid cometary nucleus. Unfortunately, the camera was slightly out of focus and had other technical problems that required considerable image processing to see the nucleus. Vega 2 fared much better when it flew through the Halley coma on March 9 to within 8,030 km (4,990 miles) of the nucleus, and its images clearly showed a peanut-shaped nucleus about 16 by 8 km (10 by 5 miles) in diameter. The nucleus was also very dark, reflecting only about 4 percent of the incident sunlight, which had already been established from Earth-based observations.",
  "Both Vega spacecraft carried infrared spectrometers designed to measure the temperature of the Halley nucleus. They found quite warm temperatures between 320 and 400 K (47 and 127 °C [116 and 260 °F]). That surprised many scientists who had predicted that the effect of water ice sublimation would be to cool the nucleus’s surface; water ice requires a great deal of heat to sublimate. The high temperatures suggested that much of the nucleus’s surface was not sublimating, but why?",
  "Whipple’s classic paper in 1950 had suggested that as comets lost material from the surface, some particles were too heavy to escape the weak gravity of the nucleus and fell back onto the surface, forming a lag deposit. That idea was later studied by American astronomer and author David Brin in his thesis work with his adviser, Sri Lankan physicist Asoka Mendis, in 1979. As the lag deposit built up, it would effectively insulate the icy materials below it from sunlight. Calculations showed that a layer only 10–100 cm (4–39 inches) in thickness could completely turn off sublimation from the surface. Brin and Mendis predicted that Halley would be so active that it would blow away any lag deposit, but that was not the case. Only about 30 percent of Halley’s sunlit hemisphere was active. Bright dust jets could be seen coming from specific areas on the nucleus surface, but much of the surface showed no visible activity.",
  "  Giotto flew through Halley’s coma on March 14, 1986, and passed only 596 km (370 miles) from the nucleus. It returned the highest-resolution images of the nucleus and showed a very rugged terrain with “mountain peaks” jutting up hundreds of metres from the surface. It also showed the same peanut shape that Vega 2 saw but from a different viewing angle and with much greater visible detail. Discrete dust jets were coming off the nucleus surface, but the resolution was not good enough to reveal the source of the jets.",
  "Giotto and both Vega spacecraft obtained numerous measurements of the dust and gas in the coma. Dust particles came in two types: silicate and organic. The silicate grains were typical of rocks found on Earth such as forsterite (Mg 2 SiO 4 ), a high-temperature mineral —that is, one which would be among the first to condense out of the hot solar nebula. Analyses of other grains showed that the comet was far richer in magnesium relative to iron . The organic grains were composed solely of the elements carbon, hydrogen, oxygen , and nitrogen and were called CHON grains based on the chemical symbol for each of those elements. Larger grains were also detected that were combinations of silicate and CHON grains, supporting the view that comet nuclei had accreted from the slow aggregation of tiny particles in the solar nebula.",
  "The three spacecraft also measured gases in the coma, water being the dominant molecule but also carbon monoxide accounting for about 7 percent of the gas relative to water. Formaldehyde , carbon dioxide , and hydrogen cyanide were also detected at a few percent relative to water.",
  "The Halley Armada was a rousing success and resulted from international cooperation by many nations. Its success is even more impressive when one considers that the spacecraft all flew by the Halley nucleus at velocities ranging from 68 to 79 km per second (152,000 to 177,000 miles per hour). (The velocities were so high because Halley’s retrograde orbit had it going around the Sun in the opposite direction from the spacecraft.)",
  "Giotto was later retargeted using assists from Earth’s gravity to pass within about 200 km (120 miles) of the nucleus of the comet 26P/Grigg-Skjellrup. The flyby was successful, but some of the scientific instruments, including the camera, were no longer working after being sandblasted at Halley.",
  "  The next comet mission was not until 1998, when NASA launched Deep Space 1, a spacecraft designed to test a variety of new technologies. After flying past the asteroid 9969 Braille in 1999, Deep Space 1 was retargeted to fly past the comet 19P/Borrelly on September 22, 2001. Images of the Borrelly nucleus showed it to be shaped like a bowling pin, with very rugged terrain on parts of its surface and mesa-like formations over a large area of it. Individual dust and gas jets were seen emanating from the surface, but the activity was far less than that of Halley’s Comet.",
  "  The NASA Stardust mission was launched in 1999 with the goal of collecting samples of dust from the coma of Comet 81P/Wild 2. At a flyby speed of 6.1 km per second (13,600 miles per hour), the dust samples would be completely destroyed by impact with a hard collector. Therefore, Stardust used a material made of silica (sand) called aerogel that had a very low density, approaching that of air. The idea was that the aerogel would slow the dust particles without destroying them, much as a detective might shoot a bullet into a box full of cotton in order to collect the undamaged bullet. It worked, and thousands of fine dust particles were returned to Earth in 2006. Perhaps the biggest surprise was that the sample contained high-temperature materials that must have formed much closer to the Sun than where the comets formed in the outer solar system. That unexpected result meant that material in the solar nebula had been mixed, at least from the inside outward, during the formation of the planets.",
  "  Stardust’s images of the nucleus of Wild 2 showed a surface that was radically different from either Halley or Borrelly. The surface appeared to be covered with large flat-floored depressions. Those were likely not impact craters, as they did not have the correct morphology and there were far too many large ones. There was some suggestion that it was a very “new” cometary surface on a nucleus that had not been close to the Sun before. Support for that was the fact that Wild 2 had been placed into its current orbit by a close Jupiter approach in 1974, reducing the perihelion distance to about 1.5 AU (224 million km, or 139 million miles). Before the Jupiter encounter, its perihelion was 4.9 AU (733 million km, or 455 million miles), beyond the region where water ice sublimation is significant.",
  "In 2002 NASA launched a mission called Contour (Comet Nucleus Tour) that was to fly by Encke’s Comet and 73P/Schwassman-Wachmann 3 and possibly continue on to 6P/D’Arrest. Unfortunately, the spacecraft structure failed when leaving Earth orbit.",
  "In 2005 NASA launched yet another comet mission, called Deep Impact . It consisted of two spacecraft, a mother spacecraft that would fly by Comet 9P/Tempel 1 and a daughter spacecraft that would be deliberately crashed into the comet nucleus. The mother spacecraft would take images of the impact. The daughter spacecraft contained its own camera system to image the nucleus surface up to the moment of impact. To maximize the effect of the impact, the daughter spacecraft contained 360 kg (794 pounds) of solid copper . The predicted impact energy was equivalent to 4.8 tonnes of TNT .",
  "  The two spacecraft encountered Tempel 1 on July 4, 2005. The impactor produced the highest-resolution pictures of a nucleus surface ever, imaging details less than 10 metres (33 feet) in size. The mother spacecraft watched the explosion and saw a huge cloud of dust and gas emitted from the nucleus. One of the mission goals was to image the crater made by the explosion, but the dust cloud was so thick that the nucleus surface could not be seen through it. Because the mission was a flyby, the mother spacecraft could not wait around for the dust to clear.",
  "Images of the Tempel 1 nucleus were very different from what had been seen before. The surface appeared to be old, with examples of “geologic” processes having occurred. There was evidence of dust flows across the nucleus surface and what appeared to be two modest-sized impact craters. There was evidence of material having been eroded away. For the first time, icy patches were discovered in some small areas of the nucleus surface.",
  "For the first time, a mission was also able to measure the mass and density of a cometary nucleus. Typically, the nuclei are too small and their gravity too weak to affect the trajectory of the flyby spacecraft. The same was true for Tempel 1, but observations of the expanding dust cloud from the impact could be modeled so as to solve for the nucleus gravity. When combined with the volume of the nucleus as obtained from the camera images, it was shown that the Tempel 1 nucleus had a bulk density between 0.2 and 1.0 gram per cubic centimetre with a preferred value of 0.4 gram per cubic centimetre, less than half that of water ice. The measurement clearly confirmed ideas from telescopic research that comets were not very dense.",
  "After the great success of Stardust and Deep Impact, NASA had additional plans for the spacecraft. Stardust was retargeted to go to Tempel 1 and image the crater from the Deep Impact explosion as well as more of the nucleus surface not seen on the first flyby. Deep Impact was retargeted to fly past 103P/Hartley 2, a small but very active comet.",
  "  Deep Impact, in its postimpact EPOXI mission, flew past Comet Hartley 2 on November 4, 2010. It imaged a small nucleus about 2.3 km (1.4 miles) in length and 0.9 km (0.6 mile) wide. As with Halley and Borrelly, the nucleus appeared to be two bodies stuck together, each having rough terrain but covered with very fine, smooth material at the “neck” where they came together. The most amazing result was that the smaller of the two bodies making up the nucleus was far more active than the larger one. The activity on the smaller body appeared to be driven by CO 2 sublimation—an unexpected result, given that short-period comets are expected to lose their near-surface CO 2 early during their many passages close to the Sun. The other half of the nucleus was far less active and only showed evidence of water ice sublimation. The active half of the comet also appeared to be flinging baseball- to basketball-sized chunks of water ice into the coma, further enhancing the gas production from the comet as they sublimated away.",
  "The EPOXI images also showed that the nucleus was not rotating smoothly but was in complex rotation—a state where the comet nucleus rotates but the direction of the rotation pole precesses rapidly, drawing a large circle on the sky. Hartley 2 was the first encountered comet to exhibit complex rotation. It was likely driven by the very high activity from the smaller half of the nucleus, putting large torques on the nucleus rotation.",
  "Stardust/NExT (New Exploration of Tempel 1) flew past Tempel 1 on February 14, 2011, and it imaged the spot where the Deep Impact daughter spacecraft had struck the nucleus. Some scientists believed that they saw evidence of a crater about 150 metres (500 feet) in diameter, but other scientists looked at the same images and saw no clear evidence of a crater. Some of the ambiguity was due to the fact that the Stardust camera was not as sharp as the Deep Impact cameras, and some of it was also due to the fact that sunlight was illuminating the nucleus from a different direction. The debate over whether there was a recognizable crater lingers on.",
  "Among the new areas observed by Stardust-NeXT there was further evidence of geologic processes, including layered terrains. Using stereographic imaging, the scientists traced dust jets observed in the coma back to the nucleus surface, and they appeared to originate from some of the layered terrain. Again, the resolution of the images was not good enough to understand why the jets were coming from that area.",
  "  In 2004 ESA launched Rosetta (named after the Rosetta Stone , which had unlocked the secret of Egyptian hieroglyphics ) on a trajectory to Comet 67P/Churyumov-Gerasimenko (67P). Rendezvous with 67P took place on August 6, 2014. Along the way, Rosetta successfully flew by the asteroids 2849 Steins and 21 Lutetia and obtained considerable scientific data. Rosetta uses 11 scientific instruments to study the nucleus, coma, and solar wind interaction. Unlike previous comet missions, Rosetta will orbit the nucleus until December 2015, providing a complete view of the comet as activity begins, reaches a maximum at perihelion, and then wanes. Rosetta carried a spacecraft called Philae that landed on the nucleus surface on November 12, 2014. Philae drilled into the nucleus surface to collect samples of the nucleus and analyze them in situ. As the first mission to orbit and land on a cometary nucleus, Rosetta is expected to answer many questions about the sources of cometary activity.",
  " Telescopic observations from Earth and spacecraft missions to comets have revealed much about their nuclei. Cometary nuclei are small solid bodies, typically only a few kilometres in diameter and composed of roughly equal parts of volatile ices, fine silicate dust, and organic materials. The ices are dominated by water ice (about 80 percent of the total ices) but also include carbon monoxide , carbon dioxide , formaldehyde , and methanol . The silicate and organic mix is similar to that found in the most primitive meteorites , carbonaceous chondrites . The materials are intimately mixed at micron scales (one micron is one millionth of a metre).",
  "The nuclei formed in the solar nebula 4.56 billion years ago as dust and ice particles settled to the central plane of the nebula. When those particles collided, they tended to stick. Micron-sized particles grew through that process of agglomeration and accretion to metre-sized and then kilometre-sized bodies.",
  "When cometary nuclei come close to the Sun , the ices on or near their surfaces sublimate , transforming directly from the solid to the vapour phase. The gas  molecules flow off the nucleus surface, carrying with them silicate and organic dust that had been embedded in the ices. The outflowing mix of materials then forms the cometary coma, the comet’s atmosphere. Because cometary nuclei are small, their gravity is too weak to retain that atmosphere, and it flows freely out into space.",
  "Because the different ices sublimate at different temperatures, gases are liberated from different depths below the surface as the solar heat wave penetrates into the surface. Therefore, the layers closest to the surface become progressively depleted in the most volatile ices. A lag deposit of nonvolatile dust, which is typically made of particles too large to be lifted by the escaping gases, develops on the surface. The nonvolatile layer can become so thick that it effectively insulates the icy component below it, preventing further sublimation.",
  "Another feature of cometary activity is driven by the fact that the water ice in comets condensed at very low temperatures, less than 100 K (−173 °C [−280 °F]). At those low temperatures, ice forms in the amorphous state, a random ordering of water molecules. As the amorphous water ice is warmed above 110 K (−163 °C [−262 °F]), it begins to transform to crystalline ice, first in the cubic form and then the normal hexagonal ice experienced on Earth. The transition is complete at about 153 K (−120 °C [−184 °F]). It is an exothermic reaction—i.e., it releases energy. That energy further sustains the reaction as it warms the ice around it but dies out because it must also warm the nonvolatile dust components of the nucleus. The amorphous-to-crystalline ice transition may be one source of cometary outbursts—sharp increases in cometary activity that appear to occur randomly. It can likely explain the unusual brightness of dynamically new comets as they approach the Sun for the first time. New comets likely experience the amorphous-to-crystalline ice phase transition at between 5 and 7 AU (748 and 1,047 million km [465 and 651 million miles]) and are often discovered at that distance.",
  "The internal structure of cometary nuclei is still an area of speculation. It is generally believed that as icy planetesimals came together at low velocity (on the order of metres per second) in the solar nebula, there was not enough energy to melt or compress them into a single solid body. The two leading explanations suggest that cometary nuclei are “fluffy aggregates,” first proposed by American astronomer Bertram Donn and British astronomer David Hughes in 1982, or “primordial rubble piles,” proposed by American astronomer Paul Weissman (the author of this article) in 1986, with low binding strength and high porosity. Key data supporting these models are estimates of nucleus bulk density, ranging from 0.2 to 1.0 gram per cubic centimetre, with preferred values of about 0.3–0.6 gram per cubic centimetre. This suggests a combined microscopic and macroscopic porosity of about 60 percent or more, a very high value.",
  "Additional evidence for the rubble pile model for cometary nuclei comes from observations of split (disrupted) cometary nuclei. Observations show that nuclei can randomly break apart, shedding a few or many pieces. Those pieces have typically been estimated to be between 8 and 60 metres (26 and 197 feet) in diameter. In some cases, the entire nucleus is disrupted. Disruption can also occur if the nucleus passes too close to the Sun or to a large planet like Jupiter , where gravitational tides tear the weakly bound nucleus apart. That has been observed for Sun-grazing comets, comets with perihelia within one solar radius of the Sun’s photosphere .",
  "  A particularly interesting case of a tidally disrupted nucleus is that of Comet Shoemaker-Levy 9 . That comet was discovered in 1993 as a string of 21 separate but co-moving active nuclei Observations showed that the comet had been captured into orbit around Jupiter and had passed so close to Jupiter on its last perijove passage, 1.3 Jupiter radii (93,000 km [58,000 miles]), that it was tidally disrupted. A suggested explanation was that the nucleus was a rubble pile and had broken into thousands of separate “cometesimals.” As that swarm of bodies moved away from Jupiter, their own self-gravity caused them to clump together. Interestingly, the number of final clumps depended on the bulk density of the original nucleus. The best fit was obtained for bulk densities of about 0.5–0.6 gram per cubic centimetre. The original nucleus was estimated to be 1.6 km (1 mile) in diameter, a fairly typical nucleus size. Thus, Shoemaker-Levy 9 is another proof of a low-density rubble pile or aggregate structure for cometary nuclei.",
  "As noted above, nuclei can display “outbursts,” which are large sudden releases of dust and gas. The most famous was from the comet 17P/Holmes in 2007, which brightened by 15 magnitudes (one million times brighter) in less than two days. One possible explanation is the amorphous ice transition to crystalline ice. Another possible explanation is rotational spin-up due to torques from the coma outgassing as ices sublimate on the surface of the irregularly shaped nucleus.",
  "Because of the small size and low gravity of the cometary nuclei, the evolving gases from sublimating ices expand freely into the vacuum of space. Entrained in the outflowing gas are fine dust particles, typically one micron in size, composed of silicates, organics, and sometimes additional ice. Because the molecules are exposed to sunlight, they begin to disassociate, breaking up into radicals and individual atoms . The most common case of this is the water molecule, H 2 O, which disassociates into H and OH. Organic dust grains appear to also release molecules and radicals into the outflowing coma, the most common of which are CN, C 2 , and C 3 . Those are known as “daughter” molecules, and cometary spectroscopy is used to study the chemistry that goes on in the coma as the parent and daughter molecules, radicals, and individual atoms react with each other. The ice included in the grains sublimates as they move away from the nucleus, providing an extended source of organics and other volatiles. It is also possible that the water ice contains clathrates, other volatile gases trapped in the crystalline water ice matrix.",
  "The observed composition of volatiles in cometary comae is very similar to that seen in dense, cold interstellar clouds where stars and solar systems are being formed. That provides additional evidence that comets are frozen remnants of the primordial solar nebula, preserving unmodified volatiles from the formation of the planetary system 4.56 billion years ago.",
  "Cometary comae often show geyser -like structures, or “jets,” which are taken as evidence of individual active areas on the surfaces of the nuclei. As noted above, lag deposits of large dust grains can shut down sublimation on the surface. Because the nature of the source vents for the cometary activity is as yet unknown, there is no good explanation as to why some areas remain active and others do not. It is known that this is likely an aging effect, as the active fraction on the nucleus is large for long-period and Halley-type comets, which have made relatively few approaches close to the Sun, and very low, typically only a few percent, for short-period, Jupiter-family comets, which have made hundreds of returns, on average.",
  "The shape of the coma is explained by the “fountain model,” in which dust and gas are liberated on the Sun-facing hemisphere of the nucleus and flow radially outward from the nucleus normal to the surface. The dust particles experience solar radiation pressure, which gradually slows them and then accelerates them in the anti-Sun direction. That creates a rounded “head” to the coma, typically up to 100,000 km (60,000 miles) in diameter.",
  "In 1951 German astronomer Ludwig Biermann studied the tails of comets and showed that the ion tails flowed away from the Sun at speeds in excess of 400 km (250 miles) per second. He suggested that the phenomenon had to be associated with some sort of “corpuscular radiation” flowing outward from the Sun. In fact, he had suggested the existence of the solar wind , which was not directly detected for another 8 years.",
  "The outflowing dust and gas in the coma interacts with the solar wind and sunlight. The molecules and free radicals are ionized by charge exchange with the solar wind. Once ionized, they are caught up in the Sun’s magnetic field and flow away at high velocity in the solar wind. The process forms long, narrow, straight trails that glow blue in colour because of the presence of CO + molecules. However, the major ion in cometary ion tails is H 2 O + , which does not glow at visible wavelengths. Those tails point almost exactly away from the Sun because the solar wind velocity is typically about 400 km per second, much larger than the orbital velocities of almost all comets. The ion or plasma tails are known as Type I tails.",
  "Sometimes the ion tails of comets will disconnect from the coma and slowly fade while the comet grows a new ion tail. That is caused by the comet crossing magnetic sector boundaries in the Sun’s magnetic field.",
  "The fine dust suffers a different fate as it is blown away from the Sun by radiation pressure on the tiny grains. That forms a broad, curved, sometimes yellow-coloured tail following the comet in its orbit and pointed generally away from the Sun, which is known as a Type II tail. The grains are blown into a larger orbit than the comet nucleus, and that results in their slowing because of the laws of planetary motion , causing them to lag behind the nucleus. The dust follows the comet around its orbit but eventually disperses into the zodiacal dust cloud.",
  "In 1986 American astronomer Mark Sykes and colleagues discovered faint trails of material in images of the sky taken by the Infrared Astronomical Satellite . Sykes showed that those trails matched the orbits of several well-known periodic comets, including Encke’s Comet and 10P/Tempel 2. Further analysis showed that the trails were collections of relatively large particles, from 100 microns to 1 cm in radius, that had been ejected from the comets but whose orbits changed very slowly because they were too big for solar radiation pressure to easily push around.",
  "Some comets display anti-tails that are pointed straight at the Sun. These are only seen as Earth passes through the comet’s orbital plane. However, what is seen is a projection effect, and the anti-tails are actually the Type II dust trail curving behind the nucleus into the line of sight.",
  "Comets are typically in more-eccentric and more-inclined orbits than are other bodies in the solar system . In general, comets were initially classified into two dynamical groups: the short-period comets with orbital periods shorter than 200 years and the long-period comets with orbital periods longer than 200 years. The short-period comets were split into two groups, the Jupiter -family comets with periods shorter than about 20 years and the Halley -type comets with periods longer than 20 years but shorter than 200 years. In 1996 American astronomer Harold Levison introduced a new taxonomy that involved a quantity called the Tisserand parameter:",
  " T = a  J / a + 2 [( a / a  J ) (1 − e  2 )] 1/2 cos i ",
  "where a , e , and i are the semimajor axis, eccentricity, and inclination of the comet’s orbit , respectively, and a  J is the semimajor axis of Jupiter’s orbit. The Tisserand parameter is approximately constant for any given comet orbit and was created by the French astronomer Félix Tisserand in order to recognize and identify returning periodic comets even though their orbits had been perturbed by Jupiter.",
  "Jupiter-family comets have Tisserand ( T ) parameters between 2.0 and 3.0, and Halley-type and long-period comets have T values less than 2.0. Asteroids generally have T values greater than 3.0. However, there are both some periodic comets whose orbits have evolved to T values greater than 3 and some asteroids with T values less than 3. Many of the latter have been shown to be likely extinct or inactive comet nuclei.",
  "Another important difference in the dynamical groups is their orbital inclination distributions. Jupiter-family comets typically have orbits that are modestly inclined to the ecliptic (the plane of Earth’s orbit), with inclinations up to about 35°. Halley-type comets can have much higher inclinations, including retrograde orbits that go around the Sun in the opposite direction, though not totally randomized. The long-period comets have totally random inclinations and can approach the planetary system from all directions. As a result, the Jupiter-family comets are also known as “ecliptic comets,” whereas the long-period comets are also known as “nearly isotropic comets.”",
  "The inclinations of the cometary orbits provide important clues to their origin. As mentioned above, dynamical simulations show that the great concentration of Jupiter-family comet orbits close to the ecliptic can only originate from a flattened source of comets. That source is the Kuiper belt , a flattened disk of icy bodies beyond the orbit of Neptune and extending to at least 50 AU from the Sun. The Kuiper belt is analogous to the asteroid belt and is composed of ice-rich bodies that never had enough time to form into a larger planet.",
  "More specifically, the source of the Jupiter-family comets is called the scattered disk, Kuiper belt comets that are in more inclined and eccentric orbits but with perihelia close to Neptune. Neptune can gravitationally scatter comets from the scattered disk inward to become Jupiter-family comets or outward to the Oort cloud .",
  "As described above, the source of the long-period comets is the Oort cloud, surrounding the solar system and stretching to interstellar distances. The key to recognizing this was the distribution of orbital energies, which showed that a large fraction of the long-period comets were in very distant orbits with semimajor axes of ~25,000 AU or more. The orbits of comets in the Oort cloud are so distant that they are perturbed by random passing stars and by tidal forces from the galactic disk. Again, dynamical simulations show that the Oort cloud is the only possible explanation for the observed number of comets with very distant orbits that are still gravitationally bound to the solar system.",
  "Oort cloud comets are in random orbits in both inclination and orientation. There are, however, some deviations from randomness that reveal the importance of the galactic tide in sending comets into the visible region where they can be observed. The galactic tide and stellar perturbations must act together to provide a steady-state flux of new long-period comets.",
  "The general explanation for the formation of comets in the Oort cloud is that they are icy planetesimals from the giant planets region. As they formed, the growing giant planets gravitationally scattered the remaining planetesimals from their zones. That is an inefficient process, only about 4 percent of ejected comets being captured into the Oort cloud. Most of the rest are ejected on hyperbolic orbits to interstellar space.",
  "It is also possible that if the Sun formed in a cluster of stars , as most stars do, then it might have exchanged comets with the growing Oort clouds of those nearby stars. That could be a significant contributor to the Oort cloud population.",
  "The source of the Halley-type comets with their intermediate inclinations and eccentricities is still a matter of debate. Both the scattered disk and the Oort cloud have been suggested as sources. It may be that the explanation lies with a combination of the two cometary reservoirs.",
  "Astronomers have often debated the existence of interstellar comets. Only a few observed comets have hyperbolic orbit solutions, and those are always just barely hyperbolic with eccentricities up to about 1.0575. That translates to comets with excess velocities of about 1–2 km (0.5–1 mile) per second, a very small and unlikely value, given that the Sun’s motion relative to the nearby stars is about 20 km (12 miles) per second. A truly interstellar comet with that excess velocity would have an eccentricity of 2.",
  "Comets pose a natural hazard to Earth . That is because many of them are in orbits that cross Earth’s and may collide with it. Approximately 10 long-period comets on the order of 1 km (0.6 mile) in diameter (or larger) cross Earth’s orbit each year. Because Earth is a relatively small target and space is vast, the impact probability per comet is, on average, very low. A random long-period comet in an Earth-crossing orbit has an average impact probability of 2.2 10 −9 . That means that, on average, one long-period comet will strike Earth for every 454 million comets that cross its orbit. Given the estimated rate of 10 comets crossing Earth’s orbit per year, that results in a mean time between long-period comet impacts of 45 million years.",
  "However, because the long-period comets move on highly eccentric and highly inclined orbits, their mean impact velocities are much higher than for other celestial bodies—i.e., asteroids . The average long-period comet will strike Earth with a velocity of 51.7 km (32.1 miles) per second. If the impact velocity is weighted by the probability of impact for a particular orbit, then the weighted mean impact velocity increases to 54.6 km (33.9 miles) per second. Those values are much higher than those for Earth-crossing asteroids, which are typically only about 15 km (9 miles) per second.",
  "An interesting case is that of Earth-crossing long-period Comet Hale-Bopp (C/1995 O1), which passed closest to the Sun in 1997. Hale-Bopp was an unusually large and active comet, easily seen with the naked eye in evening skies. With a perihelion distance of 0.914 AU, Hale-Bopp’s orbit crossed inside Earth’s orbit. Hale-Bopp was believed to have an unusually large nucleus, estimated to be 27–42 km (17–26 miles) in diameter. Taking a median value of 35 km (22 miles) and assuming a mean bulk density of 0.6 gram per cubic centimetre results in an estimated mass of 1.3 10 19 grams.",
  "The impact probability for Hale-Bopp on Earth is 2.54 10 −9 per perihelion passage, fairly typical for a long-period comet. Because of the comet’s high orbital eccentricity, 0.9951, and inclination, 89.43°, the impact velocity would be 52.9 km (32.9 miles) per second. The resulting impact energy is equivalent to 4.4 billion megatons of TNT . That is about 44 times the estimated energy of the asteroid impact that killed the dinosaurs 65 million years ago. Such an energetic impact may completely sterilize Earth, resulting in the extinction of all life on the planet. Fortunately, Hale-Bopp passed through the plane of Earth’s orbit on the far side of the Sun from Earth, so there was never any possibility of an impact. The average time between impacts of cometary nuclei as large as Hale-Bopp also far exceeds the age of the solar system.",
  "That illustrates an important point about the cometary impact hazard. Although asteroid impacts are far more frequent than comet impacts, some comets crossing Earth’s orbit are considerably larger than any of the known near-Earth asteroids. Thus, the largest and most-devastating impacts on Earth are likely to be comets. Other known Earth-crossing comets with large nuclei include Halley’s Comet , 16 by 8 km (10 by 5 miles) in diameter, and Comet 109P/Swift-Tuttle, about 23–30 km (14–19 km) in diameter.",
  "The flux of long-period comets can also vary over time. If a star comes close enough to the Sun to pass through the Oort cloud, in particular at distances less than 10,000 AU, then the star can cause a “shower” of comets to enter the planetary system. The rate of long-period comets crossing Earth’s orbit could increase by a factor of 200, and the complete shower would last for about 2.5 million years. Fortunately, such close stellar passages are rare, about one every 300 million years.",
  "For Jupiter-family comets, the mean time between comet impacts is 28 million years. For Halley-type comets, the mean time between comet impacts is 521 million years. Note that the impact frequency for both Jupiter-family and Halley-type comets may be higher if there are yet undiscovered members of each group.",
  "Comets are among the most-interesting bodies in the solar system because they retain a cosmo-chemical record of the physical and chemical conditions at the time the planets formed. They have been kept in “cold storage” far from the Sun during most of the solar system’s history and thus are essentially unmodified from their primitive state 4.56 billion years ago. Comets pose a small but significant part of the impact hazard on Earth and may account for the largest impacts on Earth over the past three billion years.",
  "General introductory works are John C. Brandt and Robert D. Chapman , Introduction to Comets , 2nd ed. (2003, reissued 2005); Jacques Crovisier and Thérèse Encrenaz , Comet Science: The Study of Remnants From the Birth of the Solar System , trans. from the French by Stephen Lyle (2000); Armand H. Delsemme , “Whence Come Comets?” Sky and Telescope , 77(3):260-264 (March 1989), an elementary discussion on their origin; Fred L. Whipple and Daniel W.E. Green , The Mystery of Comets (1985); and Robert D. Chapman and John C. Brandt , The Comet Book: A Guide for the Return of Halley’s Comet (1984), a historical treatment. Brian G. Marsden and Gareth V. Williams , Catalogue of Cometary Orbits , 16th ed. (2005), covers 2,221 cometary orbits, with detailed references and notes; a complementary work is Gary W. Kronk , Cometography: A Catalog of Comets , 2 vol. (1999–2003). More-advanced works are R.L. Newburn, Jr. , M. Neugebauer , and J. Rahe (eds.), Comets in the Post-Halley Era , 2 vol. (1991), containing reviews, summaries, and scientific papers by about one hundred authors; and K.S. Krishna Swamy , Physics of Comets , 2nd ed. (1997). Donald K. Yeomans , Comets: A Chronological History of Observation, Science, Myth, and Folklore (1991), is a comprehensive reference book on all cometary apparitions, full of anecdotes and highly recommended."
]