[
  " harmony , in music, the sound of two or more notes heard simultaneously. In practice, this broad definition can also include some instances of notes sounded one after the other. If the consecutively sounded notes call to mind the notes of a familiar chord (a group of notes sounded together), the ear creates its own simultaneity in the same way that the eye perceives movement in a motion picture. In such cases the ear perceives the harmony that would result if the notes had sounded together. In a narrower sense, harmony refers to the extensively developed system of chords and the rules that allow or forbid relations between chords that characterizes Western music.",
  "Musical sound may be regarded as having both horizontal and vertical components. The horizontal aspects are those that proceed during time such as melody, counterpoint (or the interweaving of simultaneous melodies), and rhythm. The vertical aspect comprises the sum total of what is happening at any given moment: the result either of notes that sound against each other in counterpoint, or, as in the case of a melody and accompaniment, of the underpinning of chords that the composer gives the principal notes of the melody. In this analogy, harmony is primarily a vertical phenomenon. It also has a horizontal aspect, however, since the composer not only creates a harmonic sound at any given moment but also joins these sounds in a succession of harmonies that gives the music its distinctive personality.",
  "Melody and rhythm can exist without harmony. By far the greatest part of the world’s music is nonharmonic. Many highly sophisticated musical styles, such as those of India and China, consist basically of unharmonized melodic lines and their rhythmic organization. In only a few instances of folk and primitive music are simple chords specifically cultivated. Harmony in the Western sense is a comparatively recent invention having a rather limited geographic spread. It arose less than a millennium ago in the music of western Europe and is embraced today only in those musical cultures that trace their origins to that area.",
  "The concept of harmony and harmonic relationships is not an arbitrary creation. It is based on certain relationships among musical tones that the human ear accepts almost reflexively and that are also expressible through elementary scientific investigation. These relationships were first demonstrated by the Greek philosopher Pythagoras in the 6th century bce . In one of his most famous experiments, a stretched string was divided by simple arithmetical ratios (1:2, 2:3, 3:4,…) and plucked. By this means he demonstrated that the intervals, or distances between tones, that the string sounded before and after it was divided are the most fundamental intervals the ear perceives. These intervals, which occur in the music of nearly all cultures, either in melody or in harmony, are the octave, the fifth, and the fourth. (An octave, as from C to the C above it, encompasses eight white notes on a piano keyboard, or a comparable mixture of white and black notes. A fifth, as from C to G, encompasses five white notes; a fourth, as from C to F, four white notes.) In Pythagoras’s experiment, for example, a string sounding C when cut in half sounds C, or the note an octave above it. In other words, a string divided in the ratio 1:2 yields the octave (c) of its fundamental note (C). Likewise, the ratio 2:3 (or two-thirds of its length) yields the fifth, and the ratio 3:4, the fourth.",
  " ",
  "These notes—the fundamental and the notes a fourth, a fifth, and an octave above it—form the primary musical intervals, the cornerstones on which Western harmony is built.",
  "The organized system of Western harmony as practiced from c. 1650 to c. 1900 evolved from earlier musical practices: from the polyphony—music in several voices, or parts—of the late Middle Ages and the Renaissance and, ultimately, from the strictly melodic music of the Middle Ages that gave rise to polyphony. The organization of medieval music, in turn, derives from the medieval theorists’ fragmented knowledge of ancient Greek music.",
  "Although the music of ancient Greece consisted entirely of melodies sung in unison or, in the case of voices of unequal range, at the octave, the term harmony occurs frequently in the writings on music at the time. Leading theorists such as Aristoxenus (flourished 4th century bce ) provide a clear picture of a musical style consisting of a wide choice of “harmonies,” and Plato and Aristotle discuss the ethical and moral value of one “harmony” over another.",
  "In Greek music a “harmony” was the succession of tones within an octave—in modern usage, a scale. The Greek system embraced seven “harmonies,” or scale types, distinguished from one another by their particular order of succession of tones and semitones (i.e., whole steps and half steps). These “harmonies” were later erroneously called modes, a broader term involving the characteristic contours of a melody, as well as the scale it used.",
  "By the 9th century the practice had arisen in many churches of performing portions of plainchant melodies with an added, harmonizing voice—possibly as a means of greater emphasis, or of reinforcing the sound to carry through the larger churches that were being built at the time. This harmonizing technique, called organum, is the first true example of harmony. The first instances were extremely simple, consisting of adding a voice that exactly paralleled the original melody at the interval of a fourth or fifth (parallel organum).",
  "Within a short time the new technique was explored in far greater diversity. Added harmonic lines took on melodic independence, often moving in opposite, or contrary, motion to the given melody. This style was called free organum. In such cases it was impossible to maintain at all times the accepted harmonies of fourth, fifth, and octave. These intervals were considered consonances—i.e., intervals that, because of their clear sonority, implied repose, or resolution of tension. In free organum they were used at the principal points of articulation: the beginnings and ends of phrases and at key words in the text. In between occurred other intervals that were relatively dissonant; i.e., they implied less repose and more tension.",
  "Free organum is an early example of harmonic motion from repose to tension to repose, basic to Western harmony. The emphasis on consonances at the end of compositions set the final points of arrival in strong relief and reinforced the idea of the cadence, or the finality of the keynote of a mode (on which pieces normally ended).",
  "Until the late 14th century the attitude toward consonance, especially among continental composers, adhered largely to the Pythagorean ideal, which accepted as consonances only intervals expressible in the simplest numerical ratios—fourths, fifths, and octaves. But in England the interval of the third (as from C to E) had been in common use for some time, although it is not expressible as such a simple ratio. A kind of English organum known as gymel, in which the voices move parallel to each other at the interval of a third, existed in the late 12th century; and in the famous Sumer is icumen in canon of the 13th century, a remarkably elaborate piece for the time, the harmonic style is almost entirely centred on thirds. The sixth (as from E to C), an interval closely related to the third, was also common in English music. These two intervals sounded much sweeter than did the hollow-sounding fourths, fifths, and octaves.",
  "By the early 15th century, in part because of the visits of the illustrious English composer John Dunstable to the courts of northern France, the third and sixth had become accepted in European music as consonant intervals (prior to this time they were considered mildly dissonant). The result was an enrichment of the harmony in musical compositions.",
  "This was a time, too, of a developing awareness of tonality, the concept of developing a composition with a definite keynote used as a point of departure at the beginning and as a point of arrival at the final cadence.",
  "At this time there also began the tendency by composers to think of harmony as a “vertical” phenomenon, to regard the sound of notes heard simultaneously as a definite entity. Although the basic style of composition was primarily linear—i.e., concerned with counterpoint—the chords that emerged from the coincidences of notes in contrapuntal lines took on a personality of their own. One phenomenon that bears out this development is fauxbourdon (French: “false bass”), or, in England, faburden. This was a musical style in which three voices move parallel to one another. The middle voice consisted of a succession of notes in parallel organum a fourth below the top voice, and the lowest voice paralleled the sequence a third below the middle voice, producing a chord such as G–B–E, known as a  6  3  , or first inversion, chord. This was originally an English development adopted in the 15th century by continental composers seeking to enrich their harmonies. It combined the continental fondness for “pure” intervals such as the fourth (here, B–E) with the English taste for parallel thirds (here, G–B) and sixths (here, G–E).",
  "A final phenomenon in early 15th-century harmonic practice clearly foreshadowed the end of the ancient modal system in favour of the major and minor modes of the later common practice period. The old modes were used by composers of the time, and they persisted to some extent until the end of the 16th century. But their purity became undermined by a growing tendency to introduce additional notes outside the mode. This was achieved by writing either a flat or sharp sign into the manuscript, or by leaving the performer to understand that he was expected to improvise accordingly. The effect of this musica ficta (Latin: “invented music”), as the technique of introducing nonmodal notes was called, was to break down the distinction between modes. A mode owes its distinctive character to its specific pattern of whole and half steps. Introducing sharps and flats upsets the mode’s normal pattern by placing half steps at unusual points. In many cases the resulting change made one mode resemble another. For example, adding an F♯ to the medieval Mixolydian mode (from G to G on the white keys of the piano) made that mode’s intervals identical with those of the Ionian mode (from C to C on the white keys), which in turn is identical with the modern major scale.",
  " ",
  "Likewise, adding a B♭ to the Dorian mode (from D to D) made its intervals equivalent to those of the Aeolian (A to A) mode, which is identical with one form of the modern minor scale. As this practice became increasingly prevalent, the major and minor modes gradually became predominant over the medieval church modes. The process is especially observable in the music of the late Renaissance.",
  "At the same time there emerged a more sophisticated attitude toward dissonance, favouring its use for expressive purposes. By the time of the Flemish Josquin des Prez, the leading composer of the Renaissance, contrapuntal music had assumed a more resonant texture through the use of four-, five-, and six-part writing instead of the older three-part scoring. The increased number of voices led to further enrichment of the harmony. A typical Josquin device using harmony for expressive purposes was the suspension, a type of dissonant harmony that resolved to a consonance. Suspensions arose from the chords occurring in contrapuntal music. In a suspension one note of a chord is sustained while the other voices change to a new chord. In the new chord the sustained, or “suspended,” note is dissonant. One or two beats later the suspended voice changes pitch so that it resolves into, or becomes consonant with, the chord of the remaining voices. The following illustration from Jean d’Okeghem’s Missa prolationum shows a suspension at the cadence.",
  " ",
  "The suspension, which became a standard musical device, creates tension because the expected harmony is delayed until the suspended voice resolves. Its use as the next to last chord of a cadence, or stopping point, was favoured by composers as a way to enhance, through dissonance resolving to consonance, the sense of completeness of the final chord. The use of suspensions indicates a growing awareness of chords as entities, rather than coincidences, that have expressive potential and of the concept that harmony moves through individual chords toward a goal. This concept was developed in the harmony of the common practice period.",
  "At the end of the 16th century there was an upheaval in musical style. Contrapuntal writing was frequently abandoned, and composers sought out a style that placed greater emphasis on an expressive melodic line accompanied, or supported, by harmonies. This style, called monody, brought about no marked changes in the harmonic language (the particular chords used), although such composers as the Italian Claudio Monteverdi did experiment with a heightened use of dissonance toward expressive ends. The major change at this time was in the conception of harmony. The bass line became the generating force upon which harmonies were built. It was often written out with figures below it to represent the harmonies to be built upon it. From this single line—plus figures, known variously as figured bass, basso continuo, or thorough bass—the accompanying instrumentalists were expected to improvise, or “realize,” a full harmonic underpinning for the melody of the topmost voice or voices. There was, thus, a polarization between the melodic and bass lines, with everything in the middle regarded as harmonic filling-in. This contrasts markedly with the older concept, in which all voices were regarded as of equal importance, with the harmony resulting from the interweaving of all parts.",
  "The approach to harmony according to which chords are purposely built up from their bass note marked the beginning of the common practice period of Western harmony. The transition began around 1600 and was nearly complete by 1650. Certain new concepts became important. These had their roots in the harmonic practices of the late Middle Ages and Renaissance and in the medieval modal system. They include the concepts of key, of functional harmony, and of modulation.",
  "A key is a group of related notes belonging to either a major or minor scale, plus the chords that are formed from those notes, and the hierarchy of relationships among those chords. In a key the tonic, or keynote, such as C in the key of C—and thus the chord built on the keynote—is a focal point toward which all chords and notes in the key gravitate. This is a further development of the idea of a harmonic goal that appeared in the music of the late Renaissance and that ultimately developed from the medieval idea that modes have characteristic final notes.",
  "In the new system keys further assumed relationships to one another. The larger organizational system embracing keys, key relationships, chord relationships, and harmonic goals was called tonality, or the major-minor system of tonality, because the keys were built on major and minor scales. In the tonal system, given chords assumed specific functions in moving toward or away from harmonic goals, and the system assigning goals to all chords was called functional harmony. The main goal was the keynote, or tonic, of the principal, or tonic, key. Modulation, or change of key, became an important factor in composition because it allowed the composer to exploit the listener’s ability to sense the relations between keys.",
  "The approach to harmony that emerged about 1650 (the bass-note approach) was soon formalized in one of the most important musical treatises of the common practice period, Traité de l’harmonie (1722), by the French composer Jean-Philippe Rameau. The crux of Rameau’s theory is the argument that all harmony is based on the “root” or fundamental note of a chord; for example, D. Other notes are placed a third (as D–F or D–F♯) and a fifth (as D–A) above the root. A chord formed in this way is a triad (as D–F–A or D–F♯–A), the basic chord type of the common practice period. The third and fifth above the triad can be placed within the same octave as the root (close position) or can be spread out over several octaves (open position) in compound intervals such as an octave plus a third or two octaves plus a fifth. A triad can exist in its basic, or root position, with the root as the lowest, or bass, note (as D–F♯–A). It can also exist in inversions or rearrangements of its notes placing the third or fifth in the bass, as F♯–A–D (first inversion) and A–D–F♯′ (second inversion).",
  " ",
  "Theorists after Rameau observed that inverted chords are less stable than chords in root position; at the end of a composition, for example, they do not have sufficient finality. Although Rameau’s monumental work contains certain elements that later practices tended to disprove, his writing remains the basis for the study of common-practice harmony.",
  "By Rameau’s time no vestige remained of the ancient modal system, which was replaced by 12 major and 12 minor keys beginning on each of the 12 notes of the piano keyboard (C, C♯, D,…A♯, B). The invention in the late 17th century of equal temperament ( see  tuning and temperament ) made it possible to play keyboard and other instrumental music in all 24 keys of the chromatic system, the system embracing all possible notes of the 24 scales. Such a work as J.S. Bach’s Well-Tempered Clavier was, among many things, a set of exercises to acquaint keyboard players with this newfound freedom. Equal temperament also made it possible for a composer to modulate freely from one key to another to obtain contrast in works of an extended nature. Modulation was no new invention, but it now became of prime importance.",
  "In normal, or functional, harmony, the succession of chords is analyzed by the distance, or interval, between their roots. The most common movement from chord to chord is through “strong” intervals: fourths (as C to F), fifths (as C to G), and seconds (as C to D). A movement from one chord to another having this root relation is strong because the two chords have the fewest notes in common and therefore contrast more with each other. Movement by “weak” intervals—thirds (as C to E) and sixths (as C to the A above it)—is weaker, or less pronounced, because the two chords in this case usually share two out of their three notes; for example, C–E–G and E–G–B, or C–E–G and A–C–E. Similarly, modulation from one key to another in the course of a piece was most characteristically from one key to another whose keynote is a strong interval apart from that of the first key, as from C to G. Usually the modulation was to the key built on the fifth note, or dominant, of the original scale. A work in C major, for example, tended to move toward the area of G. In works in a minor key, the modulation might be to the dominant minor key (A minor to E minor, for example); or it might be to the relative major key (the key that shares the same scale notes as the minor scale but arranging them in major scale order rather than minor scale order [A minor and C major, for example]). In the second case the contrast of major and minor mode appeared to compensate for the weak modulation (A and C are a third apart).",
  "By the early 18th century these modulatory principles were well established and were made use of in musical form. In the keyboard sonatas of Domenico Scarlatti, for example, or the instrumental dance movements in Bach’s partitas, the opening key is well established at the beginning of the piece. There then begins a movement to a new key, normally the dominant key. This is characteristically achieved by an emphasis on chords common to both keys (known as “pivots”), plus a strong musical statement in the new key leading to a cadence in that key. After the modulation there is a process of return to the initial key. During this process the harmonic motion tends to be more rapid, passing quickly through many chords and often including momentary diversions into many new keys, thus lending greater impact to the eventual return to the original key. Such a composition is said to be in “binary form.” In binary form compositions in a minor key, there occasionally occurred an exception to the rule of return to the home key. The composer could at his option return to the tonic major, the major key built on the same keynote, or tonic, as the original minor key—A major from A minor, for example. But even in this case the harmonic goal toward the tonic note (A in this case) remained the same.",
  "This basic modulatory scheme from tonic key to dominant key back to tonic key formed the basis of the large-scale musical forms that developed during the 18th century and persisted well into the 19th. The sonata forms of Mozart and Haydn, with their exposition, development, and recapitulation, adhere closely to this plan, often greatly expanded. Here the movement from the tonic to the dominant key or to the relative major key made up the exposition; the rapid harmonic movement en route back to the tonic made up the development; and the return to the tonic key—usually reinforced by a return of the initial thematic (melodic) material—signalled the start of the recapitulation. An optional final coda, or concluding section, further strengthened the sense of the tonal journey’s having come to an end. In the large, multi-movement works from this period, there was usually a further contrast achieved by having one of the inner movements in another key, but the final movement almost invariably was once again in the same key as the first movement.",
  "This clear and logical system of organization seemed highly consistent with an age that took its cues from the clarity and balance of ancient classical architecture. It was not so consistent, however, with the ideals of the ensuing era of Romanticism. Already in the mature works of Beethoven, there is the beginnings of a breaking-down of the classic modulatory scheme; the opening movement of the Waldstein Sonata , Opus 53 (completed, 1804), for example, is built on a modulation from the tonic, C major, to the sharply contrasting key of E major, instead of the expected key of G. Much of the individual harmonic language of Franz Schubert is based on his purposeful disavowal of modulation via the smooth succession of pivot chords and his fondness, instead, for dropping suddenly into unrelated, and therefore unexpected, keys, as C major to E flat major in the opening movement of the String Quintet in C Major , Opus 163 (1828); C major to E minor in the opening movement of the Symphony No. 9 in C Major (1828), known as the Great Symphony .",
  "Throughout the 19th century there was also a great increase in the use of chromatic tones—tones not belonging to the scale of a given key and that formed “foreign,” sometimes dissonant, harmonies with the notes of that key. In addition to the triad, the typical chord of functional harmony, other more complex chords were used, the harmonic functions of which were extremely ambiguous to the listener. As a result the sense of clearly established tonality created by traditional harmonies began to vanish from the musical language—doubtless in line with composers’ greater obsession with music and all arts as something mysterious and personalized.",
  "By the time of the German composer Richard Wagner, the sense of tonality as the unifying musical force showed definite signs of disintegration. For one thing, Wagner’s idea of the “endless melody” led him in his late works to abjure almost completely, except at the end of acts, the full cadence that establishes tonality. A seeming approach to a cadence in Tristan und Isolde or the Ring des Nibelungen tetralogy is more often than not thwarted by a quick and unprepared switch to a sharply contrasting key and a continuation of the music in that new area. For another, Wagner’s passion for complex chords subject to more than one functional interpretation made the tonality of even short passages difficult to assess.",
  "Although Wagner’s specific harmonic concepts were not universally accepted, during his time or afterward, the blurring of the tonal sense by one means or another became prevalent throughout Western music by the last decades of the 19th century. Even in the works of the Italian Giuseppe Verdi, whose music was regarded as the opposite pole from Wagnerian techniques, this abandonment of clear tonal outlines may be noted: the sudden changes to unrelated keys, the piling up of dissonances that leave the sense of key obscured for minutes at a time, the emergence in his late works of a continuous melodic style that avoided regular, key-defining cadences. In France the blurring of clear outlines characteristic of Impressionist painters found its musical counterpart in the music of Claude Debussy, who employed such devices as the scale consisting entirely of whole tones as a means of sidestepping the tonal feeling created by traditional scales. In the music of later French composers, especially the members of the post-World War I group known as “Les Six,” a common practice was polytonality, or the sounding of two tonalities simultaneously, each defined with relative clarity but neither dominating the other. Similar polytonal methods also occur in the works of the Hungarian-born Béla Bartók and the Russian émigré Igor Stravinsky.",
  "The Wagnerian influence continued most directly, via the music of Gustav Mahler, into the serial techniques developed in the 1920s by Arnold Schoenberg and his Viennese school. In Schoenberg’s serialism the 12 notes of the chromatic scale are arranged into an arbitrary series, or 12-tone row, that becomes the basis for the melodies, counterpoint, and harmonies of the composition. Of these 12 notes no single note is allowed to predominate. This is in complete contrast to the predominance of the tonic, or keynote, in the music of the late Renaissance and the common practice period. Serialism thus completely and systematically obliterated traditional harmonic organization. With no single note serving as a musical goal, tonality—at least as it was known from the 15th century—ceased to be a unifying musical force. Other elements, including serialization of rhythms and tone colours as well as of notes, came to prevail.",
  " ",
  "Although the preceding paragraphs represent a brief outline of composers’ attitudes toward harmony and tonality from the late Middle Ages to the 20th century, there is the danger that the broad outlines may be taken as a rigid statement of standard practices by composers at any period in musical history. Actually, although these outlines remained the general framework in which composers worked, they frequently diverged from it to some extent, particularly in their use of chromatic notes (notes outside the scale of the basic key of the composition) and chromatic chords (chords containing chromatic notes).",
  "The capacity of chromatic tones to add harmonic colour, expressiveness, and interest was apparent to composers from the beginnings of standard harmonic practice. J.S. Bach, for example, in a striking passage at the end of the “Crucifixus” of the Mass in B Minor , lent poignance to the verbal description of the burial of Christ by the musical device of a sudden modulation from B minor to a sharply contrasting new key, G major, that contained notes chromatic to the basic key. Mozart, too, derived much of the drive of his harmonic style from a constant use of chromaticism. A characteristic device of Mozart, for example, is his frequent use of secondary dominants to intensify harmonic movement. A secondary dominant is a chord related to the dominant; specifically, it is the dominant of the dominant. If the key is C, the dominant is G and the secondary dominant is D. Secondary dominant chords by their nature contain a note that is chromatic to the basic key. In Mozart’s music a harmonic progression from tonic chord (I) to dominant chord (V) will often pass through the dominant of the dominant (V-of-V): from I to V-of-V to V. By using the secondary dominant, he expanded the harmonic range of the composition by introducing chromaticism. In his later works Mozart also came to rely more and more on the dissonant value of suspensions to create harmonic interest. The slow introduction of his String Quartet in C Major , K 465 (the Dissonance Quartet ; 1785), consists of a string of long-delayed suspensions so that the harmonic definition at any given instant is as blurred as anything in Wagner.",
  "Although the harmonic style of the common practice period remained a basic framework, the history of music from Mozart’s time to the present shows a constant increase in harmonic density, or the amount of chromaticism and frequent chord changes present. The opening bars of Beethoven’s Eroica Symphony demonstrate the power of chromaticism to enhance the emotional effect.",
  " ",
  "The first eight notes of the theme are resolutely normal in their outline, the triad of E flat major, the tonic chord of the movement. But the ensuing two notes lead violently away from this harmonic stability, with the 10th note a totally unrelated C sharp. This sudden shift completely upsets the harmonic structure and gives unmistakable notice that a long, complex movement will be necessary to right the imbalance. Not until the coda of the movement is this opening theme allowed to follow the expected harmonic outline dictated by the style of the times.",
  "Throughout the 19th century, composers remained rooted in the basic concept of tonality while at the same time doing everything in their power to complicate or obscure the tonal sense for the listener. Even in the 20th century, the large, varied, and important group of composers who are called conservative—among them, Samuel Barber, Aaron Copland, Sir William Walton, Dmitri Shostakovitch, Gian Carlo Menotti, Benjamin Britten—adhered to the concept of tonality only as a challenge. Tonality in their works exists, in the sense that there are extended stable areas that give the impression of being in some definable key. But the intense chromaticism of 20th-century composition, be it conservative or radical, makes it nearly impossible for the listener to grasp the unity of a work in terms of its adherence to a clear tonal plan. Unity is achieved, rather, by melodic means, the organization of rhythms, or even of tone colour. For all practical purposes, the function of tonality as the prime unifying force in musical structures, known from the 15th through the 19th century, is a thing of the past.",
  "The very foundation of harmonic music has been the interplay of consonance and dissonance. Consonance can be defined as the normal range of tone combinations accepted by theorists and composers of any given time as implying repose; dissonance, therefore, refers to any sounds outside that range. From the 19th century on, as writers increasingly explored the exact effect of music on the emotions, these two terms took on the aspect of value judgments. There is a tendency to confuse consonance with concord, or sweet sound, dissonance with discord, or clashing sound. This has led to a certain amount of confusion.",
  "Dissonance is in fact the prime element in the harmony that creates movement, and this has been recognized by composers from the dawn of the harmonic millennium. When the human ear recognizes a certain harmony as unstable within the context of a composition, it demands that this instability be rectified by the resolution to a stable harmony. Dissonance, therefore, has never been forbidden in music, for without it music would be hopelessly static. What has been clearly defined in each era has been, rather, the treatment of dissonance, the approach toward it and away from it in a smooth and logical manner so that the musical flow is of a continual tension and relaxation.",
  "The notion of which specific chords and intervals constitute consonance and dissonance has altered violently from the beginning of harmony. In the earliest harmonic writing, the parallel organum of the 9th century, the accepted intervals were the perfect consonances, or those of the simplest harmonic ratios: the fourth, the fifth, and the octave. As contrapuntal movement among voices became freer, certain other combinations necessarily occurred: thirds and sixths and, in some cases, seconds (as C–D) and sevenths (as C–B). These combinations were regarded as dissonances and were to be confined to weak beats of the musical metre; they were to be resolved, for the most part, by stepwise movement downward to the adjacent consonance. Another interval that the musicians of the modal era took great pains to avoid was the augmented fourth (the tritone, or “devil in music”), an interval containing three whole steps, as between F and B—the whole steps F–G, G–A, and A–B. This interval was considered intolerably dissonant. Primarily to avoid the forbidden, unstable harmonic relationship of the tritone, the use of accidentals (sharps, flats, natural signs) entered music and introduced chromatic tones into a mode.",
  "By the time of Rameau, the concept of the dissonance had altered markedly. The basis of the harmony had changed, as noted above, from the perfect intervals (unison, fourth, fifth, octave) to the triad, or chord such as C–E–G, built of thirds above a root, or bass note. The tonic, or keynote, triad became the point of departure and of arrival for an entire composition and also for melodic phrases and larger sections within that composition. The harmonic movement to the cadence, a prime means of establishing points of articulation, became by the mid-18th century a more or less standard progression of harmonies subject to variation according to the composer’s own powers of imagination. Preceding the tonic chord in these cadences, and pushing toward it, was the chord built on the dominant, or fifth note of the scale. This convention developed because of the nature of the dominant chord. In a dominant chord, the note a third above the root (as B in the chord G–B–D—considering the G chord the dominant and the basic key C) is the seventh note of the scale (C, D, E,…B). This note has a strong leading tendency toward the tonic, or keynote (here, C), because it is only a half step away from the tonic, and is thus called the leading note. Because the leading note is a member of the dominant chord, this chord also has a strong pull toward the tonic chord.",
  "By Rameau’s time it was also a common practice to enhance the pull of the dominant chord to the cadence by adding to it the note a seventh above the root of the chord (as F, in the chord G–B–D–F), that note being the fourth note of the scale (C, D, E, F). Such a chord, a dominant seventh chord (V 7 ) contains two leading notes: the seventh of the scale, here B, with its strong pull toward the tonic, and the fourth of the scale, here F, which has a strong pull toward another of the notes of the tonic chord (in this case toward E in the chord C–E–G), being a half step away from that note. In this way two notes of the dominant seventh chord pulled strongly toward two notes of the tonic chord. Another reason for the strong pull of the seventh chord toward the tonic is that that chord contains a tritone (in this case B–F). Although the tritone was less intolerable by that time than it was to medieval ears, it was still considered a particularly strong dissonance that demanded resolution. This resolution occurred when the dominant seventh chord moved to the tonic chord. In the example below a dominant seventh chord (V 7 ) moves to a tonic chord (I) in the key of C major. Arrows show the resolution of the tritone dissonance. The dominant seventh chord thus became one of the basic chords in functional harmony. In addition, because it contained two dissonances (a seventh, as G–F in the chord G–B–D–F, and a tritone, as B–F in the same chord), it was the first instance of incorporating dissonance into a system built on the basically consonant triad.",
  " ",
  "Throughout the common practice period dissonances were continually added to the basic harmonic language, so that the range of harmony and use of dissonance in late 19th-century music had expanded considerably beyond that of the early 17th century.",
  "Music using the system of functional harmony has a flow of harmonic movement through contrasting chords and through passages from consonant to dissonant to consonant chords. If the change of chords is frequent in relation to the musical rhythm, there is said to be a rapid harmonic rhythm. Similarly, a leisurely pace of chord change is a slow harmonic rhythm. The slow or fast harmonic rhythm of a composition helps define its musical character, and by varying the harmonic rhythm within a piece a composer can create contrast, thereby defining sections of musical form.",
  "Modulation, or change of key, was, like dissonance, increasingly explored during the common practice period. In the sonata forms that emerged as the primary musical forms of the mid-18th century, modulation from the tonic to other keys as a means of obtaining contrast became of prime importance. This musical esthetic involved not only the necessity of modulation itself but also drew much of its strength from the varying rate of modulation. Thus, the exposition, or first section, of the “normal” sonata form involves a modulation from the tonic to a nearby related key—usually the dominant, or in works in a minor key, the relative major. The development, or second section, on the other hand, depended on a rapid series of modulations, the purpose being to cast the return to the tonic in as strong a dramatic light as possible by having the stability of the tonic contrast with the instability of rapid modulation that preceded it.",
  "The process of modulation to many keys involved the addition of dissonant, often chromatic, notes to the basic harmonic outline of a composition. A common way of preparing for the appearance of the dominant key area in a sonata exposition was for the composer to overshoot his mark, moving temporarily to the dominant of the dominant, thereby using chromatic chords. Thus, in the transition from tonic key (C major) to dominant key (G major) in the first movement of Symphony No. 1 in C Major , Opus 21 (1800), of Beethoven, there is considerable emphasis on the chords of D, both major and minor, establishing D as a dominant leading to a cadence on G, the point of arrival. Much of the dissonance in music of the late classic composers is traceable to this use of secondary dominants. The tendency to move quickly through extended sequences (musical patterns repeated at higher or lower pitch) based on secondary dominant chords became a highly sophisticated technique in the mature works of Haydn and Mozart (as, for example, the extraordinary sequence in the slow movement of Haydn’s Symphony No. 104 in D Major , the London Symphony ).",
  "Functional harmony was based on chords built from the diatonic (seven-note) major and minor scales; chromatic notes and chords were integrated into the functional system. Although composers of this period proved remarkably adventurous in straying beyond the limits of purely diatonic harmony, their use of dissonance and chromaticism was at all times both rational and functional. Chords, even though complex, normally resolved sooner or later into the chords toward which they tended, even when the composer, as in the Haydn passage cited, added unstable elements to the chord of resolution and therefore occasioned further resolution.",
  "By the early 19th century, composers became aware that harmony could also serve another purpose: it could exist outside of a purely functional context as a means of enhancing the pure harmonic colour of a composition. The opening of the Quintet in C Major of Schubert provides a simple and quite early example of chords used for the sheer effect of their sound. The C major triad of the first two bars seems to swell in the ensuing two bars into a diminished seventh chord, a chord functioning much like a dominant chord in its pull to its tonic but built instead with a leading note as its root, as, for example, F♯, the leading note of G, on which is built a chord such as F♯–A–C–E♭. (The top and bottom notes of such a chord, here F♯–E♭, encompass the interval of a diminished seventh, giving the chord its name.) In Schubert’s quintet the particular diminished seventh chord used would normally resolve to a chord on G. Instead it simply subsides back to the C major triad of the preceding bars, so that there occurs no real harmonic movement in the opening six bars.",
  "Nineteenth-century harmonic usage, therefore, tended to expand not only the chordal vocabulary itself but also the function of chords. In the former respect there was an increase in the use of chords the particular type of dissonance of which lent them an unstable and a functionally ambiguous quality; for example, a chord that became of prime importance as a means of thickening the harmonic sound and of blurring the exact tonality of a musical passage was the augmented sixth chord. This is an altered chord, or one built by taking a chord normally occurring in its key and chromatically altering it. In this case, two of its notes are changed by a half step. Specifically, an augmented sixth chord is built on the first inversion of a triad, as, for example, A–C–F, the first inversion of the triad F–A–C. Taking the first inversion (A–C–F), the A is flatted and the F is sharpened, resulting in a chord (A♭–C–F♯) that is both dissonant and ambiguous in harmonic function. The ambiguity of sound is partly due to the nature of enharmonic chords, chords that sound identical but in musical notation use different notes (as G♭, identical in sound with F♯). Thus the chord A♭–C–F♯ may move smoothly to a chord built on G, but the identical sounding chord A♭–C–G♭ will progress to a vastly different chord, on D♭.",
  " ",
  "Composers can thus use such ambiguous chords to achieve unusual or expressive harmonies that blur the listener’s expectations and therefore his ability to perceive key and tonality.",
  "The opening of Wagner’s music drama Tristan und Isolde , famous for its ambiguous sense of tonality, is an augmented sixth chord that resolves by way of a second dissonance to the dominant seventh chord of the key of A.",
  " ",
  "This sequence is repeated at a higher pitch, here resolving to the dominant seventh chord of the key of C. Although this passage can be explained in terms of normal harmonic analysis, it was in itself strikingly abnormal for its time. The passage occurs at the beginning of the composition, the point where a composer normally would be expected to establish his basic tonality. In addition, there is considerable doubt as to the exact nature of the resolution. The dominant seventh chord (here the chord of resolution) is itself dissonant, although less so than the augmented sixth chord. The tonality of the passage is obscured, for it is impossible to tell whether the passage is in A minor or A major. Since the notes of the scale that would give this information to the listener are missing from the passage, it is clear that Wagner does not want the listener to be sure. He wants the passage, rather, to stand for the substance of the opera itself: unrequited passion is equal to unresolved harmonies.",
  "Other composers, too, sought out harmonic as well as melodic and rhythmic means to underscore the content of passion, restlessness, mystery, or tragedy in their scores. The unstable, ambiguous chord of the diminished seventh accompanies the appearances of the evil Samiel and his seven supernatural bullets in the opera Der Freischütz ( The Freeshooter , or, more colloquially, The Magic Marksman ) by Carl Maria von Weber. Long strings of this chord, moving rapidly up and down the scale for purely colouristic purposes, also appear in climactic passages of the tone poem Les Préludes , by Franz Liszt, expressing the struggle of the soul against supernatural forces. The highly embroidered piano style of Frédéric Chopin, touched, in passing, on showers of dissonant, often chromatic tones—again used not for any exploitation of their functional value but as a spray of colour used as an overlay for a basically diatonic (nonchromatic) style, well-hidden underneath and recognizable only at the cadence.",
  "Until the genuinely revolutionary Tristan und Isolde of 1865, the increase in the amount of chromaticism in the musical language of the Romantic composers was largely an enhancement of expressive detail. The diatonic (nonchromatic) basis of 18th-century functional harmony was in the main respected, as was the orderly process of modulation as a means for giving structure to large musical forms. With Tristan , and even more markedly with Wagner’s music drama Parsifal , one can discern the beginnings of a gradual but unmistakable dissolution of the diatonic system on which traditional harmony was based. The analysis of Tristan ’s harmony by Rameau’s principles, although possible, is simply unimportant. What matters more is the constant flow of chromaticism, of Wagner’s wide variety of means—altered chords, chains of secondary dominants, and resolutions to chords that themselves prove unstable—for blurring any sense of functional harmony. Doubtless impelled by the dramatic substance of this music drama, he succeeded in evading the cadence, or coming to rest, that traditionally defined harmonic direction.",
  "The impact of this step became apparent in the directions taken by harmony by the end of the 19th century. After Wagner, dissonance, particularly dissonance caused by chromaticism, largely ceased to function as it had in traditional harmony, and composers created their own individual, often experimental, usage of dissonance. No composer, whether he accepted Tristan as a masterpiece or dismissed it as madness, was left untouched by its implications.",
  "In France, where musical culture stood in some ways the direct antithesis to Wagnerism, Claude Debussy evolved his own style that succeeded, as Wagner’s had, in beclouding the harmonic basis of a work either altogether or for extended periods. Debussy was influenced by a number of sources: the Impressionist painters, who were involved with the renunciation of clear perspectives and outlines in favour of the play of light across surfaces and the effect of images only half seen; exotic music, particularly that of Indonesia; and folk music, especially the modal scales of Russia. All of these led him to a partial abandonment of functional tonality. Among the devices he used toward this end is a scale composed entirely of whole tones (as C–D–E–F♯–G♯–A♯–C). Such a scale lacks the distribution of whole and half steps that define the character of the major and minor scales of the common practice period. Chords built from the whole tone scale are by normal harmonic analysis unstable: all possible triads are augmented (the top note is altered by being sharpened; for example, C–E–G♯ instead of C–E–G) and as a result are dissonant. The perfect fourth and fifth, the ancient cornerstones of harmony, do not exist. Because the chords to which dissonances traditionally resolve are impossible with this scale, a work built upon it—e.g., “Voiles” (“Sails”), from the first book of preludes for piano—can be said to exist without harmonic resolution and, therefore, without traditional tonality. Other Debussian devices include the regarding of the seventh chord (e.g., dominant seventh, diminished seventh) as a self-sufficient harmony instead of as a dissonance that must resolve; sequences of sevenths moving parallel to each other giving the effect, in his music, of lines of harmony plus a dissonant descant (a countermelody in the highest part, or voice) blurring any real sense of traditional harmonic movement. This use of self-sufficient seventh chords was also much exploited by Maurice Ravel and came, through his great appeal, into a great deal of the popular music of western Europe and America from the 1920s onward.",
  "Again, as with Wagner, Debussy’s methods cast their shadow over composers both influenced by and hostile to his musical style. Igor Stravinsky, who was a little of both, first mirrored some of Debussy’s harmonic usage in Le Sacre du printemps ( The Rite of Spring ; 1913). In Le Sacre , chords appear, as they often do in Debussy, purely for their colouristic value, related to each other only by virtue of the rhythmic insistence in the music’s patterns. Much of Stravinsky’s harmonic style, however, is actually derived from much simpler elements than Debussy’s. His complex chord structures often break apart to reveal two unrelated and dissonant diatonic chords sounded simultaneously. In the works of his Neoclassical period, Stravinsky reverts to a clear harmonic language reminiscent, at least as regards individual chords, of the 18th century; but in harmonic movement from chord to chord there is a noticeable difference from earlier styles. Stravinsky, even in this clear compositional style that occupied him in the 1920s and into the 1930s, tends to use these classical harmonies in isolation, for the chords move freely one to the other without their classical function.",
  "Similar in a sense to Stravinsky’s pandiatonicism, or use of diatonic chords without the limitations of classical harmonic function, is the tendency toward polytonality in the works of the post-World War I group of French composers known as “Les Six.” These composers, notably Darius Milhaud, worked for a time with simple, diatonic chords piled upon each other in a way that suggested a clash between simultaneous tonal areas, almost a kind of counterpoint of tonalities—again leading to the dissolution of any sense of a single, central key area. Some traces of polytonality also occur in the early works of Bartók, who was much taken with French influences early in his career. But Bartók did not pursue this device to any great extent later on. He turned instead to an exploration of the folk styles of eastern Europe—Hungarian and Romanian, predominantly. His music, though harmonically dense and complex, remained rooted in tonality, with an admixture of harmonies gleaned from the modal scales of folk music.",
  "Certain other composers, similarly obsessed with the desire to expand the harmonic vocabulary but loath to abandon the tonal system entirely, experimented with some success with synthetic scales of their own devising and with chords built of intervals other than the third. The Russian mystic Aleksandr Scriabin and the German Paul Hindemith both worked extensively with chords built out of fourths (as C–F–B♭). Scriabin employed these sounds primarily in a quasi-Impressionist way, using their unusual sounds as sonorous self-sufficient units. His “mystic” chord, shown below, formed the entire basis for many of his later works.",
  " ",
  "Hindemith, whose orientation was toward the Neoclassical, dealt with these chords by devising his own system of harmonic function, creating a quite successful reincarnation of the dissonance–consonance tensions of earlier composers.",
  "The direct influence of Wagner’s methods, however, was felt within the German–Austrian orbit. The restless, unresolved chromaticism of Tristan was directly reflected in the late works of Gustav Mahler. In such a work as the long, slow movement that ends Mahler’s Ninth Symphony , one feels the Tristan influence quite directly: the long, lyric lines move freely through a systematic evasion of cadences and through a widening range of tonalities, often reaching tonal regions far removed from the starting point. Yet Mahler, too, remained a tonal composer, as did Richard Strauss, whose overlays of dissonance in such works as Elektra are easily separable from a basically tonal harmonic movement.",
  "Early scores by the Viennese composer Arnold Schoenberg—such as the string sextet Verklärte Nacht ( Transfigured Night ; 1899), the Chamber Symphony in E Major , Opus 9 (1906), and the first two string quartets—are direct outgrowths of Tristan ’s chromaticism, masking but not obliterating the tonal basis. But by 1912 Schoenberg began actively to question tonality as a musical inevitability and to accept the broader implications of Wagner’s style. From then on the pileup of dissonance in Schoenberg’s music became so pronounced as to make the concept of dissonance itself meaningless. In such a seminal work as the chamber cantata Pierrot Lunaire (1912), tonality has been put aside. In this work it is no longer possible to discuss consonance and dissonance, for these concepts relate to the structure of a composition according to the harmonic principles of tonality.",
  "Schoenberg’s far-reaching musical philosophies, which were epitomized in his invention of the technique of serialism, have had a potent impact on the music of the decades following his own writing. They have also been resisted by large numbers of composers who are conveniently, if not always accurately, described as conservative. The conflict between tonality and atonality (i.e., nontonality) has provided a dynamic dualism for musical styles ever since.",
  "As noted above, melody and harmony were synonymous in classical Greek theory; the term harmony referred not to notes sounded simultaneously, but to the succession of notes, or the scale, out of which melody was formed. During classical antiquity and the European Middle Ages melodies were written that had an inner logic in terms of their scale, or mode, its important notes, and the melodic patterns associated with it. This is also true of many non-Western melodies. After the gradual evolution in Europe, through the polyphony of the late Middle Ages and the Renaissance, of the common practice, or classical, system of Western harmony, the inner logic of melodies was strongly affected by harmony. Because the ear can perceive harmonic patterns in certain groups of notes, even when sounded successively rather than simultaneously, melodies began to carry a strong implication of underlying harmonies. During this period there arose the conception that melody was the surface of harmony. Thus, for example, the partitas for unaccompanied violin by J.S. Bach, despite their melodic basis and lack of outright harmonic underpinning, clearly set forth their basic tonality and harmonic direction. This is achieved by a melodic style that includes frequent scale passages and arpeggiated chords (chord notes played successively, in melodic fashion, rather than simultaneously, as in a chord) that make clear to the listener the scales, harmonies, and keys belonging to the tonality of the composition. Through the 18th century and well into the 19th, melodies tended to be the bearers of their own harmonic implications. The above noted opening of Beethoven’s Eroica Symphony represents this practice at both its height and at the beginnings of its dissolution. The opening eight notes outline an unmistakable E♭ triad, and would do so even if they were sounded unharmonized; the ensuing plunge to the unexpected C♯ likewise indicates by its mere melodic shape the harmonic unrest arising at this juncture.",
  "Nevertheless, melody in the hands of a composer seeking a genuine expressiveness must function with some degree of independence from its harmonic underpinning. The long, expressive dissonances in the vocal lines of Romantic composers not only heighten the passion sought after in the music but also specifically represent a seeking for a heightened independence of melody from harmony.",
  "The shift of harmonic usage in the 20th century can be viewed partly as a marked change in relationships between melody and harmony. In Schoenberg’s techniques, the generating force is the 12-tone row, which is primarily a melodic sequence out of which harmonies, as well as themes, are generated. Thus, it is possible to detect a reversal of the traditional relationship, whereby harmony has become the surface—or at least the final result—of melody.",
  "The chief problem of composition, in any style from ancient times to the present, is the creation of a form, or structure in which the principles of unity and contrast operate in some kind of equilibrium. The listener enters into this process by the use of his powers of recognition and of memory.",
  "In purely melodic, modal music the form often derives from the inner logic of the melody in terms of the important notes and melodic patterns of the mode. In polyphonic music before the common practice period, musical form depended partly on the unity achieved by setting a piece in a given mode, partly on the use of musical themes, and partly on creating harmonic movement and tension toward stopping points, or cadences. During the common practice period—from Bach to Debussy—much of the creation of musical form took place through the organization of harmonies into keys and relationships between keys. Thus, the sonata forms of the 18th and early 19th centuries depended as much on the statement of a key, the movement to other key areas, and the eventual return to the same key as they did on themes and other melodic devices. The composer was likely, of course, to employ the two principles of melody and harmony simultaneously; the return to the tonic key late in the course of a movement was usually reinforced by a restatement of the initial themes. In certain works of Haydn and Mozart, the listener was often thrown off course purposely by the premature return of initial themes in an unexpected key; such devices served further to enhance the drama of the genuine recapitulation, or return to the main key.",
  "By the 19th century, however, the power of harmony to suggest clear formal structures was greatly undermined by freer use of dissonance, which broke down the clarity with which a key was defined. Other customary procedures were also abandoned. Many of Schumann’s songs do not return to the tonic, or home key, for the final cadence. The extended length of Wagner’s music dramas, and their wide-ranging modulation, make it impossible to regard key as a unifying force. Mahler’s Ninth Symphony , the first movement of which is in D major, ends with a movement in D flat major, and since the symphony lasts nearly 90 minutes, there seemed to Mahler to be no reason to pay any closer lip service to classical practices of unity of key. Such necessities, by the time of this symphony, had vanished from the musical language.",
  "The course of harmony after Wagner followed three distinct paths. (1) Within the broad outlines of tonality, composers explored the potential of chords of far greater complexity than the traditional triad. In doing so they often allowed unstable chords such as dominant sevenths to stand as self-sufficient entities, and they greatly increased the use of ambiguous chords such as augmented sixths and diminished sevenths to thicken or occasionally to blur the sense of a stable tonality. (2) Composers broke away from the classical system of tonality by using chords that, although clearly recognizable as derived from earlier harmonic practices, resolved in other than the expected direction. Some also went further afield by substituting for the major and minor scales unusual scales such as whole tone and Gypsy folk music scales, by using chords built out of fourths, and by utilizing polytonality. (3) Composers systematically abandoned tonality through Schoenberg’s technique of granting equal importance to all 12 chromatic tones, rather than allowing one tone to predominate as tonic. When this was done, the concept of a single, predominant key centre vanished entirely in favour of atonality. In such cases, the traditional duality of consonance and dissonance also disappeared.",
  "Among most “progressive” composers of the 20th century, atonality has been extensively explored. By far the greatest concern among avant-garde composers has been to revive contrapuntal writing, or composition stressing the combination of independent melodic lines. This was partly a reaction against the lush harmonies and lyricism of the Romantic period. During the common practice period any counterpoint that occurred was subordinated to the principles of traditional harmony. The 20th-century obsession with counterpoint tended to sweep aside concern with harmonic relationships beyond the incidental fact that clusters of notes in counterpoint are indeed heard simultaneously. In the music of the American Charles Ives, for example, many skeins of fully developed atonal, contrapuntal writing pass by simultaneously, producing momentary sonorities. Such sonorities may occasionally, and quite accidentally, be identical with recognizable harmonies; but these accidental sonorities have little to do with traditional harmonic organization. Similarly, the “tone-cluster” writing of another American innovator, Henry Cowell, whereby a pianist’s forearm sounds every note it can depress at once, can hardly be analyzed as functional harmony in any sense.",
  "Other developments, too, point to the dissolution of traditional attitudes toward harmony. The aleatory, or indeterminacy, experiments of John Cage, Earle Brown, and others assign part of the composer’s melodic, harmonic, and rhythmic events to a specific performer at a specific instance. In such music any discussion of harmonic direction is irrelevant. Most importantly, the rise of electronic music, which breaks away from any traditional scales such as might be produced on “normal” instruments, can only with the greatest stretch of the imagination lend itself to considerations of harmony.",
  "Yet, there is a possible analogy with traditional harmony in electronic music as its musical styles and languages take shape. In the works of Karlheinz Stockhausen, one of the electronic pioneers and a composer of enormous influence among his younger colleagues, there are organizational systems that point to a clear control and regulation of musical elements. The strict control of musical factors such as densities of sonority, rates of rhythmic change and of change in phrase structure, rates of change in the spread of sound in an auditorium through the use of carefully positioned and modulated loudspeakers point toward a new musical system that may possibly be analyzed in terms of a new, fundamentally different harmony.",
  "The dissolution of harmony in the “progressive” music of the 20th century was not a matter of anarchy replacing order. Actually, the common practice period is of relatively short duration against the entire history of harmony. Before Bach other rules existed. Such rules, in contrast to the later system of traditional harmony, depended not on the contrast of keys but on harmonic unity brought about by the use of a given mode. Since Debussy, similarly, harmonic styles have been dictated by new rules or by the desire of many composers to seek out new rules. And, as both the modal and the common practice systems of harmony evolved only after centuries, so is it also safe to predict that the seeming anarchy of much of 20th-century music represents a state of movement toward new harmonic precepts. The question at hand, moreover, is not one of the dissolution of harmony itself, for any notes sounded simultaneously produce a harmony—whether the notes be from traditional scales or from the infinity of musical pitches produceable through electronic means. The matter is, rather, the question of the uses to which these harmonies are put and the changing relations of harmony to musical structure.",
  "An awareness of the value of harmony as pure, expressive sound persists among all composers of the present time. Some have pursued the atonal principles toward the point where harmonic sounds are totally dissonant (which is the same as saying that they are all consonant, because the contrast between consonance and dissonance disappears). Others have written works that consist of almost nothing but static, unadorned harmony—not necessarily harmoniousness. Such a work as Terry Riley’s In C , for example, consists basically of a sustained triad on C (lasting, at the performer’s option, anywhere from 30 minutes to several hours), over which fleeting dissonances are occasionally sounded, seldom more revolutionary than an F sharp or B flat. Here again, although one is more conscious of harmony in this work than of any other musical element, the harmony itself does not move or progress in the traditional sense; the sound exists, but not its function. Here one can discuss the work as pure consonance—which is the same, for lack of harmonic contrast, as pure dissonance.",
  "Thus, in the 20th century the concepts basic to traditional harmony began to lose their importance. In counterpoint harmonies became the incidental result of the combination of melodic lines. New experiments with unusual harmonies (such as tone clusters, functionless in the traditional sense), the lessening of the tension between consonance and dissonance, and the creation of unprecedented harmonies by the use of computers have been the result of a search for new methods of musical organization. This in turn was the natural outgrowth of the blurring and final dissolution of the harmonic system that had prevailed for over two centuries in Western music.",
  "Two works by 20th-century composers that give considerable insight into the role of all musical elements in composition are Paul Hindemith , Unterweisung im Tonsatz (1937–39; Eng. trans., The Craft of Musical Composition , 2 bks., 1941–42); and Arnold Schoenberg , Harmonielehre , 3rd ed. (1922; abridged Eng. translation, Theory of Harmony , 1948). Schoenberg’s formulation of his 12-tone theories may be found in his Style and Idea (1950). Other theoretical works that trace the fluid state of harmony since the later 19th century include Elliott Zuckerman , The First Hundred Years of Wagner’s “Tristan” (1964); Henry Cowell , New Musical Resources (1930, reprinted 1968); and George Perle , Serial Composition and Atonality , 2nd. ed. (1968). Standard textbooks based on the theories of Rameau include Walter Piston , Harmony , 3rd ed. (1962); and Roger Sessions , Harmonic Practice (1951)."
]