[
  "  turtle , (order Testudines), any reptile with a body encased in a bony shell, including tortoises. Although numerous animals , from invertebrates to mammals , have evolved shells, none has an architecture like that of turtles. The turtle shell has a top (carapace) and a bottom (plastron). The carapace and plastron are bony structures that usually join one another along each side of the body, creating a rigid skeletal box. This box, composed of bone and cartilage , is retained throughout the turtle’s life. Because the shell is an integral part of the body, the turtle cannot exit it, nor is the shell shed like the skin of some other reptiles.",
  "  There are approximately 356 species of turtles living on land in all continents except Antarctica and in both salt water and fresh water. Tortoises (family Testudinidae) live exclusively on land and have anatomic features distinguishing them from other turtles, but the term tortoise has long been used to refer to other terrestrial testudines as well, such as the box turtle and the wood turtle . Similarly,  terrapin  was sometimes used to describe any aquatic turtle but is now largely restricted to the edible diamondback terrapin ( Malaclemys terrapin ) of the eastern United States.",
  "Despite turtles’ broad distribution, there are not and never seem to have been a great many species of turtles at any time over the course of their long evolutionary history. The small number of species, however, does not equate to a lack of diversity . There are turtles with carapace lengths (the standard way to measure turtles) of less than 10 cm (4 inches), as in the flattened musk turtle ( Sternotherus depressus ), and of more than 1.5 metres (4.9 feet), as in the leatherback sea turtle ( Dermochelys coriacea ). Some species live in seasonally cold climates with growing seasons of only about three months; others live in the tropics and grow year-round. Some tortoises rarely see water, while other turtles spend virtually their entire lives in it, be it in a single small pond or traveling the vast open ocean .",
  " Emys orbicularis  Both common and rare turtles are kept as pets . In the Western Hemisphere, pond turtles such as the red-eared slider ( Trachemys scripta ) and cooters ( Pseudemys species) are very often seen in pet stores. The ornate shells that make some species valuable as pets also make them vulnerable to extinction in the wild, since these turtles frequently are found only in small geographic areas or do not breed in captivity.",
  "Before the advent of plastics, tortoiseshell from the hawksbill sea turtle ( Eretmochelys imbricata ) was used in eyeglass frames and decorative items. Turtles and their eggs have long been eaten in many parts of the world, and they continue to be in great demand commercially. In some areas, local populations and even entire species have been hunted to extinction.",
  " Dermochelys coriacea Dermochelys coriacea  Such exploitation is not a recent phenomenon. For example, the Native Americans who settled Florida quite possibly ate its giant tortoises to extinction as early as 11,500 years ago. The first colonists of Madagascar eliminated that island’s giant tortoise ( Geochelone grandidieri ) between 2,300 and 2,100 years ago, and European settlers and sailors eliminated giant tortoises from the island of Mauritius during the 1700s and from Réunion by the 1840s. Every sea turtle species has long been killed for meat , with its eggs being harvested from beach  nests as soon as they are laid. This practice now endangers many populations of sea turtles. Before 1969, for example, more than 3,000 female leatherback sea turtles emerged from the ocean annually to nest on the beaches of Terengganu , Malaysia . In the 1990s only 2 to 20 females appeared each year. Their disappearance resulted from years of excessive egg harvesting and the capture and slaughter of juveniles and adults during their migratory search for food . By the 2010s the species was virtually absent from Terengganu.",
  "Overharvesting is not confined to large species. In China , turtles large and small are used for both food and medicine . By the early 1990s, many local populations of turtles had disappeared within the country, so turtles began to be imported from around the world. Some species, such as the three-striped box turtle , or golden coin turtle ( Cuora trifasciata ), are so popular for traditional Chinese celebrations and in traditional Chinese medicine that aquaculturists raise them and can sell individual turtles for tens of thousands of dollars (U.S.), an amazing price for a reptile less than 20 cm (about 8 inches) long.",
  "  The turtle’s shell is an adaptation that protects it from predators, which compensates for the reptile’s slow crawling speed. The carapace and plastron each arose from two types of bone: dermal bones that form in the skin and endochondral bone (bone arising from cartilage ) derived from the skeleton. Evolution has intricately linked these two types of bone to produce the shell of modern turtles. The carapace consists of 10 trunk vertebrae and their ribs, which are overlain by and fused to dermal plates. Another series of dermal plates forms the perimeter of the carapace. The plastron usually contains four pairs of large plates and a single one centred near the front (the anteromedial plate); these plates are large dermal bones, although the anterior ones may contain parts of the shoulder girdle. The shell is variously modified and shaped to meet the needs of defense, feeding, and movement .",
  "Most tortoises have high, domed shells, the major exception being the pancake tortoise ( Malacochersus tornieri ) of southeastern Africa. The pancake tortoise lives among rocky outcroppings, where its flat shell allows it to crawl into crevices to rest. Once in a crevice, the pancake tortoise can inflate its lungs , thus expanding the shell and lodging itself so securely that a predator cannot pull it free. The domed shell of other tortoises and land turtles such as box turtles ( Cuora , Terrapene ) seems to be an adaptation that makes the shell difficult for a predator to hold in its mouth and crush. Among aquatic turtles, some groups are swimmers and usually have streamlined shells; streamlining is best-developed in the sea turtles . Other aquatic turtles, such as the matamata (described below) and snapping turtles, are bottom-walkers; their shells are less streamlined and often have ridged carapaces that may assist in camouflage ( see also  concealing coloration ).",
  " Terrapene carolina major  The manner in which the neck folds is the main criteria for differentiating the two main groups (suborders) of turtles. All turtles, no matter how long or short their necks, have eight cervical vertebrae , but those that fold their neck vertically can withdraw the head into the shell. These are the so-called S-necked, or vertical-necked, turtles of the suborder Cryptodira (meaning “hidden neck”). Turtles that cannot withdraw the head belong to the suborder Pleurodira (meaning “side neck”). ( See also  side-necked turtle ; snake-necked turtle .)",
  "In addition to differences in the neck, skulls vary in size and shape between the two groups, though all are made up of the same bony elements. The pleurodiran and cryptodiran turtles differ fundamentally in lower jaw architecture and musculature. This difference typically yields a flatter and broader skull in the pleurodires—an architecture that may have allowed the evolution of the gape-and-suck feeding mechanism seen in many pleurodires and best developed in the South American matamata ( Chelus fimbriatus or C. fimbriata ). This turtle can quickly enlarge the cavity of its mouth and throat when striking at passing prey. As the turtle’s head nears its victim, the greatly enlarged cavity acts like a vacuum , sucking water and prey into the mouth. As the throat area is compressed, the mouth is opened to allow water to escape but not the prey. Most carnivorous turtles use a head strike to capture their prey and when scavenging.",
  " Chelydra serpentina  No present-day turtles have teeth ; rather, the upper and lower jaws bear keratinous sheaths that fit onto the skull like a pair of false teeth. The edges (occasionally with serrations) are sharp and allow turtles to cut pieces of flesh from carcasses and quickly kill small prey. The cutting edges are also effective in chopping vegetation into bite-size pieces. Turtles do not chew; those that eat mollusks crush them with a broad, thick sheath inside the mouth.",
  "All the turtle’s senses are well-developed, and they are used in avoiding predators and in finding and capturing food. The eyes have the typical anatomy of other vertebrates having good vision . Aquatic turtles have eyes that quickly adjust for aerial or aquatic vision, seeing well in both situations. Tortoises appear to have colour vision , but colour vision is untested for most turtles. Turtles, particularly aquatic ones, are not strongly olfactory, but all are capable of smelling . Some aquatic species have protuberances on the chin in the form of tubercles and papillae. These appear to be mainly tactile, although some are chemosensory (that is, having the ability to sense particular chemical stimuli). The turtle ear has an eardrum flush with the surface of the head. A single bone , the stapes, transmits sound to the inner ear .",
  " Terrapene carolina  Graptemys   Turtles have adapted to a remarkable variety of environments , but the greatest number of species occur in southeastern North America and South Asia. In both areas, most species are aquatic, living in bodies of water ranging from small ponds and bogs to large lakes and rivers . A few are strictly terrestrial ( tortoises ), and others divide their time between land and water. Although turtles as a group are broadly distributed, each species has a preferred habitat and is seldom found elsewhere. For example, both the gopher tortoise ( Gopherus polyphemus ) and the Eastern box turtle ( Terrapene carolina ) live in the southern United States and are equally terrestrial, but they are not usually found together, as the box turtle prefers moist forest and the gopher tortoise open woodlands on sand ridges. The eastern mud turtle ( Kinosternon subrubrum ) is commonly considered an aquatic turtle, yet it spends the summer months in dormancy , estivating beneath vegetation in woodlands adjacent to its pond and stream habitats. The alligator snapping turtle ( Macrochelys temmincki ) lives in the deep, slow-moving streams and backwaters of the U.S. Gulf Coast. Map turtles ( Graptemys ), on the other hand, select the faster-flowing waters of those same streams. The saltwater terrapin ( Malaclemys terrapin ) lives in brackish coastal estuaries and marshes from Cape Cod , Massachusetts, to Padre Island , Texas. In some instances, juvenile sea turtles share these estuaries; larger and older sea turtles swim offshore in coastal waters to the mid-continental shelf.",
  " Apalone spinifera Apalone spinifera Trionyx spiniferus  A comparable range of species and preferred habitats is observed among the South Asian turtles. South Asia has a broad range of habitats and environments, ranging from desert to rainforest and from shallow tropical seas to frigid mountain forest. Turtles are found in most of these habitats, though mostly at low elevations and in waterways. Softshell turtles (family Trionychidae) have their greatest diversity in Asia and occur in most waters, from tiny ponds to large rivers. The Indian and Burmese flapshell turtles (genus Lissemys ) are ubiquitous in slow-moving streams and rice paddies. Their mud colouring and relatively small size (carapaces up to 28 cm [11 inches]) make them inconspicuous and more likely to be overlooked in cultures that view all turtles as harvestable for food or medicine . On the other hand, their giant cousins, the narrow-headed softshells (genus Chitra ) and the Asian giant softshells (genus Pelochelys ), are inhabitants of large, deep rivers and attain shell lengths of over 1 metre (39 inches). They are poorly protected from habitat loss and harvesting, and some are critically endangered species . All softshell turtles are predominantly carnivores , though the flapshells eat some plant matter.",
  "The Asian pond or river turtles (family Geoemydidae) show more diversity than their North American relatives (Emydidae). The six to eight species of Asian box turtles (genus Cuora ) tend to be more aquatic than the American box turtles, spending much of their time in forest ponds and streams. As with the softshell turtles, Asia has two of the largest species of pond turtles—the Asian river turtle, or batagur ( Batagur baska ), and the painted terrapin ( Callagur borneoensis )—with shell lengths to a half-metre (about 20 inches) and weights to 25 kg (55 pounds). Both are tidal river species, tolerating salinities up to about half that of marine salt water, and both include large amounts of fruits and leaves from waterside vegetation in their diet.",
  "Asia has a few tortoises , the most widespread being the elongate tortoise ( Indotestudo elongata ), which is found in a variety of open woodland habitats. Although it is predominantly a herbivore, it consumes invertebrates and is not averse to eating carrion.",
  "Turtles can be very common in some habitats, although in many places human activities have reduced their populations . Turtles also can attain surprisingly high densities, reaching 300 per hectare (120 per acre) in the red-eared slider. In contrast, the North American bog turtle ( Clemmys muhlenbergi ) lives in isolation, each bog containing only a dozen or fewer adults. The Aldabra giant tortoise ( Geochelone gigantea ) of the Indian Ocean has received modest protection, and, as a result, it has attained a total population of more than 100,000 according to some estimates, with densities in some areas of 30 to 160 individuals per hectare (12 to 64 per acre). The International Union for Conservation of Nature (IUCN) has listed the Aldabra giant tortoise as vulnerable since 1996.",
  "  Turtles are not social animals. Although members of the same species may be observed congregating along a stream or basking on a log, there is usually little interaction between individuals ( see also  social behaviour, animal ). Several species may inhabit the same river or lake, but each has different foods , feeding behaviours, and likely different activity periods. For example, a small lake in Georgia may be home to at least seven turtle species: snapping turtles , red-eared sliders, eastern cooters, common mud turtles , loggerhead musk turtles , stinkpots (common musk turtles), and spiny softshell turtles . The snapper is strongly carnivorous and will catch fish, frogs , snakes , and small aquatic birds . The softshell, musk, and mud turtles, meanwhile, will pursue many of the same small aquatic animals but with different preferences: the softshell hunts mainly fish and crayfish , the stinkpot eats mainly snails , insect larvae, and carrion, and the mud turtle primarily feeds on insects, mollusks , and carrion. The slider and cooter, on the other hand, have a mixed diet, the cooter’s being more heavily vegetarian.",
  " Podocnemis unifilis Podocnemis unifilis  Like the Georgia turtles, most turtles eat a variety of foods . Tortoises (family Testudinidae) are herbivores that regularly eat a variety of plants and plant parts as available. Green sea turtles prefer marine grasses but, if these are not available, will eat algae . Many of the large river turtles are also herbivorous—for example, the yellow-spotted Amazon river turtle ( Podocnemis unifilis ), the Asian river turtle, and the Suwannee cooter ( Pseudemys suwanniensis ). Commonly, juvenile aquatic herbivores are insectivores and become herbivorous as they approach adulthood. There are some dietary specialists, however. For example, the Asian black marsh turtle ( Siebenrockiella crassicollis ), the American loggerhead musk turtle ( Sternotherus carinatus ), and the African Zambezi flapshell turtle ( Cyclanorbis frenatum ) eat only mollusks . The leatherback sea turtle predominantly consumes gelatinous prey in the form of jellyfish and salps , apparently timing its movements into different areas to coincide with the seasonal blooms of prey.",
  "Turtles in turn are prey for a variety of animals, mainly as eggs and hatchlings. Sharks will attack even adult sea turtles . Alligators and other crocodilians can crush the shell of most freshwater turtles, and mammalian predators can kill adult turtles on land.",
  "All turtles lay their eggs on land, and none show parental care. Amidst this apparent uniformity, however, there is a variety of reproductive behaviours, ecologies, and physiologies.",
  " Chelonia mydas  The age at which turtles first reproduce varies from only a few years to perhaps as many as 50, with small species typically reaching sexual maturity sooner. Female false map turtles ( Graptemys pseudogeographica ) of the central United States, for example, are about 8 cm (3.2 inches) long and become sexually mature at two to three years. The eastern (U.S.) mud turtle ( Kinosternon subrubrum ) is somewhat larger and spends three to four years as a juvenile. The much larger common snapping turtle ( Chelydra serpentina ), at nearly 30 cm (one foot), takes 10 to 12 years to mature, and the slightly larger Mexican tortoise ( Gopherus flavomarinatus ) matures at 14 to 15 years. Age at maturity is also tied to a turtle’s rate of growth , which relates to both the quantity and quality of food. Along Florida’s Atlantic coast the metre-long (3.3-foot) green sea turtle ( Chelonia mydas ) takes 24 to 28 years to mature, but in Hawaii it takes 30 to 34 years, and some Australian populations near the southern end of the Great Barrier Reef take more than 40 years.",
  "Reproductive activity is generally seasonal, and for most species it occurs in conjunction with a major annual weather change. For most turtles living in temperate regions, reproductive activity can occur with increasing day length and temperature (i.e., in springtime), whereas for many tropical species it may occur late in the dry season or early in the rainy season. Egg laying coincides with periods favourable for the development and emergence of hatchlings—for instance, times of abundant food or of optimal weather conditions.",
  " Courtship and copulation require cooperation because of the turtles’ shells. Mating can occur only with entwined tails, thus placing the male and female vents together for insertion of the penis . Courtship patterns range from a seemingly abusive interaction to a titillation routine that entices the female’s cooperation. Many male tortoises ( Geochelone species) compete with one another in a series of head bobs and ramming charges. A male then uses the same behaviour along with biting to force the female into immobility and submission. In contrast, male sliders ( Trachemys ) and cooters are more subtle in their approach. These freshwater turtles have exceptionally long and straight claws . Depending upon the species , the male swims above or backward in front of the female with his forelimbs extended and his claws brushing the sides of the female’s head. His forefeet vibrate, and the rapid, light touch of the claws titillates the female. In a few species, including the Asian river turtle, or batagur ( Batagur baska ), and the Argentine side-necked turtle ( Phrynops hilarii ), the male develops bright head and trunk colours that signal his reproductive readiness and possibly elicit a female’s cooperation.",
  " Dermochelys coriacea  Leatherbacks and other sea turtles are migratory in that they traverse hundreds of kilometres from their main feeding areas to nest on the beaches where they hatched. Annual migration also occurs in some river-dwelling turtles, including the South American arrau ( Podocnemis expansa ) and the Asian river turtle. These turtles move tens of kilometres along rivers in order to find large sandbars on which to nest. The females of all aquatic species must leave the water to find nesting sites. Some merely move to the banks adjacent to the streams they live in; others travel hundreds of metres across land to find appropriate nesting conditions. Nesting is an arduous affair that exposes females to increased predation.",
  " Eretmochelys imbricata  The number of eggs in a single “clutch” is variable both within and between species. Small species typically lay few eggs—only one or two in the Asian black marsh turtle or the pancake tortoise. The number of eggs increases with body size among species and occasionally within a species. However, the largest turtle, the leatherback sea turtle, produces fewer eggs (average 50–90 eggs per clutch) than do smaller sea turtles such as the hawksbill (140–160 eggs) and olive ridley (105–110 eggs). Similarly, the large Aldabran tortoise (60–80 cm [24–32 inches]) lays 12–14 eggs, yet the common snapping turtle (20–35 cm [8–14 inches]) lays 20–30 eggs, and the Suwanee cooter (14–28 cm [5.5–11 inches]) lays 15–20 eggs.",
  "In most species, eggs are laid annually; a few species lay every other year, and some lay twice in one nesting season. The sea turtles generally nest in three- to four-year cycles, the female usually laying multiple clutches of eggs during each nesting season. Within the season, cycles of egg laying occur about two weeks apart, allowing the female time to rest from the energy-demanding excursion ashore and for ovulation and shelling of the eggs. Turtle eggshells can be leathery, as in sea turtles, or brittle, as in many tortoises. Calcium carbonate is a constituent of both types of shells; the leathery ones simply have less.",
  " Sternotherus odoratus   Nest digging is a fixed behavioral pattern in all but a few species. Most turtles dig chambers in which the eggs are laid. Once the female finds a desired nesting site, she begins to dig the chamber with alternate scooping movements of the hind limbs. As one hind limb supports the rear half of the body, the other one moves inward under the tail and, with a semicircular twist of the foot, spades into the soil and makes a quick sideward flip, dropping the soil to the outside as the hind foot locks into its supportive position. The opposite foot repeats the pattern, and in a slow, steady alternation the nest is dug. Digging stops when the female has reached a depth equal to the length of her outstretched hind limbs. Then, bracing herself on both hind limbs and with the tail centred over the nest, she drops her eggs into the hole. After she has expelled all of her eggs, the hind limbs resume their alternate movement, but now they drag the loose soil back into the nest. The female departs when the nest is filled. A few species, such as the stinkpot, or common musk turtle ( Sternotherus odoratus ), dig a shallow nest with both the fore- and hind feet.",
  "The rate of development inside the egg is temperature -dependent, with warmer temperatures speeding development and cooler temperatures slowing it. As a result, incubation time is variable. For the majority of turtles, incubation ranges between 45 and 75 days. A few species, including the scorpion mud turtle ( Kinosternon scorpioides ) of Central and South America and the northern snake-necked turtle ( Chelodina rugosa ) of Australia, have embryonic diapause , in which development stops soon after an egg is deposited. Diapause is usually triggered by an environmental stimulus, and development resumes when a contrasting stimulus (temperature and moisture) occurs. Incubation with diapause can be as long as 12 months from egg laying to hatching.",
  "In most turtles, sex is determined by temperature. Within a narrow range of temperatures (centred at 28 °C [82 °F]), a clutch of eggs yields nearly equal numbers of females and males. Above that range all hatchlings are female, and below it all are male. The critical period for sex determination is during the second trimester of incubation, and the critical temperature seems to be the average during this period rather than the maximum or minimum.",
  "This temperature effect is substantial. Increases in air and sea surface temperatures related to global warming and shifting regional climate patterns have had substantial effects on the sex ratios of some species. For example, the sex ratio of green sea turtle ( Chelonia mydas ) juveniles and subadults from the beaches of the northern parts of Australia’s Great Barrier Reef became overwhelmingly (more than 99 percent) female between 1960 and 2016 as air temperatures rose.",
  "Hatching consists of two separate events: exiting the egg and emerging from the nest. Hatchlings have a small, pointed, keratinous bump (caruncle) on the tip of the snout. This structure is analogous to the egg tooth possessed by hatchling birds and some other reptiles . The caruncle is pushed against the inner surface of the eggshell, breaking it. The hatchling then tears a larger opening and climbs out of the shell. After a pause to uncurl its body and shell from the cramped conditions within the egg, the hatchling begins to dig upward. This may be an individual effort, but usually several hatchlings dig together, helping one another. In sea turtles a collective effort is required because a single hatchling lacks the energy and time to do it alone. Upon reaching the surface, hatchlings of aquatic species move to the water ; terrestrial ones make their way into leaf litter or dense vegetation to avoid predators. Eggs and hatchlings are the most vulnerable life stages, and many become a meal for almost any predator in their habitat .",
  "The long lives of turtles are often proclaimed as fact, but reliable evidence is lacking for many of the claims. In some cases of exceptional longevity, written records reveal that the individual has mysteriously changed sex or species from beginning to end, hinting at a surreptitious replacement. Even so, if an individual survives to adulthood, it will likely have a life span of two to three decades. In the wild, American box turtles ( Terrapene carolina ) regularly live more than 30 years. Obviously, sea turtles requiring 40 to 50 years to mature will have life spans reaching at least 60 to 70 years. The giant tortoises of the Galapagos Islands and Aldabra ( Geochelone elephantopus and G. gigantea , respectively) have lived more than 60 years in zoos. On occasion it has been reported that individuals of a few tortoise species have lived in captivity for 100 to 250 years. In many of these cases, the reported sex of the supposedly long-lived tortoise, or the species, or even both, have mysteriously changed during captivity, making it difficult to accept the reliability of such reports. 100 years is not the maximum for a few species, especially sea turtles and giant tortoises , but, in order to surpass this age, an extremely nurturing protective environment would be required. For example, “Jonathan” (a giant tortoise residing on St. Helena) is the world’s oldest known terrestrial animal; he was hatched in the early 1830s and likely owes his longevity to having been cared for by humans since the 1880s.",
  "  The earliest turtles known date to the Late Permian Epoch (the Permian Period lasted from 298.9 million to about 251.9 million years ago). Whereas living turtles are toothless, many ancestral forms possessed teeth. Many of the oldest and most primitive forms not only lacked a shell but also lacked a plastron and a carapace. However, early turtles did possess precursors to these structures.",
  " Eunotosaurus africanus , the earliest known turtle, lived 260 million years ago. Eunotosaurus was toothed, and its midsection contained nine elongated trunk vertebrae , nine pairs of broad T-shaped dorsal ribs, and five pairs of gastralia (ventrally located abdominal ribs). Collectively, these modified bones may have served as a type of intermediate shell structure from which the carapace and plastron evolved. (Similar structures also appear in Pappochelys , a younger, toothed species dating from about 240 million ago during the Middle Triassic Epoch .) These broad-ribbed structures likely evolved to provide these early forms with more stability and leverage for burrowing.",
  " Odontochelys semitestacea , a species dating from about 220 million years ago, during the Late Triassic, is the oldest species to possess a complete plastron, broad dorsal ribs , and a series of neural plates, though it lacked a fully developed carapace. Authorities contend that this species is evidence that the carapace evolved after the plastron. This evidence also suggests that the carapace of later turtles arose from neural plates that hardened over time to become flat sections of bone (osteoderms) supported by wide dorsal ribs. Teeth were still present in turtles at this time, appearing in both the upper and lower jaws of Odontochelys .",
  "A slightly younger fossil species, Proganochelys quenstedi , also had teeth, but the teeth were located on the roof of the mouth, not on the upper or lower jaw. In contrast to Odontochelys , the shell of Proganochelys possessed most of the features of modern turtles, and it completely encased the shoulder and pelvic girdles.",
  "Although Odontochelys , Proganochelys , and Eunotosaurus offer insight into early anatomy, the origin of turtles remains a strongly debated issue. There are three main hypotheses concerning their origins, and existing evidence is such that there is a lack of overwhelming support for any one of them. One hypothesis relies heavily on DNA analysis, whereas the others are based on morphological studies of fossils . The DNA hypothesis suggests that turtles were a sister group to the archosaurs (the group that contains the dinosaurs and their relatives, including crocodiles and their ancestors and modern birds and their ancestors). A second hypothesis posits that turtles were more closely related to lizards and tuataras . A third hypothesis suggests that turtles arose as anapsids—a lineage whose skull contained no openings (temporal fenestrae) in the side of the head. The Anapsida is thought to have been ancestral to the Diapsida—a lineage of reptiles whose skull was characterized by two temporal fenestrae and would subsequently include all archosaurs as well as lizards and tuataras.",
  " Proterocheris is another ancient fossil turtle that lived at the same time as Proganochelys . Proterocheris has many features that suggest that it is a side-necked turtle. If this is true, the two major taxonomic groups of living turtles, suborders Pleurodira ( side-necked turtles ) and Cryptodira (hidden necks), had their origins some 230 million years ago during the Triassic Period (251.9 million to 201.3 million years ago) at the latest, making turtles an extremely ancient group. Proterocheris and two later-appearing Triassic genera are likely not true side-necks but turtles that share some pleurodire characteristics. Unquestionable pleurodires do not appear until the Early Cretaceous (about 145 million to 100.5 million years ago), and the first modern side-neck families do not appear until the Late Cretaceous (100.5 million to 66 million years ago).",
  "In tracing back the history of the other turtle suborder, Cryptodira, Kayentachelys aprix of the Late Jurassic (some 150 million years ago) is almost assuredly a cryptodire; it is also the oldest known North American turtle. Other cryptodires are known from the Late Jurassic, although they are not representative of existing families. The largest known turtles are Archelon ischyros , a sea turtle species that lived during the Late Cretaceous and reached a length of about 3.5 metres (12 feet), and Stupendymys geographicus , a side-necked freshwater turtle that lived during the Miocene and whose shell alone measured 2.4 metres (about 8 feet) long. Softshell turtle s (family Trionychidae) are the first modern turtles found in the fossil record , appearing in the Cretaceous Period. The oldest sea turtle ( Santanachelys gaffneyi ) is known from the mid-Cretaceous. It is a member of the Protostegidae, a likely sister group of modern leatherback sea turtles. S. gaffneyi had a streamlined shell of about 1.5 metres (5 feet) and forelimbs well along the evolutionary path to becoming flippers.",
  " Emydoidea blandingii Emydoidea blandingii  The title of the turtle order was formerly Testudinata, although the term Chelonia was also regularly used. In the 1950s, priority was given to the Linnaean name Testudines as the formal name for the turtle order. The manner in which the neck folds is the most obvious feature separating the two modern turtle suborders. Lower levels of taxonomy are defined mainly by differences in the skeleton, primarily the skull and shell. The following classification of living families derives mainly from Turtles of the World , 8th ed. (2017), by the Turtle Taxonomy Working Group of the IUCN .",
  "General treatments of turtles include Raymond Lee Ditmars , Reptiles of the World: Tortoises and Turtles, Crocodilians, Lizards and Snakes of the Eastern and Western Hemispheres (1910, reissued 2016); and Robert Powell , Roger Conant , and Joseph T. Collins , Peterson Field Guide to Reptiles and Amphibians of Eastern and Central North America , 4th ed. (2016). G.J. Anders et al., Turtles of the World: Annotated Checklist and Atlas of Taxonomy, Synonymy, Distribution, and Conservation Status , 8th ed. (2017); and Carl J. Franklin and David C. Killpack , Turtles: An Extraordinary Natural History 245 Million Years in the Making (2011), are taxonomic summaries of the world’s turtles. Michael W. Klemens (ed.), Turtle Conservation (2000), is a semitechnical examination of the biological and environmental issues of turtle conservation. Ronald Orenstein , Turtles, Tortoises, and Terrapins: Survivors in Armor (2002), is a popular and well-illustrated account that addresses conservation and evolution as well as natural history.",
  " Peter L. Lutz , John A. Musick (eds.), The Biology of Sea Turtles , 3 vol. (1996–2013), collects reviews by several authors of major aspects of sea turtle biology, including reproduction, navigation, physiology, and ecology. Other treatments of sea turtle natural history include James R. Spotila , Sea Turtles: A Complete Guide to Their Biology, Behavior, and Conservation (2004); and Wallace J. Nichols , Brad Nahill , and Melissa Gaskill , A Worldwide Travel Guide to Sea Turtles (2014).",
  " C. Kenneth Dodd, Jr. , North American Box Turtles: A Natural History (2002), is a technical summary of the life cycle of the familiar box turtle. Carl H. Ernst , Roger W. Barbour , and Jeffrey E. Lovich , Turtles of the United States and Canada , 2nd ed. (2009), thoroughly reviews the biology of each species of turtle found in those countries. Two natural history guides to regional terrestrial and freshwater turtles are Richard C. Boycott and Ortwin Borquin , The Southern African Tortoise Book , rev. ed. (2000), covering the southern third of Africa; and J.C. Daniel , The Book of Indian Reptiles and Amphibians (2002), which includes a survey of the subcontinent’s turtles. John Cann , Australian Freshwater Turtles (2017), reviews all species of Australian turtles and includes superb colour photographs. Richard D. Bartlett and Patricia Bartlett , Reptiles and Amphibians of the Amazon: An Ecotourist’s Guide (2003), includes a classification guide of turtles inhabiting the Amazon basin."
]