[
  " high-pressure phenomena , changes in physical, chemical, and structural characteristics that matter undergoes when subjected to high pressure. Pressure thus serves as a versatile tool in materials research, and it is especially important in the investigation of the rocks and minerals that form the deep interior of the Earth and other planets.",
  "Pressure, defined as a force applied to an area, is a thermochemical variable that induces physical and chemical changes comparable to the more familiar effects of temperature. Liquid water, for example, transforms to solid ice when cooled to temperatures below 0 °C (32 °F), but ice can also be produced at room temperature by compressing water to pressures roughly 10,000 times above atmospheric pressure. Similarly, water converts to its gaseous form at high temperature or at low pressure.",
  "In spite of the superficial similarity between temperature and pressure, these two variables are fundamentally different in the ways they affect a material’s internal energy. Temperature variations reflect changes in the kinetic energy and thus in the thermodynamic behaviour of vibrating atoms. Increased pressure, on the other hand, alters the energy of atomic bonds by forcing atoms closer together in a smaller volume. Pressure thus serves as a powerful probe of atomic interactions and chemical bonding. Furthermore, pressure is an important tool for synthesizing dense structures, including superhard materials, novel solidified gases and liquids, and mineral-like phases suspected to occur deep within the Earth and other planets.",
  "Numerous units for measuring pressure have been introduced and, at times, are confused in the literature. The atmosphere (atm; approximately 1.034 kilograms per square centimetre [14.7 pounds per square inch], equivalent to the weight of about 760 millimetres [30 inches] of mercury) and the bar (equivalent to one kilogram per square centimetre) are often cited. Coincidently, these units are almost identical (1 bar = 0.987 atm). The pascal, defined as one newton per square metre (1 Pa = 0.00001 bar), is the official SI (Système International d’Unités) unit of pressure. Nevertheless, the pascal has not gained universal acceptance among high-pressure researchers, perhaps because of the awkward necessity of using the gigapascal (1 GPa = 10,000 bars) and terapascal (1 TPa = 10,000,000 bars) in describing high-pressure results.",
  "In everyday experience, greater-than-ambient pressures are encountered in, for example, pressure cookers (about 1.5 atm), pneumatic automobile and truck tires (usually 2 to 3 atm), and steam systems (up to 20 atm). In the context of materials research, however, “high pressure” usually refers to pressures in the range of thousands to millions of atmospheres.",
  "Studies of matter under high pressure are especially important in a planetary context. Objects in the deepest trench of the Pacific Ocean are subjected to about 0.1 GPa (roughly 1,000 atm), equivalent to the pressure beneath a three-kilometre column of rock. The pressure at the centre of the Earth exceeds 300 GPa, and pressures inside the largest planets—Saturn and Jupiter—are estimated to be roughly 2 and 10 TPa, respectively. At the upper extreme, pressures inside stars may exceed 1,000,000,000 TPa.",
  "Scientists study materials at high pressure by confining samples in specially designed machines that apply a force to the sample area. Prior to 1900 these studies were conducted in rather crude iron or steel cylinders, usually with relatively inefficient screw seals. Maximum laboratory pressures were limited to about 0.3 GPa, and explosions of the cylinders were a common and sometimes injurious occurrence. Dramatic improvements in high-pressure apparatuses and measuring techniques were introduced by the American physicist Percy Williams Bridgman of Harvard University in Cambridge, Mass. In 1905 Bridgman discovered a method of packing pressurized samples, including gases and liquids, in such a way that the sealing gasket always experienced a higher pressure than the sample under study, thereby confining the sample and reducing the risk of experimental failure. Bridgman not only routinely attained pressures above 30,000 atm, but he also was able to study fluids and other difficult samples.",
  "Sustained high pressures and temperatures are now commonly produced in massive presses that focus large forces (up to thousands of tons) through two or more strong anvils to compress a sample. The simplest of these devices, introduced by Bridgman in the 1930s, employs two tapered anvils that squeeze the sample like a vise. Although capable of very high pressures—in excess of 50 GPa in designs with sufficient lateral anvil support—the axial force of the squeezer tends to deform samples into extremely flattened, highly strained disks.",
  "The piston-in-cylinder design, in use for more than a century, incorporates a strong metal or carbide piston that is rammed into a sample-confining cylinder. In principle, the piston can be quite long, so a piston-cylinder design can accommodate a much larger volume of sample than the squeezer, depending on the dimensions of the sample-holding cylinder. These devices are rarely used at pressures above about 10 GPa owing to the likelihood of lateral failure (namely, explosive bursting) of the metal cylinder.",
  "The belt apparatus, invented in 1954 by the scientist Tracy Hall of the General Electric Company for use in the company’s diamond-making program, incorporates features of both opposed-anvil and piston-cylinder designs. Two highly tapered pistonlike anvils compress a sample that is confined in a torus, much like a cylinder open at both ends. Hundreds of belt-type devices are in use worldwide in diamond synthesis.",
  "Many high-pressure researchers now employ split-sphere or multianvil devices, which compress a sample uniformly from all sides. Versions with six anvils that press against the six faces of a cube-shaped sample or with eight anvils that compress an octahedral sample are in widespread use. Unlike the simple squeezer, piston-cylinder, and belt apparatuses, multianvil devices can compress a sample uniformly from all sides, while achieving a pressure range with an upper limit of at least 30 GPa. All these types of high-pressure apparatuses can be fitted with a resistance heater, typically a sample-surrounding cylinder of graphite or another electrically conducting heating element, for studies at temperatures up to 2,000 °C.",
  "The diamond-anvil pressure cell, in which two gem-quality diamonds apply a force to the sample, revolutionized high-pressure research. The diamond-anvil cell was invented in 1958 almost simultaneously by workers at the National Bureau of Standards (now the National Institute of Standards and Technology) in Washington, D.C., and at the University of Chicago. The diamond-cell design represented a logical outgrowth of Bridgman’s simple squeezer, but it had one significant advantage over all other high-pressure apparatuses. Diamond, while extremely strong, is also transparent to many kinds of electromagnetic radiation, including gamma rays, X-rays, visible light, and much of the infrared and ultraviolet region. The diamond cell thus provided the first opportunity for high-pressure researchers to observe visually the effects of pressure, and it allowed convenient access for many kinds of experimental techniques, notably X-ray diffraction, Mössbauer (gamma-ray), infrared, and Raman spectroscopies, and other optical spectroscopies.",
  "The utility of the diamond cell was greatly enhanced when Alvin Van Valkenburg, one of the original diamond-cell inventors at the National Bureau of Standards, placed a thin metal foil gasket between the two diamond-anvil faces. Liquids and other fluid samples could thus be confined in a sample chamber defined by the cylindrical gasket wall and flat diamond ends. In 1963 Van Valkenburg became the first person to observe water, alcohol, and other liquids crystallize at high pressure. The gasketed geometry also permitted for the first time X-ray and optical studies of uncrushed single crystals that were hydrostatically pressurized by a fluid medium.",
  "The diamond-anvil cell holds all records for sustained high pressures. The 100 GPa (megabar) mark was surpassed in December 1975 by the geophysicists Ho-kwang Mao and Peter M. Bell, both of the Geophysical Laboratory of the Carnegie Institution of Washington, in Washington, D.C., where they subsequently attained diamond-cell pressures of approximately 300 GPa. Heating of diamond-cell samples, with both resistance heaters and lasers, has extended accessible pressure-temperature conditions to those that prevail in most of the solid Earth.",
  "The highest transient laboratory pressures are generated with high-velocity projectiles that induce extreme shock pressures (which often reach many millions of atmospheres) for times on the order of one microsecond. Shock waves generated by explosions or gas-propelled projectiles induce dramatic changes in physical properties, as well as rapid polymorphic transformations. Carefully timed intense pulses of X-rays or laser light can be used to probe these transient environments. While dynamic high-pressure studies are limited by the difficulty of making precise measurements in such short time periods, these shock techniques have provided insights into changes in atomic structure and properties that occur at extreme conditions. Explosive shock compression has also become an important tool for the synthesis of microcrystalline diamond, which is employed in the polishing of gemstones and other hard materials.",
  "The principal effect of high pressure, observed in all materials, is a reduction in volume and a corresponding shortening of mean interatomic distances. Coincident with these structural modifications are numerous changes, often dramatic, in physical properties.",
  "In four decades of high-pressure research, Bridgman, whose work was honoured by the 1946 Nobel Prize for Physics, documented effects of pressure on electric conductivity, thermal conductivity, viscosity, melting, reaction kinetics, and other material properties. Pressure was found to induce both continuous and discontinuous changes in matter. Bridgman and others observed smoothly varying trends in properties such as electric conductivity or volume versus pressure for most materials. Some substances, however, displayed sharp, reproducible discontinuities in these properties at specific pressures. Dramatic sudden drops in the electric resistance and volume of bismuth, lead, and other metals were carefully documented and provided Bridgman with a useful internal pressure standard for his experiments. These experiments also demonstrated the effectiveness of pressure for studying continuous changes in properties (under uniform compression) and discontinuous changes (phase transitions).",
  "Under sufficiently high pressure, every material is expected to undergo structural transformations to denser, more closely packed atomic arrangements. At room temperature, for example, all gases solidify at pressures not greater than about 15 GPa. Molecular solids like water ice (H 2 O) and carbon tetrachloride (CCl 4 ) often undergo a series of structural transitions, characterized by successively denser arrangements of molecular units.",
  "A different transition mode is observed in oxides, silicates, and other types of ionic compounds that comprise most rock-forming minerals. In these materials, metal or semimetal atoms such as magnesium (Mg) or silicon (Si) are surrounded by regular tetrahedral or octahedral arrangements of four or six oxygen (O) atoms, respectively. High-pressure phase transitions of such minerals often involve a structural rearrangement that increases the number of oxygen atoms around each central cation. The common mineral quartz (SiO 2 ), for example, contains four-coordinated silicon at low pressure, but it transforms to the dense stishovite form with six-coordinated silicon at about 8 GPa. Similarly, the pyroxene mineral with formula MgSiO 3 at room pressure contains magnesium and silicon in six- and four-coordination, respectively, but the pyroxene transforms to the perovskite structure with eight-coordinated magnesium and six-coordinated silicon above 25 GPa. Each of these high-pressure phase transitions results in a denser structure with increased packing efficiency of atoms.",
  "The British scientist J.D. Bernal predicted in 1928 that all matter should ultimately become metallic at sufficient pressure, as the forced overlap of electron orbitals induces electron delocalization. High-pressure transformations from insulator to metal were first observed in iodine, silicon, germanium, and other elements by the American chemist Harry G. Drickamer and his coworkers at the University of Illinois at Urbana-Champaign in the early 1960s. Subsequently, metallization has been documented in several more elements (including the gases xenon and oxygen), as well as in numerous molecular, ionic, and covalent chemical compounds. In 1996 William J. Nellis, an experimental physicist at the Lawrence Livermore National Laboratory, formed metallized hydrogen at a pressure of about 1.4 million atmospheres and temperatures above 3,700 °C.",
  " High-pressure X-ray crystallographic studies of atomic structure reveal three principal compression mechanisms in solids: bond compression, bond-angle bending, and intermolecular compression; they are illustrated in Figure 1 . Bond compression—i.e., the shortening of interatomic distances—occurs to some extent in all compounds at high pressure. The magnitude of this effect has been shown both theoretically and empirically to be related to bond strength. Strong covalent carbon-carbon bonds in diamond experience the lowest percentage of compression: roughly 0.07 percent per GPa. Similarly, ionic bonds between highly charged cations and anions, such as bonds between Si 4+ and O 2− in silicates, are relatively incompressible (less than 0.2 percent per GPa). Relatively weak bonds in alkali halides, on the other hand, display bond compressibilities that often exceed 5.0 percent per GPa.",
  "Many common materials display different bonding characteristics in different directions; this occurs notably in layered compounds (e.g., graphite and layered silicates such as micas) and in chain compounds (e.g., many polymeric compounds and chain silicates, including some varieties of asbestos). The strong dependence of bond compression on bond strength thus commonly leads to anisotropies—that is, significant differences in compression in different crystal directions. In many layered-structure silicates, such as mica, in which relatively strong and rigid layers containing magnesium-oxygen, aluminum-oxygen, and silicon-oxygen bonds alternate with weaker layers containing alkali cations, compressibility is five times greater perpendicular to the layers than within the layers. This differential compressibility and the associated stresses that develop in a high-pressure geologic environment contribute to the development of dramatic layered textures in mica-rich rocks such as schist.",
  "Many common ionic compounds, including the rock-forming minerals quartz, feldspar, garnet, zeolite, and perovskite (the high-pressure MgSiO 3 form of which is thought to be the Earth’s most abundant mineral), are composed of corner-linked clusters—or frameworks—of atomic polyhedrons. A polyhedron consists of a central cation, typically silicon or aluminum in common minerals, surrounded by a regular tetrahedron or octahedron of four or six oxygen atoms, respectively. In framework structures every oxygen atom is bonded to two tetrahedral or octahedral cations, resulting in a three-dimensional polyhedral network. In these materials significant compression can occur by bending the metal-oxygen-metal bond angles between the polyhedrons. The volume change resulting from this bending, and the associated collapse of interpolyhedral spaces, is typically an order of magnitude greater than compression due to bond-length changes alone. Framework structures, consequently, are often much more compressible than structures with only edge- or face-sharing polyhedrons, whose compression is attributable predominantly to bond shortening.",
  "Molecular solids—including ice, solidified gases such as solid oxygen (O 2 ), hydrogen (H 2 ), and methane (CH 4 ), and virtually all organic compounds—consist of an array of discrete, rigid molecules that are linked to one another by weak hydrogen bonds and van der Waals forces. Compression in these materials generally occurs by large decreases in intermolecular distances (often approaching 10 percent per GPa), in contrast to minimal intramolecular compression. Differences in the intermolecular versus intramolecular compression mechanisms lead in some cases to significantly anisotropic compression. Graphite, the low-pressure layered form of elemental carbon in which the “molecules” are continuous two-dimensional sheets, exhibits perhaps the most extreme example of this phenomenon. Carbon-carbon bonds within graphite layers compress only 0.07 percent per GPa (similar to C-C bond compression in diamond), while interlayer compression, dominated by van der Waals forces acting between carbon sheets, is approximately 45 times greater.",
  "The measurement of electric and magnetic properties of materials in a high-pressure environment entails considerable experimental difficulties, especially those associated with attaching leads to pressurized samples or detecting small signals from the experiment. Nevertheless, electric conductivities of numerous materials at high pressures have been documented. The principal classes of solids—insulators, semiconductors, metals, and superconductors—are distinguished on the basis of electric conductivity and its variation with temperature. Insulators, which include most rock-forming oxides and silicates, have been investigated extensively by geophysicists concerned primarily with the behaviour and properties of deep-earth rocks and minerals at extreme conditions. Indeed, it was once hoped that laboratory constraints on such properties could be tied to known values of the Earth’s electric and magnetic properties and thus constrain the composition and temperature gradients of Earth models. It appears, however, that small variations in mineral composition (e.g., the ratio of ferrous to ferric iron) as well as defect properties can play a role orders of magnitude greater than that of pressure alone.",
  "Properties of semiconductors are highly sensitive to pressure, because small changes in structure can result in large changes in electronic properties. The metallizations of silicon and germanium, which are accompanied by an orders-of-magnitude increase in electric conductivity, represent extreme cases of such changes. While simple metals display a general trend of increased conductivity with increased pressure, there are many exceptions. Calcium and strontium exhibit maxima in electric conductivity at 30 and 4 GPa, respectively, while barium and arsenic display both maxima and minima with increasing pressure. Ionic conductors, on the other hand, generally experience decreased electric conductivity at high pressure owing to the collapse of ion pathways.",
  "Pressure has been found to be a sensitive probe of the effects of structure on superconductivity, because the structural changes brought about by pressure often have a significant effect on the critical temperature, that is, the temperature below which a material is a superconductor. In simple metals, pressure tends to decrease the critical temperature, eventually suppressing superconductivity altogether. In some organic superconductors, on the other hand, superconductivity appears only at high pressure (and temperatures near absolute zero). In several of the layered copper-oxide high-temperature superconductors, pressure has a strong positive effect on critical temperature; this phenomenon led to the synthesis of new varieties of superconductors in which smaller cations are used to mimic the structural effect of pressure.",
  "The first measurements of magnetic properties at high pressure were conducted on samples in a diamond-anvil cell using Mössbauer spectroscopy, which is a technique that can probe the coupling of a magnetic field with the nuclear magnetic dipole. High-pressure ferromagnetic-to-paramagnetic transitions were documented in iron metal and in magnetite (Fe 3 O 4 ), while Curie temperatures (i.e., the temperature above which the ferromagnetic properties of a material cease to exist) in several metallic elements were found to shift slightly. Subsequent research has employed high-pressure devices constructed of nonmagnetic beryllium-copper alloys, which were developed for research on samples subjected to strong magnetic fields.",
  "While modest pressures (less than 1,000 atm) have long been used in the manufacture of plastics, in the synthesis of chromium dioxide for magnetic recording tape, and in the growth of large, high-quality quartz crystals, the principal application of high-pressure materials technology lies in the synthesis of diamond and other superhard abrasives. Approximately 100 tons of synthetic diamond are produced each year—a weight comparable to the total amount of diamond mined since biblical times. For centuries diamonds had been identified only as an unusual mineral found in river gravels; scientists had no clear idea about their mode of origin until the late 1860s, when South African miners found diamond embedded in its native matrix, the high-pressure volcanic rock called kimberlite. Efforts to make diamond by subjecting graphitic carbon to high pressure began shortly after that historic discovery.",
  "Prior to the work of Bridgman, sufficient laboratory pressures for driving the graphite-to-diamond transition had not been achieved. Bridgman’s opposed-anvil device demonstrated that the necessary pressures could be sustained, but high temperatures were required to overcome the kinetic barrier to the transformation. Following World War II, several industrial laboratories, including Allmanna Svenska Elektriska Aktiebolaget (ASEA) in Sweden and Norton Company and General Electric in the United States, undertook major efforts to develop a commercial process. Diamond was first synthesized in a reproducible, commercially viable experiment in December 1954, when Tracy Hall, working for General Electric, subjected a mixture of iron sulfide and carbon to approximately 6 GPa and 1,500 °C in a belt-type apparatus. General Electric employees soon standardized the processes and discovered that a melted ferrous metal, which acts as a catalyst, is essential for diamond growth at these conditions.",
  "Diamond-making techniques have been embraced by Earth scientists in their efforts to simulate conditions in the Earth’s deep interior. Of special significance were the high-pressure syntheses of two new forms of silicates. In 1960 Sergei Stishov, while at the Institute of High-Pressure Physics in Moscow, subjected ordinary beach sand (composed of the mineral quartz SiO 2 ) to more than 8 GPa of pressure and high temperatures. The form of silica that he produced was approximately 62 percent denser than quartz and was the first known high-pressure compound to contain silicon in six-coordination rather than the four-coordination found in virtually all crustal minerals. The natural occurrence of this new synthetic material was confirmed within a few weeks by careful examination of shocked material from Meteor Crater, Ariz., U.S. The mineral was named stishovite.",
  "In 1974 a second high-pressure discovery revolutionized geologists’ understanding of deep-earth mineralogy when Lin-gun Liu of the Australian National University used a diamond-anvil cell to synthesize silicate perovskite, a dense form of the common mineral enstatite, MgSiO 3 . Subsequent studies by Liu revealed that many of the minerals believed to constitute the deep interior of the Earth transform to the perovskite structure at lower mantle conditions—an observation that led him to propose that silicate perovskite is the Earth’s most abundant mineral, perhaps accounting for more than half of the planet’s volume.",
  " A. Jayaraman , “The Diamond-Anvil High-Pressure Cell,” Scientific American , 250:42–55 (1984), is a readable review of high-pressure research. P.W. Bridgman , The Physics of High Pressure , new impression with supplement (1949), remains the major source of information on high-pressure history and technology prior to its publication. Maila L. Walters , Science and Cultural Crisis (1990), surveys Percy Bridgman’s accomplishments. Robert M. Hazen , The New Alchemists: Breaking Through the Barriers of High Pressure (1993), reviews the history of high-pressure research, particularly efforts to synthesize diamond. Collected papers from several biannual conferences of the International Association for High-Pressure Research are available in B. Vodar and Ph. Marteau (eds.), High Pressure Science and Technology , 2 vol. (1980); C. Homan , R.K. MacCrone , and E. Whalley (eds.), High Pressure in Science and Technology , 3 vol. (1984); N.J. Trappeniers  et al. (eds.), Proceedings of the Xth AIRAPT International High Pressure Conference on Research in High Pressure Science & Technology (1986); and W.B. Holzapfel and P.G. Johannsen (eds.), High Pressure Science and Technology (1990). Efforts in the Earth sciences are reviewed by S. Akimoto and M.H. Manghnani (eds.), High-Pressure Research in Geophysics (1982); M.H. Manghnani and Yasuhiko Syono (eds.), High-Pressure Research in Mineral Physics (1987); and Y. Syomo and M.H. Manghnani (eds.), High-Pressure Research: Application to Earth and Planetary Sciences (1992)."
]