[
  " liquid , in physics, one of the three principal states of matter, intermediate between gas and crystalline solid.",
  "The most obvious physical properties of a liquid are its retention of volume and its conformation to the shape of its container. When a liquid substance is poured into a vessel, it takes the shape of the vessel, and, as long as the substance stays in the liquid state, it will remain inside the vessel. Furthermore, when a liquid is poured from one vessel to another, it retains its volume (as long as there is no vaporization or change in temperature) but not its shape. These properties serve as convenient criteria for distinguishing the liquid state from the solid and gaseous states. Gases, for example, expand to fill their container so that the volume they occupy is the same as that of the container. Solids retain both their shape and volume when moved from one container to another.",
  "Liquids may be divided into two general categories: pure liquids and liquid mixtures. On Earth, water is the most abundant liquid, although much of the water with which organisms come into contact is not in pure form but is a mixture in which various substances are dissolved. Such mixtures include those fluids essential to life—blood, for example—beverages, and seawater. Seawater is a liquid mixture in which a variety of salts have been dissolved in water. Even though in pure form these salts are solids, in oceans they are part of the liquid phase. Thus, liquid mixtures contain substances that in their pure form may themselves be liquids, solids, or even gases.",
  "The liquid state sometimes is described simply as the state that occurs between the solid and gaseous states, and for simple molecules this distinction is unambiguous. However, clear distinction between the liquid, gaseous, and solid states holds only for those substances whose molecules are composed of a small number of atoms. When the number exceeds about 20, the liquid may often be cooled below the true melting point to form a glass, which has many of the mechanical properties of a solid but lacks crystalline order. If the number of atoms in the molecule exceeds about 100–200, the classification into solid, liquid, and gas ceases to be useful. At low temperatures such substances are usually glasses or amorphous solids, and their rigidity falls with increasing temperature—i.e., they do not have fixed melting points; some may, however, form true liquids. With these large molecules, the gaseous state is not attainable, because they decompose chemically before the temperature is high enough for the liquid to evaporate. Synthetic and natural high polymers (e.g., nylon and rubber) behave in this way.",
  "If the molecules are large, rigid, and either roughly planar or linear, as in cholesteryl acetate or p -azoxyanisole, the solid may melt to an anisotropic liquid (i.e., one that is not uniform in all directions) in which the molecules are free to move about but have great difficulty in rotating. Such a state is called a liquid crystal, and the anisotropy produces changes of the refractive index (a measure of the change in direction of light when it passes from one medium into another) with the direction of the incident light and hence leads to unusual optical effects. Liquid crystals have found widespread applications in temperature-sensing devices and in displays for watches and calculators. However, no inorganic compounds and only about 5 percent of the known organic compounds form liquid crystals. The theory of normal liquids is, therefore, predominantly the theory of the behaviour of substances consisting of simple molecules.",
  "A liquid lacks both the strong spatial order of a solid, though it has the high density of solids, and the absence of order of a gas that results from the low density of gases—i.e., gas molecules are relatively free of each other’s influence. The combination of high density and of partial order in liquids has led to difficulties in developing quantitatively acceptable theories of liquids. Understanding of the liquid state, as of all states of matter, came with the kinetic molecular theory, which stated that matter consisted of particles in constant motion and that this motion was the manifestation of thermal energy. The greater the thermal energy of the particle, the faster it moved.",
  "In very general terms, the particles that constitute matter include molecules, atoms, ions, and electrons. In a gas these particles are far enough from one another and are moving fast enough to escape each other’s influence, which may be of various kinds—such as attraction or repulsion due to electrical charges and specific forces of attraction that involve the electrons orbiting around atomic nuclei. The motion of particles is in a straight line, and the collisions that result occur with no loss of energy, although an exchange of energies may result between colliding particles. When a gas is cooled, its particles move more slowly, and those slow enough to linger in each other’s vicinity will coalesce, because a force of attraction will overcome their lowered kinetic energy and, by definition, thermal energy. Each particle, when it joins others in the liquid state, gives up a measure of heat called the latent heat of liquefaction, but each continues to move at the same speed within the liquid as long as the temperature remains at the condensation point. The distances that the particles can travel in a liquid without colliding are on the order of molecular diameters. As the liquid is cooled, the particles move more slowly still, until at the freezing temperature the attractive energy produces so high a density that the liquid freezes into the solid state. They continue to vibrate, however, at the same speed as long as the temperature remains at the freezing point, and their latent heat of fusion is released in the freezing process. Heating a solid provides the particles with the heat of fusion necessary to allow them to escape one another’s influence enough to move about in the liquid state. Further heating provides the liquid particles with their heat of evaporation, which enables them to escape one another completely and enter the vapour, or gaseous, state.",
  "This starkly simplified view of the states of matter ignores many complicating factors, the most important being the fact that no two particles need be moving at the same speed in a gas, liquid, or solid and the related fact that even in a solid some particles may have acquired the energy necessary to exist as gas particles, while even in a gas some particles may be practically motionless for a brief time. It is the average kinetic energy of the particles that must be considered, together with the fact that the motion is random. At the interface between liquid and gas and between liquid and solid, an exchange of particles is always taking place: slow gas molecules condensing at the liquid surface and fast liquid molecules escaping into the gas. An equilibrium state is reached in any closed system, so that the number of exchanges in either direction is the same. Because the kinetic energy of particles in the liquid state can be defined only in statistical terms (i.e., every possible value can be found), discussion of the liquid (as well as the gaseous) state at the molecular level involves formulations in terms of probability functions.",
  " When the temperature and pressure of a pure substance are fixed, the equilibrium state of the substance is also fixed. This is illustrated in Figure 1 , which shows the phase diagram for pure argon. In the diagram a single phase is shown as an area, two as a line, and three as the intersection of the lines at the triple point, T . Along the line TC , called the vapour-pressure curve, liquid and vapour exist in equilibrium. The liquid region exists to the left and above this line while the gas, or vapour, region exists below it. At the upper extreme, this curve ends at the critical point, C . If line TC is crossed by moving directly from point P to S , there is a distinct phase change accompanied by abrupt changes in the physical properties of the substance (e.g., density, heat capacity, viscosity, and dielectric constant) because the vapour and liquid phases have distinctly different properties. At the critical point, however, the vapour and liquid phases become identical, and above the critical point, the two phases are no longer distinct. Thus, if the substance moves from point P to S by the path PQRS so that no phase-change lines are crossed, the change in properties will be smooth and continuous, and the specific moment when the substance converts from a liquid to a gas is not clearly defined. In fact, the path PQRS demonstrates the essential continuity of state between liquid and gas, which differ in degree but which together constitute the single fluid state. Strictly speaking, the term liquid should be applied only to the denser of the two phases on the line TC , but it is generally extended to any dense fluid state at low temperatures—i.e., to the area lying within the angle CTM .",
  "The extension of line TC below the triple point is called the sublimation curve. It represents the equilibrium between solid and gas, and when the sublimation curve is crossed, the substance changes directly from solid to gas. This conversion occurs when dry ice (solid carbon dioxide) vaporizes at atmospheric pressure to form gaseous carbon dioxide because the triple-point pressure for carbon dioxide is greater than atmospheric pressure. Line TM is the melting curve and represents an equilibrium between solid and liquid; when this curve is crossed from left to right, solid changes to liquid with the associated abrupt change in properties.",
  "The melting curve is initially much steeper than the vapour-pressure curve; hence, as the pressure is changed, the temperature does not change much, and the melting temperature is little affected by pressure. No substance has been found to have a critical point on this line, and there are theoretical reasons for supposing that it continues indefinitely to high temperatures and pressures, until the substance is so compressed that the molecules break up into atoms, ions, and electrons. At pressures above 10 6 bars (one bar is equal to 0.987 atmosphere, where one atmosphere is the pressure exerted by the air at sea level), it is believed that most substances pass into a metallic state.",
  "It is possible to cool a gas at constant pressure to a temperature lower than that of the vapour-pressure line without producing immediate condensation, since the liquid phase forms readily only in the presence of suitable nuclei (e.g., dust particles or ions) about which the drops can grow. Unless the gas is scrupulously cleaned, such nuclei remain; a subcooled vapour is unstable and will ultimately condense. It is similarly possible to superheat a liquid to a temperature where, though still a liquid, the gas is the stable phase. Again, this occurs most readily with clean liquids heated in smooth vessels, because bubble formation occurs around foreign particles or sharp points. When the superheated liquid changes to gas, it does so with almost explosive violence. A liquid also may be subcooled to below its freezing temperature.",
  "To a certain extent the behaviour of all substances is similar to that described in Figure 1 . The parameters that vary from substance to substance are the particular values of the triple-point and critical-point temperature and pressure, the size of the various regions, and the slopes of the lines. Triple-point temperatures range from 14 K (0 K equals -273.15° C [-459.67° F]), for hydrogen to temperatures too high for accurate measurement. Triple-point pressures are generally low, that of carbon dioxide at 5.2 bars being one of the highest. Most are around 10 -3 bar, and those of some hydrocarbons are as low as 10 -7 bar. The normal melting point of a substance is defined as the melting temperature at a pressure of one atmosphere (equivalent to 1.01325 bars); it differs little from the triple-point temperature, because of the steepness of melting lines ( TM in Figure 1 ). Critical temperatures (the maximum temperature at which a gas can be liquefied by pressure) range from 5.2 K, for helium, to temperatures too high to measure. Critical pressures (the vapour pressure at the critical temperature) are generally about 40–100 bars. The normal boiling point is the temperature at which the vapour pressure reaches one atmosphere. The normal liquid range is defined as the temperature interval between the normal melting point and the normal boiling point, but such a restriction is artificial, the true liquid range being from triple point to critical point. Substances whose triple-point pressures are above atmospheric (e.g., carbon dioxide) have no normal liquid range but sublime at atmospheric pressure.",
  "Each of the three two-phase lines in Figure 1 can be described by the Clapeyron equation:   ",
  "In this equation, dp / dT is the slope of the curve under consideration—i.e., either the melting, sublimation, or vapour-pressure curve. Δ H is the latent heat required for the phase change, and Δ V is the change in volume associated with the phase change. Thus, for the sublimation and vapour-pressure curves, since Δ H and Δ V are both positive (i.e., heat is required for vaporization, and the volume increases on vaporization), the slope is always positive. Although not apparent from Figure 1 , the slope of the sublimation curve immediately below the triple point is greater than the slope of the vapour-pressure curve immediately above it, so that the vapour-pressure curve is not continuous through the triple point. This is consistent with equation ( 1 ) because the heat of sublimation for a substance is somewhat larger than its heat of vaporization. The slope of the melting line is usually positive, but there are a few substances, such as water and bismuth, for which the melting-line slope is negative. The negative melting-line slope is consistent with equation ( 1 ) because, for these two substances, the density of the solid is less than the density of the liquid. This is the reason ice floats. For water, this negative volume change (i.e., shrinking) persists to 2.1 kilobars and -22° C, at which point the normal form of ice changes to a denser form, and thereafter the change in volume on melting is positive.",
  "At the critical point the liquid is identical to the vapour phase, and near the critical point the liquid behaviour is somewhat similar to vapour-phase behaviour. While the particular values of the critical temperature and pressure vary from substance to substance, the nature of the behaviour in the vicinity of the critical point is similar for all compounds. This fact has led to a method that is commonly referred to as the law of corresponding states. Roughly speaking, this approach presumes that, if the phase diagram is plotted using reduced variables, the behaviour of all substances will be more or less the same. Reduced variables are defined by dividing the actual variable by its associated critical constant: the reduced temperature, T   r  , equals T / T   c  , and the reduced pressure, p   r  , equals p / p   c  . Then for all substances the critical point occurs at a value of T   r  and p   r  equal to unity. This approach has been used successfully to develop equations to correlate and predict a number of liquid-phase properties including vapour pressures, saturated and compressed liquid densities, heat capacities, and latent heats of vaporization. The corresponding states approach works remarkably well at temperatures between the normal boiling point and the critical point for many compounds but tends to break down near and below the triple-point temperature. At these temperatures the liquid is influenced more by the behaviour of the solid, which has not been successfully correlated by corresponding states methods.",
  "Many of the properties of a liquid near its triple point are closer to those of the solid than to those of the gas. It has a high density (typically 0.5–1.5 grams per cubic centimetre [0.02–0.05 pound per cubic inch]), a high refractive index (which varies from 1.3 to 1.8 for liquids), a high heat capacity at constant pressure (two to four joules per gram per kelvin, one joule being equal to 0.239 calorie), and a low compressibility (0.5–1 × 10 -4 per bar). The compressibility falls to values characteristic of a solid (0.1 × 10 -4 per bar or less) as the pressure increases. A simple and widely used equation describes the change of specific volume with pressure. If V ( p ) is the volume at pressure p,  V (0) is volume at zero pressure, and A and B are positive parameters (constants whose values may be arbitrarily assigned), then the difference in volume resulting from a change in pressure equals the product of A , the pressure, and the volume at zero pressure, divided by the sum of B and the pressure. This is written:   ",
  "The pressure parameter B is close to the pressure at which the compressibility has fallen to half its initial value and is generally about 500 bars for liquids near their triple points. It falls rapidly with increasing temperature.",
  "As a liquid is heated along its vapour-pressure curve, TC , its density falls and its compressibility rises. Conversely, the density of the saturated vapour in equilibrium with the liquid rises; i.e., the number of gas molecules in a fixed space above the liquid increases. Liquid and gas states approach each other with increasing rapidity as the temperature approaches C , until at this point they become identical and have a density about one-third that of the liquid at point T . The change of saturated-gas density ( ρ   g  ) and liquid density ( ρ   l  ) with temperature T can be expressed by a simple equation when the temperature is close to critical. If ρ   c  is the density at the critical temperature T   c  , then the difference between densities equals the difference between temperatures raised to a factor called beta, β :   where β is about 0.34. The compressibility and the heat capacity of the gas at constant pressure ( C   p  ) become infinite as T approaches T   c  from above along the path of constant density. The infinite compressibility implies that the pressure no longer restrains local fluctuations of density. The fluctuations grow to such an extent that their size is comparable with the wavelength of light, which is therefore strongly scattered. Hence, at the critical point, a normally transparent liquid is almost opaque and usually dark brown in colour. The classical description of the critical point and the results of modern measurement do not agree in detail, but recent considerations of thermodynamic stability show that there are certain regularities in behaviour that are common to all substances.",
  "  Between a liquid and its corresponding vapour there is a dividing surface that has a measurable tension; work must be done to increase the area of the surface at constant temperature. Hence, in the absence of gravity or during free fall, the equilibrium shape of a volume of liquid is one that has a minimum area—i.e., a sphere. In the Earth’s field this shape is found only for small drops, for which the gravitational forces, since they are proportional to the volume, are negligible compared with surface forces, which are proportional to the area. The surface tension falls with rising temperature and vanishes at the critical point. There is a similar dividing surface between two immiscible liquids, but this usually has lower tension. There is a tension also between a liquid and a solid (often referred to as surface energy), though it is not directly measurable, because of the rigidity of the solid; it may be inferred, however, under certain assumptions, from the angle of contact between the liquid and the solid (i.e., the angle at which the liquid’s surface meets the solid). If this angle is zero, the liquid surface is parallel to the solid surface and is said to wet the solid completely. The equation relating the angle of contact to the surface tensions of the liquid-air, liquid-solid, and solid-air interfaces is called the Young equation after British scientist Thomas Young .",
  "For a complete understanding of the liquid state of matter, an understanding of behaviour on the molecular level is necessary. Such behaviour is characterized by two quantities called the intermolecular pair potential function, u , and the radial distribution function, g . The pair potential gives information about the energy due to the interaction of a pair of molecules and is a function of the distance r between their centres. Information about the structure or the distances between pairs of molecules is contained in the radial distribution function. If g and u are known for a substance, macroscopic properties can be calculated.",
  " In an ideal gas—where there are no forces between molecules, and the volume of the molecules is negligible— g is unity, which means that the chance of encountering a second molecule when moving away from a central molecule is independent of position. In a solid, g takes on discrete values at distances that correspond to the locations associated with the solid’s crystal structure. Liquids possess neither the completely ordered structure of a solid crystal nor the complete randomness of an ideal gas. The structure in a liquid is intermediate to these two extremes—i.e., the molecules in a liquid are free to move about, but there is some order because they remain relatively close to one another. Although there are an infinite number of possible positions one molecule may assume with respect to another, some are more likely than others. This is illustrated by Figure 2 , which shows an example of the radial distribution function for the dense packing typical of liquids. In this figure, g is a measure of the probability of finding the centre of one molecule at a distance r from the centre of a second molecule. For values of r less than those of the molecular diameter, d , g goes to zero. This is consistent with the fact that two molecules cannot occupy the same space. The most likely location for a second molecule with respect to a central molecule is slightly more than one molecular diameter away, which reflects the fact that in liquids the molecules are packed almost against one another. The second most likely location is a little more than two molecular diameters away, but beyond the third layer preferred locations damp out, and the chance of finding the centre of a molecule becomes independent of position.",
  "The pair potential function, u , is a large positive number for r less than d , assumes a minimum value at the most preferred location (this corresponds to the maximum of the curve in Figure 2 ), and damps out to zero as r approaches infinity. The large positive value of u corresponds to a strong repulsion, while the minimum corresponds to the net result of repulsive and attractive forces.",
  "There are two methods of measuring the radial distribution function g : first, by X-ray or neutron diffraction from simple fluids and, second, by computer simulation of the molecular structure and motions in a liquid. In the first, the liquid is exposed to a specific, single wavelength (monochromatic) radiation, and the observed results are then subjected to a mathematical treatment known as a Fourier transform.",
  "The second method of obtaining the radial distribution function g supposes that the energy of interaction, u , for the liquid under study is known. A computer model of a liquid is set up, in which between 100 and 1,000 molecules are contained within a cube. There are now two methods of proceeding: by Monte Carlo calculation or by what is called molecular dynamics; only the latter is discussed here. Each molecule is assigned a random position and velocity, and Newton’s equations of motion are solved to calculate the path of each molecule in the changing field of all the others. A molecule that leaves the cell is deemed to be replaced by a new one with equal velocity entering through the corresponding point on the opposite wall. After a few collisions per molecule, the distribution of velocities conforms with equations worked out by the Scottish physicist James Clerk Maxwell, and after a longer time the mean positions are those appropriate to the density and mean kinetic energy (i.e., temperature) of the liquid. Functions such as the radial distribution function g can now be evaluated by taking suitable averages as the system evolves in time. Since 1958 such computer experiments have added more to the knowledge of the molecular structure of simple liquids than all the theoretical work of the previous century and continue to be an active area of research for not only pure liquids but liquid mixtures as well.",
  "A sound wave is a series of longitudinal compressions and expansions that travels through a liquid at a speed of about one kilometre per second (0.62 mile per second), or about three times the speed of sound in air. If the frequency is not too high, the compressions and expansions are adiabatic (i.e., the changes take place without transfer of heat) and reversible. Conduction of energy from the hot (compressed) to the cold (expanded) regions of the liquid introduces irreversible effects, which are dissipative, and thus such conduction leads to the absorption of the sound. A longitudinal compression (in the direction of the wave) is a combination of a uniform compression and a shearing stress (a force that causes one plane of a substance to glide past an adjacent plane). Hence, both bulk and shear viscosity also govern the propagation of sound in a liquid.",
  "If a liquid is placed in a static electric field, the field exerts a force on any free carriers of electric charge in the liquid, and the liquid, therefore, conducts electricity. Such carriers are of two kinds: mobile electrons and ions. The former are present in abundance in liquid metals, which have conductivities that are generally about one-third of the conductivity of the corresponding solid. The decrease in conductivity upon melting arises from the greater disorder of the positive ions in the liquid and hence their greater ability to scatter electrons. The contribution of the ions is small, less than 5 percent in most liquid metals, but it is the sole cause of conductivity in molten salts and in their aqueous solutions. Such conductivities vary widely but are much lower than those of liquid metals.",
  "Nonionic liquids (those composed of molecules that do not dissociate into ions) have negligible conductivities, but they are polarized by an electric field; that is, the liquid develops positive and negative poles and also a dipole moment (which is the product of the pole strength and the distance between the poles) that is oriented against the field, from which the liquid acquires energy. This polarization is of three kinds: electron, atomic, and orientation. In electron polarization the electrons in each atom are displaced from their usual positions, giving each molecule a small dipole moment. The contribution of electron polarization to the dielectric constant ( see below  Electrolytes and nonelectrolytes ) of the liquid is numerically equal to the square root of its refractive index. The second effect, atomic polarization, arises because there is a relative change in the mean positions of the atomic nuclei within the molecules. This generally small effect is observed at radio frequencies but not at optical, and so it is missing from the refractive index. The third effect, orientation polarization, occurs with molecules that have permanent dipole moments. These molecules are partially aligned by the field and contribute heavily to the polarization. Thus, the dielectric constant of a nonpolar liquid, such as a hydrocarbon, is about 2, that of a weakly polar liquid, such as chloroform or ethyl ether, about 5, while those of highly polar liquids, such as ethanol and water, range from 25 to 80.",
  "The ability of liquids to dissolve solids, other liquids, or gases has long been recognized as one of the fundamental phenomena of nature encountered in daily life. The practical importance of solutions and the need to understand their properties have challenged numerous writers since the Ionian philosophers and Aristotle. Though many physicists and chemists have devoted themselves to a study of solutions, as of the early 1990s it was still an incompletely understood subject under active investigation.",
  "A solution is a mixture of two or more chemically distinct substances that is said to be homogeneous on the molecular scale—the composition at any one point in the mixture is the same as that at any other point. This is in contrast to a suspension (or slurry), in which small discontinuous particles are surrounded by a continuous fluid. Although the word solution is commonly applied to the liquid state of matter, solutions of solids and gases are also possible; brass, for example, is a solution of copper and zinc, and air is a solution primarily of oxygen and nitrogen with a few other gases present in relatively small amounts.",
  "The ability of one substance to dissolve another depends always on the chemical nature of the substances, frequently on the temperature, and occasionally on the pressure. Water, for example, readily dissolves methyl alcohol but does not dissolve mercury; it barely dissolves benzene at room temperature but does so increasingly as the temperature rises. While the solubility in water of the gases present in air is extremely small at atmospheric pressure, it becomes appreciable at high pressures where, in many cases, the solubility of a gas is (approximately) proportional to its pressure. Thus, a diver breathes air (four-fifths nitrogen) at a pressure corresponding to the pressure around him, and, as he goes deeper, more air dissolves in his blood. If he ascends rapidly, the solubility of the gases decreases so that they leave his blood suddenly, forming bubbles in the blood vessels. This condition (known as the bends) is extremely painful and may cause death; it can be alleviated by breathing, instead of air, a mixture of helium and oxygen because the solubility of helium in blood is much lower than that of nitrogen.",
  "The solubility of one fluid in another may be complete or partial; thus, at room temperature water and methyl alcohol mix in all proportions, but 100 grams of water dissolve only 0.07 gram of benzene. Though it is generally supposed that all gases are completely miscible—i.e., mutually soluble in all proportions—this is true only at normal pressures. At high pressures pairs of chemically unlike gases may exhibit only limited miscibility; for example, at 20° C helium and xenon are completely miscible at pressures below 200 atmospheres but become increasingly immiscible as the pressure rises.",
  "The ability of a liquid to dissolve selectively forms the basis of common separation operations in chemical and related industries. A mixture of two gases, carbon dioxide and nitrogen, can be separated by bringing it into contact with ethanolamine, a liquid solvent that readily dissolves carbon dioxide but barely dissolves nitrogen. In this process, called absorption, the dissolved carbon dioxide is later recovered, and the solvent is made usable again by heating the carbon dioxide-rich solvent, since the solubility of a gas in a liquid usually (but not always) decreases with rising temperature. A similar absorption operation can remove a pollutant such as sulfur dioxide from smokestack gases in a plant using sulfur-containing coal or petroleum as fuel.",
  "The process wherein a dissolved substance is transferred from one liquid to another is called extraction. As an example, phenolic pollutants (organic compounds of the types known as phenol, cresol, and resorcinol) are frequently found in industrial aqueous waste streams, and, since these phenolics are damaging to marine life, it is important to remove them before sending the waste stream back to a lake or river. One such removal technique is to bring the waste stream into contact with a water-insoluble solvent (e.g., an organic liquid such as a high-boiling hydrocarbon) that has a strong affinity for the phenolic pollutant. The solubility of the phenolic in the solvent divided by that in water is called the distribution coefficient, and it is clear that for an efficient extraction process it is desirable to have as large a distribution coefficient as possible.",
  "  Broadly speaking, liquid mixtures can be classified as either solutions of electrolytes or solutions of nonelectrolytes. Electrolytes are substances that can dissociate into electrically charged particles called ions, while nonelectrolytes consist of molecules that bear no net electric charge. Thus, when ordinary salt (sodium chloride, formula NaCl) is dissolved in water, it forms an electrolytic solution, dissociating into positive sodium ions (Na + ) and negative chloride ions (Cl - ), whereas sugar dissolved in water maintains its molecular integrity and does not dissociate. Because of its omnipresence, water is the most common solvent for electrolytes; the ocean is a solution of electrolytes. Electrolyte solutions, however, are also formed by other solvents (such as ammonia and sulfur dioxide) that have a large dielectric constant (a measure of the ability of a fluid to decrease the forces of attraction and repulsion between charged particles). The energy required to separate an ion pair (i.e., one ion of positive charge and one ion of negative charge) varies inversely with the dielectric constant, and, therefore, appreciable dissociation into separate ions occurs only in solvents with large dielectric constants.",
  "Most electrolytes (for example, salts) are nonvolatile, which means that they have essentially no tendency to enter the vapour phase. There are, however, some notable exceptions, such as hydrogen chloride (HCl), which is readily soluble in water, where it forms hydrogen ions (H + ) and chloride ions (Cl - ). At normal temperature and pressure, pure hydrogen chloride is a gas, and, in the absence of water or some other ionizing solvent, hydrogen chloride exists in molecular, rather than ionic, form.",
  "Solutions of electrolytes readily conduct electricity, whereas nonelectrolyte solutions do not. A dilute solution of hydrogen chloride in water is a good electrical conductor, but a dilute solution of hydrogen chloride in a hydrocarbon is a good insulator. Because of the large difference in dielectric constants, hydrogen chloride is ionized in water but not in hydrocarbons.",
  "While classification under the heading electrolyte-solution or nonelectrolyte-solution is often useful, some solutions have properties near the boundary between these two broad classes. Although such substances as ordinary salt and hydrogen chloride are strong electrolytes—i.e., they dissociate completely in an ionizing solvent—there are many substances, called weak electrolytes, that dissociate to only a small extent in ionizing solvents. For example, in aqueous solution, acetic acid can dissociate into a positive hydrogen ion and a negative acetate ion (CH 3 COO - ), but it does so to a limited extent; in an aqueous solution containing 50 grams acetic acid and 1,000 grams water, less than 1 percent of the acetic acid molecules are dissociated into ions. Therefore, a solution of acetic acid in water exhibits some properties associated with electrolyte solutions (e.g., it is a fair conductor of electricity), but in general terms it is more properly classified as a nonelectrolyte solution. By similar reasoning, an aqueous solution of carbon dioxide is also considered a nonelectrolyte solution even though carbon dioxide and water have a slight tendency to form carbonic acid, which, in turn, dissociates to a small extent to hydrogen ions and bicarbonate ions (HCO 3  - ).",
  "When two substances mix to form a solution, heat is either evolved (an exothermic process) or absorbed (an endothermic process); only in the special case of an ideal solution do substances mix without any heat effect. Most simple molecules mix with a small endothermic heat of solution, while exothermic heats of solution are observed when the components interact strongly with one another. An extreme example of an exothermic heat of mixing is provided by adding an aqueous solution of sodium hydroxide, a powerful base, to an aqueous solution of hydrogen chloride, a powerful acid; the hydroxide ions (OH - ) of the base combine with the hydrogen ions of the acid to form water, a highly exothermic reaction that yields 75,300 calories per 100 grams of water formed. In nonelectrolyte solutions, heat effects are usually endothermic and much smaller, often about 100 calories, when roughly equal parts are mixed to form 100 grams of mixture.",
  "Formation of a solution usually is accompanied by a small change in volume. If equal parts of benzene and stannic chloride are mixed, the temperature drops; if the mixture is then heated slightly to bring its temperature back to that of the unmixed liquids, the volume increases by about 2 percent. On the other hand, mixing roughly equal parts of acetone and chloroform produces a small decrease in volume, about 0.2 percent. It frequently happens that mixtures with endothermic heats of mixing expand—i.e., show small increases in volume—while mixtures with exothermic heats of mixing tend to contract.",
  "A large decrease in volume occurs when a gas is dissolved in a liquid. For example, at 0° C and atmospheric pressure, the volume of 28 grams of nitrogen gas is 22,400 cubic centimetres. When these 28 grams of nitrogen are dissolved in an excess of water, the volume of the water increases only 40 cubic centimetres; the decrease in volume accompanying the dissolution of 28 grams of nitrogen in water is therefore 22,360 cubic centimetres. In this case, it is said that the nitrogen gas has been condensed into a liquid, the word condense meaning “to make dense”—i.e., to decrease the volume.",
  "The composition of a liquid solution means the composition of that solution in the bulk—that is, of that part that is not near the surface. The interface between the liquid solution and some other phase (for example, a gas such as air) has a composition that differs, sometimes very much, from that of the bulk. The environment at an interface is significantly different from that throughout the bulk of the liquid, and in a solution the molecules of a particular component may prefer one environment over the other. If the molecules of one component in the solution prefer to be at the interface as opposed to the bulk, it is said that this component is positively adsorbed at the interface. In aqueous solutions of organic liquids, the organic component is usually positively adsorbed at the solution-air interface; as a result, it is often possible to separate a mixture of an organic solute from water by a process called froth separation. Air is bubbled vigorously into the solution, and a froth is formed. The composition of the froth differs from that of the bulk because the organic solute concentrates at the interfacial region. The froth is mechanically removed and collapsed, and, if further separation is desired, a new froth is generated. The tendency of some dissolved molecules to congregate at the surface has been utilized in water conservation. A certain type of alcohol, when added to water, concentrates at the surface to form a barrier to evaporating water molecules. In warm climates, therefore, water loss by evaporation from lakes can be significantly reduced by introducing a solute that adsorbs positively at the lake-air interface.",
  "The composition of a solution can be expressed in a variety of ways, the simplest of which is the weight fraction, or weight percent; for example, the salt content of seawater is about 3.5 weight percent—i.e., of 100 grams of seawater, 3.5 grams is salt. For a fundamental understanding of solution properties, however, it is often useful to express composition in terms of molecular units such as molecular concentration, molality, or mole fraction. To understand these terms, it is necessary to define atomic and molecular weights. The atomic weight of elements is a relative figure, with one atom of the carbon-12 isotope being assigned the atomic weight of 12; the atomic weight of hydrogen is then approximately 1, of oxygen approximately 16, and the molecular weight of water (H 2 O) 18. The atomic and molecular theory of matter asserts that the atomic weight of any element in grams must contain the same number of atoms as the atomic weight in grams (the gram-atomic weight) of any other element. Thus, two grams of molecular hydrogen (H 2 )—its gram-molecular weight—contain the same number of molecules as 18 grams of water or 32 grams of oxygen molecules (O 2 ). Further, a specified volume of any gas (at low pressure) contains the same number of molecules as the same volume of any other gas at the same temperature and pressure. At standard temperature and pressure (0° C and one atmosphere) the volume of one gram-molecular weight of any gas has been determined experimentally to be approximately 22.4 litres (23.7 quarts). The number of molecules in this volume of gas, or in the gram-molecular weight of any compound, is called Avogadro’s number.",
  "Molecular concentration is the number of molecules of a particular component per unit volume. Since the number of molecules in a litre or even a cubic centimetre is enormous, it has become common practice to use what are called molar, rather than molecular, quantities. A mole is the gram-molecular weight of a substance and, therefore, also Avogadro’s number of molecules (6.02 × 10 23 ). Thus, the number of moles in a sample is the weight of the sample divided by the molecular weight of the substance; it is also the number of molecules in the sample divided by Avogadro’s number. Instead of using molecular concentration, it is more convenient to use molar concentration; instead of saying, for example, that the concentration is 12.04 × 10 23 molecules per litre, it is simpler to say that it is two moles per litre. Concentration in moles per litre (i.e., molarity) is usually designated by the letter M.",
  "In electrolyte solutions it is common to distinguish between the solvent (usually water) and the dissolved substance, or solute, which dissociates into ions. For these solutions it is useful to express composition in terms of molality, designated as m , a unit proportional to the number of undissociated solute molecules (or, alternatively, to the number of ions) per 1,000 grams of solvent. The number of molecules or ions in 1,000 grams of solvent usually is very large, so molality is defined as the number of moles per 1,000 grams of solvent.",
  "Many compounds do not exist in molecular form, either as pure substances or in their solutions. The particles that make up sodium chloride (NaCl), for example, are sodium ions (Na + ) and chloride ions (Cl - ), and, although equal numbers of these two ions are present in any sample of sodium chloride, no Na + ion is associated with a particular Cl - ion to form a neutral molecule having the composition implied by the formula. Therefore, even though the compositions of such compounds are well defined, it would be erroneous to express concentrations of their solutions in terms of molecular weights. A useful concept in cases of this kind is that of the formula weight, defined as the sum of the weights of the atoms in the formula of the compound; thus, the formula weight of sodium chloride is the sum of the atomic weights of sodium and chlorine, 23 plus 35.5, or 58.5, and a solution containing 58.5 grams of sodium chloride per litre is said to have a concentration of one formal, or 1 F.",
  "It often is useful to express the composition of nonelectrolyte solutions in terms of mole fraction or mole percentage. In a binary mixture—i.e., a mixture of two components, 1 and 2—there are two mole fractions, x  1 and x  2 , which satisfy the relation x  1 + x  2 = 1. The mole fraction x  1 is the fraction of molecules of species 1 in the solution, and x  2 is the fraction of molecules of species 2 in the solution. (Mole percentage is the mole fraction multiplied by 100.)",
  "The composition of a nonelectrolyte solution containing very large molecules, known as polymers, is most conveniently expressed by the volume fraction (Φ)—i.e., the volume of polymer used to prepare the solution divided by the sum of that volume of polymer and the volume of the solvent.",
  "A quantitative description of liquid-solution properties when the system is in equilibrium is provided by relating the vapour pressure of the solution to its composition. The vapour pressure of a liquid, pure or mixed, is the pressure exerted by those molecules that escape from the liquid to form a separate vapour phase above the liquid. If a quantity of liquid is placed in an evacuated, closed container the volume of which is slightly larger than that of the liquid, most of the container is filled with the liquid, but, immediately above the liquid surface, a vapour phase forms, consisting of molecules that have passed through the liquid surface from liquid to gas; the pressure exerted by that vapour phase is called the vapour (or saturation) pressure. For a pure liquid, this pressure depends only on the temperature, the best-known example being the normal boiling point, which is that temperature at which the vapour pressure is equal to the pressure of the atmosphere. The vapour pressure is one atmosphere at 100° C for water, at 78.5° C for ethyl alcohol, and at 125.7° C for octane. In a liquid solution, the component with the higher vapour pressure is called the light component, and that with the lower vapour pressure is called the heavy component.",
  "In a liquid mixture, the vapour pressure depends not only on the temperature but also on the composition, and the key problem in understanding the properties of solutions lies in determining this composition dependence. The simplest approximation is to assume that, at constant temperature, the vapour pressure of a solution is a linear function of its composition (i.e., as one increases, so does the other in such proportion that, when the values are plotted, the resulting graph is a straight line). A mixture following this approximation is called an ideal solution.",
  "In a pure liquid, the vapour generated by its escaping molecules necessarily has the same composition as that of the liquid. In a mixture, however, the composition of the vapour is not the same as that of the liquid; the vapour is richer in that component whose molecules have greater tendency to escape from the liquid phase. This tendency is measured by fugacity, a term derived from the Latin fugere (“to escape, to fly away”). The fugacity of a component in a mixture is (essentially) the pressure that the component exerts in the vapour phase when the vapour is in equilibrium with the liquid mixture. (A state of equilibrium is attained when all the properties remain constant in time and there is no net transfer of energy or matter between the vapour and the liquid.) If the vapour phase can be considered to be an ideal gas (i.e., the molecules in the gas phase are assumed to act independently and without any influence on each other), then the fugacity of a component, i , is equal to its partial pressure, which is defined as the product of the total vapour pressure, P , and the vapour-phase mole fraction, y   i  . Assuming ideal gas behaviour for the vapour phase, the fugacity ( y   i   P ) equals the product of the liquid-phase mole fraction, x   i  , the vapour pressure of pure liquid at the same temperature as that of the mixture, P   i  °, and the activity coefficient, γ   i  . The real concentration of a substance may not be an accurate measure of its effectiveness, because of physical and chemical interactions, in which case an effective concentration must be used, called the activity. The activity is given by the product of the mole fraction x   i  and the activity coefficient γ   i  . The equation is:   ",
  "In a real solution, the activity coefficient, γ   i  , depends on both temperature and composition, but, in an ideal solution, γ   i  equals 1 for all components in the mixture. For an ideal binary mixture then, the above equation becomes, for components 1 and 2, y  1  P = x  1  P  1 ° and y  2  P = x  2  P  2 °, respectively. Upon adding these equations—recalling that x  1 + x  2 = 1 and y  1 + y  2 = 1—the total pressure, P , is shown to be expressed by the equation P = x  1  P  1 ° + x  2  P  2 ° = x  1 [ P  1 ° - P  2 °] + P  2 °, which is a linear function of x  1 .",
  "Assuming γ  1 = γ  2 = 1, equations for y  1  P and y  2  P express what is commonly known as Raoult’s law, which states that at constant temperature the partial pressure of a component in a liquid mixture is proportional to its mole fraction in that mixture (i.e., each component exerts a pressure that depends directly on the number of its molecules present). It is unfortunate that the word law is associated with this relation, because only very few mixtures behave according to the equations for ideal binary mixtures. In most cases the activity coefficient, γ   i  , is not equal to unity. When γ   i  is greater than 1, there are positive deviations from Raoult’s law; when γ   i  is less than 1, there are negative deviations from Raoult’s law.",
  " An example of a binary system that exhibits positive deviations from Raoult’s law is represented in Figure 3 , the partial pressures and the total pressure being related to the liquid-phase composition; if Raoult’s law were valid, all the lines would be straight, as indicated by the dashed lines. As a practical result of these relationships, it is often possible by a series of repeated vaporizations and condensations to separate a liquid mixture into its components, a sequence of steps called fractional distillation.",
  "When the vapour in equilibrium with a liquid mixture has a composition identical to that of the liquid, the mixture is called an azeotrope. It is not possible to separate an azeotropic mixture by fractional distillation because no change in composition is achieved by a series of vaporizations and condensations. Azeotropic mixtures are common. At the azeotropic composition, the total pressure (at constant temperature) is always either a maximum or a minimum with respect to composition, and the boiling temperature (at constant pressure) is always either a minimum or a maximum temperature.",
  "Only pairs of liquids that are completely miscible have been considered so far. Many pairs of liquids, however, are only partially miscible in one another, the degree of miscibility often depending strongly on temperature. In most cases, rising temperature produces enhanced solubility, but this is not always so. For example, at 50° C the solubility (weight percent) of n -butyl alcohol in water is 6.5 percent, whereas that of water in n -butyl alcohol is 22.4 percent. At 127° C, the upper consolute temperature, complete miscibility is attained: above 127° C the two liquids mix in all proportions, but below 127° C they show a miscibility gap. Thus, if n- butyl alcohol is added to water at 50° C, there is only one liquid phase until 6.5 weight percent of the mixture is alcohol; when more alcohol is added, a second liquid phase appears the composition of which is 22.4 weight percent water. When sufficient alcohol is present to make the overall composition 77.6 weight percent alcohol, the first phase disappears, and only one liquid phase remains. A qualitatively different example is the system water-triethylamine, which has a lower consolute temperature at 17° C. Below 17° C the two liquids are completely miscible, but at higher temperatures they are only partially miscible. Finally, it is possible, although rare, for a binary system to exhibit both upper and lower consolute temperatures. Above 128° C and below 49° C butyl glycol and water are completely miscible, but between these temperatures they do not mix in all proportions.",
  "Colligative properties depend only on the concentration of the solute, not on the identity of the solute molecules. The concept of an ideal solution, as expressed by Raoult’s law, was already well-known during the last quarter of the 19th century, and it provided the early physical chemists with a powerful technique for measuring molecular weights. (Reliable measurements of molecular weights, in turn, provided important evidence for the modern atomic and molecular theory of matter.)",
  "It was observed that, whenever one component in a binary solution is present in large excess, the partial pressure of that component is correctly predicted by Raoult’s law, even though the solution may exhibit departures from ideal behaviour in other respects. When Raoult’s law is applied to the solvent of a very dilute solution containing a nonvolatile solute, it is possible to calculate the mole fraction of the solute from an experimental determination of the rise in boiling point that results when the solute is dissolved in the solvent. Since the separate weights of solute and solvent are readily measured, the procedure provides a simple experimental method for the determination of molecular weight. If a weighed amount of a nonvolatile substance, w  2 , is dissolved in a weighed amount of a solvent, w  1 , at constant pressure, the increase in the boiling temperature, Δ T   b 1 , the gas constant, R (derived from the gas laws), the heat of vaporization of the pure solvent per unit weight, l  1  vap , and the boiling temperature of pure solvent, T   b 1 , are related in a simple product of ratios equal to the molecular weight of the solute, M  2 . The equation is:   ",
  "The essence of this technique follows from the observation that, in a dilute solution of a nonvolatile solute, the rise in boiling point is proportional to the number of solute molecules, regardless of their size and mass.",
  "Another colligative property of solutions is the decrease in the freezing temperature of a solvent that is observed when a small amount of solute is dissolved in that solvent. By reasoning similar to that leading to equation ( 5 ), the freezing-point depression, Δ T   f  , the freezing temperature of pure solvent, T   f 1 , the heat of fusion (also called the heat of melting) of pure solvent per unit weight, l  1  fusion , and the weights of solute and solvent in the solution, w  2 and w  1 , respectively, are so related as to equal the molecular weight of solute, M  2 , in the equation   ",
  "A well-known practical application of freezing-point depression is provided by adding antifreeze to the cooling water in an automobile’s radiator. Water alone freezes at 0° C, but the freezing temperature decreases appreciably when ethylene glycol is mixed with water.",
  " π A third colligative property, osmotic pressure, helped to establish the fundamentals of modern physical chemistry and played a particularly important role in the early days of solution theory. Osmosis is especially important in medicine and biology, but in recent years it has also been applied industrially to problems such as the concentration of fruit juices, the desalting of seawater, and the purification of municipal sewage. Osmosis occurs whenever a liquid solution is in contact with a semipermeable membrane—i.e., a thin, porous wall whose porosity is such that some, but not all, of the components in the liquid mixture can pass through the wall. A semipermeable membrane is a selective barrier, and many such barriers are found in plants and animals. Osmosis gives rise to what is known as osmotic pressure, as illustrated in Figure 4 , which shows a container at uniform temperature divided into two parts by a semipermeable membrane that allows only molecules of component A to pass from the left to the right side; the selective membrane does not allow molecules of component B to pass. Example compounds for A and B might be water and sodium chloride (table salt), respectively. Molecules of component A are free to pass back and forth through the membrane, but, at equilibrium, when the fugacity (escaping tendency) of A in the right-hand side is the same as that in the left-hand side, there is no net transfer of A from one side to the other. On the left side, the presence of B molecules lowers the fugacity of A, and, therefore, to achieve equal fugacities for A on both sides, some compensating effect is needed on the left side. This compensating effect is an enhanced pressure, designated by π and called osmotic pressure. At equilibrium the pressure in the left side of the container is larger than that in the right side; the difference in pressure is π . In the simplest case, when the concentration of B is small (i.e., A is in excess), the osmotic pressure is the product of the gas constant ( R ), the absolute temperature ( T ), and the concentration of B ( c  B ) in the solution expressed in moles of B per unit volume: π = RTc  B . Since the osmotic pressure for a dilute solution is proportional to the number of solute molecules, it is a colligative property, and, as a result, osmotic-pressure measurements are often used to determine molecular weights, especially for large molecules such as polymers. When w  B grams of solute B are added to a large amount of solvent A at temperature T , and V is the volume of liquid solvent A in the left side of the container, then the molecular weight of B, M  B , is given by   ",
  "For sodium chloride in water, c  B is the concentration of the ions, which is twice the concentration of the salt owing to the dissociation of the salt (NaCl) into sodium ions (Na + ) and chloride ions (Cl - ). Thus, for a 3.5 percent sodium chloride solution at 25° C, π is 29 atmospheres, which is the minimum pressure at which a desalination reverse osmosis process can operate.",
  "Pure fluids have two transport properties that are of primary importance: viscosity and thermal conductivity. Transport properties differ from equilibrium properties in that they reflect not what happens at equilibrium but the speed at which equilibrium is attained. In solutions these two transport properties are also important. In addition, there is a third one, called diffusivity.",
  "The viscosity of a fluid (pure or not) is a measure of its ability to resist deformation. If water is poured into a thin vertical tube with a funnel at the top, it flows easily through the tube, but salad oil is difficult to force into the tube. If the oil is heated, however, its flow through the tube is much facilitated. The intrinsic property that is responsible for these phenomena is the viscosity (the “thickness”) of the fluid, a property which is often strongly affected by temperature. All fluids (liquid or gas) exhibit viscous behaviour (i.e., all fluids resist deformation to some degree), but the range of viscosity is enormous: the viscosity of air is extremely small, while that of glass is essentially infinite. The viscosity of a solution depends not only on temperature but also on composition. By varying the composition of a petroleum mixture, it is possible to attain a desired viscosity at a particular temperature. This is precisely what the oil companies do when they sell oil to a motorist: in winter, they recommend an oil with lower viscosity than that used in summer, because otherwise, on a cold morning, the viscosity of the lubricating oil may be so high that the car’s battery will not be powerful enough to move the lubricated piston.",
  "The thermal conductivity of a material reflects its ability to transfer heat by conduction. In practical situations both viscosity and thermal conductivity are important, as is illustrated by the contrast between an air mattress and a water bed. Because of its low viscosity, air yields rapidly to an imposed load, and thus the air mattress responds quickly when someone lying on it changes position. Water, because of its higher viscosity, noticeably resists deformation, and someone lying on a water bed experiences a caressing response whenever position is changed. At the same time, since the thermal conductivity as well as the viscosity of water are larger than those of air, the user of a water bed rapidly gets cold unless a heater keeps the water warm. No heater is required by the user of an air mattress because stagnant air is inefficient in removing heat from a warm body.",
  "Composition and temperature affect the thermal conductivity of a solution but, in typical liquid mixtures, the effect on viscosity is much larger than that on thermal conductivity.",
  "While viscosity is concerned with the transfer of momentum and thermal conductivity with the transfer of heat, diffusivity is concerned with the transport of molecules in a mixture. If a lump of sugar is put into a cup of coffee, the sugar molecules travel from the surface of the lump into the coffee at a speed determined by the temperature and by the pertinent intermolecular forces. The characteristic property that determines this speed is called diffusivity—i.e., the ability of a molecule to diffuse through a sea of other molecules. Diffusivities in solids are extremely small, and those in liquids are much smaller than those in gases. For this reason, a spoon is used to stir the coffee to speed up the motion of the sugar molecules, but, if the odour of cigarette smoke fills a room, little effort is needed to clear the air—opening the windows for a few minutes is sufficient.",
  "In order to define diffusivity, it is necessary to consider a binary fluid mixture in which the concentration of solute molecules is c  1 at position 1 and c  2 at position 2, which is l centimetres from position 1; if c  1 is larger than c  2 , then the concentration gradient (change with respect to distance), given by ( c  2 - c  1 )/ l , is a negative number, indicating that molecules of solute spontaneously diffuse from position 1 to position 2. The number of solute molecules that pass through an area of one square centimetre perpendicular to l , per second, is called the flux J (expressed in molecules per second per square centimetre). The diffusivity D is given by the formula   ",
  "The leading minus sign is introduced because, when the gradient is positive, J is negative, and, by convention, D is a positive number. In binary gaseous mixtures, diffusivity depends only weakly on the composition, and, therefore, to a good approximation, the diffusivity of gas A in gas B is the same as that of gas B in gas A. In liquid systems, however, the diffusivity of solute A in solvent B may be significantly different from that of solute B in solvent A. In a very viscous fluid, molecules cannot rapidly move from one place to another. Therefore, in liquid systems, the diffusivity of solute A depends strongly on the viscosity of solvent B and vice versa. While the letter D is always used for diffusivity, viscosity is commonly given the symbol η : in many liquid solutions it is observed that, as the composition changes (as long as the temperature remains constant), the product Dη remains nearly the same.",
  "The properties of solutions depend, essentially, on two characteristics: first, the manner in which the molecules arrange themselves (that is, the geometric array in which the molecules occupy space) and, second, the nature and strength of the forces operating between the molecules.",
  "The first characteristic is reflected primarily in the thermodynamic quantity S , called entropy, which is a measure of disorder, and the second characteristic is reflected in the thermodynamic quantity H , called enthalpy, which is a measure of potential energy—i.e., the energy that must be supplied to separate all the molecules from one another. Enthalpy minus the product of the absolute temperature T and entropy equals a thermodynamic quantity G , called Gibbs energy (also called free energy):   ",
  "From the second law of thermodynamics, it can be shown that, at constant temperature and pressure, any spontaneous process is accompanied by a decrease in Gibbs energy. The change in G that results from mixing is designated by Δ G , which, in turn, is related to changes in H and S at constant temperature by the equation   ",
  "At a fixed temperature and pressure, two substances mix spontaneously whenever Δ G is negative; that is, mixing (either partial or complete) occurs whenever the Gibbs energy of the substances after mixing is less than that before mixing.",
  "The two characteristics that determine solution behaviour, structure and intermolecular forces, are, unfortunately, not independent, because the structure is influenced by the intermolecular forces and because the potential energy of the mixture depends on the structure. Only in limiting cases is it possible, on the one hand, to calculate Δ S (the entropy change upon mixing) from structural considerations alone and, on the other, to calculate Δ H (the enthalpy change of mixing) exclusively from relations describing intermolecular forces. Nevertheless, such calculations have proved to be useful for establishing models that approximate solution behaviour and that serve as guides in interpreting experimental measurements. Solutions for which structural considerations are dominant are called athermal solutions, and those for which the effects of intermolecular forces are more important than those of structure are called regular solutions ( see below  Regular and athermal solutions ).",
  "A variety of forces operate between molecules, and there is a qualitative relation between the properties of a solution and the types of intermolecular forces that operate within it. The volume occupied by a solution is determined primarily by repulsive forces. When two molecules are extremely close to one another, they must necessarily exert a repulsive force on each other since two molecules of finite dimensions cannot occupy the same space; two molecules in very close proximity resist attempts to shorten the distance between them.",
  "At larger distances of separation, molecules may attract or repel each other depending on the sign (plus or minus) and distribution of their electrical charge. Two ions attract one another if the charge on one is positive and that on the other is negative; they repel when both carry charges of the same sign. Forces between ions are called Coulomb forces and are characterized by their long range; the force ( F ) between two ions is inversely proportional to the square of the distance between them; i.e., F varies as 1/ r  2 . Noncoulombic physical forces between molecules decay more rapidly with distance; i.e., in general F varies as 1/ r   n  , n being larger than 2 for intermolecular forces other than those between ions.",
  "The Coulomb force ( F ) equals the product of the magnitude of the charge on one ion ( e  1 ) and that on the other ( e  2 ) divided by the product of the distance squared ( r  2 ) and the dielectric constant ( ε ):   ",
  "If both e  1 and e  2 are positive, F is positive and the force is repulsive. If either e  1 or e  2 is positive while the other is negative, F is negative and the force is attractive. Coulomb forces are dominant in electrolyte solutions.",
  "If a molecule has no net electrical charge, its negative charge is equal to its positive charge. The forces experienced by such molecules depend on how the positive and negative charges are arranged in space. If the arrangement is spherically symmetric, the molecule is said to be nonpolar; if there is an excess of positive charge on one end of the molecule and an excess of negative charge on the other, the molecule has a dipole moment (i.e., a measurable tendency to rotate in an electric or magnetic field) and is therefore called polar. The dipole moment ( μ ) is defined as the product of the magnitude of the charge, e , and the distance separating the positive and negative charges, l : μ = el . Electrical charge is measured in electrostatic units (esu), and the typical charge at one end of a molecule is of the order of 10 -10 esu; the distance between charges is of the order of 10 -8 centimetres (cm). Dipole moments, therefore, usually are measured in debyes (one debye is 10 -18 esu-cm). For nonpolar molecules, μ = 0.",
  "The force F between two polar molecules is directly proportional to the product of the two dipole moments ( μ  1 and μ  2 ) and inversely proportional to the fourth power of the distance between them ( r  4 ): that is, F varies as μ  1  μ  2 / r  4 . The equation for this relationship contains a constant of proportionality ( F = kμ  1  μ  2 / r  4 ), the sign and magnitude of which depend on the mutual orientation of the two dipoles; if the positive end of one faces the negative end of the other, the constant of proportionality is negative (meaning that an attractive force exists), while it is positive (meaning that a repulsive force exists) when the positive end of one faces the positive end of the other. When polar molecules are free to rotate, they tend to favour those orientations that lead to attractive forces. To a first approximation, the force (averaged over all orientations) is inversely proportional to the temperature and to the seventh power of the distance of separation. Mixtures of polar molecules often exhibit only mild deviations from ideality, but mixtures containing polar and nonpolar molecules are frequently strongly nonideal. Because of the qualitative and quantitative differences in intermolecular forces, the molecules segregate: the polar molecules prefer to be with each other, and so do the nonpolar ones. Only at higher temperatures, such that the thermal energy of the molecules offsets the cohesion between identical molecules, do the two liquids mix in all proportions. In mixtures containing both polar and nonpolar components, deviations from Raoult’s law diminish as temperature rises.",
  "A nonpolar molecule is one whose charge distribution is spherically symmetric when averaged over time; since the charges oscillate, a temporary dipole moment exists at any given instant in a so-called nonpolar molecule. These temporary dipole moments fluctuate rapidly in magnitude and direction, giving rise to intermolecular forces of attraction called London (or dispersion) forces. All molecules, charged or not, polar or not, interact by London forces. To a first approximation, the London force between two molecules is inversely proportional to the seventh power of the distance of separation; it is therefore short-range, decreasing rapidly as one molecule moves away from the other. The London theory indicates that for simple molecules positive deviations from Raoult’s law may be expected (i.e., the activity coefficient γ   i  is greater than 1, as explained previously). Since the London theory suggests that the attractive forces between unlike simple molecules are smaller than those corresponding to an ideal solution, the escaping tendency of the molecules in solution is larger than that calculated by Raoult’s law. As a result, mixing of small nonpolar molecules is endothermic (absorbing heat from the surroundings) and the volume occupied by the liquid solution often exceeds that of the unmixed components—that is, the components expand on mixing.",
  "In addition to the forces listed above, there are so-called induction forces set up when a charged or polar molecule induces a dipole in another molecule: the electric field of the inducing molecule distorts the charge distribution in the other. When a charged molecule induces a dipole in another, the force is always attractive and is inversely proportional to the fifth power of the distance of separation. When a polar molecule induces a dipole in another molecule, the force is also attractive and is inversely proportional to the seventh power of separation. Induction forces are usually small but may make a significant contribution to the energy of a mixture of molecules that are strongly dissimilar.",
  "In many cases the properties of a mixture are determined primarily by forces that are more properly classified as chemical rather than as physical. For example, when dinitrogen pentoxide is dissolved in water, a new substance, nitric acid, is formed; and it is necessary to interpret the behaviour of such a solution in terms of its chemical properties, which, in this case, are more important than its physical properties. This example is an extreme one, and there are many solutions for which the chemical effect is less severe but nevertheless dominant.",
  "This dominance is especially important in those solutions that involve hydrogen bonding. Whenever a solution contains molecules with an electropositive hydrogen atom and with an electronegative atom (such as nitrogen, oxygen, sulfur, or fluorine), hydrogen bonding may occur and, when it does, the properties of the solution are affected profoundly. Hydrogen bonds may form between identical molecules or between dissimilar molecules; for example, methanol (CH 3 OH) has an electropositive (electron-attracting) hydrogen atom and also an electronegative (electron-donating) oxygen atom, and therefore two methanol molecules may hydrogen-bond (represented by the dashed line) singly to form the structure   or in chains to form   Hydrogen bonding between identical molecules is often called association.",
  "In a mixture of methanol and, say, pyridine (C 5 H 5 N), hydrogen bonds can also form between the electropositive hydrogen atom in methanol and the electronegative nitrogen atom in pyridine. Hydrogen bonding between dissimilar molecules is an example of a type of interaction known as solvation. Since the extent of association or solvation or both depends on the concentrations of the solution’s components, the partial pressure of a component is not even approximately proportional to its mole fraction as given by Raoult’s law; therefore, large deviations from Raoult’s law are commonly observed in solutions in which hydrogen bonding is extensive. Broadly speaking, association of one component, but not the other, tends to produce positive deviations from Raoult’s law, because the associating component hydrogen-bonds to a smaller extent when it is surrounded by other molecules than it does in the pure state. On the other hand, solvation between dissimilar molecules tends to produce negative deviations from Raoult’s law.",
  "As has been explained previously, when actual concentrations do not give simple linear relations for the behaviour of a solution, activity coefficients, symbolized by γ   i  , are used in expressing deviations from Raoult’s law. Activity coefficients are directly related to excess functions, and, in attempting to understand solution behaviour, it is convenient to characterize nonelectrolyte solutions in terms of these functions. In particular, it is useful to distinguish between two types of limiting behaviour: one corresponds to that of a regular solution; the other, to that of an athermal solution (i.e., when components are mixed, no heat is generated or absorbed).",
  "In a binary mixture with mole fractions x  1 and x  2 and activity coefficients γ  1 and γ  2 , these quantities can be related to a thermodynamic function designated by G   E  , called the excess Gibbs (or free) energy. The significance of the word excess lies in the fact that G   E  is the Gibbs energy of a solution in excess of what it would be if it were ideal.",
  "In a binary solution the two activity coefficients are not independent but are related by an exact differential equation called the Gibbs-Duhem relation. If experimental data at constant temperature are available for γ  1 and γ  2 as a function of composition, it is possible to apply this equation to check the data for thermodynamic consistency: the data are said to be consistent only if they satisfy the Gibbs-Duhem relation. Experimental data that do not satisfy this relation are thermodynamically inconsistent and therefore must be erroneous.",
  "To establish a theory of solutions, it is necessary to construct a theoretical (or semitheoretical) equation for the excess Gibbs energy as a function of absolute temperature ( T ) and the mole fractions x  1 and x  2 . After such an equation has been established, the individual activity coefficients can readily be calculated.",
  "Gibbs energy, by definition, consists of two parts: one part is the enthalpy, which reflects the intermolecular forces between the molecules, which, in turn, are responsible for the heat effects that accompany the mixing process (enthalpy is, in a general sense, a measure of the heat content of a substance); and the other part is the entropy, which reflects the state of disorder (a measure of the random behaviour of particles) in the mixture. The excess Gibbs energy G   E  is given by the equation   where H   E  is the excess enthalpy and S   E  is the excess entropy. The word excess means in excess of that which would prevail if the solution were ideal. In the simplest case, both H   E  and S   E  are zero; in that case the solution is ideal and γ  1 = γ  2 = 1. In the general case, neither H   E  nor S   E  is zero, but two types of semi-ideal solutions can be designated: in the first, S   E  is zero but H   E  is not; this is called a regular solution. In the second, H   E  is zero but S   E  is not; this is called an athermal solution. An ideal solution is both regular and athermal.",
  "The word regular implies that the molecules mix in a completely random manner, which means that there is no segregation or preference; a given molecule chooses its neighbours with no regard for chemical identity (species 1 or 2). In a regular solution of composition x  1 and x  2 , the probability that the neighbour of a given molecule is of species 1 is given by the mole fraction x  1 , and the probability that it is of species 2 is given by x  2 .",
  " ω Two liquids form a solution that is approximately regular when the molecules of the two liquids do not differ appreciably in size and there are no strong orienting forces caused by dipoles or hydrogen bonding. In that event, the mixing process can be represented by the lattice model shown in Figure 5 ; the left half of the diagram shows pure liquids 1 and 2, and the right half shows the mixture obtained when the central molecule of liquid 1 is interchanged with the central molecule of liquid 2. Before interchange, the potential energy between central molecule 1 and one of its immediate neighbours is Γ 1  1 , and that between central molecule 2 and one of its immediate neighbours is Γ 2  2 . After interchange, the potential energy between molecule 1 and one of its immediate neighbours is Γ 1  2 , and that between molecule 2 and one of its immediate neighbours is also Γ 1  2 . The change in energy that accompanies this mixing process is equal to twice the interchange energy ( ω ), which is equal to the potential energy after mixing less one-half the sum of the potential energies before mixing, the whole multiplied by the number of immediate neighbours, called the coordination number ( z ), surrounding the two shifted molecules:   ",
  "In the two-dimensional representation ( Figure 5 ), z equals 4; but, in three dimensions, z varies between 6 and 12, depending on the lattice geometry. In this simple lattice model, the interchange process occurs without change of volume; thus, in this particular case, the excess enthalpy is the same as the energy change upon mixing. Assuming regular-solution behaviour (i.e., S   E  = 0), an equation may be derived relating Gibbs energy, Avogadro’s number, interchange energy, and mole fractions. In principle, the interchange energy ( ω ) may be positive or negative, but, for simple molecules, for which only London forces of attraction are important, ω is positive. The equation obtained from the simple lattice model can be extended semiempirically to apply to mixtures of molecules whose sizes are not nearly the same by using volume fractions instead of mole fractions to express the effect of composition and by introducing the concept of cohesive energy density, which is defined as the potential energy of a liquid divided by its volume. The adjective cohesive is well chosen because it indicates that this energy is associated with the forces that keep the molecules close together in a condensed state. Again restricting attention to nonpolar molecules and assuming a completely random mixture ( S   E  = 0), an equation may be derived that requires only pure-component properties to predict the excess Gibbs energy (and hence the activity coefficients) of binary mixtures. Because of many simplifying assumptions, this equation does not give consistently accurate results, but in many cases it provides good semiquantitative estimates. The form of the equation is such that the excess Gibbs energy is larger than zero; hence, the equation is not applicable to mixtures that have negative deviations from Raoult’s law.",
  "In a solution in which the molecules of one component are much larger than those of the other, the assumption that the solution is regular (i.e., that S   E  = 0) no longer provides a reasonable approximation even if the effect of intermolecular forces is neglected. A large flexible molecule (e.g., a chain molecule such as polyethylene) can attain many more configurations when it is surrounded by small molecules than it can when surrounded by other large flexible molecules; the state of disorder in such a solution is therefore much larger than that of a regular solution in which S   E  = 0. A solution of very large molecules (i.e., polymers) in an ordinary liquid solvent is analogous to a mixture of cooked spaghetti (representing the polymers) and tomato sauce (the solvent). When there is a large amount of sauce and relatively little spaghetti, each piece of spaghetti is free to exist in many different shapes; this freedom, however, becomes restricted as the number of spaghetti pieces rises and the amount of sauce available for each strand declines. The excess entropy then is determined primarily by the freedom that the spaghetti has in the tomato sauce mixture relative to the freedom it has in the absence of sauce.",
  "Regular solutions and athermal solutions represent limiting cases; real solutions are neither regular nor athermal. For real solutions it has been proposed to calculate G   E  by combining the equations derived separately for regular solutions and for athermal solutions, but, in view of the restrictive and mutually inconsistent assumptions that were made in deriving these two equations, the proposal has met with only limited success.",
  "For those solutions in which there are strong intermolecular forces due to large dipole moments, hydrogen bonding, or complex formation, equations based on fundamental molecular theory cannot be applied, but it is frequently useful to apply a chemical treatment—i.e., to describe the liquid mixture in terms of association and solvation, by assuming the existence of a variety of distinct chemical species in chemical equilibrium with one another. For example, there is much experimental evidence for association in acetic acid, in which most of the molecules dimerize; i.e., two single acetic acid molecules, called monomers, combine to form a new molecule, called a dimer, through hydrogen bonding. When acetic acid is dissolved in a solvent such as benzene, the extent of dimerization of acetic acid depends on the temperature and on the total concentration of acetic acid in the solution. The escaping tendency (vapour pressure) of a monomer is much greater than that of a dimer, and it is thus possible to explain the variation of activity coefficient with composition for acetic acid in benzene; the activity coefficient of acetic acid in an excess of benzene is large because, under these conditions, acetic acid is primarily in the monomeric state, whereas pure acetic acid is almost completely dimerized. In the acetic acid–benzene system, association of acetic acid molecules produces positive deviations from Raoult’s law.",
  "When a solvent and a solute molecule link together with weak bonds, the process is called solvation. For example, in the system acetone-chloroform, a hydrogen bond is formed between the hydrogen atom in chloroform and the oxygen atom in acetone. In this case, hydrogen bonding depresses the escaping tendencies of both components, producing negative deviations from Raoult’s law.",
  "While hydrogen bonding is frequently encountered in solutions, there are many other examples of weak chemical-bond formation between dissimilar molecules. The formation of such weak bonds is called complex formation—that is, formation of a new chemical species, called a complex, which is held together by weak forces that are chemical in nature rather than physical. Such complexes usually exist only in solution; because of their low stability, they cannot, in general, be isolated. The ability of molecules to form complexes has a strong effect on solution behaviour. For example, the solubility of a sparingly soluble species can be much increased by complex formation: the solubility of silver chloride in water is extremely small since silver chloride dissociates only slightly to silver ion and chloride ion; however, when a small quantity of ammonia is added, solubility rises dramatically because of the reaction of six molecules of ammonia with one silver ion to form the complex ion Ag(NH 3 ) 6  + . By tying up silver ions and forcing extensive dissociation of molecular silver chloride, the ammonia pulls silver chloride into aqueous solution.",
  "In recent years there has been much interest in the use of computers to generate theoretical expressions for the activity coefficients of solutions. In many cases the calculations have been restricted to model systems, in particular to mixtures of hard-sphere (envisioned as billiard balls) molecules—i.e., idealized molecules that have finite size but no forces of attraction. These calculations have produced a better understanding of the structure of simple liquid solutions since the manner in which nonpolar and non-hydrogen-bonding molecules arrange themselves in space is determined primarily by their size and shape and only secondarily by their attractive intermolecular forces. The results obtained for hard-sphere molecules can be extended to real molecules by applying corrections required for attractive forces and for the “softness” of the molecules—i.e., the ability of molecules to interpenetrate (overlap) at high temperatures. While practical results are still severely limited and while the amount of required computer calculation is large even for simple binary systems, there is good reason to believe that advances in the theory of solution will increasingly depend on computerized, as opposed to analytical, models.",
  "Near the end of the 19th century, the properties of electrolyte solutions were investigated extensively by the early workers in physical chemistry. A suggestion of Svante August Arrhenius, a Swedish chemist, that salts of strong acids and bases (for example, sodium chloride) are completely dissociated into ions when in aqueous solution received strong support from electrical-conductivity measurements and from molecular-weight studies (freezing-point depression, boiling-point elevation, and osmotic pressure). These studies showed that the number of solute particles was larger than it would be if no dissociation occurred. For example, a 0.001 molal solution of a uni-univalent electrolyte (one in which each ion has a valence, or charge, of 1, and, when dissociated, two ions are produced) such as sodium chloride, Na + Cl - , exhibits colligative properties corresponding to a nonelectrolyte solution whose molality is 0.002; the colligative properties of a 0.001 molal solution of a univalent-divalent electrolyte (yielding three ions) such as magnesium bromide, Mg 2  + Br 2  - , correspond to those of a nonelectrolyte solution with a molality of 0.003. At somewhat higher concentrations the experimental data showed some inconsistencies with Arrhenius’ dissociation theory, and initially these were ascribed to incomplete, or partial, dissociation. In the years 1920–30, however, it was shown that these inconsistencies could be explained by electrostatic interactions (Coulomb forces) of the ions in solution. The current view of electrolyte solutions is that, in water at normal temperatures, the salts of strong acids and strong bases are completely dissociated into ions at all concentrations up to the solubility limit. At high concentrations Coulombic interactions may cause the formation of ion pairs, which implies that the ions are not dispersed uniformly in the solution but have a tendency to form two-ion aggregates in which a positive ion seeks the close proximity of a negative ion and vice versa. While the theory of dilute electrolyte solutions is well advanced, no adequate theory exists for concentrated electrolyte solutions primarily because of the long-range Coulomb forces that dominate in ionic solutions.",
  "The equilibrium properties of electrolyte solutions can be studied experimentally by electrochemical measurements, freezing-point depressions, solubility determinations, osmotic pressures, or measurements of vapour pressure. Most electrolytes, such as salts, are nonvolatile at ordinary temperature, and, in that event, the vapour pressure exerted by the solution is the same as the partial pressure of the solvent. The activity coefficient of the solvent can, therefore, be found from total-pressure measurements, and, using the Gibbs-Duhem equation, it is then possible to calculate the activity coefficient of the electrolyte solute. This activity coefficient is designated by γ  ± to indicate that it is a mean activity coefficient for the positive and negative ions. Since it is impossible to isolate positive ions and negative ions into separate containers, it is not possible to determine individual activity coefficients for the positive ions and for the negative ions. The mean activity coefficient γ  ± is so defined that it approaches a value of unity at very low molality where the ions are so far apart that they exert negligible influence on one another. For small concentrations of electrolyte, the theory of Peter Debye, a Dutch-born American physical chemist, and Erich Hückel, a German chemist, relates γ  ± to the ionic strength, which is the sum of the products of the concentration of each ion (in moles per litre) and the square of its charge; the equation predicts that γ  ± decreases with rising ionic strength in agreement with experiment at very low ionic strength; at higher ionic strength, however, γ  ± rises, and in some cases γ  ± is greater than 1. The derivation of the Debye-Hückel theory clearly shows that it is limited to low concentrations. Many attempts have been made to extend the Debye-Hückel equation to higher electrolyte concentrations. One of the more successful attempts is based on the idea that the ions are solvated, which means that every ion is surrounded by a tight-fitting shell of solvent molecules.",
  "The concept of solvation is often used to explain properties of aqueous solutions; one well-known property is the salting-out effect, in which the solubility of a nonelectrolyte in water is decreased when electrolyte is added. For example, the solubility of ethyl ether in water at 25° C is 0.91 mole percent, but, in an aqueous solution containing 15 weight percent sodium chloride, it is only 0.13 mole percent. This decrease in solubility can be explained by postulating that some of the water molecules cannot participate in the dissolution of the ether because they are tightly held (solvated) by sodium and chloride ions.",
  "Electrolyte solutions have long been of interest in industry since many common inorganic chemicals are directly obtained, or else separated, by crystallization from aqueous solution. Further, many important chemical and metallurgical products (e.g., aluminum) are obtained or refined by electrochemical processes that occur in liquid solution. In recent years there has been renewed interest in electrolyte solutions because of their relevance to fuel cells as a possible source of power for automobiles.",
  "The properties of electrolyte solutions also have large importance in physiology. Many molecules that occur in biological systems bear electric charges; a large molecule that has a positive electric charge at one end and a negative charge at the other is called a zwitterion. Very large molecules, such as those of proteins, may have numerous positive and negative charges; such molecules are called polyelectrolytes. In solution, the conformation (i.e., the three-dimensional structure) of a large, charged molecule is strongly dependent on the ionic strength of the dissolving medium; for example, depending on the nature and concentration of salts present in the solvent, a polyelectrolyte molecule may coagulate into a ball, it may stretch out like a rod, or it may form a coil or helix. The conformation, in turn, is closely related to the molecule’s physiological function. As a result, improved understanding of the properties of electrolyte solutions has direct consequences in molecular biology and medicine.",
  "Since the dissolution of one substance in another can occur only if there is a decrease in the Gibbs energy, it follows that, generally speaking, gases and solids do not dissolve in liquids as readily as do other liquids. To understand this, the dissolution of a solid can be visualized as occurring in two steps: in the first, the pure solid is melted at constant temperature to a pure liquid, and, in the second, that liquid is dissolved at constant temperature in the solvent. Similarly, the dissolution of a gas can be divided at some fixed pressure into two parts, the first corresponding to constant-temperature condensation of the pure gas to a liquid and the second to constant-temperature mixing of that liquid with solvent. In many cases, the pure liquids (obtained by melting or by condensation) may be hypothetical (i.e., unstable and, therefore, physically unobtainable), but usually their properties can be estimated by reasonable extrapolations. It is found that the change in Gibbs energy corresponding to the first step is positive and, hence, in opposition to the change needed for dissolution. For example, at -10° C, ice is more stable than water, and, at 110° C and one atmosphere, steam is more stable than water. Therefore, the Gibbs energy of melting ice at -10° C is positive, and the Gibbs energy of condensing steam at one atmosphere and 110° C is also positive. For the second step, however, the change in Gibbs energy is negative; its magnitude depends on the equilibrium composition of the mixture. Owing to the positive Gibbs energy change that accompanies the first step, there is a barrier that makes it more difficult to dissolve solids and gases as compared with liquids.",
  "For gases at normal pressures, the positive Gibbs energy of condensation increases with rising temperature, but, for solids, the positive Gibbs energy of melting decreases with rising temperature. For example, the change in energy, Δ G , of condensing steam at one atmosphere is larger at 120° C than it is at 110° C, while the change in energy of melting ice at -5° C is smaller than it is at -10° C. Thus, as temperature rises, the barrier becomes larger for gases but lower for solids, and therefore, with few exceptions, the solubility of a solid rises while the solubility of a gas falls as the temperature is raised.",
  "For solids, the positive Gibbs energy “barrier” depends on the melting temperature. If the melting temperature is much higher than the temperature of the solution, the barrier is large, shrinking to zero when the melting temperature and solution temperature become identical.",
  "The tables give and . These solubilities illustrate the qualitative rule that “like dissolves like”; thus naphthalene, an aromatic hydrocarbon, dissolves more readily in another aromatic hydrocarbon such as benzene than it does in a chlorinated solvent such as carbon tetrachloride or in a hydrogen-bonded solvent such as methyl alcohol. By similar reasoning, the gas methane, a paraffinic hydrocarbon, dissolves more readily in another paraffin such as hexane than it does in water. In all three solvents, the gas hydrogen (which boils at -252.5° C) is less soluble than nitrogen (which boils at a higher temperature, -195.8° C).",
  "While exceptions may occur at very high pressures, the solubility of a gas in a liquid generally rises as the pressure of that gas increases. When the pressure of the gas is much larger than the vapour pressure of the solvent, the solubility is often proportional to the pressure. This proportionality is consistent with Henry’s law, which states that, if the gas phase is ideal, the solubility x  2 of gas 2 in solvent 1 is equal to the partial pressure (the vapour-phase mole fraction y  2 times the total pressure P —i.e., y  2  P ) divided by a temperature-dependent constant, H  2,1 (called Henry’s constant), which is determined to a large extent by the intermolecular forces between solute 2 and solvent 1:   ",
  "When the vapour pressure of solvent 1 is small compared with the total pressure, the vapour-phase mole fraction of gas 2 is approximately one, and the solubility of the gas is proportional to the total pressure.",
  "A classic survey of the liquid state by a pioneer in the field is given in J.S. Rowlinson (ed.), J.D. van der Waals: On the Continuity of the Gaseous and Liquid States (1988), with an extensive bibliography. J.N. Murrell and E.A. Boucher , Properties of Liquids and Solutions , 2nd ed. (1994), is a short introduction to the physics and chemistry of the liquid state. A general approach to the chemical thermodynamics of pure substances and solutions is given in the classic text Gilbert Newton Lewis and Merle Randall , Thermodynamics , 2nd ed., rev. by Kenneth S. Pitzer and Leo Brewer (1961). J.S. Rowlinson and F.L. Swinton , Liquids and Liquid Mixtures , 3rd ed. (1982), gives a thorough treatment of the physics of fluids and of the statistical mechanics of the equilibrium properties of simple pure liquids and liquid mixtures; the work also contains a data bibliography and is primarily for research-oriented readers.",
  "More-specialized books include John P. O’Connell , John M. Prausnitz , and Bruce E. Poling , The Properties of Gases and Liquids , 5th ed. (2001), which focuses on the vapour-liquid transition and evaluates techniques for estimating and correlating properties of gases and liquids, as well as tabulating the properties of 600 compounds; and John M. Prausnitz , Ruediger N. Lichtenthaler , and Edmundo Gomes de Azevedo , Molecular Thermodynamics of Fluid-Phase Equilibria , 3rd ed. (1998), which is written from a chemical-engineering point of view.",
  "Those interested in the properties of water from the physical and chemical standpoint, and in terms of biological function, will find accessible introductory descriptions in Sidney Perkowitz , “The Rarest Element,” The Sciences , 39:(1): 34–38 (Jan./Feb. 1999); and Mark W. Denny , Air and Water: The Biology and Physics of Life’s Media (1993)."
]