[
  "  architecture , the art and technique of designing and building, as distinguished from the skills associated with construction. The practice of architecture is employed to fulfill both practical and expressive requirements, and thus it serves both utilitarian and aesthetic ends. Although these two ends may be distinguished, they cannot be separated, and the relative weight given to each can vary widely. Because every society—settled or nomadic—has a spatial relationship to the natural world and to other societies, the structures they produce reveal much about their environment (including climate and weather ), history , ceremonies, and artistic sensibility, as well as many aspects of daily life.",
  "The characteristics that distinguish a work of architecture from other built structures are (1) the suitability of the work to use by human beings in general and the adaptability of it to particular human activities, (2) the stability and permanence of the work’s construction, and (3) the communication of experience and ideas through its form. All these conditions must be met in architecture. The second is a constant, while the first and third vary in relative importance according to the social function of buildings. If the function is chiefly utilitarian, as in a factory, communication is of less importance. If the function is chiefly expressive, as in a monumental tomb, utility is a minor concern. In some buildings, such as churches and city halls, utility and communication may be of equal importance.",
  "The present article treats primarily the forms, elements, methods, and theory of architecture. For the history of architecture in antiquity, see the sections on ancient Greece and Rome in Western architecture ; as well as Anatolian art and architecture ; Arabian art and architecture ; Egyptian art and architecture ; Iranian art and architecture ; Mesopotamian art and architecture ; and Syro-Palestinian art and architecture . For later historical and regional treatments of architecture, see  African architecture ; Chinese architecture ; Japanese architecture ; Korean architecture ; Oceanic art and architecture ; Western architecture ; Central Asian arts ; Islamic arts ; South Asian arts ; and Southeast Asian arts . For a discussion of the place of architecture and architectural theory in the realm of the arts, see  aesthetics . For related forms of artistic expression, see  city ; interior design ; and urban planning .",
  "The types of architecture are established not by architects but by society, according to the needs of its different institutions. Society sets the goals and assigns to the architect the job of finding the means of achieving them. This section of the article is concerned with architectural typology, with the role of society in determining the kinds of architecture, and with planning—the role of the architect in adapting designs to particular uses and to the general physical needs of human beings.",
  "Architecture is created only to fulfill the specifications of an individual or group. Economic law prevents architects from emulating their fellow artists in producing works for which the demand is nonexistent or only potential. So the types of architecture depend upon social formations and may be classified according to the role of the patron in the community. The types that will be discussed here—domestic, religious, governmental, recreational, welfare and educational, and commercial and industrial—represent the simplest classification; a scientific typology of architecture would require a more detailed analysis.",
  "  Domestic architecture is produced for the social unit: the individual, family, or clan and their dependents, human and animal. It provides shelter and security for the basic physical functions of life and at times also for commercial, industrial, or agricultural activities that involve the family unit rather than the community. The basic requirements of domestic architecture are simple: a place to sleep, prepare food, eat, and perhaps work; a place that has some light and is protected from the weather. A single room with sturdy walls and roof, a door, a window, and a hearth are the necessities; all else can be considered luxury.",
  "In much of the world today, even where institutions have been in a continuous process of change, dwelling types of ancient or prehistoric origin are in use. In the industrialized United States, for instance, barns are being built according to a design employed in Europe in the 1st millennium bce . The forces that produce a dynamic evolution of architectural style in communal building are usually inactive in the home and farm. The lives of average people may be unaltered by the most fundamental changes in their institutions. The people can be successively enslaved persons, the subjects of a monarchy, and voting citizens without having the means or the desire to change their customs, techniques, or surroundings. Economic pressure is the major factor that causes average individuals to restrict their demands to a level far below that which the technology of their time is capable of maintaining. Frequently they build new structures with old techniques because experiment and innovation are more costly than repetition. But in wealthy cultures economy permits and customs encourage architecture to provide conveniences such as sanitation, lighting, and heating, as well as separate areas for distinct functions, and these may come to be regarded as necessities. The same causes tend to replace the conservatism of the home with the aspirations of institutional architecture and to emphasize the expressive as well as the utilitarian function.",
  "As wealth and expressive functions increase, a special type of domestic building can be distinguished that may be called power architecture. In almost every civilization the pattern of society gives to a few of its members the power to utilize the resources of the community in the construction of their homes, palaces, villas, gardens, and places of recreation. These few, whose advantages usually arise from economic, religious, or class distinctions, are able to enjoy an infinite variety of domestic activities connected with the mores of their position. These can include even communal functions: the palace of the Flavian emperors in ancient Rome incorporated the activities of the state and the judicial system; the palace of Versailles, a whole city in itself, provided the necessities and luxuries of life for several thousand persons of all classes and was the centre of government for the empire of Louis XIV . Power architecture may have a complex expressive function, too, since the symbolizing of power by elegance or display is a responsibility or a necessity (and often a fault) of the powerful. Since this function usually is sought not so much to delight the patrons as to demonstrate their social position to others, power architecture becomes communal as well as domestic. In democracies such as ancient Greece and in the modern Western world, this show of power may have been more reserved, but it is still distinguishable.",
  "  A third type of domestic architecture accommodates the group rather than the unit and is therefore public as well as private. It is familiar through the widespread development of mass housing in the modern world, in which individuals or families find living space either in multiple dwellings or in single units produced in quantity. Group housing is produced by many kinds of cultures: by communal states to equalize living standards, by tyrants to assure a docile labour force, and by feudal or caste systems to bring together members of a class. The apartment house was developed independently by the imperial Romans of antiquity to suit urban conditions and by the American Indians to suit agricultural conditions. Group architecture may be power architecture as well, particularly when land values are too high to permit even the wealthy to build privately, as in the 17th-century Place des Vosges in Paris, where aristocratic mansions were designed uniformly around a square, or in the 18th-century flats in English towns and spas. Although most domestic architecture of the 20th century employed the style and techniques of the past, the exceptions are more numerous and more important for the development of architecture than ever before. This is because the distribution of wealth and power is widespread in parts of the world where architecture is vital and because the modern state has assumed responsibility for much high-quality housing.",
  "  The history of architecture is concerned more with religious buildings than with any other type, because in most past cultures the universal and exalted appeal of religion made the church or temple the most expressive, the most permanent, and the most influential building in any community.",
  "The typology of religious architecture is complex, because no basic requirements such as those that characterize domestic architecture are common to all religions and because the functions of any one religion involve many different kinds of activity, all of which change with the evolution of cultural patterns.",
  "   Temples , churches , mosques , and synagogues serve as places of worship and as shelters for the images, relics, and holy areas of the cult. In the older religions, the temple was not always designed for communal use. In ancient Egypt and India it was considered the residence of the deity, and entrance into the sanctum was prohibited or reserved for priests ; in ancient Greece it contained an accessible cult image, but services were held outside the main facade; and in the ancient Near East and in the Mayan and Aztec architecture of ancient Mexico, where the temple was erected at the summit of pyramidal mounds, only privileged members of the community were allowed to approach.",
  " minbar  Few existing religions are so exclusive. Beliefs as dissimilar as Christianity , Buddhism , Judaism , and Islam are based on communal participation in rites held inside each religion’s place of worship. The buildings have even evolved into similar plans, because of a common requirement that the maximum number of worshippers be able to face the focal point of the service (the mosque’s focal point is the qibla , indicated by the mihrab , a niche in the mosque’s interior wall facing the direction of Mecca , the city of Muhammad ’s birth and therefore the most sacred of all Islamic religious sites). Consequently, the Muslims were able to adopt the Byzantine church tradition, modern synagogues are often scarcely distinguishable from churches, and early Protestantism absorbed Catholic architecture with only minor revision (elimination of subsidiary chapels and altars , repositories of relics , and some symbolic decoration).",
  "Shelter is not always required for worship. Some rites are often practiced outdoors with a monument as a focus, while the altar of Pergamum and the Ara Pacis (Augustan Altar of Peace) in Rome are evidences of the open-air religious observances of the classical world. The atrium of early Christian architecture and the cloister were isolated areas for prayer.",
  "  The complex programs of later religions made the place of worship the focus for varied activities demanding architectural solutions—for example, the baptistery , bell towers, and chapter houses of Christian architecture, the minarets of Islamic architecture, and the holy gates of Buddhist architecture. Most modern sects demand space for religious education adjoining the community church or temple. Catholicism and the religions of Asia have produced madrasahs, monasteries , convents , and abbeys —connected to places of worship—that accommodate the organized practice of religion, adding domestic and often industrial, agricultural, and scholarly functions to the religious.",
  "  Shrines consecrate a holy place for its miraculous character or for its association with the life of the founder, gods, or saints of a cult. The major commemorative buildings of Christianity are those connected with the life of Jesus Christ (Church of the Nativity in Bethlehem) and the Apostles or early Church Fathers ( St. Peter’s Basilica in Rome) or with the medieval cult of relics ( Santiago de Compostela in Spain). No single formal design characterizes this type, but the theme of the domed or central-plan structure (round, square, polygon , Greek cross, etc.) connects the memoria of Asia (the Indian stupa , Chinese pagoda ), pagan antiquity (the Pantheon in Rome), and Christianity (the Church of the Holy Sepulchre in Jerusalem). The significance of the form is discussed below under Content .",
  "  Expressing relationship to the afterlife, funerary art is not always architectural, since it may be purely symbolic and therefore suitable to sculptural treatment, as in the classic Greek, medieval, and modern tomb. Funerary architecture is produced by societies whose belief in the afterlife is materialistic and by individuals who want to perpetuate and symbolize their temporal importance. Monumental tombs have been produced in ancient Egypt ( pyramids ), Hellenistic Greece ( tomb of Mausolus at Halicarnassus , which is the source of the word  mausoleum  ), ancient Rome (tomb of Hadrian ), Renaissance Europe ( Michelangelo ’s Medici Chapel , Florence), and Asia (Taj Mahal, Agra, Uttar Pradesh, India). Modern tomb design has lost vitality, though it remains as elaborate (Monument to Victor Emmanuel II , Rome) or as meaningful in terms of power ( Lenin Mausoleum, Moscow) as before. The exceptional examples are partly sculptural in character (e.g., Louis Sullivan ’s Wainwright Tomb, St. Louis, Missouri; Walter Gropius ’s war memorial, Weimar, Germany).",
  "Since the 18th century much of religious architecture has lost individuality and importance through the weakening of liturgical traditions. But today, as in the past, outstanding architects have met new demands of use and expression with superior solutions.",
  "  The basic functions of government, to an even greater extent than those of religion, are similar in all societies: administration, legislation, and the dispensing of justice. But the architectural needs differ according to the nature of the relationship between the governing and the governed. Where governmental functions are centralized in the hands of a single individual, they are simple and may be exercised in the ruler’s residence; where the functions are shared by many and established as specialized activities, they become complex and demand distinct structures. There are, however, no basic formal solutions for governmental architecture, since the practical needs of government may be met in any sheltered area that has convenient space for deliberation and administration. A distinct type is created rather by expressive functions arising from the ideology of the different systems of political organization ( monarchy , theocracy , democracy , etc.) and from the traditions of the various offices of government (law courts, assembly houses, city halls, etc.). Governments that exercise power by force rather than by consent tend to employ the expressive functions of architecture to emphasize their power; they tend to produce buildings of a monumentality disproportionate to their service to the community. Those in which the ruler is given divine attributes bring religious symbolism into architecture. Democratic governments have the responsibility of expressing in their architecture the aims of the community itself, a difficult task in the modern world, when the community may be neither small enough to express itself easily nor homogeneous enough to agree on how to do so.",
  "The simple democratic processes of the Greek city-states and the medieval free towns produced governmental architecture on a domestic scale, while the Roman Empire and later monarchies seldom made important distinctions between the palace and the seat of state functions. The widespread growth of representative government and the increase in the size and functions of the state in the 19th century created a great variety of buildings, some for entirely new uses. Some examples are: first, capitols, courthouses, parliament buildings, printing offices, and mints and, later, post offices, embassies, archives , secretariats, and even laboratories , when the work, the increased personnel, and the complexity of mechanical aids demanded specialized architectural solutions. Bureaucracy , for better or for worse, has made governmental architecture more important than at any time in history.",
  "  In the first rapid expansion from about 1780 to 1840, Neoclassical architects found impressive solutions to the new problems, but afterward governmental architecture lapsed into a century of conservatism, following at a safe distance behind private building. After World War II , governmental architecture showed new vitality. Outstanding are Le Corbusier ’s work at Chandigarh, Punjab, India, the United Nations Educational, Scientific and Cultural Organization headquarters in Paris, and the program of the U.S. Department of State for building American embassies.",
  "Military architecture is closer to the governmental type than to others, but its expressive function is so much subordinated to the practical that it is usually regarded as a class of engineering ( see  fortification ).",
  "Few recreations require architecture until they become institutionalized and must provide for both active and passive participation (athletic events, dramatic, musical performances, etc.) or for communal participation in essentially private luxuries (baths, museums , libraries ). Throughout history, recreational architecture has been the most consistent in form of any type. Diversions may change, but, as in domestic architecture, the physical makeup of human beings provides consistency. If their participation is passive, they must be able to hear and to see in comfort. If their participation is active, they must be given spaces suited to the chosen activities. In most cultures, recreational institutions have their origins in religious rites, but they easily gain independence, and religious expression is reduced or eliminated in their architecture.",
  "   Theatres originated in ancient Greece with the rites of the god Dionysus , first as temporary installations and later as outdoor architecture using the natural slope and curves of hillsides to bring the spectator close to the stage and to avoid the need for substructures. The Greek theatre was monumentalized and modified by the Romans, whose arches and vaults allowed construction of sloping seats from level foundations. In the Middle Ages churches and temporary structures were used for dramatic purposes, and in the Renaissance the form of the Roman theatre was occasionally revived ( Andrea Palladio ’s Teatro Olimpico in Vicenza, Italy). The 17th-century development of opera , drama, and ballet in Europe brought about a revival of theatre building but in a new form conceived to satisfy class and economic distinctions (e.g., the Teatro Farnese in Parma, Italy; Residenztheater, in Munich). A flat or inclined pit accommodated standing patrons, tiers of boxes rose vertically above in a horseshoe plan, and permanent covering (for both acoustics and comfort) made artificial lighting an important feature in theatrical performances. While the modern theatre has been greatly improved in efficiency by new acoustical methods and materials, it also has kept much of the Baroque form. However, it provides seating throughout and usually substitutes sloping galleries (into which the unprivileged have been moved) for boxes. The motion picture has had little effect on theatre design ( see  theatre ).",
  "The auditorium is distinguished by the absence of stage machinery and by its greater size. The development of large symphony  orchestras and choirs and of the institution of lectures and mass meetings combined with growing urban populations to produce this modification of the theatre.",
  "  Sport arenas , racetracks, and public swimming pools of the present day owe their origin to the ancient Romans (though certain precedents can be found in Crete and Greece). Although the classical tradition of sports was broken from the early Middle Ages to the 19th century, even the design of arenas and tracks has been scarcely altered from the Colosseum and Circus Maximus , though the construction of large grandstands has inspired magnificent designs in reinforced concrete (stadiums at Florence, Helsinki, and the Universidad Nacional Autónoma de México). Sports that have no precedents in antiquity, such as baseball , have required modifications in design but have not been important for architecture.",
  "   Museum and library architecture was also an innovation of classical antiquity (library architecture appears independently in ancient China and Japan). Early examples are found on the acropolis of Hellenistic Pergamum and in Roman Ephesus . Museums were not cultivated in the Middle Ages , and libraries were incorporated into monasteries . In the Renaissance and Baroque periods, library construction like Johann Bernhard Fischer von Erlach ’s Hofbibliothek in the Hofburg, Vienna, was rare, but important civic buildings were designed within religious institutions ( Michelangelo ’s Biblioteca Laurenziana in Florence) and universities ( Sir Christopher Wren ’s Trinity College Library, Cambridge; James Gibbs ’s Radcliffe Camera, Oxford). This type of architecture became truly communal for the first time in the 19th century, when the size of library collections and the number of visitors inspired some of the finest architecture of the modern period (Michael Gottlieb Bindesbøll’s Thorvaldsen Museum, Copenhagen; Sir Robert Smirke’s British Museum in London; Henri Labrouste ’s Bibliothèque Sainte-Geneviève in Paris; Alvar Aalto ’s library in Viipuri, Finland; Frank Lloyd Wright ’s Solomon R. Guggenheim Museum in New York City).",
  "The principal institutions of public welfare are those that provide facilities for education, health , public security, and utilities. Some of these functions are performed by the church and the state , but, since their character is not essentially religious or political, they may require independent architectural solutions, particularly in urban environments. A consistent typology of this architecture, however, cannot be established throughout history, because the acceptance of responsibility for the welfare of the community differs in degree in every social system.",
  "  Buildings for the specific purposes of public welfare were seldom considered necessary in antiquity or in the early Middle Ages. But in ancient Greece health facilities were included in precincts of Asclepius , the god of healing, and in the East within Buddhist precincts. The Romans produced a highly developed system of water supply and sewerage, of which their monumental aqueducts are an impressive survival.",
  "  In the later Middle Ages consistent forms began to emerge. With the separation of the university from a purely religious context, a concept of planning developed (particularly at Oxford , Cambridge , and Paris) that still influences educational architecture. Hospitals designed as large halls were established as adjuncts to churches, convents, and monasteries (Hôtel-Dieu, Beaune, France) and gained architectural independence in the Renaissance (Ospedale degli Innocenti, Florence). Ancient and medieval prisons and guardhouses were occasionally isolated from military architecture (e.g., Tower of London ; Bargello in Florence), but the prison did not become an important architectural type until the late 18th and 19th centuries (e.g., George Dance ’s Newgate Prison, London; Henry Hobson Richardson ’s Allegheny County Jail, Pittsburgh).",
  "The expansion of education and health facilities beginning in the 19th century created a widespread and consistently growing need for specialized architectural solutions. Schools, from the nursery to the university, now demand not only particular solutions at all levels but structures for a variety of purposes within each level; advanced education demands buildings for scientific research, training for trades and professions, recreation, health, housing, religious institutions, and other purposes. Most of the countries of the Western world have produced educational architecture of the highest quality; this architectural type is more important than in any past age.",
  "  Buildings for exchange, transportation, communication, manufacturing, and power production meet the principal needs of commerce and industry. In the past these needs were mostly unspecialized. They were met either within domestic architecture or in buildings distinguished from domestic types chiefly by their size. Stores, banks , hostelries, guildhalls, and factories required only space for more persons and things than houses could accommodate. Bridges , warehouses, and other structures not used for sheltering people were, of course, specialized from the beginning and survived the Industrial Revolution without basic changes. The Industrial Revolution profoundly affected the typology as well as the techniques of architecture. Through the introduction of the machine and mass production , economic life moved out of the domestic environment into an area dominated by devices and processes rather than by individuals, creating the need for buildings more specialized and more numerous than the total accumulation of types throughout history. All the types cannot be discussed here, but a categorical listing into which they can be fitted will illustrate their importance for architecture: exchange (office buildings, stores, markets, banks, exchanges, warehouses, exhibition halls); transportation ( roads , bridges, tunnels ; stations for rail, sea, and air transport and the dispensing of fuel; garages, hangars, and other storage facilities; hotels ); communication (structures for the transmission and reception of telephone , telegraph , radio , television , and radar communication; for the printing and distribution of newspapers , magazines , books , and other reading matter; for motion-picture production; and for advertising functions); production (mines, factories, laboratories, food-processing plants); power ( dams , generating plants; fuel storage, processing, and distribution installations).",
  "Each of these functions demands its own architectural solution, but in general they may be divided into two classes according to whether the plan must give greater attention to the size and movement of machinery or of persons. Wherever human activity is the chief concern, there has been less departure from traditional expression; banks in the form of Roman temples are an obvious example. The demands of machines have no tradition and have encouraged a search for greater, simpler, and more flexible spaces, but frequently the practical function has entirely eliminated the expressive, so that, with some distinguished exceptions (e.g., Frank Lloyd Wright’s S.C. Johnson & Sons, Inc., building, Racine, Wisconsin; Eero Saarinen ’s General Motors Technical Center, Warren, Michigan), most modern factories are not architecture. Where both human beings and machines had to be given equal attention, as in railroad stations, architecture of the 19th and 20th centuries vacillated between creating new forms and grasping for irrelevant traditions.",
  "The architect usually begins to work when the site and the type and cost of a building have been determined.",
  "The site involves the varying behaviour of the natural environment that must be adjusted to the unvarying physical needs of human beings; the type is the generalized form established by society that must be adjusted to the special use for which the building is required; the cost implies the economics of land, labour, and materials that must be adjusted to suit a particular sum.",
  "Thus, planning is the process of particularizing and, ultimately, of harmonizing the demands of environment, use, and economy. This process has a cultural as well as a utilitarian value, for in creating a plan for any social activity the architect inevitably influences the way in which that activity is performed.",
  "The natural environment is at once a hindrance and a help, and the architect seeks both to invite its aid and to repel its attacks. To make buildings habitable and comfortable, the architect must control the effects of heat , cold, light , air , moisture, and dryness and foresee destructive potentialities such as fire , earthquake , flood , and disease .",
  "The methods of controlling the environment considered here are only the practical aspects of planning. They are treated by the architect within the context of the expressive aspects. The placement and form of buildings in relation to their sites, the distribution of spaces within buildings, and other planning devices discussed below are fundamental elements in the aesthetics of architecture.",
  "The arrangement of the axes of buildings and their parts is a device for controlling the effects of sun , wind , and rainfall . The sun is regular in its course; it favours the southern and neglects the northern exposures of buildings in the Northern Hemisphere, so that it may be captured for heat or evaded for coolness by turning the axis of a plan toward or away from it. Within buildings, the axis and placement of each space determines the amount of sun it receives. Orientation may control air for circulation and reduce the disadvantages of wind, rain, and snow , since in most climates the prevailing currents can be foreseen. The characteristics of the immediate environment also influence orientation: trees , land formations, and other buildings create shade and reduce or intensify wind, while bodies of water produce moisture and reflect the sun.",
  "Planning may control the environment by the design of architectural forms that may modify the effects of natural forces. For example, overhanging eaves, moldings , projections, courts , and porches give shade and protection from rain. Roofs are designed to shed snow and to drain or preserve water. Walls control the amount of heat lost to the exterior or retained in the interior by their thickness and by the structural and insulating materials used in making them. Walls, when properly sealed and protected, are the chief defense against wind and moisture. Windows are the principal means of controlling natural light; its amount, distribution, intensity, direction, and quality are conditioned by their number, size, shape, and placement and by the characteristics of translucent materials (e.g., thickness, transparency, texture, colour). But the planning of fenestration is influenced by other factors, such as ventilation and heating. Since most translucent materials conduct heat more readily than the average wall, windows are used sparingly in extreme climates. Finally, since transparent windows are the medium of visual contact between the interior and exterior, their design is conditioned by aesthetic and practical demands.",
  "Colour has a practical planning function as well as an expressive quality because of the range of its reflection and its absorption of solar rays. Since light colours reflect heat and dark colours absorb it, the choice of materials and pigments is an effective tool of environmental control.",
  "The choice of materials is conditioned by their own ability to withstand the environment as well as by properties that make them useful to human beings. One of the architect’s jobs is to find a successful solution to both conditions; to balance the physical and economic advantages of wood against the possibility of fire, termites , and mold , the weather resistance of glass and light metals against their high thermal conductivity , and many similar conflicts. The more violent natural manifestations, such as heavy snow loads, earthquakes, high winds, and tornadoes , are controlled by special technical devices in regions where they are prevalent.",
  "Any number of these controls may be out of reach of the planner for various reasons. The urban environment, for example, restricts freedom of orientation and design of architectural forms and creates new control problems of its own: smoke, dirt, noise , and odours .",
  "The control of the environment through the design of the plan and the outer shell of a building cannot be complete, since extremes of heat and cold, light, and sounds penetrate into the interior, where they can be further modified by the planning of spaces and by special conditioning devices.",
  "Temperature, light and sound are all subject to control by the size and shape of interior spaces, the way in which the spaces are connected, and the materials employed for floors , walls, ceilings , and furnishings. Hot air may be retained or released by the adjustment of ceiling heights and sources of ventilation . Light reflects in relation to the colour and texture of surfaces and may be reduced by dark, rough walls and increased by light, smooth ones. Sounds are transmitted by some materials and absorbed by others and may be controlled by the form of interiors and by the use of structural or applied materials that by their density, thickness, and texture amplify or restrict sound waves.",
  "Conditioning devices played only a small part in architecture before the introduction of mechanical and electrical systems in the 19th century. The fireplace was almost the only method of temperature control (though the ancient Romans anticipated the modern water system for radiant heating ); fuel lamps and candles had to be movable and were rather in the sphere of furnishings than of architecture; the same is true of the tapestries and hangings used for acoustical purposes and to block drafts.",
  "Today, heating, insulation, air conditioning , lighting, and acoustical methods have become basic parts of the architectural program. These defenses and comforts of industrialization control the environment so efficiently that the contemporary architect is free to use or to discard many of the traditional approaches to site and interior planning.",
  "While environmental planning produces comfort for the senses (sight, feeling, hearing) and reflexes (respiration), planning for use or function is concerned with convenience of movement and rest. All activities that demand architectural attention require unique planning solutions to facilitate them. These solutions are found by differentiating spaces for distinct functions, by providing circulation among these spaces, and by designing them to facilitate the actions of the human body.",
  "The number of functions requiring distinct kinds of space within a building depends not only upon the type of building but also upon the requirements of the culture and the habits and activities of the individual patrons. Some houses have a single room with a hearth area, and others have separate areas for cooking, eating, sleeping, washing, storage, and recreation. A meetinghouse with a single hall is sufficient for Quaker religious services, while a Roman Catholic cathedral may require a nave , aisles , choir , apse , chapels , crypt , sacristy , and ambulatory .",
  "The planning of differentiated spaces involves as a guide to their design (placement, size, shape, environmental conditions, sequence, etc.) the analysis of use (number of uses and character, duration, time of day, frequency, variability, etc., of each), users (number, behaviour, age, sex, physical condition, etc.), and furniture or equipment required.",
  "Communication among differentiated spaces and between the exterior and the interior may be achieved by openings alone in the simplest plans, but most buildings require distinct spaces allotted to horizontal and vertical circulation (corridors, lobbies, stairs, ramps, elevators , etc.). These are designed by the procedure of analysis employed for differentiating uses. Since their function is usually limited to simplifying the movement of persons and things toward a particular goal, their efficiency depends on making the goal evident and the movement direct and easy to execute.",
  "The convenience of movement, like the comfort of environment, can be increased both by planning and by devices. Planning methods are based on analysis of the body measurements, movements, and muscular power of human beings of different ages and sexes, which results in the establishment of standards for the measurements of ceilings, doorways, windows, storage shelves, working surfaces, steps, and the like and for the weight of architectural elements that must be moved, such as doors, gates, and windows. These standards also include allowances for the movement of whatever furnishings, equipment, or machinery are required for the use of any building. Devices for facilitating movement within buildings replace or simplify the labours of daily life: the traditional pumps, plumbing , and sewerage systems and the innumerable modern machines for circulation, food preparation and preservation, industrial processing, and other purposes.",
  "Major expenses in building are for land, materials, and labour. In each case they are high when the commodity is scarce and low when it is abundant, and they influence planning more directly when they become restrictive.",
  "The effect of high land values is to limit the amount of space occupied by any building as well as the amount of expenditure that can be reserved for construction. When land coverage is limited, it is usually necessary to design in height the space that otherwise would be planned in breadth and depth, as in the ancient Roman  insula  (apartment houses) or the modern skyscraper . When the choice of materials is influenced by cost, all phases of architectural design are affected, since the planning procedure, the technique, and the form of buildings are dependent on materials. High labour costs influence the choice of techniques and, consequently, of materials. They encourage simplification in construction and the replacement of craftsmanship by standardization. The development in the 19th and 20th centuries of light wood-frame construction and methods of prefabrication was largely the result of the rising cost of labour.",
  "Planning involves not only the control of cost in each area but also the proportioning of expenditures among land, materials, and labour in order to produce the most effective solution to an architectural problem.",
  "The techniques of architecture in the sense that they will be considered here are simply the methods by which structures are formed from particular materials. These methods are influenced not only by the availability and character of materials but also by the total technological development of society, for architecture depends on an organized labour force and upon the existence of the tools and skills necessary to secure, manufacture, transport, and work durable materials.",
  "The evolution of techniques is conditioned by two forces. One is economic—the search for a maximum of stability and durability in building with a minimum of materials and labour. The other is expressive—the desire to produce meaningful form. Techniques evolve rapidly when economic requirements suggest new expressive forms or when the conception of new forms demands new procedures. But they remain static when architects avoid the risk of pioneering with untried and possibly unsuccessful methods and depend instead on proved procedures or when the need for the observance of tradition, for the communication of ideas, or for elegance and display is best fulfilled by familiar forms.",
  "The ultimate purpose of building techniques is to create a stable structure. In mechanical terms, structures are stable when all their parts are in a state of equilibrium, or rest. Walls and roofs can buckle, crack, or collapse if they are not properly designed. These movements are caused by forces that tend to push or pull bodies in a given direction. Forces acting on any member (part) of a building are, first, its own weight and, second, the loads it carries, principally from other members but also from persons, furnishings, wind, etc. Their action encounters a reaction in opposing forces that hold the member in place by resisting at its joints. These forces may be active in all directions, and they must be balanced for stability. They tend to crush, pull apart, and bend the member—in other words, to change its size and shape.",
  "Within the member itself there are forces, too, that tend to resist any deformation. They are called stresses, and they vary according to the strength of materials and the form of the member. The kinds of stress under consideration are compression , which resists crushing; tension , which resists pulling apart; and bending, which occurs when one part of a member is in compression and the other is in tension. A column is put into compression by the loads it carries; in a trussed roof the piece that forms the base of the triangle is put into tension by the outward-pushing forces in the sides; and a lintel or beam (the member that spans a space) is put into bending by loads and forces that push down on its top and encounter a reacting force at its ends. Some materials are strong only in compression (e.g., stone , brick , cast iron , concrete ) and others in tension as well (e.g., wood, steel , reinforced concrete ), so the latter are more efficient in resisting bending forces.",
  "Finally, the stability of the total structure whose single members are all in equilibrium is achieved by diverting the loads from all of them downward so that they may be resisted by the upward-supporting forces of the ground.",
  "Techniques will be discussed in terms of the characteristics of building materials and the methods by which they are used in architecture ( see  building construction) .",
  " bce  In most areas where stone is available, it has been favoured over other materials for the construction of monumental architecture. Its advantages are durability, adaptability to sculptural treatment, and the fact that it can be used in modest structures in its natural state. But it is difficult to quarry , transport, and cut, and its weakness in tension limits its use for beams, lintels, and floor supports.",
  "The simplest and cheapest stonework is rubble; i.e., roughly broken stones of any shape bounded in mortar . The strongest and most suitable stonework for monumental architecture is ashlar masonry, which consists of regularly cut blocks (usually rectangular). Because of its weight and the precision with which it can be shaped, stone masonry (in contrast with brick) does not depend on strong bonding for stability where it supports only direct downward loads. The entablatures (the upper sections of a classical order that rest on the capital of a column ) of an ancient Greek temple , for example, were bonded by small bronze dowels. But the weight creates problems of stability when loads push at an angle; stone vaults and arches require more support and buttressing than equivalent forms in other materials.",
  "  The best stone (and brick) bonding is that in which blocks are placed so that the vertical joints in one course are not above the joints in the courses above and below, since the stone resists deformation better than any bonding material. Many stones are strong enough to provide monolithic supports (columns and piers ) and beams (lintels), and in some styles stone slabs are employed even for roofing (ancient Egyptian temples, early Christian basilicas in Syria), but this roofing requires so many columns that unvaulted masonry buildings are almost always combined with floors and covering in wood. Stone has been consistently used for building since the Stone Age, as exemplified by Stonehenge , in England. Although it has generally been replaced as a structural material by cheaper and more efficient manufactured products, it is still widely used as a surface veneer for its practical and expressive qualities.",
  "  Brick compares favourably with stone as a structural material for its fire- and weather-resisting qualities and for the ease of production, transportation, and laying. The size of bricks is limited by the need for efficient drying, firing, and handling, but shapes, along with the techniques of bricklaying, have varied widely throughout history. Special shapes can be produced by molding to meet particular structural or expressive requirements (for example, wedge-shaped bricks are sometimes employed in arch construction and bricks with rounded faces in columns). Bricks may be used in construction only in conjunction with mortar, since the unit is too small, too light, and too irregular to be stabilized by weight. Each course (or layer) must be laid on an ample mortar bed with mortar filling the vertical joints. The commonest ancient Roman bricks were cut into triangles and laid with the base out and the apex set into a concrete filling that provided additional strength. Rectangular bricks are bonded either as headers (short side out) or stretchers (long side out). Standard modern types provide a ratio of width to length of slightly less than 1:2 to permit a wide variety of bonding patterns within a consistent module, or standard of measurement. Brick, which has been used since the 4th millennium bce , was the chief building material in the ancient Near East. The versatility of the medium was expanded in ancient Rome by improvements in the manufacture of both bricks and mortar and by new techniques of laying and bonding. Employed throughout the Middle Ages , brick gained greater popularity from the 16th century on, particularly in northern Europe. It was widely used in the 20th century, often for nonbearing walls in steel frame construction.",
  "  Wood is easier to acquire, transport, and work than other natural materials. All parts of a building can be efficiently constructed of wood except foundations; its disadvantage is susceptibility to fire, mold, and termites. The strength of wood in both tension and compression arises from its organic nature, which gives it an internal structure of longitudinal and radial fibres that is not impaired by cutting or long exposure. But like all organisms it contains moisture and is not uniformly strong, so it must be carefully selected and seasoned to prevent warping, splitting, and failure under loads. Wood is used in building both solid and skeletal structures. The principal solid system, called log construction, is employed when only unsophisticated cutting tools are available. Four walls must be built up together in horizontal layers of single hewn or uncut logs and jointed at the corners. The stability of the log building depends entirely on the mutual support of the walls, and the method is suitable only for simple structures of limited size. The skeletal system requires precise cutting and shaping of lumber. It provides a rigid framework of jointed or nailed members independent of the walls, which are attached to the exterior and interior surfaces after completion.",
  "Almost all masonry buildings of the past had wood floors and coverings, since wood is the lightest, the most practical, and the most inexpensive material for spanning spaces.",
  "The monumental architecture of the West has typically employed materials rarer than wood for expressive purposes, but the history of wood construction can be traced consistently in China, Korea, and Japan and in the domestic architecture of northern Europe and North America. Wood continues to be used in a growing number of techniques and products: heavy framing systems with compound beams and girders , interior and exterior facing with plywood and other composite panels, and arch and truss systems with laminated members that can be designed to meet particular structural demands ( see  wood ).",
  "  The development of construction methods in iron and steel was the most important innovation in architecture since ancient times. These methods provide far stronger and taller structures with less expenditure of material than stone, brick, or wood and can produce greater unsupported spans over openings and interior or exterior spaces. The evolution of steel frame construction in the 20th century entirely changed the concept of the wall and the support.",
  "In architecture before 1800, metals played an auxiliary role. They were used for bonding masonry (dowels and clamps), for tension members (chains strengthening domes, tie rods across arches to reinforce the vaults), and for roofing, doors, windows, and decoration. Cast iron, the first metal that could be substituted for traditional structural materials, was used in bridge building as early as 1779. Its ability to bear loads and to be produced in an endless variety of forms, in addition to its resistance to fire and corrosion, quickly encouraged architectural adaptations, first as columns and arches and afterward in skeletal structures. Because cast iron has much more compressive than tensile strength (for example, it works better as a small column than as a beam), it was largely replaced in the late 19th century by steel, which is more uniformly strong, elastic, and workable, and its high resistance in all stresses can be closely calculated.",
  "Steel structural members are rolled in a variety of shapes, the commonest of which are plates, angles, I beams, and U-shaped channels. These members may be joined by steel bolts or rivets , and the development of welding in the 20th century made it possible to produce fused joints with less labour and materials. The result is a rigid, continuous structure in which the joint is as firm as the member and which distributes stresses between beams and columns. This is a fundamental change in architectural technique, the effect of which cannot yet be estimated.",
  "Normally, steel must be protected against corrosion by surface coverings, but alloys such as stainless steel have been developed for exposed surfaces. Aluminum and other light metal alloys have come to be favoured for exterior construction because of their weather resistance.",
  "Concrete is a manufactured mixture of cement and water, with aggregates of sand and stones, which hardens rapidly by chemical combination to a stonelike, water- and fire-resisting solid of great compressive (but low tensile) strength. Because it can be poured into forms while liquid to produce a great variety of structural elements, it provides an economical substitute for traditional materials, and it has the advantages of continuity (absence of joints) and of fusing with other materials.",
  "Concrete was employed in ancient Egypt and was highly developed by the ancient Romans, whose concrete made with volcanic-ash cement (pozzolana) permitted a great expansion of architectural methods, particularly the development of domes and vaults (often reinforced by brick ribbing) to cover large areas, of foundations, and of structures such as bridges and sewerage systems where waterproofing was essential. The technique of manufacture declined in the Middle Ages and was regained in the 18th century, but concrete had only a limited importance for architecture until the invention of reinforced concrete in the 1860s.",
  "  Reinforced concrete was developed to add the tensile strength of steel to the compressive strength of mass concrete. The metal is embedded by being set as a mesh into the forms before pouring, and in the hardened material the two act uniformly. The combination is much more versatile than either product; it serves not only for constructing rigid frames but also for foundations, columns, walls, floors, and a limitless variety of coverings, and it does not require the addition of other structural materials. Although the making of forms is a slow and costly process, the technique competes economically with steel frame construction because the mesh, composed of thin, bendable metal rods or metal fabric, employs far less steel, and concrete is itself inexpensive.",
  "The steel reinforcement is employed to take full advantage of the plastic, or sculptural, character of concrete. It can be jointed or bent to unify supporting members with the floors and the coverings they carry. Furthermore, stresses produced in floors, domes, and vaults may be distributed within the slabs themselves to reduce load, and the diminished load may be concentrated at desired points so that the number and size of supports is greatly reduced.",
  "Three 20th-century developments in production had a radical effect on architecture. The first, concrete-shell construction, permits the erection of vast vaults and domes with a concrete and steel content so reduced that the thickness is comparatively less than that of an eggshell. The second development, precast-concrete construction, employs bricks, slabs, and supports made under optimal factory conditions to increase waterproofing and solidity, to decrease time and cost in erection, and to reduce expansion and contraction. Finally, prestressed concrete provides bearing members into which reinforcement is set under tension to produce a live force to resist a particular load. Since the member acts like a spring, it can carry a greater load than an unstressed member of the same size.",
  "The two types of wall are load bearing, which supports the weight of floors and roofs, and nonbearing, which at most supports its own weight.",
  "The load-bearing wall of masonry is thickened in proportion to the forces it has to resist: its own load, the load of floors, roofs, persons, etc., and the lateral forces of arches, vaults, wind, etc., that may cause it to crack or buckle. Its thickness often can be reduced at the top, because loads accumulate toward the base; in high buildings this is done by interior or exterior setbacks at the floor level of upper stories. Walls that must resist lateral forces are thickened either along the whole length or at particular points where the force is concentrated. The latter method is called buttressing . Doors and windows weaken the resistance of the wall and divert the forces above them to the parts on either side, which must be thickened in proportion to the width of the opening. In multistory buildings, windows—unless they are very small—must be placed one above the other so as to leave uninterrupted vertical masses of wall between them to transfer loads directly to the ground. The number of openings that can be used depends on the strength of the masonry and the stresses in the wall. Walls in light, wood-framed structures and in reinforced-concrete construction may have a bearing function also. But the nature of the material admits other means of resisting forces than the increase of mass.",
  "The placement of walls is determined by the type of support for floors and roofs. The commonest support is the beam, which must be jointed to walls at both ends; consequently, its maximum permissible length establishes the distance between bearing walls. All floors and coverings are most easily supported on straight, parallel walls except the dome ( see below  Dome ).",
  "Excluding the independent garden variety, the nonbearing wall appears only where loads are carried by other members, as in heavy timber and other skeletal structures. Modern steel and reinforced-concrete frames require exterior walls only for shelter and sometimes dispense with them on the ground floor to permit easier access. Since the wall rests or hangs upon members of the frame, it becomes a curtain or screen and admits treatment in any durable, weather-resisting material. Traditional materials are often used, but light walls of glass, plastic, metal alloys, wood products, etc., can be equally efficient. This freedom of choice extends also to the form of walls and offers greatly expanded opportunities for creative expression.",
  "  The simplest illustration of load and support in construction is the post-and-lintel system, in which two upright members (posts, columns , piers ) hold up a third member (lintel, beam , girder , rafter) laid horizontally across their top surfaces. This is the basis for the evolution of all openings. But, in its pure form, the post-and-lintel is seen only in colonnades and in framed structures, since the posts of doors, windows, ceilings, and roofs are part of the wall.",
  "The job of the lintel is to bear the loads that rest on it (and its own load) without deforming or breaking. Failure occurs only when the material is too weak or the lintel is too long. Lintels composed of materials that are weak in bending, such as stone, must be short, while lintels in materials that are strong in bending, such as steel, may span far greater openings. Masonry lintels are inefficient because they must depend on the cohesiveness of mortar, which is weaker than the blocks it bonds; so, in masonry construction, lintels of monolithic (single-slab) stone, wood, and stronger materials are employed.",
  "The job of the post is to support the lintel and its loads without crushing or buckling. Failure occurs, as in lintels, from excessive weakness or length, but the difference is that the material must be especially strong in compression. Stone, which has this property, is more versatile as a post than as a lintel; under heavy loads it is superior to wood but not to iron, steel, or reinforced concrete. Masonry posts, including those of brick, may be highly efficient, since the loads compress the joints and add to their cohesiveness. Although monolithic stone columns are used, they are extravagant to produce for large structures, and columns are usually built up of a series of cylindrical blocks called drums .",
  "  From prehistoric times to the Roman Empire , the post-and-lintel system was the root of architectural design. The interiors of Egyptian temples and the exteriors of Greek temples are delineated by columns covered by stone lintels. The Greeks opened their interior spaces by substituting wooden beams for stone, since the wood required fewer supports. The development of the arch and vault challenged the system but could not diminish its importance either in masonry construction or in wood framing, by its nature dependent on posts and beams.",
  "  Ancient uses of the post-and-lintel were refined but not fundamentally altered until the production of cast-iron columns, which, offering greater strength and smaller circumference, greatly reduced the mass and weight of buildings. Much construction in modern materials is based on the post-and-lintel system of the past. Steel and concrete skeletons restore to modern architecture the formal simplicity of the oldest structures known. But, because they are rigid frames, they abandon the fundamental concept of the duality of post-and-lintel by fusing them into a unit throughout which stresses are distributed. The “mushroom” column is a further departure, since the unit can be extended into a covering slab and becomes a ceiling as well as a support.",
  "  The arch can be called a curved lintel. Early masonry builders could span only narrow openings because of the necessary shortness and weight of monolithic stone lintels. With the invention of the arch, two problems were solved: (1) wide openings could be spanned with small, light blocks, in brick as well as stone, which were easy to transport and to handle; and (2) the arch was bent upward to resist and to conduct into its supports the loads that tended to bend the lintel downward. Because the arch is curved, the upper edge has a greater circumference than the lower, so that each of its blocks must be cut in wedge shapes that press firmly against the whole surface of neighbouring blocks and conduct loads uniformly. This form creates problems of equilibrium that do not exist in lintels. The stresses in the arch tend to squeeze the blocks outward radially, and loads divert these outward forces downward to exert a resultant diagonal force, called thrust, which will cause the arch to collapse if it is not properly buttressed. So an arch cannot replace a lintel on two free-standing posts unless the posts are massive enough to buttress the thrust and to conduct it into the foundations (as in ancient Roman triumphal arches ). Arches may rest on light supports, however, where they occur in a row, because the thrust of one arch counteracts the thrust of its neighbours, and the system will remain stable as long as the arches at either end of the row are buttressed by walls, piers, or earth.",
  "The size of arches is limited only by economy; large arches exert large thrusts, and they are hard to buttress and to build. The form may be varied to meet specific problems; the most efficient forms in masonry are semicircular, segmental (segment of a circle), and pointed (two intersecting arcs of a circle), but noncircular curves can be used successfully.",
  "  Arches were known in Egypt and Greece but were considered unsuitable for monumental architecture. In Roman times the arch was fully exploited in bridges , aqueducts , and large-scale architecture. New forms and uses were found in medieval and particularly Gothic architecture ( flying buttress , pointed arch), and Baroque architects developed a vocabulary of noncircular forms for expressive reasons. Steel, concrete, and laminated-wood arches of the 20th century changed the concept and the mechanics of arches. Their components are completely different from wedge-shaped blocks (voussoirs); they may be made entirely rigid so as to require only vertical support; they may be of hinged intersections that work independently, or they may be thin slabs or members (in reinforced concrete) in which stresses are so distributed that they add the advantages of lintels to those of arches, requiring only light supports. These innovations provide a great freedom of design and a means of covering great spans without a massive substructure.",
  "  The evolution of the vault begins with the discovery of the arch, because the basic “barrel” form, which appeared first in ancient Egypt and the Near East, is simply a deep, or three-dimensional, arch. Since the barrel vault exerts thrust as the arch does, it must be buttressed along its entire length by heavy walls in which openings must be limited in size and number. This is a disadvantage, since it inhibits light and circulation.",
  "But Roman builders discovered that openings could be made by building two barrel vaults that intersected at right angles to form the groin vault, which is square in plan and may be repeated in series to span rectangular areas of unlimited length. This vault has the additional advantage that its thrusts are concentrated at the four corners, so that the supporting walls need not be uniformly massive but may be buttressed where they support the vault.",
  "Two disadvantages of the groin vault encouraged Gothic builders to develop a modification known as the rib vault. First, to build a groin vault, a form must be made to pour or lay the entire vault, and this requires complex scaffolding from the ground up; second, the groin vault must be more or less square, and a single vault cannot span extended rectangular areas. The rib vault provided a skeleton of arches or ribs along the sides of the area and crossing it diagonally; on these the masonry of the vault could be laid; a simple centring sufficed for the ribs. To cover the rectangular areas, the medieval mason used pointed arches, which, unlike round arches, can be raised as high over a short span as over a long one. Thus, the vault could be composed of the intersection of two vaults of different widths but the same height.",
  "  To reduce further the thickness of the wall (to the point of substituting large areas of glass for masonry), Gothic builders developed the flying buttress , which counteracts vault thrust not by continuous wall mass and weight but by counterthrust created by exterior half-arches placed at the height of the vaults at the points of greatest stress. These buttresses conduct stresses to heavier wall buttresses below the window level.",
  "  The next important development in vaults, as in arches, came with 19th-century materials. Great iron skeleton vaults were constructed as a framework for light materials such as glass ( Crystal Palace , London). The elimination of weight and excessive thrust, the freedom in the use of materials, and the absence of centring problems favoured the simple barrel vault and made more complex types obsolete. But in many of the modern frame systems the vault itself loses its structural function and becomes a thin skin laid over a series of arches.",
  "While the arch is supplanting the vault in one area of technique, the vault has abandoned the arch principle in another. The reinforced-concrete shell vault, based on the principle of the bent or molded slab, is one of the most important innovations in the history of architecture. It has all the advantages of load distribution of the concrete floor slab, plus the resistance to bending provided by its curved form. The shell is reinforced in such a way that it exerts no lateral thrust and may be supported as if it were a beam or truss ; hence, the form no longer necessitates the conducting of loads into the wall, and the vault may be designed with great freedom.",
  " Domes appeared first on round huts and tombs in the ancient Near East, India, and the Mediterranean region but only as solid mounds or in techniques adaptable only to the smallest buildings. They became technically significant with the introduction of the large-scale masonry hemispheres by the Romans. Domes, like vaults, evolved from the arch, for in their simplest form they may be thought of as a continuous series of arches, with the same centre. Therefore, the dome exerts thrusts all around its perimeter, and the earliest monumental examples required heavy walls. Since the walls permitted few openings and had to be round or polygonal to give continuous support, early domes were difficult to incorporate into complex structures, especially when adjacent spaces were vaulted.",
  "Byzantine architects perfected a way of raising domes on piers instead of walls (like groin vaults), which permitted lighting and communication from four directions. The transition from a cubic plan to the hemisphere was achieved by four inverted spherical triangles called pendentives —masses of masonry curved both horizontally and vertically. Their apexes rested on the four piers, to which they conducted the forces of the dome; their sides joined to form arches over openings in four faces of the cube; and their bases met in a complete circle to form the dome foundation. The pendentive dome could rest directly on this foundation or upon a cylindrical wall, called a drum, inserted between the two to increase height.",
  "The dome was unsuited to the lightness and verticality of late medieval styles but was widely used in the Renaissance and Baroque periods. Renaissance builders adapted the Gothic rib system to dome construction and found new means to reduce loads and thrust (concentric chains, etc.) that permitted high drums and variations in the curvature of the dome. The awkward, tunnellike effect produced on the interior by high domes was often hidden by an internal shell built on the same foundations (as at Florence Cathedral and St. Paul’s Cathedral, London).",
  "The effort and ingenuity devoted to doming rectangular buildings can be explained principally by the symbolic character of the form, since vaulting is a simpler alternative. So it was chiefly the desire to observe tradition that preserved the dome in the early era of iron and steel construction, and, with rare exceptions (Halle aux Blés, Paris; the Coal Exchange, London), 19th-century examples retained masonry forms without exploiting the advantages of metal.",
  "  Newer techniques, however, have added practically to the expressive advantages of domes. The reinforced-concrete slab used in vaulting can be curved in length as well as width (like an inflated handkerchief or a parachute). And in this development the distinction between vaults and domes loses significance, being based on nothing but the type of curvature in the slab. Geodesic domes, developed in the 20th century by R. Buckminster Fuller , are spherical forms in which triangular or polygonal facets composed of light skeletal struts or flat planes replace the arch principle and distribute stresses within the structure itself, as in a truss. Geodesic domes can be supported by light walls and are the only large domes that can be set directly on the ground as complete structures.",
  "  By far the commonest covering throughout history is the trussed roof, constructed upon a frame composed of triangular sections spaced crosswise at intervals and made rigid in length by beams. Trusses formerly were principally of wood and were used to cover masonry as well as framed structures, even when these were vaulted. The variety of trusses is so great that only the general principle of the form can be given here.",
  "The truss is based on the geometric law that a triangle is the only figure that cannot be changed in shape without a change in the length of its sides; thus, a triangular frame of strong pieces firmly fastened at the angles cannot be deformed by its own load or by external forces such as wind pressure. These forces, which in a vault thrust outward against the walls, are contained within the truss itself, because the piece (chord) at the base of the triangle resists by tension the tendency of the two sides to behave like a vault. With its forces in equilibrium, the truss exerts only a direct downward pressure on the walls, so that they need not be thickened or buttressed. This explains why most roofs are triangular in cross section.",
  "In trusses that are too large to be constructed of three members of moderate size, a complex system of small triangles within the frame replaces the simple triangle.",
  "Not all peaked roofs are trusses, for in early buildings, in ancient Greece, and in much Chinese and Japanese wood architecture the chord is omitted and the sides exert thrust. Nor are all trusses triangular, since the principle may be modified (as in modern steel and heavy timber construction) to apply to arches and vaults if chords of sufficient strength can be found.",
  "A framed structure in any material is one that is made stable by a skeleton that is able to stand by itself as a rigid structure without depending on floors or walls to resist deformation. Materials such as wood, steel , and reinforced concrete , which are strong in both tension and compression, make the best members for framing. Masonry skeletons, which cannot be made rigid without walls, are not frames. The heavy timber frame, in which large posts, spaced relatively far apart, support thick floor and roof beams, was the commonest type of construction in eastern Asia and northern Europe from prehistoric times to the mid-19th century. It was supplanted by the American light wood frame ( balloon frame ), composed of many small and closely spaced members that could be handled easily and assembled quickly by nailing instead of by the slow joinery and dowelling of the past. Construction is similar in the two systems, since they are both based on the post-and-lintel principle. Posts must rest on a level, waterproof foundation, usually composed of masonry or concrete, on which the sill (base member) is attached. Each upper story is laid on crossbeams that are supported on the exterior wall by horizontal members. Interior walls give additional beam support.",
  "In the heavy-timber system, the beams are strong enough to allow the upper story and roof to project beyond the plane of the ground-floor posts, increasing the space and weather protection. The members are usually exposed on the exterior. In China, Korea, and Japan, spaces between are enclosed by light screen walls and in northern Europe partly by thinner bracing members and partly by boards, panels, or (in half-timbered construction) bricks or earth.",
  "The light frame, however, is sheathed with vertical or horizontal boarding or shingling , which is jointed or overlapped for weather protection. Sheathing helps to brace as well as to protect the frame, so the frame is not structurally independent as in steel frame construction. The light-frame system has not been significantly improved since its introduction, and it lags behind other modern techniques. Prefabricated panels designed to reduce the growing cost of construction have not been widely adopted. Modern heavy-timber and laminated-wood techniques, however, provide means of building up compound members for trusses and arches that challenge steel construction for certain large-scale projects in areas where wood is plentiful.",
  "Steel framing is based on the same principles but is much simplified by the far greater strength of the material, which provides more rigidity with fewer members. The load-bearing capacity of steel is adequate for buildings many times higher than those made of other materials. Because the column and beam are fused by riveting or welding, stresses are distributed between them, and both can be longer and lighter than in structures in which they work independently as post-and-lintel. Thus, large cubic spaces can be spanned by four columns and four beams, and buildings of almost any size can be produced by joining cubes in height and width. Since structural steel must be protected from corrosion, the skeleton is either covered by curtain walls or surfaced in concrete or, more rarely, painted. The steel frame is used also in single-story buildings where large spans are required. The simple cube then can be abandoned for covering systems employing arches, trusses, and other elements in a limitless variety of forms in order to suit the functions of the building.",
  "Differences between reinforced-concrete and steel framing are discussed in the section on materials. The greater rigidity and continuity of concrete frames give them more versatility, but steel is favoured for very tall structures for reasons of economy in construction and space. An example is the system called box frame construction , in which each unit is composed of two walls bearing a slab (the other two walls enclosing the unit are nonbearing curtain walls); this type of construction extends the post-and-lintel principle into three dimensions. Here, again, concrete crosses the barriers that separated traditional methods of construction.",
  "Expression in architecture is the communication of quality and meaning. The functions and the techniques of building are interpreted and transformed by expression into art, as sounds are made into music and words into literature.",
  "The nature of expression varies with the character of culture in different places and in different times, forming distinct modes or languages of expression that are called styles. Style communicates the outlook of a culture and the concepts of its architects. The boundaries of a style may be national and geographical (e.g., Japanese , Mayan ) or religious (e.g., Islamic ) and intellectual (e.g., Renaissance ), embracing distinct linguistic, cultural, and national units; different expressions within each of these boundaries are produced by the particular style of regions, towns, groups, architects, or craftsmen. The life span of styles may be long ( ancient Egyptian , over 3,000 years) or short ( Baroque , less than 200 years) according to the changeability of cultural patterns. The principal forces in the creation of a style are tradition, the experience of earlier architecture; influence, the contribution of contemporary expressions outside the immediate cultural environment; and innovation, the creative contribution of the culture and the architect. These forces operate to produce an evolution within every style and ultimately to generate new styles that tend to supplant their predecessors.",
  "The components of expression, which communicate the particular values of style, are content and form. Since content can be communicated only through form, the two are organically united, but here they will be discussed separately in order to distinguish the specific and concrete meaning (content) from the abstract expression of qualities (form).",
  "Content is the subject matter of architecture, the element in architectural expression that communicates specific meanings that interpret to society the functions and techniques of buildings.",
  "Society requires that architecture not only communicate the aspirations of its institutions but also fulfill their practical needs. Differences in expression, apart from differences in planning, distinguish the forms of architectural types (the house from the church, etc.), the kinds of use (the Catholic from the Protestant church), and the traditions and customs of users (the English from the Swiss Protestant church). When architectural forms become the vehicles of content—in plan, elevation, and decoration—they are symbolic. Their symbolism can be understood consciously or unconsciously, by association (e.g., spire = church) to a building one has seen before and by the fact that it suggests certain universal experiences (e.g., vertical forms “rise”; low roofs “envelop”). One comprehends the meaning of symbols that are new, as well as those that are known, by association, because the laws of statics restrain builders from putting them into forms so completely unfamiliar that they do not suggest some tradition, just as the structure of language permits endless new meanings but retains a fairly constant vocabulary. The meaning of architectural symbols—or of words—may even change, but the process must be both logical and gradual, for, if the change is irrational, the purpose—communication—is lost.",
  "The architectural plan, when used symbolically, communicates through its shape. From prehistoric times and in many cultures, the circle, with its suggestion of the planets and other manifestations of nature, gained a symbolic, mystical significance and was used in the plans of houses, tombs, and religious structures. By slow processes it came to be employed for memoria and shrines and for hero cults in both the East and the West. When building techniques permitted, its symbolism often merged with that of the dome. In Hindu temples , the square (and the cross plans developed from it) expressed celestial harmony. The central-plan Christian church (circle, polygon, Greek cross, ellipse) fascinated the architects of the Renaissance with its symbolic and traditional values, and it is found in their drawings and treatises to the virtual exclusion of the more practical longitudinal basilicas that architects were often commissioned to build.",
  "Plan symbolism remained almost exclusively in the sphere of religion after antiquity, and its traditions gradually disappeared in the course of the 19th century. The modern plan is determined by problems of form (space-mass relationships, etc.) and by the practical demands of use rather than by symbolic communication.",
  "  In elevation the most consistent symbolic forms have been the dome, the tower , the stairway , the portal, and the colonnade . Domes imply the meanings of the circle and more, since a dome is a covering. Long before masonry domes could be built, the hemisphere was associated with the heavens as a “cosmic canopy,” and throughout history domes have been decorated with stars and astrological symbols. In ancient Rome and among Christians and Indian Buddhists, the dome came to mean universal power. During the Renaissance it spread from religious structures to palaces and government buildings, retaining some of its implications of power. In the United States the national capitol is domed, and there are few state capitols without domes; the symbol has survived the loss of its original meanings. The tower, with origins in early nature rites, has consistently symbolized power. The Chinese pagoda extends central-plan symbolism into towers; many towers and spires rose from the northern European Gothic cathedral, and the medieval Italian city was a forest of towers erected by nobles in constant competition to express their supremacy. This meaning survives in modern skyscrapers; their height is more frequently boasted of than their efficiency or beauty.",
  "Architectural elements conceived to facilitate the use of buildings may also take on symbolic significance. The stairway, employed in the past to give “monumentality” to important buildings, frequently became more expressive than convenient, especially in Baroque palaces. Portals, from the time of ancient Egyptian temple pylons and Babylonian city gates, became monuments in themselves, used to communicate a heightened significance to what lay behind them. In the Gothic cathedral they became the richest element of the facade—a translation of biblical doctrine into stone. Since the development of the classical Greek temple, the colonnade on the exterior of buildings has borne similar implications.",
  "Such symbols have become archaic in modern culture and appear as a sign of resistance to new forms. This resistance is especially evident in the popular symbolism of domestic architecture, where the atmosphere of the home is often expressed by cottage-like roofs, shutters, trellises, mullioned windows, grilles, and other associations with a more peaceful past.",
  "  Decoration, the most easily recognized medium of content, communicates meaning either through architectural elements or through the figural arts ( sculpture , painting , mosaic , stained glass , etc.). The architectural elements used decoratively, such as the classical orders , usually originate in technique and in time lose their structural significance to become symbols. In ancient Rome and from the Renaissance to the 20th century, the formal Grecian orders were applied to buildings of many different techniques as expressions of the continuing influence of Greek institutions. Similarly, the new vocabulary of Gothic architecture , developed with new building techniques (the pointed arch, the flying buttress , etc.), became in later periods a source for religious and romantic symbolism. The Art Nouveau of the turn of the 20th century, a system of ornament based on floral and other organic forms, survived for only two decades, perhaps because its symbols were neither drawn from a tradition nor derived from a structural system. (Architectural ornament will be further treated below.)",
  "The function of the figural arts in conveying content is a subject outside the scope of this article, but its importance for architecture must be mentioned. The figural arts not only offer the means of expressing more specific ideas than any architectural symbols, but in many architectural styles they define the character of mass and space. The sculptures of the Hindu temple, the mosaics of the Byzantine church, and the stuccoes of Moorish palaces are not ornamental applications; they determine the form of the building itself.",
  "The virtual absence of traditional symbols in modern architecture is evidence of the failure of these symbols to express the cultural patterns of the 20th and 21st century. In these times, architecture, like painting, sculpture, and other arts, has tended to be abstract, to emphasize qualities of form rather than the communication of familiar ideas through symbols.",
  "The second aspect of content is the communication of the structural significance of materials and methods. Its purpose is to interpret the way in which architecture is put together. The characteristics of materials that are important in expressing design techniques are the properties of their composition (e.g., structure, weight, durability) and the way they are used in structure. Their properties may be expressed and interpreted by the treatment of the surface, and their use may be expressed by emphasis on the dimensions and joining of the building units into which they are formed.",
  "The hardness, weight, and crystalline composition of stone masonry traditionally have been emphasized by devices not necessarily connected with structural methods: rustication (finishing in rough, uneven surfaces), drafting (more refined, linear cutting), and polishing. Niches and other indentations, projecting courses, or frames around openings suggest massiveness. In nonbearing walls, a smooth, unbroken surface implies thinness. The use of stone or brick masonry in construction is emphasized by clarifying the limits of each block and by the amount of mortar used and by distinguishing lintels, arches, and other specific members from the construction of the wall. The properties of wood are suggested by revealing and emphasizing its texture in load-bearing members and by treating the sheathing of light wood frames in patterns (of shingling or boarding) that communicate thinness. The plasticity of concrete is shown by freedom in modelling and its use in construction by emphasizing the impressions of the wooden forms in which it is cast. The sections of light metal curtain walls are frequently stamped into geometric patterns to illustrate their nonbearing character. Materials that must be covered for protection, such as unfired brick and the steel used in framing, are not adaptable to this type of communication.",
  "  At times building methods are demonstrated simply by exposing the structure, as in the heavy timber frame, but in many styles the functions of structural systems have been interpreted by designing their members in forms that often are more explanatory than efficient. The Greek column, which is narrower at its summit than at its base, is diminished by a curve beginning slightly below the midpoint, giving it an effect of an almost muscular power to resist loads. The expression is more explicit in the caryatid , a human figure that replaces the column, and in the burdened animals and dwarfs that support the columns of Romanesque portals. Many elements in the Gothic cathedral serve as diagrams of structure: the supporting piers are clusters of shafts, each of which extends upward without interruption to become the rib of the vault, and the ribs themselves are an elucidation of technique; the flying buttress and the window tracery are elegant interpretations of their functions. In the modern steel-frame building, the hidden forms of the skeleton are often repeated on the facade to enable one to “see through” to the technique, but the system also permits the alternative of expressing the lightness and independence of the curtain wall by sheer surfaces of glass and other materials. The work of the concrete slab is made explicit by projecting indications of the placement of reinforcement or of the distribution of stresses.",
  "The expression of technique is characteristic not of all architectural styles but only of those such as the Gothic and modern, in which new techniques excite a search for the interpretive design of their materials and methods. More often than not, both materials and methods have been disguised by decorative forms or surfacing such as veneers , stucco , or paint, because of emphasis on the expression of content or of form. Most early stone architecture in Egypt, Greece, and India retained as decoration the forms developed in wooden forerunners. The precious marble of Greek temples was disguised under painted stucco, Roman brickwork was hidden by slabs of coloured marble, and 19th-century cast-iron columns were molded into classic or Gothic forms. The history of domes is filled with examples of the successful disguising of method, of giving the ponderous mass the effect of rising from the exterior and of floating from within.",
  "Technical content was one of the foundation stones of 20th-century architectural theory, particularly in its early phases, and represented a reaction against 19th-century symbolic content. It is essential for the understanding of modern architecture that the expression of technique be seen as an art—a creative interpretation that heightens awareness of the nature of architecture.",
  "In the sphere of function and technique, architects are responsible to the patterns of their culture on one hand and to the patterns of technology on the other, but, in the expression of form, they are free to communicate their own personalities and concepts. Not every architect has the gift to exercise this prerogative to the fullest. As in other arts and sciences, a few individuals generate new styles and others follow, interpreting these styles in original and personal ways. But the majority accept styles as given and perpetuate them without leaving a mark. The architect’s principal responsibility in the formation of style is to create meaningful form. When form is spoken of in the arts, not only the physical shape, size, and mass of a work are meant but also all the elements that contribute to the work’s aesthetic structure and composition. Many of these may be without a fixed form of their own—a rest in music, a line in painting, a space in architecture—and gain significance only as they are organized into the finished product. The basic formal elements of architecture in this sense are space and mass. The process of organizing these elements into an ordered form is called composition, and the principal means by which they are given expressive quality are scale, light, texture, and colour.",
  "Space, that immaterial essence that the painter suggests and the sculptor fills, the architect envelops, creating a wholly human and finite environment within the infinite environment of nature. The concept that space can have a quality other than emptiness is difficult to grasp. When a building is entered, floor, supports, walls, and a ceiling are seen, all of which can be studied and perhaps enjoyed, while the space, in the sense that one is accustomed to think of it, is void: the absence of mass, filled by air.",
  "  But spatial experiences that express something are common to everyone, though they are not always consciously grasped. One feels insecure in a low cave or a narrow defile, exhilarated and powerful on a hilltop; these are psychological and motor reactions that result from measuring one’s potential for movement against the surrounding spaces, and the same reactions take root even in language (“confining” circumstances and “elevating” experiences are spoken of). An infinite variety of such reactions may be summoned by the architect, because the architect controls the limits above, below, and on all sides of the observer. People entering the architect’s space measure it in terms of the degree and the quality of their potential for movement. The concept of potentiality is important, first, because observers can anticipate where they may move merely looking about and, second, because they can conceive movements that they cannot execute. Thus, in the nave of a Gothic cathedral, the high walls closely confining the observers on two sides restrict their possible movements, suggesting advance along the free space of the nave toward the altar, or their compression forces the observers to look upward to the vaults and the light far overhead, there to feel a sense of physical release, though they are earthbound. The experience of Gothic space is called uplifting because it urges one to rise.",
  "Renaissance space, on the other hand, attempts to balance its suggestion of movement, to draw observers to a focal point at which they can sense an equilibrium of movement in all directions, a resolution of the conflict of compression and release. At this point one feels physically at rest, at the opposite extreme from the elevating sensation of the cathedral.",
  "Of course, one does not use the eyes alone to feel spatial quality, because only the simplest spaces—a cubic room, for example—can be wholly experienced from one standpoint. In a complex of spaces, such as that of the cathedral, the observer walks about, gaining new sensations, seeing new potentials for movement at every step. Most modern architecture, in its free organization of space sequences, demands mobility; its techniques have made it possible to remove the heavy walls and supports of the past, reducing the sense of compression. Walls become membranes to be arranged at will for spatial experience, and some are transparent and so extend one’s potential for movement into the limitless out-of-doors.",
  "  Spatial experience is not restricted to the interiors of buildings. The sensations one has in nature’s open spaces may be re-created by art. City squares and streets, even gardens, achieve a variety of expression comparable with that of interiors. The Baroque  piazza of St. Peter’s in Rome, which directs the observer along its great embracing arcs toward the entrance, is at least as moving as the church interior.",
  "The exterior of a single building, particularly one that is isolated from other architecture, does not create a space. It occupies the space of nature. Thus, it may be experienced as sculpture , in terms of the play of masses in a void. The aesthetics of masses, like that of spaces, is rooted in one’s psychology. When a tall tree or a mountain is called majestic and a rocky cliff menacing, human attributes are being projected. People inevitably humanize inert matter and so give the architect the opportunity to arouse predictable patterns of experience.",
  "The appreciation of mass, like that of space, depends on movement, but this movement must be physical. It cannot be experienced in anticipation, because, no matter where one stands to observe even the simplest building, part of it is out of sight. The mass of a complex building is differently composed from every point of view. The 20th-century art critic Sigfried Giedion, emphasizing the need for movement in experiencing modern architecture, suggested that architecture may be four-dimensional, since time (for movement) is as meaningful as the spatial dimensions.",
  "  Some architecture depends much more on mass expression than on space expression. The Egyptian pyramid , the Indian stupa , and the dagoba of Sri Lanka have no meaningful interior spaces; they are architectural in function and technique, sculptural in expression. The interior of a Greek temple is of little interest compared with the wonderful play of forms on its colonnaded exterior, while early Christian and Byzantine architecture reverse the emphasis, making the simple exterior a shell for a splendid and mystical space. Gothic architecture balances the two, partly in order to express a dual content: earthly power over the world outside, spiritual power inside. Modern techniques permit a reduction of the contrast between space and mass expressions by reducing the mass of walls and the size and number of supports and by allowing the interpenetration of interior and exterior space.",
  "Space and mass are the raw materials of architectural form; from them the architect creates an ordered expression through the process of composition. Composition is the organization of the whole out of its parts—the conception of single elements, the interrelating of these elements, and the relating of them to the total form.",
  "The simplest architectural element is a plane, the flat, two-dimensional surface that limits masses and spaces. The simplest plane is a rectangular one without openings or decoration—the wall of a room, for example. This wall is given quality solely by the proportion of its width to its height. Now a door is put into the wall; the door itself has a certain proportion, and a third element is injected, the relation of two proportions. A window is added, and the composition becomes more complex; then a row of windows, and sequence becomes a factor in addition to the elements of proportion and relation. Sequence again involves the concept of motion; the row of windows is said “to run along” the facade or is “rhythmically” designed.",
  "Finally, this wall may gain rich subtleties of composition within its proportions and rhythms. It can be modelled—into a complex of planes or irregular or curved surfaces—to provide the dimension of depth to its proportions, or symbols of use or of technique can become part of its expressive form.",
  "No architectural planes stand alone, of course; they always intersect other planes. The room wall meets two other walls, the floor, and the ceiling, and a facade wall meets the ground, the roof, and two other walls. So the total composition of a wall must be harmonized with the composition of other planes in a three-dimensional whole.",
  "The means of achieving this harmony differ in every style. Greek architects developed a system of proportions based on the lower diameter of the temple column , from which spatial intervals and the measurement of masses were derived by multiplication and division. Medieval architects first used arithmetical modules based on the measurements of areas in the cathedral plan and, in the Gothic period, changed to a geometric system that employed chiefly the equilateral triangle and the square, figures that had symbolic and mystical values. In Renaissance theory, proportions and harmonies were developed from systems of musical composition, since architects believed that relationships in all the arts depended on an all-pervading celestial harmony. Several modular and proportional systems have been evolved by modern architects (e.g., Le Corbusier ’s “Modulor”), but none has been widely adopted.",
  "Behind these changing theoretical methods, however, there seems to be a constant human reaction to spatial relationships that distinguishes harmony from cacophony, that makes one bored with a perfectly cubic room or prefer certain rectangular forms to others. This psychological response to form probably is connected to one’s mechanisms of balance, movements, and stature—in short, to one’s own composition—but the scientific analysis of the process is still at an early stage of development.",
  "  Some buildings have only a single, simple interior space (the Pantheon in Rome) or exterior mass (the pyramids of Egypt) and are not less expressive on this account. But composition carries on into a richer dimension as soon as two or more spaces or masses are organized into the whole. Such a complex composition must give a coordinated form to connecting spaces and masses, each of them in itself a unique harmony. The observer must be made to feel, in moving through the spaces and around the masses, not only that each is related to the one that precedes and follows it but that each one is contributing to a concept of the whole: a form that is greater than the sum of its parts. In the Gothic  cathedral , the nave , the aisles alongside it, the transept that crosses it toward one end, the choir, and apse beyond may each be experienced separately for its own quality. But the experience gains its full meaning only when the form of the total expression is realized: the low aisles giving grandeur to the high nave, the three together leading to the confluence of the two transept arms at the crossing in a vast climax that prepares for the resolution or finale at the altar . In the same way, the significance of a total mass composition unfolds as one moves about its separate parts. At St. Peter’s in Rome, the three projecting apses are gathered into a unity by the undulating walls; they prepare for the cylindrical drum, the drum for the dome, the form of which leads to the culminating lantern , which is harmonized with the drum. Toward the facade, two little domes frame and prophesy the great one, as the cathedral aisles do the nave. While these particular examples from the past illustrate symmetrical compositions with a climax, other buildings that are of equal quality might be chosen to show irregular unity that is no less expressive (e.g., the Erechtheum in Athens; the abbey of Mont-Saint-Michel in France).",
  "In modern architecture, as in modern painting, Renaissance laws of composition, which emphasized the symmetry and balance of semi-independent units, have been supplanted by principles that imply the continuity of the whole and remove distinctions between parts. The biological term organic is sometimes used to describe a process of composition that seeks to develop interdependent spaces and masses that function expressively as members of an organism.",
  "If composition were merely a matter of organizing a certain number of relationships, the process would be mechanical, not creative, and all architecture would be equally good or, more likely, bad. The purpose of composition is to express particular concepts and experiences, and it is successful only when these are fully communicated to the observer.",
  "When the proportions of architectural composition are applied to a particular building, the two-termed relationship of the parts to the whole must be harmonized with a third term—the observer, who not only sees the proportions of a door and their relationship to those of a wall (as would be seen in a drawing of the building) but measures them against his or her own dimensions. This three-termed relationship is called scale.",
  "A well-scaled building such as a Greek temple will serve for illustration. If it were to be magnified to the size of St. Peter’s in Rome, with its proportions remaining unchanged in their own relationships, the temple would be out of scale, and the result would appear monstrous. If the columns were to be doubled in width while the temple remained the same size, they would be out of scale and out of proportion with the whole. The proportions of the temple are satisfactory as they are because they are based on certain aesthetic principles established by the Greeks, principles that are partly rooted in human psychological makeup and partly accepted by custom (e.g., as are musical consonances). It is difficult to understand, however, why the scale of these temples is so successful within a certain range of size, for neither the ancient Greeks nor anyone else established laws to relate scale to size. They found their solution by experiment and subjective judgment.",
  "It may be that the success of scale depends upon the ability to comprehend proportions in relation to some unit or module that is roughly human-sized and close enough to the persons in a building to permit them to measure it against themselves. The Greeks, in employing the base of the column as a module for all the proportions of a temple, found a unit of a size that can be grasped easily and one that is close to eye level as a person approaches the temple. This module is a key to relationships among elements too far away to measure. This can be done in much larger buildings, too, where the elements close to the observer are too massive to be measured easily. Roman and Renaissance architecture retained the ancient Greek orders as decoration partly for this reason, using them to break up huge masses into more comprehensible parts. In entirely different styles of architecture, such as the Gothic, where the expressive function requires immeasurable proportions, there is still a measurable module given in the base of the pier. But piers and columns are not always a source of the module. In masonry construction, the single block can serve the same purpose. In frame construction, the bay (distance between floors or columns) or doors and windows may make a better key. The most successful modern skyscrapers retain a comprehensible scale, in spite of their size, by the repetition of some such module, and this is one reason why the skeleton is so often expressed on the exterior even when it is hidden behind walls.",
  "Light is a necessity for sight and, in architecture, a utility. But light is also a powerful, though ephemeral, vehicle of expression. Because it moves, changes character, and comes and goes with its source, light has the power to give to the inert mass of architecture the living quality of nature. The architect does not quite control it but can predict its behaviour well enough to catch its movements meaningfully. Architects channel it through openings into their spaces and mold it on the surfaces of their masses by changes of plane, making it enliven their forms by contrast with shadow.",
  "The sunlight that falls on the exteriors of buildings cannot be directed or changed in quality, but it can be reflected or absorbed in a wide range of modulation by the relief and texture of surfaces. The planes and decoration of a facade, therefore, are not just the lines the architect makes on working drawings but are receptacles of light and shadow that change in character, even in form, as the Earth moves about the Sun.",
  "Because of this link between nature and art, an important part in the formation of local architectural styles is played by the variation in the quality and intensity of light in different climatic regions.",
  "Architects control interior light better than exterior light, since they can select the position, size, and shape of its source. With glass and other transparent materials, they transform even its colour and intensity and so give light a meaning independent of that which it imparts to the structure. One realizes this most powerfully in the Gothic  cathedral , where the stained-glass windows transform the rays of the sun into a mystical diffusion that descends from above like a supernatural vision.",
  "  Furthermore, light may be illusory, dissolving rather than clarifying form. When it comes out of darkness in great intensity it seems to spread outward from its architectural channel. This illusion may be employed to express meanings, as at the Hagia Sophia in Istanbul, where the light from the base of the dome hides the supports, giving the impression that the canopy floats on air.",
  "Texture plays a dual role in architecture: it expresses something of the quality of materials, and it gives a particular quality to light. Although one absorbs both qualities simultaneously by eye, the first has tactile, the second visual associations.",
  "Specific tactile textures are peculiar to every material by virtue of its manufacture or natural composition, but they may be altered to produce a variety of expressive qualities. Any stone may be used in its natural, irregular state, or it may be chiselled in a rough or smooth texture or highly polished to convey a range of meanings from vigour to refinement.",
  "Visual textures are produced by the patterns given to the lighting of the surface both through the way the materials are worked (e.g., vertical or horizontal chiselling of stone) and through the way they are employed in building (e.g., vertical or horizontal boarding, projection and recession of courses of brick). Like all patterns, visual textures create associations of movement, giving rhythm to the surface.",
  "A single texture is rarely employed in building. The variety of materials and treatments typically produces a complex of textures that must be composed and harmonized like the forms and spaces of architecture into a consistent expressive whole.",
  "  Since colour is a characteristic of all building materials, it is a constant feature of architecture. But building materials are selected primarily for their structural value, and their colours are not always suited to expressive requirements; thus, other materials chosen for their colour are frequently added to the surface. These include pigments, which usually preserve the texture of the original surface, and veneers of stone, wood, and a variety of manufactured products that entirely alter the surface character.",
  "But colour, regardless of how it is produced, is the most impermanent element in architecture. It changes with the weathering and staining of materials (the white Gothic cathedrals are now deep gray), or, if it is superficial, it can easily be altered or removed (as the coloured stucco veneers of ancient Greek temples or the bright marble facing on Roman brickwork).",
  "The values that are associated with colour (yellow and red, for instance, are called “gay,” black and deep blue “sombre”) are independent of materials and forms, and they give architects a range of expression not provided by other means at their disposal. A different expressive device is provided by the great range of light reflection in the colour scale. Colours that reflect light brilliantly appear to advance toward the viewer, and those that absorb light appear to recede; the degree of projection and recession of architectural forms may be altered, emphasized, or subdued by the colours of their surfaces.",
  "Architecture, unlike most of the other arts, is not often conceived independently of particular surroundings. The problems of design extend beyond the organizing of space and mass complexes to include the relating of the total form to its natural and architectural environment.",
  "In site planning, a primary function of architectural design, the architect aims to create harmonies with preexisting elements in the landscape and “townscape.”",
  "But the province of the architect is not limited to the conception of single structures in harmony with a given setting. Throughout history, architects have been employed in giving a new form to the environment itself: planning the natural surroundings by the design of parks, roadways, waterways, etc.; designing complexes of related buildings; and organizing the urban environment into areas of residence, recreation, assembly, commerce, etc., both to increase their utility and to give them unique expressive qualities through the interrelationship of groups of buildings to the open areas about them.",
  "Although it would be difficult to cover in any single definition all conceptions, past and present, of what constitutes ornament in architecture, three basic and fairly distinct categories may be recognized: mimetic, or imitative, ornament, the forms of which have certain definite meanings or symbolic significance; applied ornament, intended to add beauty to a structure but extrinsic to it; and organic ornament, inherent in the building’s function or materials.",
  "  Although it is still found today, mimetic ornament is by far the commonest type of architectural ornament in Asian civilizations and generally throughout antiquity. It grows out of what seems to be a universal human reaction to technological change: the tendency to reproduce in new materials and techniques shapes and qualities familiar from past usage, regardless of appropriateness. This tendency may be called the principle of mimesis. Most common building types in antiquity, both East and West (e.g., tombs , pyramids , temples , towers ), began as imitations of primeval house and shrine forms. An obvious example is the dome , which developed as a permanent wooden or stone reproduction of a revered form originally built of pliable materials. In the mature stages of early civilizations, building types tended to evolve beyond early prototypes; their ornament, however, usually remained based on such models. Decorative motifs derived from earlier structural and symbolic forms are innumerable and universal. In Indian and Chinese architecture, domical and other originally structural forms occur often and lavishly as ornament. In ancient Egypt , architectural details continued to preserve faithfully the appearance of bundled papyrus shafts and similar early building forms. In ancient Mesopotamia , brick walls long imitated the effect of early mud-and-reed construction. In the carved-stone details of the Greco-Roman orders (e.g., capitals , entablatures , moldings ), the precedent of archaic construction in wood was always clearly discernible.",
  "The prevalence of mimetic ornament in architecture may be explained in two ways. Some is religious in origin. Certain forms and shapes, through long association with religious rites, became sacred and were preserved and reproduced for their symbolic value. These forms continued to be understood even though they were often stylized into abstract or geometric patterns, unrecognizably removed from their naturalistic models. Much mimetic ornament, however, even in early times, can be ascribed simply to inertia or conservatism. People have generally tended to resist change; they find it reassuring to be surrounded by known and familiar forms. Reproducing them as ornament on newly introduced forms is a common reaction to the vague feeling of uneasiness that rapid social and technological change induces; it provides a satisfying sense of continuity between the past and the present. This resistance was a factor in the 19th- and early 20th-century practice of disguising new techniques of construction in metal and glass by an overload of ornament imitating earlier styles.",
  "Architectural ornament in the 19th century exemplified the common tendency for mimetic ornament, in all times and places, to turn into mere applied decoration, lacking either symbolic meaning or reference to the structure on which it is placed. By the 5th century bce in Greece, the details of the orders had largely lost whatever conscious symbolic or structural significance they may have had; they became simply decorative elements extrinsic to the structure. The Doric frieze is a good case: its origin (i.e., an imitation of the effect of alternating beam ends and shuttered openings in archaic wood construction) remained evident, but it came to be treated as a decorative sheath without reference to the actual structural forms behind. In losing their mimetic character, the details of the Greek orders acquired a new function; they served to articulate or unify the building visually, organizing it into a series of coordinated visual units that could be comprehended as an integrated whole, rather than as a collection of isolated units. This concept of applied decoration was passed on through the Greco-Roman period. The triumphal arch of Rome, with its system of decorative columns and entablature articulating what is essentially one massive shape, is a particularly good illustration; the Colosseum is another. Most of the great architecture of the Renaissance and Baroque periods depends on it; to a large extent, the difference between these styles is the difference in decoration. The characteristic serenity and balance of Filippo Brunelleschi’s architecture in the 15th century, for example, is very largely effected by his treatment of pilasters (rectangular ornamental columns with bases and capitals) and entablatures applied to them, whereas, in 16th-century wall-surface designs such as Michelangelo ’s Medici chapel or the dome of St. Peter’s , the same elements are used in different combinations to create a quite opposite effect of tension and release.",
  "Judicious and intelligent use of applied ornament remained characteristic of most Western architecture until the 19th century, when the rationale of applied ornament frequently broke down, and an often indiscriminate and inappropriate use of decoration became characteristic. The reasons for this development are complex. In part it was a reaction to an overly rapid pace of social change during the period; partly, also, it was a logical outgrowth of the increasingly lavish decoration of late Baroque and Rococo architecture in the 18th century. Also, there was an overemphasis on the purely literary and associative values attached to the ornament characteristic of historical architectural styles. But compounding all these factors was the development of machinery, such as multiple lathes and jigs , which provided builders with cheap prefabricated ornament to give their often shoddy and ill-proportioned structures an illusion of elegance. Architectural ornament and architectural forms proper tended to part company and to be designed quite independently of each other.",
  "By the early 20th century a preoccupation with the proper function of architectural ornament was characteristic of many architectural thinkers, and by the mid-20th century a concept of architectural ornament had been formulated that has been called organic ornament. This concept, however, is by no means peculiar to the 20th century. Its essential principle is that ornament in architecture should derive directly from and be a function of the nature of the building and the materials used. This principle is characteristic of both Christian and Islamic religious architecture of the medieval period. In the architectural ornament of Muslim India or Persia, as in early Christian and Byzantine work, there is a strong mimetic element. The proscription of representational forms in the Qurʾān and the tendency of both Muslim and early Christian artists to borrow and adapt their formal vocabulary from preceding cultures led inevitably to their transforming what had been meaningful forms into systems of abstract ornament. But basically this ornament was neither mimetic nor applied. Throughout the Middle Ages, church buildings were conceived primarily as tangible symbols of heaven. Their architectural ornament, no matter how various or lavish, was consistently designed to promote this symbolism; whether by gilt, intricacy, or multiplicity, it all contributed to an overall effect of glory and so was integral to the architectural form.",
  "Twentieth-century concepts of the function of architectural ornament, generally speaking, began with an understanding of this medieval usage that grew out of the 19th-century writings of the English art critic John Ruskin and the French Gothic Revival architect Eugène-Emmanuel Viollet-le-Duc , as well as through the interpretations and applications of the British designer William Morris. The immediate influence of these men proved rather unfortunate. The first result of Viollet-le-Duc’s disciplined and scholarly investigations into the principles of medieval architecture was a school of slick archaeological architects, capable of decorating all manner of collegiate, civic, and domestic buildings with frigidly correct reproductions of the details of medieval cathedrals and châteaus . Out of Ruskin’s demonstration of the origins of medieval decoration in natural forms there grew the so-called Art Nouveau movement toward exaggerated floral and curvilinear ornament, and out of Morris’s insistence on handicrafts, inspired by infatuation with the medieval guild system, developed the Arts and Crafts movement .",
  "As early as the 1870s the U.S. architect H.H. Richardson adopted the Romanesque style, less for its historical associations than for the opportunities it afforded him to express the nature and texture of stone. In mature examples of his architecture from the mid-1880s, ornament in the older, applied sense had virtually disappeared, and his buildings depend for their aesthetic effect mainly on the inherent qualities of their materials. The generation following Richardson saw a further international development of this principle.",
  "In Great Britain Sir Edwin Lutyens and Charles Rennie Mackintosh , in the Netherlands Hendrik Petrus Berlage , and in the United States Louis Sullivan were among many architects who contributed to the new ornamental expression. It was largely based on intrinsic texture and pattern but with interspersed bands and patches of naturalistic ornament, applied with studied discipline. With the general reaction against 19th-century eclectic principles of ornamentation after World War I, however, leading designers rejected even this kind of applied ornament and relied for ornamental effect on building materials alone. The so-called International Style , in which the German architect Walter Gropius and the Swiss-French architect Le Corbusier were the chief figures, dominated advanced design during the late 1920s and 1930s. The barrenness that resulted from their reliance on such materials as concrete and glass, however, along with other factors, resulted in a reaction in the 1940s in favour of the neglected precedent set by the U.S. architect Frank Lloyd Wright in his early 20th-century work, which emphasized more visually interesting materials, intricate textural patterns, and natural settings as the proper basis of architectural ornament. This trend continued in later decades; the style known as the New Brutalism was related to it.",
  "The term theory of architecture was originally simply the accepted translation of the Latin term ratiocinatio as used by Vitruvius , a Roman architect-engineer of the 1st century ce , to differentiate intellectual from practical knowledge in architectural education, but it has come to signify the total basis for judging the merits of buildings or building projects. Such reasoned judgments are an essential part of the architectural creative process. A building can be designed only by a continuous creative, intellectual dialectic between imagination and reason in the mind of each creator.",
  "A variety of interpretations has been given to the term architectural theory by those who have written or spoken on the topic in the past. Before 1750 every comprehensive treatise or published lecture course on architecture could appropriately be described as a textbook on architectural theory. But, after the changes associated with the Industrial Revolution , the amount of architectural knowledge that could be acquired only by academic study increased to the point where a complete synthesis became virtually impossible in a single volume.",
  "The historical evolution of architectural theory is assessable mainly from manuscripts and published treatises, from critical essays and commentaries, and from the surviving buildings of every epoch. It is thus in no way a type of historical study that can reflect accurately the spirit of each age and in this respect is similar to the history of philosophy itself. Some architectural treatises were intended to publicize novel concepts rather than to state widely accepted ideals. The most idiosyncratic theories could (and often did) exert wide and sometimes beneficial influence, but the value of these influences is not necessarily related to the extent of this acceptance.",
  "The analysis of surviving buildings provides guidance that requires great caution, since, apart from the impossibility of determining whether or not any particular group of buildings (intact or in ruins) constitutes a reliable sample of the era, any such analyses will usually depend on preliminary evaluations of merit and will be useless unless the extent to which the function, the structure, and the detailing envisaged by the original builders can be correctly re-established. Many erudite studies of antique theories are misleading because they rest on the assumption that the original character and appearance of fragmentary ancient Greek and Hellenistic architectural environments can be adequately deduced from verbal or graphic “reconstructions.” Even when buildings constructed before 1500 remain intact, the many textbooks dealing with antique and medieval theories of architecture seldom make qualitative distinctions and generally imply that all surviving antique and medieval buildings were good, if not absolutely perfect.",
  "Nevertheless, the study of the history of architectural philosophy, like that of the history of general philosophy, not only teaches what past generations thought but can help individuals decide how they themselves should act and judge. For those desirous of establishing a viable theory of architecture for their own era, it is generally agreed that great stimulus can be found in studying historical evidence and in speculating on the ideals and achievements of those who created this evidence.",
  "The distinction between the history and theory of architecture did not emerge until the mid-18th century. Indeed, the establishment of two separate academic disciplines was not even nominal until 1818, when separate professorships with these titles were established at the École des Beaux-Arts in Paris. Even then, however, the distinction was seldom scrupulously maintained by either specialist. It is impossible to discuss meaningfully the buildings of the immediate past without discussing the ideals of those who built them, just as it is impossible to discuss the ideals of bygone architects without reference to the structures they designed. Nevertheless, since any two disciplines that are inseparably complementary can at the same time be logically distinguishable, it may be asserted that this particular distinction first became manifest in Les Ruines des plus beaux monuments de la Grèce (“The Ruins of the Most Beautiful Monuments of Greece”), written in 1758 by a French architecture student, Julien-David LeRoy. Faced with the problem of discussing Athenian buildings constructed in the time of Vitruvius, he decided to discuss them twice, by treating them separately under two different headings. Before this date, “history” was of architectural importance only as a means of justifying, by reference to classical mythology, the use of certain otherwise irrational elements, such as caryatids . Even Jacques-François Blondel, who in 1750 was probably the first architectural teacher to devote a separate section of his lecture courses to “history,” envisaged the subject mainly as an account of the literary references to architecture found in antique manuscripts—an attitude already developed by the 15th-century Renaissance architect Leon Battista Alberti .",
  "The modern concept of architectural history was in fact simply part of a larger trend stimulated by the leading writers of the French Enlightenment , an 18th-century intellectual movement that developed from interrelated conceptions of reason, nature, and humans. As a result of discussing constitutional law in terms of its evolution, every branch of knowledge (especially the natural and social sciences) was eventually seen as a historical sequence. In the philosophy of architecture, as in all other kinds of philosophy, the introduction of the historical method not only facilitated the teaching of these subjects but also militated against the elaboration of theoretical speculation. Just as those charged with the responsibility of lecturing on ethics found it very much easier to lecture on the history of ethics, rather than to discuss how a person should or should not act in specific contemporary circumstances, so those who lectured on architectural theory found it easier to recite detailed accounts of what had been done in the past, rather than to recommend practical methods of dealing with current problems.",
  "Moreover, the system of the Paris École des Beaux-Arts (which provided virtually the only organized system of architectural education at the beginning of the 19th century) was radically different from that of the prerevolutionary Académie Royale d’Architecture. Quatremère de Quincy, an Italophile archaeologist who had been trained as a sculptor, united the school of architecture with that of painting and sculpture to form a single organization, so that, although architectural students were ultimately given their own professor of theory, the whole theoretical background of their studies was assimilated to the other two fine arts by lecture courses and textbooks such as Hippolyte Taine ’s Philosophie de l’art , Charles Blanc’s Grammaire des arts du dessin , and Eugène Guillaume’s Essais sur la théorie du dessin .",
  "Similarly, whereas before 1750 the uniformity of doctrine (the basic premises of which were ostensibly unchanged since the Renaissance ) allowed the professor of architecture to discuss antique and 16th-century buildings as examples of architectural theory and to ignore medieval buildings completely, the mid-19th-century controversy between “medievalists” and “classicists” (the “Battle of the Styles”) and the ensuing faith in Eclecticism turned the studies of architectural history into courses on archaeology.",
  "Thus, the attitudes of those scholars who, during the 19th and early 20th centuries, wished to expound a theory of architecture that was neither a philosophy of art nor a history of architecture tended to become highly personal, if not idiosyncratic. By 1950 most theoretical writings concentrated almost exclusively on visual aspects of architecture, thereby identifying the theory of architecture with what, before 1750, would have been regarded as simply that aspect that Vitruvius called venustas (i.e., “beauty”). This approach did not necessarily invalidate the conclusions reached, but many valuable ideas then put forward as theories of architecture were only partial theories, in which it was taken for granted that theoretical concepts concerning construction and planning were dealt with in other texts.",
  "Before embarking on any discussion as to the nature of the philosophy of architecture, it is essential to distinguish between two mutually exclusive theories that affect the whole course of any such speculation. The first theory regards the philosophy of architecture as the application of a general philosophy of art to a particular type of art. The second, on the contrary, regards the philosophy of architecture as a separate study that, though it may well have many characteristics common to the theories of other arts, is generically distinct.",
  "The first notion (i.e., that there exists a generic theory of art of which the theory of architecture is a specific extension) has been widely held since the mid-16th century, when the artist and writer Giorgio Vasari published in his Le vite de’ più eccellenti pittori, scultori ed architettori italiani… ( The Lives of the Most Eminent Italian Painters, Sculptors and Architects… ) his assertion that painting , sculpture , and architecture are all of common ancestry in that all depend on the ability to draw. This idea became particularly prevalent among English-speaking theorists, since the word design is used to translate both disegno (“a drawing”) and concetto (“a mental plan”). But its main influence on Western thought was due to Italophile Frenchmen, after Louis XIV had been induced to establish in Rome a French Academy modelled on Italian art academies.",
  "As a result of the widespread influence of French culture in the 17th and 18th centuries, the concept of the beaux arts (literally “beautiful arts” but usually translated into English as “fine arts”) was accepted by Anglo-Saxon theorists as denoting a philosophical entity, to the point where it was generally forgotten that in France itself the architectural profession remained totally aloof from the Académie Royale de Peinture et de Sculpture until they were forced to amalgamate after the French Revolution .",
  "This theory of fine art might not have been so widely adopted but for the development of aesthetics , elaborated after 1750. Thus, when academies of fine art were being established successively in Denmark, Russia, and England on the model of the French Academy in Rome, German philosophers were gradually asserting (1) that it was possible to elaborate a theory of beauty without reference to function ( Zweck ); (2) that any theory of beauty should be applicable to all sensory perceptions, whether visual or auditory; and (3) that the notion of beauty was only one aspect of a much larger concept of life-enhancing sensory stimuli.",
  "The alternative theory (i.e., that a philosophy of architecture is unique and can therefore be evolved only by specific reference to the art of building) will be dealt with below with reference to the traditional triad usually cited in the formula coined, by the English theorist Sir Henry Wotton , in his book The Elements of Architecture , namely “commodity, firmness, and delight.”",
  "Generally speaking, writers on aesthetics have been noticeably reluctant to use architectural examples in support of speculations as to the nature of their general theories, but references to buildings have been used in most “philosophies of art” ever since the German philosophers Immanuel Kant and G.W.F. Hegel first popularized the philosophical discipline. Kant, in his Kritik der Urteilskraft (1790; Critique of Judgment , 1951), distinguished between what he termed free beauty ( pulchritudo vaga ) and dependent beauty ( pulchritudo adhaerens ). He classified architecture as dependent beauty, saying that in a thing that is possible only by means of design ( Absicht )—a building or even an animal—the regularity consisting in symmetry must express the unity of the intuition that accompanies the concept of purpose ( Zweck ), and this regularity belongs to cognition . Nevertheless, he claimed that a flower should be classified as free beauty (where the judgment of taste is “pure”) “because hardly anyone but a botanist knows what sort of thing a flower ought to be; and even he, though recognizing in the flower the reproductive organ of the plant, pays no regard to this natural purpose if he is passing judgment on the flower by taste.” What Kant’s reaction would have been to a modern plastic imitation flower is impossible to guess, but it will readily be perceived (1) why those who, in the 19th century, accepted the notion that beauty in architecture is pulchritudo adhaerens felt such antipathy toward “shams,” (2) how the distinction between “pure art” and “functional art” ( Zweckkunst ) became confused, and (3) why there arose a tendency to pursue definitions of “pure beauty” or “pure art” without specifically referring to the function and structure of any particular class of beautiful or artistic objects, such as buildings.",
  "This latter tendency was reinforced when the French philosopher Victor Cousin, writing in 1835, classified the history of philosophy under three distinct headings: the true, the beautiful, and the good. The ensuing acceptance of the idea that beauty was to be studied independently of truth and goodness produced a tendency not merely to regard beauty as something added to a building (rather than conceptually inseparable from the truth and goodness of its structure and function) but to regard beauty as limited to visual and emotional qualities.",
  "In the first half of the 20th century, philosophers grew less dogmatic about aesthetics. But its influence on theories of architecture became stronger because of the popular view that sculpture was essentially nonrepresentational . Thus, although the assertion that “aesthetically, architecture is the creation of sculpture big enough to walk about inside” was meaningful in the 20th century, it would have seemed nonsensical to any architectural theorist living before 1900, when sculpture was invariably thought of either as representational or as a carved refinement of load-bearing wood or stone.",
  "The notion of functional art, most actively promoted by German writers and termed by them Zweckkunst , is most appropriately related to architectural theory under three headings, namely (1) the idea that no building is beautiful unless it properly fulfills its function, (2) the idea that if a building fulfills its function it is ipso facto beautiful, and (3) the idea that, since form relates to function, all artifacts, including buildings, are a species of industrial, or applied, art (known in German as Kunstgewerbe ).",
  "The first proposition will be dealt with later under the heading utilitas . The second proposition, though widely popularized through the publication of the French architect Jean-Nicholas-Louis Durand’s lectures delivered during the economic depression of the beginning of the 19th century, has had little influence except during similar periods of economic depression. The third proposition has, however, had a wide influence, since, unlike the second proposition, it is closely akin to (rather than antagonistic toward) the theory of aesthetics, in that it regards all the visual arts as generically related.",
  "  This last theory seems to have been popularized, if not originated, by Gottfried Semper, an architect from Dresden who, after finding political asylum in England (where he then helped to organize the Great Exhibition of 1851 ), published a book in German on arts and crafts that seems to have been influential not only in Germany but also in areas of the United States heavily populated by German-speaking immigrants, such as Chicago. Later, in 20th-century Germany, the Bauhaus (officially Hochschule für Gestaltung; Academy for Form Giving) was ostensibly intended to train students in separate creative disciplines, but its didactic method was based on the assumption—implied by the general introductory courses—that, if one could design anything, one could design everything. In the explanatory words of its founder, the architect Walter Gropius , “The approach to any kind of design—a chair, a building, a whole town or a regional plan—should be essentially identical.”",
  "The notion that architecture is the art of building was implied by Leon Battista Alberti in the first published treatise on the theory of architecture, De re aedificatoria (1485; Eng. trans. Ten Books on Architecture , 1955); although he was a layman writing for other lay scholars, he rejected, by his title, the idea that architecture was simply applied mathematics, as had been claimed by Vitruvius. The specific denotation of architecture as “the art of building,” however, seems to be a French tradition, deriving perhaps from the medieval status of master masons, as understood by the 16th-century architect Philibert Delorme . This definition occurs in most French treatises published before 1750, and, although the humanistic and antiquarian aspects of fine building were rarely questioned after the Renaissance, the distinction between “architecture” and “building” never had any appreciable significance before Renaissance ideas succumbed to the combined assault of “aesthetics” and the Gothic Revival movement.",
  "Before the 18th century it was generally accepted that the theory of architecture was concerned mainly with important private or civic buildings such as palaces , mansions, churches , and monasteries . Buildings such as these required the superior skill that only book learning could provide, and so relatively little attention was given, in theoretical writings, to simple and straightforward buildings that could be competently built in accordance with local traditions by unlettered craftsmen. But, with the expansion of the architectural profession, with the perversion of the idea that social prestige was symbolized by ornamentation , with the wider distribution of wealth, and with the growing urge toward individualism in an increasingly egalitarian society, the real distinction between these two kinds of buildings was obscured, and in its place was substituted an antithesis. Henceforth, “building” was associated with the notion of cheapness, whereas “architecture” was associated with what John Ruskin would have called “sacrifice” (but which his antagonists would have called conspicuous waste). A distinction was made between the respective attitudes of “art architects” and practical-minded civil engineers . This distinction persisted because of the different methods of training candidates for the two professions. Whereas a fledgling engineering student is seldom asked to design a whole structure (such as a bridge), architectural students begin by designing whole structures and proceed with structures of increasing size and complexity, either graphically or by means of small-scale models.",
  "It was doubtless the difference in educational methods that prompted Le Corbusier to state:",
  "The engineer, inspired by the law of economy and led by mathematical calculation, puts us in accord with the laws of the universe. He achieves harmony. The architect, by his arrangement of forms, achieves an order which is a pure creation of his spirit…it is then that we experience beauty.",
  "  Yet some 80 years previously the English critic James Fergusson had felt obliged to qualify, with a comparable distinction, his enthusiasm for the new architecture of the Crystal Palace , by observing that “it has not a sufficient amount of decoration about its parts to take it entirely out of the category of first-class engineering and to make it entirely an object of fine art.” The distinction between architecture and “mere building” was stated by Nikolaus Pevsner in the opening paragraph of his Outline of European Architecture (1942): “a bicycle shed is a building; Lincoln Cathedral is a piece of architecture…the term architecture applies only to buildings designed with a view to aesthetic appeal.” Whatever the justification for such assertions, it must nevertheless be recognized that neither of these authors suggests that aesthetic appeal or art are synonyms for superfluity. Although adjustment in proportions or refinement of profiles may increase the thickness of short-span structural members beyond the structural analytical minima, this does not necessarily imply any radical decrease in real economy but simply indicates a concept of economy that takes into account the assembly and amenity of spatial enclosures and admits that there is value in environmental harmony. It is thus as misleading to imply (as Fergusson implied) that architecture is civil engineering plus ornament as it is to imply (as Le Corbusier did) that the status of the two professions is to be distinguished by the relative superiority of beauty over harmony.",
  "It is important to insist that the theory of architecture is concerned primarily with the attainment of certain environmental ideals rather than with their cost; for these two problems are philosophically distinct, as is clear if one considers such a concept as, for example, that of standardization. The financial saving made by standardizing rolled-steel sections or by casting concrete in reusable formwork is so obvious that it requires no elaboration with respect to Vitruvius’s demand for oeconomia . But such standardization also fulfills Vitruvius’s concurrent demand for order, arrangement, eurythmy, symmetry, and propriety.",
  "The Place Vendôme in Paris is adorned with over 100 identical pilasters and half columns, all carved with the same Corinthian capitals under the supervision of a member of the Académie Royale de Peinture et de Sculpture. Whether or not the resultant uniformity was or still is both pleasing and desirable is certainly open to discussion, but it will be perceived that any argument about architectural standardization must primarily be a question of value, rather than of cost, and it is with values that architectural theory has always been predominantly concerned.",
  "It has been generally assumed that a complete theory of architecture is always concerned essentially in some way or another with these three interrelated terms, which, in Vitruvius’s Latin text, are given as firmitas , utilitas , and venustas (i.e., structural stability, appropriate spatial accommodation, and attractive appearance). Nevertheless, a number of influential theorists after 1750 sought to make modifications to this traditional triad (1) by giving its components a radically different equilibrium (such as the primacy given by the 18th-century French architect Étienne-Louis Boullée to the effects of geometric forms in light or the claim made by Jean-Nicolas-Louis Durand that the fulfillment of function was the sole essence of architectural beauty), (2) by adding ethical values (such as Ruskin’s “sacrifice” and “obedience”), or (3) by introducing new scientific concepts (such as Giedion’s “space-time”).",
  "Furthermore, it has been argued that the traditional concept of firmitas , utilitas , and venustas ceased to have any real value after 1800, when engineers began creating structures that seemed so ostentatiously to defy the stonemasons’ laws of gravity, when scientific studies were creating more and more doubts as to the economical, sociological, psychological, acoustical, thermal, or optical determinants of appropriate spatial accommodation and when beauty was “altogether in the eye of the beholder.”",
  "Clearly, one must be wary of attributing too much importance to the sequence, since a slight variation occurs in the writings of even the most traditional theorists. Vitruvius gives these terms in the sequence firmitas, utilitas, venustas , whereas both Alberti and, following him, the 16th-century Venetian architect and theorist Andrea Palladio reverse the order of the first two. Thus, Sir Henry Wotton’s sequence (which is normally used in English-language texts) does not, as so often stated, derive directly from the Latin text of Vitruvius but from the Italian text of Palladio’s I quattro libri dell’architettura (i.e., comodità, perpetuità, bellezza ). But it does seem worth noting that venustas generally comes last, implying that firmitas and utilitas are to be regarded as essential logical prerequisites of architectural beauty.",
  "On the other hand, the practical advantages, in academic treatises, of giving priority to venustas are evident. Jacques-François Blondel, in his nine-volume Cours d’architecture (1771–77; “Architecture Course”), used this sequence because he observed that considerations of “decoration” are almost entirely within the domain of the theory of architecture, whereas neither distribution ( utilitas ) nor construction ( firmitas ) can be explained properly without practical experience. The growing emphasis on aesthetics, combined with developments in psychology and the influence of art-historical methods, added weight to this argument, while the corresponding independence of scientific techniques of structural and spatial analysis led many teachers of architecture to consider utilitas and firmitas as totally separate academic disciplines. Important exceptions can be found to this generalization. At the end of the 19th century, Julien Guadet, in reaction against the creation of a chair of aesthetics at the Paris École des Beaux-Arts , considered it his duty, as professor of architectural theory, to devote his lectures to the study of architectural planning, and this method, which achieved prestige as a result of his keen mind and wide historical knowledge, was pursued by many later scholars. But Guadet’s approach became unfashionable, and since the 1960s the predominant methods of teaching architectural theory have ranged from a return to the synthesis of structural, spatial, and formal values espoused by Robert Venturi to the exploration of the architectural implications of general theories of linguistics advanced by Christian Norberg-Schulz.",
  "This Latin term for “beauty” (literally, the salient qualities possessed by the goddess Venus ) clearly implied a visual quality in architecture that would arouse the emotion of love, but it is of interest to note that one of the crucial aspects of this problem was already anticipated by Alberti in the 15th century, as is made clear by his substitution of the word amoenitas (“pleasure”) for Vitruvius’s more anthropomorphic term venustas . Alberti not only avoids the erotic implications of the term venustas but, by subdividing amoenitas into pulchritudo and ornamentum , gives far more precise indications as to the type of visual satisfaction that architecture should provide. Pulchritudo , he asserts, is derived from harmonious proportions that are comparable to those that exist in music and are the essence of the pleasure created by architecture. Ornamentum , he claims, is only an “auxiliary brightness,” the quality and extent of which will depend essentially on what is appropriate and seemly. Both pulchritudo and ornamentum were thus related to function and environment in that, ideally, they were governed by a sense of decorum, and, since the etymological roots of both decoration and decorum are the same, it will be understood why, before 1750, the term decoration had in both English and French a far less superficial architectural implication than it often does today.",
  "After the German philosopher and educator Alexander Gottlieb Baumgarten had introduced the neologism aesthetics about 1750, the visual merits of all artifacts tended to be assessed more subjectively than objectively, and, in the criticism of all those sensory stimuli that, for want of a better term, critics somewhat indiscriminately lumped together as the fine arts, the visual criteria were extended to include not only beauty but also sublimity, picturesqueness, and even ugliness. Now it is clear that, once ugliness is equated with beauty, both terms (being contradictory) become virtually meaningless. But ugliness, after the mid-19th century, was not only one of the most important themes of many popular dramas and novels. Ugliness was also often considered the most appropriate architectural expression for all sorts of virtues—especially those of manliness, sincerity, and so on.",
  "Before 1750, architects had expressed these qualities more subtly (e.g., by slight modifications of proportions or by unobtrusive ornament). In later years, when the value of proportion and ornament became highly controversial, architectural theorists tended to avoid committing themselves to any criteria that might be subsumed under the heading venustas . In the last resort, however, some concept of beauty must be essential to any theory of architecture, and, whether one considers Le Corbusier’s buildings beautiful or not, his most stabilizing contribution toward the theory of modern architecture was undoubtedly his constant reiteration of this term and his insistence on the traditional view that beauty in architecture is essentially based on harmonious proportions, mathematically conceived.",
  "In the 20th century the main obstacle to an acceptance of Alberti’s notions of pulchritudo and ornamentum resulted from the influence of nonrepresentational sculpture after 1918, whereby ornament was no longer conceived as an enrichment of proportioned structure but as an integral, all-pervading part of each building’s totality. This ideal of the fusion between good proportions and “auxiliary brightness” was expressed by Walter Gropius in The New Architecture and the Bauhaus when he wrote in 1935:",
  "Our ultimate goal, therefore, was the composite but inseparable work of art, the great building, in which the old dividing-line between monumental and decorative elements would have disappeared for ever.",
  "The idea was accepted in most schools of architecture by the mid-20th century, but one may question whether it fully justified the expectations of its protagonists, once it had been exemplified and proliferated in so many urban environments. It is by no means certain that Gropius’s concept of the fundamental interdependence of architectural proportion and architectural ornament was irrevocably established by the Bauhaus theorists or that future architectural theorists need only concentrate on such minor modifications to the concept as may be required by sociological and technological developments.",
  "The notion that a building is defective unless the spaces provided are adequate and appropriate for their intended usage would seem obvious. Yet the statement itself has been a source of controversy since the 1960s. The main reasons for the controversy are: first, whereas there are seldom exact statistical means of computing spatial adequacy or appropriateness, there are many building types or building elements for which one cannot even establish the optimum forms and dimensions with any confidence that they will be generally accepted. Second, edifices are frequently used for purposes other than those for which they were originally planned. Furthermore, there is some doubt as to whether “form follows function” or “function follows form,” since, although, in general, it can reasonably be assumed that an architect’s task is to construct specific spaces for the fulfillment of predetermined functions, there is plenty of historical evidence to suggest that many important social institutions have resulted from spaces already built. No better example could be found than the evolution of parliamentary systems. The British system, based on the concept of legislatures in which the sovereign’s government and the sovereign’s opposition confront each other, originated in the fact that the earliest parliaments met in the medieval palace chapel. The French system, created concurrently with the Greek and Roman revivals, was based on the concept of legislatures addressed by orators, and its environment was that of an antique theatre. In the former system the seating was designed in accordance with the liturgical requirements of a Christian church; in the latter, with the evolution of Greek drama. Neither had anything to do with preconceived notions regarding the most effective environment for parliamentary debate, yet both have had divergent influences on constitutional procedures, thereby deeply affecting the whole theory of government.",
  "Third, the exact significance of what is meant by “adequate appropriate spaces” becomes far more complex in buildings requiring a large number of interrelated spaces than it is in single-cell buildings. The emotional effect of transitions from spacious to constricted volumes and vice versa transcends in architectural importance the statistical evaluation of floor areas; a fact which explains the attractiveness of theories that have tacitly adopted places of worship as spatial paradigms and bolstered their arguments by historical reference to temples and churches. This bias is perceptible not only in the most influential theories enunciated before 1900 (when the prototypes were either primeval, antique, or medieval) but also in the most influential ideas promulgated by such great architectural leaders of the 20th century as Frank Lloyd Wright and Ludwig Mies van der Rohe .",
  "The idealization of monumental single-cell spaces is sometimes justified, but the difficulty of evolving theories of planning by the use of historical prototypes should be emphasized. It is in this branch of architectural theory that the influences of historicism have been most insidious, precisely because they are less obvious here than in systems of construction, of proportions, and of ornamentation. Such influences persist mainly because of art-historical indifference to the essential distinction between building types, since such distinction conflicts with the chronological sequence of particular architects’ stylistic evolution, but it is for this reason that Julien Guadet’s greatest contribution to the theory of architecture may well have been his decision to evolve a history of architecture in which all buildings were classified solely in accordance with their function.",
  "Two plausible reasons can be given for according logical primacy in the Vitruvian triad to firmitas . The first is the notion that architecture is essentially the “art of building.” The second is that, since the uses or functions of a building tend to change, the structures serving such functions may be considered as taking logical precedence over them. This idea was expressed with characteristic lapidary vigour by the 20th-century French architect Auguste Perret when he asserted that",
  "architecture is the art of organizing space; but it is by construction that it expresses itself…Functions, customs, and building regulations and fashions impose conditions which are only transitory.",
  "Some later architectural theorists have become so concerned with the rapid obsolescence of modern buildings that they have envisaged edifices that express the temporary nature of these transitory qualities and are therefore built in such a way as to enable the structures themselves to be discarded completely after a few years. On the other hand (since the economic feasibility of this technique is questionable), there are still many architects who believe in the inevitability of permanent buildings and who therefore hold views more compatible with this belief.",
  "From the time of the Renaissance to the mid-18th century—as also before the decline of the ancient Roman Empire on which the culture of this era was modelled—little concern seems to have been given to the idea that there was any virtue in manifesting the actual structural system of a building. Alberti recommended a distinctive articulation of the skeleton frame in conformity with the antique concept of trabeation, or the post-and-lintel system (and hence the independence of the “infilling” elements, such as arches or solid walling), but the more commonly accepted notion seems to have been that, provided a trabeated system was expressed externally, the relationship of this visual expression to the actual system of construction was relatively unimportant. Theoretical pronouncements on this matter depended of course on the architectural traditions of each country. In Italy (where the traditional technique of building had, even during the Middle Ages , assumed that structure was independent of appearance and where it was common to complete a building in brick before adding its marble facades) the idea that there could be any theoretical dilemma regarding the unison between these two elements was virtually inconceivable. Palladio and his generation seem to have generally accepted the idea that, in regions where masonry was scarce, the use of stuccoed, painted, or veneered brickwork, with plastered timber beams, was architecturally as “genuine” as the use of stone, provided it was all of one colour. But in the Île-de-France region around Paris, on the contrary, the medieval traditions of French masonry construction, combined with the abundance of good freestone, caused theorists from the Renaissance to the time of the French Revolution to favour a less tenuous relationship between the external appearance of a building and the system by which it was constructed. Nevertheless, it is probably fair to say that in all European countries before the end of the 18th century, as well as in their American colonies, the only problem concerned with firmitas (other than technical problems) was the problem of the relationship between “real and apparent stability,” and, when theorists pronounced on this problem, it was usually to assert that a building should not only be structurally stable but should also appear to be so.",
  "A violent assault upon this point of view was launched by the Gothic Revivalists, who in the mid-19th century contended that the breathtaking counterpoise of a cathedral’s flying buttresses was far more dramatically expressive of firmitas than the ponderous massiveness of its sturdy western towers. It was in this era that the term daring (which Ruskin had frequently used with reference to the paintings of the English Romantic artist J.M.W. Turner ) became popular as a laudatory epithet, thereby indicating an ideal of structural expression that was to be increasingly exploited when steel and reinforced concrete permitted higher buildings with fewer and more slender supports.",
  "But the most controversial issue concerning firmitas in the 19th century—which also arose through the influence of the Gothic Revival movement—concerned the extent to which a building should manifest its structural system and the materials used. The attraction of this particular interpretation of the concept of truthful architecture was probably due to the popularity of new attitudes toward experimental science and to the disrepute into which mythology had been cast by the philosophers of the Enlightenment . Presumably, truth was no less prized in the 17th or 18th centuries than in the 19th century (though shams may have been less rife), while hypocrisy was regarded with as much contempt. Moreover, although the 19th century was a period of growing realism in literature, it was also a period of growing expressiveness in painting and music. Whatever the reason for this change of attitude, the 19th century saw a general acceptance of the notion that buildings were “true” only insofar as their structural form and appearance corresponded to the structural systems and materials employed, and this dogma was developed by means of many elaborate biological and mechanical analogies.",
  "This particular doctrine had a highly beneficial influence on architectural evolution during the 20th century, since it helped to demonstrate why the radical changes in building technology rendered earlier concepts of architectural form (based on load-bearing masonry construction) theoretically untenable. While it may readily be admitted that a building can express many other things besides its function and structure, failure to express the latter in some manner, however remote, must always lead to arbitrariness. This would not only be harmful to the evolution of architectural form but would inevitably result in a somewhat cynical concept of building as “pure form”—a concept that only those who regard architecture as nothing more than large-scale packaging or abstract sculpture could accept.",
  " John Fleming , Hugh Honour , and Nikolaus Pevsner , The Penguin Dictionary of Architecture , 4th ed. (1991), is a general reference work of architectural terminology and biography. Paul Frankl , Principles of Architectural History (1968, reissued 1973; originally published in German, 1914), contains a classic analysis of architectural form, 1400–1900. Sigfried Giedion , Space, Time, and Architecture , 5th ed. (1967, reissued 1982), offers a stimulating survey and justification of modern architecture and its antecedents. Steen Eiler Rasmussen , Experiencing Architecture , 2nd ed., trans. from Danish (1962), is a beginner’s guide to architectural appreciation. Julius Schlosser , Die Kunstliteratur (1924, reprinted 1985), comprises a bibliography of theoretical writing up to 1800. Michael Raeburn (ed.), Architecture of the Western World (1980), is an excellent survey. A useful illustrated introduction to the principles of architectural design is Francis D.K. Ching , Architecture: Form, Space, and Order , 3rd ed. (2007).",
  "Architectural types and planning are addressed in Jeffrey Ellis Aronin , Climate & Architecture (1953, reprinted 1973), on the influence of physical environment on planning; Sigfried Giedion , Mechanization Takes Command (1948, reprinted 1969), on the impact of machinery on 19th- and 20th-century building; Lewis Mumford , The Culture of Cities (1938, reissued 1981), the growth of modern cities seen from a historical and humanitarian viewpoint; Jane Jacobs , The Death and Life of Great American Cities (1961, reissued 1993), a pensive critique of modern patterns of urbanization and of the modernist approach to urban architecture; and Amos Rapoport , House Form and Culture (1969), an analysis of basic domestic forms in the light of cultural anthropology.",
  "Building methods and techniques are explained in Lewis Mumford , Technics and Civilization (1934, reissued 1963), a general view of the cultural role of technology; Great Britain, Department of Scientific and Industrial Research , Principles of Modern Building , 3rd ed., 2 vol. (1959–61), a study of building techniques and materials; Charles G. Ramsey and Harold R. Sleeper , Ramsey/Sleeper Architectural Graphic Standards , 9th ed. edited by John Ray Hoke, Jr. (1994), the practicing designer’s handbook of standards and equipment; and Mario Salvadori and Robert Heller , Structure in Architecture , 3rd ed. (1986), a clear, well-illustrated explanation of structural principles.",
  "Early works include John Ruskin , The Seven Lamps of Architecture (1849, reissued 1989), an aesthetic of architecture of the Romantic era allied to ethics; Eugéne Emmanuel Viollet-le-Duc , Discourses on Architecture , 2 vol. (1889–90, reissued 1959; originally published in French, 1863–72), a premodern architectural theory based on rational construction; and Vitruvius , The Ten Books on Architecture (1914, reissued 1960), the only architectural treatise to survive from antiquity—a book that exerted great influence on Renaissance and later design. Modern studies include Christopher Alexander , Notes on the Synthesis of Form (1964, reissued 1971), design calculations for the cybernetic age; and the credos of the three most influential modern architects: Le Corbusier , Towards a New Architecture (1927, reissued 1986; originally published in French, 1923); Walter Gropius , Scope of Total Architecture (1955, reissued 1970); and Frank Lloyd Wright , Modern Architecture (1931, reprinted 1987). The following are surveys: Peter Collins , Changing Ideals in Modern Architecture, 1750–1950 (1965, reissued 1975), a survey of architectural principles; Paul Frankl , The Gothic: Literary Sources and Interpretations Through Eight Centuries (1960), the medieval style and its survivals through the centuries; Geoffrey Scott , The Architecture of Humanism , 2nd ed., rev. (1924, reissued 1980), combining a critique of 19th-century theory with a psychologically based defense of Baroque design; John Summerson , The Classical Language of Architecture (1963, reissued 1985), on the use of the classical repertoire of motives through the ages; Rudolf Wittkower , Architectural Principles in the Age of Humanism , 4th ed. (1988), discussing architectural thought in the Renaissance; and Aldo Rossi , The Architecture of the City (1982; originally published in Italian, 1966), addressing architectural and urban theory.",
  "A useful general survey of ornamental forms and designs is Joan Evans , Pattern: A Study of Ornament in Western Europe from 1180 to 1900 , 2 vol. (1931, reprinted 1976). Accounts of mimetic ornament and design may be found in E. Baldwin Smith , Egyptian Architecture as Cultural Expression (1938, reissued 1968), The Dome: A Study in the History of Ideas (1950, reissued 1978), and Architectural Symbolism of Imperial Rome and the Middle Ages (1956, reprinted 1978). A theory of ornament as social function is found in Alan Gowans , “The Unchanging Arts of Beautification: Commercial Design and Decoration,” in his The Unchanging Arts (1971). Carole Rifkind , A Field Guide to American Architecture (1980), covers styles, building types, ornamentation, and elements of construction.",
  " Leon Battista Alberti , De re aedificatoria (1485), was the first printed book on the theory of architecture; numerous English translations are available, including On the Art of Building in Ten Books (1988). Reyner Banham , Theory and Design in the First Machine Age , 2nd ed. (1980), is an authoritative study of the theories of architecture developed in the second quarter of the 20th century. Peter Collins , Architectural Judgement (1971), provides a comparative study of decision making in architecture and law. Christian Norberg-Schulz , Intentions in Architecture (1963, reissued 1977), contains an influential study of architectural theory based on linguistics. Howard Robertson , The Principles of Architectural Composition (1924), is a characteristic textbook of the early decades of the 20th century. Robert Venturi , Complexity and Contradiction in Architecture , 2nd ed. (1977), proposes a new theory of architecture based on recent art-historical interpretations of Mannerism and Baroque architecture. Edward R. De Zurko , Origins of Functionalist Theory (1957), is a compendious historical analysis of the relationship between form and function, as conceived by philosophers and architectural theorists. David Watkin , Morality and Architecture (1977, reprinted 1984), makes a spirited attack on modernist and functionalist theories. Roger Scruton , The Aesthetics of Architecture (1979), offers a philosophical exploration of the intellectual questions raised by architecture."
]