[
  "  human behaviour , the potential and expressed capacity for physical, mental, and social activity during the phases of human life.",
  "Humans, like other animal species, have a typical life course that consists of successive phases of growth, each of which is characterized by a distinct set of physical, physiological, and behavioral features. These phases are prenatal life, infancy , childhood , adolescence , and adulthood (including old age). Human development , or developmental psychology, is a field of study that attempts to describe and explain the changes in human cognitive, emotional, and behavioral capabilities and functioning over the entire life span , from the fetus to old age.",
  "Most scientific research on human development has concentrated on the period from birth through early adolescence, owing to both the rapidity and magnitude of the psychological changes observed during those phases and to the fact that they culminate in the optimum mental functioning of early adulthood. A primary motivation of many investigators in the field has been to determine how the culminating mental abilities of adulthood were reached during the preceding phases. This essay will concentrate, therefore, on human development during the first 12 years of life.",
  "This article discusses the development of human behaviour. For treatment of biological development, see  human development . For further treatment of particular facets of behavioral development, see emotion ; learning theory ; motivation ; perception ; personality ; and sexual behaviour, human . Various disorders with significant behavioral manifestations are discussed in mental disorder .",
  "The systematic study of children is less than 200 years old, and the vast majority of its research has been published since the mid-1940s. Basic philosophical differences over the fundamental nature of children and their growth occupied psychologists during much of the 20th century. The most important of such controversies concerned the relative importance of genetic endowment and environment, or “nature” and “nurture,” in determining development during infancy and childhood. Most researchers came to recognize, however, that it is the interaction of inborn biological factors with external factors, rather than the mutually exclusive action or predominance of one or the other force, that guides and influences human development. The advances in cognition , emotion , and behaviour that normally occur at certain points in the life span require both maturation (i.e., genetically driven biological changes in the central nervous system ) and events, experiences, and influences in the physical and social environment. Generally, maturation by itself cannot cause a psychological function to emerge; it does, however, permit such a function to occur and sets limits on its earliest time of appearance.",
  "Three prominent theories of human development emerged in the 20th century, each addressing different aspects of psychological growth. In retrospect, these and other theories seem to have been neither logically rigorous nor able to account for both intellectual and emotional growth within the same framework. Research in the field has thus tended to be descriptive, since developmental psychology lacks a tight net of interlocking theoretical propositions that reliably permit satisfying explanations.",
  "Early psychoanalytic theories of human behaviour were set forth most notably by Austrian neurologist Sigmund Freud . Freud’s ideas were influenced by Charles Darwin ’s theory of evolution and by the physical concept of energy as applied to the central nervous system. Freud’s most basic hypothesis was that each child is born with a source of basic psychological energy called libido . Further, each child’s libido becomes successively focused on various parts of the body (in addition to people and objects) in the course of his or her emotional development. During the first postnatal year, libido is initially focused on the mouth and its activities; nursing enables the infant to derive gratification through a pleasurable reduction of tension in the oral region. Freud called this the oral stage of development. During the second year, the source of excitation is said to shift to the anal area, and the start of toilet training leads the child to invest libido in the anal functions. Freud called this period of development the anal stage. During the period from three through six years, the child’s attention is attracted to sensations from the genitals, and Freud called this stage the phallic stage. The half dozen years before puberty are called the latency stage. During the final and so-called genital stage of development, mature gratification is sought in a heterosexual love relationship with another. Freud believed that adult emotional problems result from either deprivation or excessive gratification during the oral, anal, or phallic stages. A child with libido fixated at one of these stages would in adulthood show specific neurotic symptoms, such as anxiety .",
  "  (Read Sigmund Freud’s 1926 Britannica essay on psychoanalysis.)  ",
  "Freud devised an influential theory of personality structure. According to him, a wholly unconscious mental structure called the id contains a person’s inborn, inherited drives and instinctual forces and is closely identified with his or her basic psychological energy (libido). During infancy and childhood, the ego , which is the reality-oriented portion of the personality, develops to balance and complement the id. The ego utilizes a variety of conscious and unconscious mental processes to try to satisfy id instincts while also trying to maintain the individual comfortably in relation to the environment. Although id impulses are constantly directed toward obtaining immediate gratification of one’s major instinctual drives (sex, affection, aggression, self-preservation), the ego functions to set limits on this process. In Freud’s language, as the child grows, the reality principle gradually begins to control the pleasure principle; the child learns that the environment does not always permit immediate gratification. Child development , according to Freud, is thus primarily concerned with the emergence of the functions of the ego, which is responsible for channeling the discharge of fundamental drives and for controlling intellectual and perceptual functions in the process of negotiating realistically with the outside world.",
  "Although Freud made great contributions to psychological theory—particularly in his concept of unconscious urges and motivations—his elegant concepts cannot be verified through scientific experimentation and empirical observation. But his concentration on emotional development in early childhood influenced even those schools of thought that rejected his theories. The belief that personality is affected by both biological and psychosocial forces operating principally within the family, with the major foundations being laid early in life, continues to prove fruitful in research on infant and child development.",
  "Freud’s emphasis on biological and psychosexual motives in personality development was modified by German-born American psychoanalyst Erik Erikson to include psychosocial and social factors. Erikson viewed emotional development over the life span as a sequence of stages during which there occur important inner conflicts whose successful resolution depends on both the child and his or her environment. These conflicts can be thought of as interactions between instinctual drives and motives on the one hand and social and other external factors on the other. Erikson evolved eight stages of development, the first four of which are: (1) infancy, trust versus mistrust, (2) early childhood, autonomy versus shame and doubt, (3) preschool, initiative versus guilt, and (4) school age, industry versus inferiority. Conflicts at any one stage must be resolved if personality problems are to be avoided. (Erikson’s developmental stages during adulthood are discussed below in the section Development in adulthood and old age .)",
  "Swiss psychologist Jean Piaget took the intellectual functioning of adults as the central phenomenon to be explained and wanted to know how an adult acquired the ability to think logically and to draw valid conclusions about the world from evidence. Piaget’s theory rests on the fundamental notion that the child develops through stages until arriving at a stage of thinking that resembles that of an adult. The four stages given by Piaget are: (1) the sensorimotor stage from birth to 2 years, (2) the preoperational stage from 2 to 7 years, (3) the concrete-operational stage from 7 to 12 years, and (4) the stage of formal operations that characterizes the adolescent and the adult. One of Piaget’s fundamental assumptions is that early intellectual growth arises primarily out of the child’s interactions with objects in the environment. For example, Piaget believed that a two-year-old child who repeatedly builds and knocks down a tower of blocks is learning that the arrangement of objects in the world can be reversed. According to Piaget, children organize and adapt their experiences with objects into increasingly sophisticated cognitive models that enable them to deal with future situations in more effective ways. The older child, for instance, who has learned the concept of reversibility, will be able to execute an intelligent and logical search for a missing object, retracing steps, for example, in order to determine where he or she may have dropped a set of keys. As children pass through successive stages of cognitive development, their knowledge of the world assumes different forms, with each stage building on the models and concepts acquired in the preceding stage. Adolescents in the final developmental stage, that of formal operations, are able to think in a rational and systematic manner about hypothetical problems that are not necessarily in accord with their experience. Piaget’s theory is treated in greater detail below in the sections on cognitive development in infancy and childhood.",
  "A more distinctively American theoretical view focuses primarily on the child’s actions, rather than on his emotions or thinking. This point of view, called learning theory , is concerned with identifying those mechanisms that can be offered to explain differences in behaviour, motives, and values among children. Its major principles stress the effects of reward and punishment (administered by parents, teachers, and peers) on the child’s tendency to adopt the behaviour and values of others. Learning theory is thus directed to the overt actions of the child, rather than to inner psychological states or mechanisms.",
  " Learning is any relatively permanent change in behaviour that results from past experience. There are two generally recognized learning processes: classical and instrumental conditioning, both of which use associations, or learned relations between events or stimuli, to create or shape behavioural responses. In classical conditioning, a close temporal relation is maintained between pairs of stimuli in order to create an association between the two. If, for example, an infant hears a tone and one second later receives some sweetened water in the mouth, the infant will make sucking movements to the sweet taste. After a dozen repetitions of this sequence of the tone followed by the sweet water, the infant associates the sounding of the tone with the receipt of the sweetened water and will, on subsequent repetitions, make sucking movements to the tone even though no sugar water is delivered.",
  "Instrumental, or operant, conditioning involves creating a relationship between a response and a stimulus. If the experiment described above is changed so that after the tone is heard, the infant is required to turn his or her head to the right in order to receive the sweetened water, the infant will learn to turn the head when the tone sounds. The infant learns a relation between the response of turning the head and the subsequent receipt of the sweet taste. This set of relations is referred to as instrumental conditioning because the child must do something in order to receive the reward; the latter, in turn, makes the infant’s head-turning response more likely in future occurrences of the situation. Rewards, such as praise and approval from parents, act as positive reinforcers of specific learned behaviours, while punishments decrease the likelihood of repeating such behaviours. Scientists who believe in the importance of these principles use them to explain the changing behaviour of children over the course of development.",
  "Conception occurs when the sperm from the male penetrates the cell wall of an egg from the female. Human development during the 38 weeks from conception to birth is divided into three phases. The first, the germinal period, lasts from the moment of conception until the time the fertilized egg is implanted in the wall of the uterus, a process that typically takes 10 to 14 days. A second phase, lasting from the second to the eighth week after conception, is called the embryonic period and is characterized by differentiation of the major organs. The last phase, from the eighth week until delivery, is called the fetal period and is characterized by dramatic growth in the size of the organism.",
  "Prenatal development is extremely rapid; by the 18th day the embryo has already taken some shape and has established a longitudinal axis. By the ninth week the embryo is about 2.5 centimetres (one inch) long; face, mouth, eyes, and ears have begun to take on well-defined form, and arms, legs, hands, feet, and even fingers and toes have appeared. The sex organs, along with muscle and cartilage, also have begun to form. The internal organs have a definite shape and assume some primitive function. The fetal period (from about the second month until birth) is characterized by increased growth of the organism and by the gradual assumption of physical functions. By the 20th week the mother can often feel the movements of the fetus, which is now about 20 centimetres long. By the 32nd week the normal fetus is capable of breathing, sucking, and swallowing, and by the 36th week it can show a response to light and sound waves. The head of the fetus is unusually large in relation to other parts of its body because its brain develops more rapidly than do other organs. The seventh month is generally regarded as the earliest age at which a newborn can survive without medical assistance.",
  "By definition, infancy is the period of life between birth and the acquisition of language approximately one to two years later. The average newborn infant weighs 3.4 kilograms (7.5 pounds) and is about 51 centimetres long; in general, boys are slightly larger and heavier than girls. (The period of the newborn covers the first five to seven days, which the infant normally spends recovering from the stresses of delivery.) During their first month, infants sleep for about 16–18 hours a day, with five or six sleep periods alternating with a like number of shorter episodes of wakefulness. The total amount of time spent sleeping decreases dramatically, however, to 9–12 hours a day by age two years, and, with the cessation of nocturnal feedings and morning and afternoon naps, sleep becomes concentrated in one long nocturnal period. Newborns spend as much time in active sleep (during which rapid eye movements occur) as in quiet sleep, but by the third month they spend twice as much time in quiet as in active sleep, and this trend continues (at a much slower rate) into adulthood.",
  "At birth the infant displays a set of inherited reflexes, some of which serve his very survival. An infant only two hours old typically will follow a moving light with his eyes and will blink or close them at the sudden appearance of a bright light or at a sharp, sudden sound nearby. The newborn infant will suck a nipple or almost any other object ( e.g., a finger) inserted into his mouth or touching his lips. He will also turn his head toward a touch on the corner of his mouth or on his cheek; this reflex helps him contact the nipple so he can nurse. He will grasp a finger or other object that is placed in his palm. Reflexes that involve sucking and turning toward stimuli are intended to maintain sustenance, while those involving eye-closing or muscle withdrawal are intended to ward off danger. Some reflexes involving the limbs or digits vanish after four months of age; one example is the Babinski reflex, in which the infant bends his big toe upward and spreads his small toes when the outer edge of the sole of his foot is stroked.",
  "The newborn baby can turn his head and eyes toward and away from visual and auditory stimuli, signaling interest and alarm, respectively. Smiling during infancy changes its meaning over the first year. The smiles that newborns display during their first weeks constitute what is called reflex smiling and usually occur without reference to any external source or stimulus, including other people. By two months, however, infants smile most readily in response to the sound of human voices, and by the third or fourth month they smile easily at the sight of a human face, especially one talking to or smiling at the infant. This social smiling, as it is called, marks the beginning of the infant’s emotional responses to other people.",
  "Research shows the achievement of extraordinary perceptual sophistication over the first months of life. The fetus is already sensitive to stimulation of its skin, especially in the area around the mouth, by the eighth week of intrauterine development. Judging from their facial expressions when different substances are placed on their tongues, newborn infants apparently discriminate between bitter, salty, or sweet tastes; they have an innate preference for sweet tastes and even prefer a sucrose solution to milk. Newborns can also discriminate between different odours or smells; six-day-old infants can tell the smell of their mother’s breast from that of another mother.",
  "Much more is known, however, about infants’ ability to see and hear than about their senses of touch, smell, or taste. During the first half-year of life outside the womb, there is rapid development of visual acuity, from 20/800 vision (in Snellen notation) among two-week-olds to 20/70 vision in five-month-olds to 20/20 vision at five years. Even newborn infants are sensitive to visual stimulation and attend selectively to certain visual patterns; they will track moving stimuli with their gaze and can discriminate among lights that vary in brightness. They show a noticeable predilection for the sight of the human face, and by the first or second month they are able to discriminate between different faces by attending to the internal features—eyes, nose, and mouth. By the third month, infants can identify their mothers by sight and can discriminate between some facial expressions. By the seventh month, they can recognize a particular person from different perspectives—for example, a full face versus a profile of that face. Infants can identify the same facial expression on the faces of different people and can distinguish male from female faces.",
  "Newborns can also hear and are sensitive to the location of a sound source as well as to differences in the frequency of the sound wave. They also discriminate between louder and softer sounds, as indicated by the startle reflex and by rises in heart rate. Newborns can also discriminate among sounds of higher or lower pitch. Continuous rather than intermittent sounds and low tones rather than high-pitched ones are apparently those most soothing to infants.",
  "Even young infants show a striking sensitivity to the tones, rhythmic flow, and individual sounds that together make up human speech. A young infant can make subtle discriminations among phonemes, which are the basic sounds of language, and is able to tell the difference between “pa,” “ga,” and “ba.” Furthermore, infants less than one year old can make discriminations between phonemes that some adults cannot because the particular discrimination is not present in the adult language. A distinction between “ra” and “la” does not exist in the Japanese language, and hence Japanese adults fail to make that discrimination. Japanese infants under nine months can discriminate between these two phonemes but lose that ability after one year because the language they hear does not require that discrimination.",
  "Both movement and contrasts between dark and light tend to attract an infant’s attention. When an alert newborn is placed in a dark room, he opens his eyes and looks around for edges. If he is shown a thick black bar on a white background, his eyes dart to the bar’s contour and hover near it, rather than wander randomly across the visual field. Certain other visual qualities engage the infant’s attention more effectively than do others. The colour red is more attractive than others, for example, and objects characterized by curvilinearity and symmetry hold the infant’s attention longer than do ones with straight lines and asymmetric patterns. Sounds having the pitch and timbre of the human voice are more attractive than most others; the newborn is particularly responsive to the tones of a mother’s voice, as well as to sounds with a great deal of variety. These classes of stimuli tend to elicit the most prolonged attention during the first 8 to 10 weeks of life. During the infant’s third month a second principle, called the discrepancy principle, begins to assume precedence. According to this principle, the infant is most likely to attend to those events that are moderately different from those he has been exposed to in the past. For instance, by the third month, the infant has developed an internal representation of the faces of the people who care for him. Hence, a slightly distorted face— e.g., a mask with the eyes misplaced—will provoke more sustained attention than will a normal face or an object the infant has never seen before. This discrepancy principle operates in other sensory modalities as well.",
  "Even infants less than one year old are capable of what appears to be complex perceptual judgments. They can estimate the distance of an object from their body, for example. If an infant is shown a rattle and hears its distinctive sound and the room is then darkened, the infant will reach for the rattle if the sound indicates that the object can be grasped but will not reach if the sound indicates that it is beyond his grasp.",
  "More dramatically, infants will also reach for an object with a posture appropriate to its shape. If an infant sees a round object in the shape of a wheel and hears its distinctive sound and also sees a smaller rattle and hears its sound, he will reach in the dark with one hand in a grasping movement if he hears the sound of the rattle but will reach with both hands spread apart if he hears the sound associated with the wheel.",
  "The four-month-old infant is also capable of rapidly learning to anticipate where a particular event will occur. After less than a minute of exposure to different scenes that alternate on the right and left side of their visual field, infants will anticipate that a picture is about to appear on the right side and will move their eyes to the right before the picture actually appears. Similarly, infants only five to six months old can detect the relation between the shape of a person’s mouth and the sound that is uttered. Thus, they will look longer at a face that matches the sound they are hearing than at one where there is a mismatch between the mouth’s movements and the sound being uttered.",
  "Infants develop an avoidance reaction to the appearance of depth by the age of 8 to 10 months, when they begin to crawl. This discovery was made on the surface of an apparatus called the visual cliff. The latter is a table divided into two halves, with its entire top covered by glass. One half of the top has a checkerboard pattern lying immediately underneath the glass; the other half is transparent and reveals a sharp drop of a metre or so, at the bottom of which is the same checkerboard pattern. The infant is placed on a board on the centre of the table. The mother stands across the table and tries to tempt her baby to cross the glass on either the shallow or the deep side. Infants younger than seven months will unhesitatingly crawl to the mother across the deep side, but infants older than eight months avoid the deep side and refuse to cross it. The crying and anxiety that eight-month-olds display when confronted with the need to cross the deep side are the result of their ability to perceive depth but also, and more importantly, their ability to recognize the discrepancy of sitting on a solid surface while nevertheless seeing the visual bottom some distance below. Both nervous-system maturation and experience contribute to this particular cognitive advance.",
  "Finally, infants create perceptual categories by which to organize experience, a category being defined as a representation of the dimensions or qualities shared by a set of similar but not identical events. Infants will treat the different colours of the spectrum, for example, according to the same categories that adults recognize. Thus, they show greater attentiveness when a shade of red changes to yellow than when a light shade of red merely replaces a darker shade of the same colour. Five-month-old infants can tell the difference between the moving pattern of lights that corresponds to a person walking and a randomly moving version of the same number of lights, suggesting that they have acquired a category for the appearance of a person walking. By one year of age, infants apparently possess categories for people, edible food, household furniture, and animals. Finally, infants seem to show the capacity for cross-modal perception— i.e., they can recognize an object in one sensory modality that they have previously perceived only in another. For example, if an infant sucks a nubby pacifier without being able to see it and then is shown that pacifier alongside a smooth one, the infant’s longer look at the nubby pacifier suggests that he recognizes it, even though he previously experienced only its tactile qualities.",
  "Infants make robust advances in both recognition memory and recall memory during their first year. In recognition memory, the infant is able to recognize a particular object he has seen a short time earlier (and hence will look at a new object rather than the older one if both are present side by side). Although newborns cannot remember objects seen more than a minute or two previously, their memory improves fairly rapidly over the first four or five months of life. By one month they are capable of remembering an object they saw 24 hours earlier, and by one year they can recognize an object they saw several days earlier. Three-month-old infants can remember an instrumental response, such as kicking the foot to produce a swinging motion in a toy, that they learned two weeks earlier, but they respond more readily if their memory is strengthened by repeated performances of the action.",
  "By contrast, recall memory involves remembering (retrieving the representation, or mental image) an event or object that is not currently present. A major advance in recall memory occurs between the 8th and 12th months and underlies the child’s acquisition of what Piaget called “the idea of the permanent object.” This advance becomes apparent when an infant watches an adult hide an object under a cloth and must wait a short period of time before being allowed to reach for it. A six-month-old will not reach under the cloth for the hidden object, presumably because he has forgotten that the object was placed there. A one-year-old, however, will reach for the object even after a 30-second delay period, presumably because he is able to remember its being hidden in the first place. These improvements in recall memory arise from the maturation of circuits linking various parts of the brain together. The improvements enable the infant to relate an event in his environment to a similar event in the past. As a result, he begins to anticipate his mother’s positive reaction when the two are in close face-to-face interaction, and he behaves as if inviting her to respond. The infant may also develop new fears, such as those of objects, people, or situations with which he is unfamiliar— i.e., which he cannot relate to past experiences using recall memory.",
  "As stated previously, Piaget identified the first phase of mental development as the sensorimotor stage (birth to two years). This stage is marked by the child’s acquisition of various sensorimotor schemes, which may be defined as mental representations of motor actions that are used to obtain a goal; such actions include sucking, grasping, banging, kicking, and throwing. The sensorimotor stage, in turn, was differentiated by Piaget into six subphases, the first four of which are achieved during the initial year. During the first subphase, which lasts one month, the newborn’s automatic reflexes become more efficient. In the second subphase, the infant’s reflex movements become more coordinated, though they still consist largely of simple acts (called primary circular actions) that are repeated for their own sake ( e.g., sucking, opening and closing the fists, and fingering a blanket) and do not reflect any conscious intent or purpose on the infant’s part. During the third phase, lasting from the 4th to the 8th month, the infant begins to repeat actions that produce interesting effects; for example, he may kick his legs to produce a swinging motion in a toy. In the fourth subphase, from the 8th to the 12th month, the child begins coordinating his actions to attain an external goal; he thus begins solving simple problems, building on actions he has mastered previously. For example, he may purposely knock down a pillow to obtain a toy hidden behind it. During the fifth subphase, covering the 12th to 18th months, the child begins to invent new sensorimotor schemes in a form of trial-and-error experimentation. He may change his actions toward the same object or try out new ones to achieve a particular goal. For example, if he finds that his arm alone is not long enough, he may use a stick to retrieve a ball that rolled beneath a couch. In the final subphase of infancy, which is achieved by about the 18th month, the child starts trying to solve problems by mentally imagining certain events and outcomes rather than by simple physical trial-and-error experimentation.",
  "The child’s actions thus far have shown progressively greater intentionality, and he has developed a primitive form of representation, which Piaget defined as a kind of mental imagery that can be used to solve a problem or attain a goal for which the child has no habitual, available action. An important part of the child’s progress in his first year is his acquisition of what Piaget calls the idea of “object permanence”— i.e., the ability to treat objects as permanent entities. According to Piaget, the infant gradually learns that objects continue to exist even when they are no longer in view. Children younger than six months do not behave as if objects that are moved out of sight continue to exist; they may grab for objects they see but lose all interest once the objects are withdrawn from sight. However, infants of nine months or older do reach for objects hidden from view if they have watched them being hidden. Children aged 12 to 18 months may even search for objects that they have not themselves witnessed being hidden, indicating that they are capable of inferring those objects’ location. Show such a child a toy placed in a box, put both under a cover, and then remove the box; the child will search under the cover as though he inferred the location of the toy.",
  "The first of the two basic sounds made by infants includes all those related to crying; these are present even at birth. A second category, described as cooing, emerges at about eight weeks and includes sounds that progress to babbling and ultimately become part of meaningful speech. Almost all children make babbling sounds during infancy, and no relationship has been established between the amount of babbling during the first six months and the amount or quality of speech produced by a child at age two. Vocalization in the young infant often accompanies motor activity and usually occurs when the child appears excited by something he sees or hears. Environmental influences ordinarily do not begin to influence vocalization seriously before two months of age; in fact, during the first two months of postnatal life, the vocalizations of deaf children born to deaf parents are indistinguishable from those of infants born to hearing parents. Environmental effects on the variety and frequency of the infant’s sounds become more evident after roughly eight weeks of age. The use of meaningful words differs from simple babbling in that speech primarily helps to obtain goals, rather than simply reflecting excitement.",
  "A child’s first year is characterized by rapid growth of body and brain: healthy, well-nourished children experience an almost 200 percent increase in height between birth and one year. Every normal, healthy infant proceeds through a sequence of motor development that occurs spontaneously and requires no special training. The infant can reach for and grasp an object by about the 4th month and can grasp a small object between his thumb and forefinger by the 10th month. By 4 months of age most babies are able to sit up for a minute or so with support, and by 9 months they can do so without support for 10 minutes or more. Most babies begin crawling ( i.e., moving with one’s abdomen in contact with the floor) between 7 and 10 months and are creeping on hands and knees adequately at the end of that time. By 10 months an infant can pull himself up to a standing position by holding onto an external support ( e.g., a piece of furniture), and by 12 months he can stand up alone. He is able to walk with help by 12 months and can walk unaided by 14 months. By 18 months, with exposure to stairs, the average child can walk up and down them without help, and by his second birthday he can run, walk backward, and pick up an object from the floor without falling down.",
  "Emotions are distinct feelings or qualities of consciousness, such as joy or sadness, that reflect the personal significance of emotion-arousing events. The major types of emotions include fear, sadness, anger, surprise, excitement, guilt, shame, disgust, interest, and happiness. These emotions develop in an orderly sequence over the course of infancy and childhood.",
  "Even during the first three or four months of life, infants display behavioral reactions suggestive of emotional states. These reactions are indicated by changes in facial expression, motor activity, and heart rate and of course by smiling and crying. Infants show a quieting of motor activity and a decrease in heart rate in response to an unexpected event, a combination that implies the emotion of surprise. A second behavioral profile, expressed by increased movement, closing of the eyes, an increase in heart rate, and crying, usually arises in response to hunger or discomfort and is a distress response to physical privation. A third set of reactions includes decreased muscle tone and closing of the eyes after feeding, which may be termed relaxation. A fourth pattern, characterized by increased movement of the arms and legs, smiling, and excited babbling, occurs in response to moderately familiar events or social interaction and may be termed excitement. In the period from 4 to 10 months, new emotional states appear. The crying and resistance infants display at the withdrawal of a favourite toy or at the interruption of an interesting activity can be termed anger. One-year-old infants are capable of displaying sadness in response to the prolonged absence of a parent.",
  "Finally, infants begin displaying signs of the emotion of fear by their fourth to sixth month; a fearful response to novelty— i.e., to events that are moderately discrepant from the infant’s knowledge—can be observed as early as four months. If an infant at that age hears a voice speaking sentences but there is no face present, he may show a fearful facial expression and begin to cry. By 7 to 10 months of age, an infant may cry when approached by an unfamiliar person, a phenomenon called stranger anxiety. A month or two later the infant may cry when his mother leaves him in an unfamiliar place; this phenomenon is called separation anxiety. It is no accident that both stranger and separation anxiety first appear about the time the child becomes able to recall past events. If an infant is unable to remember that his mother had been present after she leaves the room, he will experience no feeling of unfamiliarity when she is gone. However, if he is able to recall the mother’s prior presence and cannot understand why she is no longer with him, that discrepancy can lead to anxiety. Thus, the appearance of stranger and separation anxiety are dependent on the improvement in memorial ability.",
  "These emotions in young infants may not be identical to similar emotional states that occur in older children or adolescents, who experience complex cognitions in concert with emotion; these are missing in the young infant. The older child’s anger, for example, can remain strong for a longer period of time because the child can think about the target of his anger. Thus, it may be an error to attribute to the young infant the same emotional states that one can assume are present in older children.",
  "Perhaps the central accomplishment in personality development during the first years of life is the establishment of specific and enduring emotional bonds, or attachment. The person to whom an infant becomes emotionally attached is termed the target of attachment. Targets of attachment are usually those persons who respond most consistently, predictably, and appropriately to the baby’s signals, primarily the mother but also the father and eventually others. Infants are biologically predisposed to form attachments with adults, and these attachments in turn form the basis for healthy emotional and social development throughout childhood. Infants depend on their targets of attachment not only for food, water, warmth, and relief from pain or discomfort but also for such emotional qualities as soothing and placating, play, consolation, and information about the world around them. Moreover, it is through the reciprocal interactions between child and parent that infants learn that their behaviour can affect the behaviour of others in consistent and predictable ways and that others can be counted on to respond when signaled.",
  "Infants who do not have a particular adult devoted to their care often do not become strongly attached to any one adult and are less socially responsive—less likely to smile, vocalize, laugh, or approach adults. Such behaviour has been observed in children raised in relatively impersonal institutional surroundings and is shared by monkeys reared in isolation.",
  "The social smiling of two-month-old infants invites adults to interact with them; all normal human infants show a social smile, which is, in fact, their first true sign of social responsiveness. The social smile is apparently innate in the human species. At about six months of age infants begin to respond socially to particular people who become the targets of attachment. Although all infants develop some form of attachment to their caregivers, the strength and quality of that attachment depends partly on the parents’ behaviour to the child. The sheer amount of time spent with a child counts for less than the quality of the adult-child interaction in this regard. The parents’ satisfaction of the infant’s physical needs is an important factor in their interaction, but sensitivity to the child’s needs and wishes, along with the provision of emotional warmth, supportiveness, and gentleness are equally important. Interestingly, mothers and fathers have been observed to behave differently with their infants and young children: mothers hold, comfort, and calm their babies in predictable and rhythmic ways, whereas fathers play and excite in unpredictable and less rhythmic ways.",
  "One significant difference has been detected in the quality of infants’ attachment to their caregivers—that between infants who are “securely” attached and those who are “insecurely” attached. Infants with a secure attachment to a parent are less afraid of challenge and unfamiliarity than are those with an insecure attachment.",
  "During the first two years of life, the presence of targets of attachment tends to mute infants’ feelings of fear in unfamiliar situations. A one-year-old in an unfamiliar room is much less likely to cry if his mother is present than if she is not. A one-year-old is also much less likely to cry at an unexpected sound or an unfamiliar object if his mother is nearby. Monkeys, too, show less fear of the unfamiliar when they are with their mothers. This behavioral fact has been used to develop a series of experimental situations thought to be useful in distinguishing securely from insecurely attached infants. These procedures consist of exposing a one-year-old to what is known as the “strange situation.” Two episodes that are part of a longer series in this procedure involve leaving the infant with a stranger and leaving the infant alone in an unfamiliar room. Children who show only moderate distress when the mother leaves, seek her upon her return, and are easily comforted by her are assumed to be securely attached. Children who do not become upset when the mother leaves, play contentedly while she is gone, and seem to ignore her when she returns are termed insecurely attached–avoidant. Finally, children who become extremely upset when the mother leaves, resist her soothing when she returns, and are difficult to calm down are termed insecurely attached–resistant. About 65 percent of all American children tested are classed as securely attached, 21 percent as insecurely attached–avoidant, and 14 percent as insecurely attached–resistant. All other things being equal, it is believed that those children who demonstrate a secure attachment during the first two years of life are likely to remain more emotionally secure and be more socially outgoing later in childhood than those who are insecurely attached. But insecurely attached–resistant children are more likely to display social or emotional problems later in childhood. The development of a secure or insecure attachment is partly a function of the predictability and emotional sensitivity of an infant’s caregiver and partly the product of the infant’s innate temperament.",
  "Individual infants tend to vary in their basic mood and in their typical responses to situations and events involving challenge, restraint, and unfamiliarity. Infants may differ in such qualities as fearfulness, irritability, fussiness, attention span, sensitivity to stimuli, vigour of response, activity level, and readiness to adapt to new events. These constitutional differences help make up what is called a child’s temperament. It is believed that many temperament qualities are mediated by inherited differences in the neurochemistry of the brain.",
  "Most individual differences in temperament observed in infants up to 12 months in age do not endure over time and are not predictive of later behaviour. One temperamental trait that is more lasting, however, is that of inhibition to the unfamiliar. Inhibited children, who account for 10–20 percent of all one-year-old children, tend to be shy, timid, and restrained when encountering unfamiliar people, objects, or situations. As young infants, they show high levels of motor activity and fretfulness in response to stimulation. (They are also likely to be classified as insecurely attached–resistant when observed in the “strange situation.”) By contrast, uninhibited children, who account for about 30 percent of all children, tend to be very sociable, fearless, and emotionally spontaneous in unfamiliar situations. As infants, they display low levels of motor activity and irritability in response to unfamiliar stimuli. Inhibited children have a more reactive sympathetic nervous system than do uninhibited children. Inhibited children show larger increases in heart rate in response to challenges and larger increases in diastolic blood pressure when they change from a sitting to a standing posture. In addition, inhibited children show greater activation of the frontal cortex on the right side of the brain, while uninhibited children show greater activation of the frontal cortex on the left side.",
  "These two temperament profiles are moderately stable from the second to the eighth year; studies reveal that about one-half of those children classed as inhibited at age two are still shy, introverted, and emotionally restrained at age eight, while about three-quarters of those children classed as uninhibited have remained outgoing, sociable, and emotionally spontaneous.",
  "The capacity for language usually emerges in infants soon after the first birthday, and they make enormous progress in this area during their second year. Language is a symbolic form of communication that involves, on the one hand, the comprehension of words and sentences and, on the other, the expression of feelings, thoughts, and ideas. The basic units of language are phonemes, morphemes, and words. Phonemes are the basic sounds that are combined to make words; most languages have about 30 phonemes, which correspond roughly to the sounds of the spoken letters of the alphabet. Although one-month-old infants can discriminate among various phonemes, they are themselves unable to produce them. By 4 to 6 months of age, however, infants usually express vowellike elements in their vocalizations, and by 11–12 months of age they are producing clear consonant-vowel utterances like “dada” and “mama.”",
  "Virtually all children begin to comprehend some words several months before they speak their own first meaningful words. In fact, one- to three-year-olds typically understand five times as many words as they actually use in everyday speech. The average infant speaks his first words by 12–14 months; these are generally simple labels for persons, objects, or actions; e.g., “mommy,” “milk,” “go,” “yes,” “no,” and “dog.” By the time the child reaches his 18th month, he has a speaking vocabulary of about 50 words. The single words he uses may stand for entire sentences. Thus, the word “eat” may signify “Can I eat now?” and “shoe” may mean “Take off my shoe.” The child soon begins to use two-word combinations for making simple requests or for describing the environment: “Want juice,” “Daddy gone,” “Mommy soup.” These simple statements are abbreviated versions of adult sentences. “Where is the ball?” becomes “where ball?”; the sentence “That’s the ball” becomes “that ball.” These early two-word combinations consist mostly of nouns, verbs, and a few adjectives. Articles (a, an, the), conjunctions (and, or, but), and prepositions (in, on, under) are almost completely absent at this stage. In their telegraphic sentences, children usually place the subject, object, and verb in an order that is correct within certain broad limits for their native language. For example, an American child will say “want ball” rather than “ball want” for a sentence meaning “I want the ball.”",
  "In the few months before the child’s second birthday, there is a major increase in the size of his vocabulary and in the variety of his two- and three-word combinations. By two years of age a child’s comprehension vocabulary contains an average of about 270 words. By the end of the second year, he understands interrogatives such as “where,” “who,” and “what,” and by three years of age he can correctly interpret the respective use of the words “this” or “that” and “here” or “there,” as well as the terms “in front of” and “behind.” By three years of age children are learning at least two new words a day and possess a working vocabulary of 1,000 words.",
  "Children in their second and third years sometimes use words as overextensions; “doggie,” for instance, may refer to a variety of four-legged animals as well as to dogs, and the word “daddy” may be used in reference to all men. This occurs simply because, although the infant detects the differences among various types of animals, he has only one word (“dog”) in his vocabulary to apply to them. Overextensions are more common in speech than in comprehension, however; the child who uses the word “apple” for all round objects has no difficulty pointing to an apple in a picture illustrating several round objects. Other words are underextended; that is, they are defined too narrowly. Some infants will use the word “car” to refer only to cars moving on the street but not to cars standing still or to a picture of a car.",
  "Children learn the rules of syntax (i.e., the grammatical rules specifying how words are combined in a sentence) with very little explicit instruction or tutoring from adults. They begin to flesh out their noun-verb sentences with less critical words such as prepositions, conjunctions, articles, and auxiliary verbs. Children follow a typical sequence in their acquisition of grammatical rules, depending on the language they are learning to use. In English, a child first masters the grammatical rules for the present tense (e.g., “I want”) and begins to use the present progressive ending (“-ing”) and the plural. This is followed by mastery of the irregular past tense (“I made,” “I had”), possessives (my, mine, his), articles (a, an, the), and the regular past tense (“I walked,” “he stopped”). These successes are followed by mastery of the third person present tense (“he goes”) and auxiliary verbs (“I’m walking,” “we’re playing”).",
  "Deaf children learning sign language from deaf-mute parents show in their signs the same course of development that is apparent in the speech of children with normal hearing. Deaf, like hearing, children make their first signs for objects and later display signs for more complex ideas like “Mommy eat” or “Daddy coat.”",
  "By the middle of the third year, children tend to use more sentences containing four, five, or six words, and by the fourth year they can converse in adultlike sentences. Finally, five- and six-year-olds demonstrate metalinguistic awareness—i.e., a mastery of the complex rules of grammar and meaning. They can differentiate between sounds that are real words and those that are not—e.g., they regard “apple” as a word but reject “oope” as a word. They can tell the difference between grammatically correct and incorrect sentences and will make spontaneous corrections in their speech; that is to say, if a child makes a speech error, he recognizes it and will say the phrase or sentence correctly the second time.",
  "A major disagreement among theories of language acquisition is their relative emphasis on the role of maturation of the brain, on the one hand, and of social interaction, on the other. The most popular view assumes that biological factors provide a strong foundation for language acquisition but that infants’ social interaction with others is absolutely necessary if language is to develop. The special biological basis of language is supported by the fact that deaf children who are not exposed to a sign language invent a symbol system that is similar in structure to that developed by hearing children. But interaction with other people is also crucial. Even during the first year, children’s production and perception of speech sounds are increasingly shaped by the linguistic environment around them, reflecting their exquisite sensitivity and susceptibility to human speech. Indeed, the amount and variety of verbal stimulation is a critical factor in language development, as is the adult caregivers’ sensitivity to an infant’s own vocalizations; mothers who ask questions and encourage their infants’ vocal responses have children who show a more advanced language development.",
  "The mental activities involved in the acquisition, processing, organization, and use of knowledge are collectively termed cognition. These activities include selective attention, perception, discrimination, interpretation, classification, recall and recognition memory, evaluation, inference, and deduction. The cognitive structures that are involved in these processes include schemata, images, symbols, concepts or categories, and propositions. A schema is an abstract representation of the distinctive characteristics of an event. These representations are not photographic copies or visual images but are more like schematic blueprints that emphasize the arrangement of a set of salient elements, which supply the schema with distinctiveness and differentiate it from similar events. The child’s ability to recognize the face of another person is mediated by a schema, for example. Young children already display a remarkable ability to generate and store schemata. Another type of early cognitive unit is the image; this is a mental picture, or the reconstruction of a schema, that preserves the spatial and temporal detail of the event.",
  "Symbols represent the next level of abstraction from experience; they are arbitrary names for things and qualities. Common examples of symbols are the names for objects, letters, and numbers. Whereas a schema or image represents a specific experience, such as a sight or sound, a symbol is an arbitrary representation of an event. The letter A is a symbol, and children use schemata, images, and symbols in their mastery of the alphabet. Symbols are used in the development of higher cognitive units called concepts. A concept, or category, may be thought of as a special kind of symbol that represents a set of attributes common to a group of symbols or images. The concept represents a common attribute or meaning from a diverse array of experiences, while a symbol stands for a particular class of events. Concepts are used to sort specific experiences into general rules or classes, and conceptual thinking refers to a person’s subjective manipulations of those abstract classes.",
  "Jean Piaget tried to trace specific stages in children’s progressive use of symbols and concepts to manipulate their environment. According to Piaget, two of the four stages of cognitive development occur during childhood: the preoperational stage (2 to 7 years), in which the child learns to manipulate the environment by means of symbolic thought and language; and the concrete-operational stage (7 to 12 years), in which the beginnings of logic appear in the form of classifications of ideas and an understanding of time and number. An important structure in Piaget’s theory of cognitive development is the operation, which is a cognitive structure that the child uses to transform, or “operate on,” information. Children learn to use operations that are flexible and fully reversible in thought; the ability to plan a series of moves in a game of checkers and then mentally retrace one’s steps to the beginning of that sequence is one such example of an operation.",
  "It is important to make a distinction between the knowledge and skills a child possesses, called competence, and the demonstration of that knowledge in actual problem-solving situations, called performance. Children often possess knowledge that they do not use even when the occasion calls for it. Adapting to new challenges, according to Piaget, requires two complementary processes. The first, assimilation, is the relating of a new event or object to cognitive structures the child already possesses. A five-year-old who has a concept of a bird as a living thing with a beak and wings that flies will try to assimilate the initial perception of an ostrich to his concept of bird. Accommodation, the second process, occurs when the information presented does not fit the existing concept. Thus, once the child learns that the ostrich does not fly, he will accommodate to that fact and modify his concept of bird to include the fact that some birds do not fly.",
  "One of the central victories of cognitive development occurs during ages five to seven and, according to Piaget, marks the child’s entry to the concrete-operational stage. This is the ability to reason simultaneously about the whole and about part of the whole. For instance, if an eight-year-old is shown eight yellow candies and four brown candies and asked, “Are there more yellow candies or more candies,” he will say that there are more candies, whereas a five-year-old is likely to respond incorrectly that there are more yellow candies.",
  "A child who has reached the concrete-operational stage is able to solve several other new kinds of logical problems. For example, a five-year-old who is shown two balls of clay of the same size and shape will tell an adult that they have the same amount of clay, but, when the experimenter rolls one of the balls into a long but thin sausage, the five-year-old will tend to say that the untouched sphere has more clay in it than the sausage-shaped object does. A seven-year-old, however, shows what is called the ability to conserve; when presented with the same problem, he will recognize that the two pieces still have the same amount of clay in them, based on his awareness that liquids and solids do not change in amount or quantity merely because their external shape changes. The seven-year-old is able to reverse an event in thought and knows that the sausage can be reshaped back into the original ball without a loss or gain in the total amount of clay. The knowledge that one can reverse one state of affairs into a prior state, which is called conservation, is a mark of this new stage of development.",
  "Another cognitive advance children make during the concrete-operational stage is the knowledge that hierarchical relationships can exist within categories. This is illustrated by the ability to arrange similar objects according to some quantified dimension, such as weight or size. This ability is called seriation. A seven-year-old can arrange eight sticks of different lengths in order from shortest to longest, indicating that the child appreciates a relation among the different sizes of the objects. Seriation is crucial to understanding the relations between numbers and hence to learning arithmetic. Children in the concrete-operational stage also appreciate the fact that terms such as taller, darker, and bigger refer to a relation between objects rather than to some absolute characteristic.",
  "One implication of the stage of concrete operations is that the child is now able to compare himself with other children in such qualities as size, attractiveness, intelligence, courage, and so on. Hence, the formation of the child’s sense of identity, or self-concept, proceeds at a faster rate because he is able to compare his characteristics with those of other children.",
  "The final stage of cognitive development, called the stage of formal operations, begins at about age 12 and characterizes the logical processes of adolescents and adults. A child who has reached this stage of logical thinking can reason about hypothetical events that are not necessarily in accord with his experience. He shows a willingness to think about possibilities, and he can analyze and evaluate events from a number of different possible perspectives. A second hallmark of the stage of formal operations is the systematic search for solutions. Faced with a novel problem, the adolescent is able to generate a number of possible means of solving it and then select the most logical, probable, or successful of his hypotheses. The formal thinking of adolescents and adults thus tends to be self-consciously deductive, rational, and systematic. Finally, adolescents typically begin to examine their own thinking and evaluate it while searching for inconsistencies and fallacies in their own beliefs and values concerning themselves, society, and nature.",
  "Symbolic ability, which appears at about one year of age, can be observed when a child imaginatively treats an object as something other than it is—pretending a wooden block is a car or using a cup as a hat. By the middle of their second year, children impart new functions to objects; they may turn a doll upside down and pretend it is a salt shaker or try to use a wooden block as if it were a chair. Many three-year-olds are capable of simple metaphor and will play with two wooden balls of different size as if they were symbolic of a parent and a child. Children’s drawings also become symbolic during the second and third years and begin to contain forms that look like (or at least are intended to represent) animals, people, and various objects.",
  "Imitation may be defined as behaviour that selectively duplicates that of another person. Like symbolism, it is a basic capacity that is inherent in human nature. Infants engage in selective imitation by seven or eight months of age, and their imitations become more frequent and complex during the next two to three years. One-year-olds already imitate the gestures, speech sounds, and instrumental actions that they see performed by people around them. They also become capable of imitating an act some time after they have actually observed it; for example, one-year-olds may imitate an action they witnessed one day earlier. Children often imitate the instrumental behaviours of parents, like cleaning or feeding, but are less likely to imitate emotional expressions or parental behaviours that have no instrumental goal. Children are also more likely to imitate their parents than their siblings or characters they see on television.",
  "Children imitate others for a variety of reasons. They are most likely to imitate those acts over which they feel some uncertainty regarding their ability to perform. If they are too uncertain, they will cry; if they are absolutely certain they can perform an act, they are less likely to imitate it. Children also imitate actions that win parental approval or attention or that enhance their similarity to other persons they want to be like (e.g., a boy imitating his father).",
  "Memory, which is central to all cognitive processes, involves both the storage of traces of past experience and the retrieval of that stored information at a later time. It is useful to distinguish between short-term and long-term memory processes. Short-term, or working, memory may be defined as referring to traces available for a maximum of 30 seconds immediately after stimulation, but typically for a much shorter period. The ability to remember a phone number while redialing it is a good example of short-term memory. Long-term memory, or permanent memory, refers to stored information that is potentially available for relatively long periods of time, extending up to a lifetime.",
  "Two-year-olds can usually hold in short-term memory only one or two independent units of information, while 15-year-olds can remember seven or eight units (numbers or words, for example). Both children and adults tend to perform much better when they have to recognize than when they have to recall, but this difference is most dramatic in young children. Thus, a four-year-old child can usually recognize almost all of 12 pictures he has seen but may be able to recall only 2 or 3 of them. A 10-year-old, by contrast, who recognizes the 12 pictures can also recall as many as 8 of them.",
  "Besides improvements in capacity, older children demonstrate an increasing speed of recall and can search their memory for information more quickly. Another improvement in memory ability is selectivity. As they grow older, children become adept at choosing more important items to remember—i.e., at distinguishing fundamental from merely incidental information. In addition, older children acquire more efficient strategies for the coding, rehearsal, and retrieval of information that younger children do not possess. By eight or nine years of age, for example, most children know that it is easier to relearn a text passage than to learn it for the first time. Generally, older children are better able to plan their own behaviour, formulate problems, monitor their ability, control distraction and anxiety, and evaluate the quality of their cognitive products. And because older children have a more accurate understanding of their own abilities, they are better able to assess and predict the cognitive abilities of other people.",
  "Controversy exists over whether children can be said to differ in a unitary abstract ability called intelligence or whether each child might better be described as possessing a set of specific cognitive abilities. Some children are especially proficient with verbal problems and less proficient at problems involving spatial relations or mathematical reasoning, for example. The American psychologist J.P. Guilford suggests that cognitive abilities can be classified along three dimensions: the content of the information (symbolic, semantic, behavioral, or figural); the operation performed on the content (memory, evaluation, convergence, divergence, or cognition); and finally the product of the cognitive work (a unit, a class, a relation, a system, a transformation, or an implication). This theory predicts that there are a very large number of different cognitive profiles, not just one.",
  "Although earlier theorists believed that personality traits evident in the first three years of life would persist into later life, research indicates that this claim is exaggerated. Long-term studies that follow children from infancy through adolescence and into adulthood indicate that lasting personality traits do not emerge until after six or seven years of age and that most of the differences seen in children in the first three years of life are not preserved. The one possible exception to this claim holds for the temperamental qualities of inhibited and uninhibited to the unfamiliar. Children who are extremely inhibited or uninhibited in the first three years of life are more likely than others to retain those qualities through late childhood.",
  "Perhaps the most important aspect of children’s emotional development is a growing awareness of their own emotional states and the ability to discern and interpret the emotions of others. The last half of the second year is a time when children start becoming aware of their own emotional states, characteristics, abilities, and potential for action; this phenomenon is called self-awareness. Two-year-old children begin to describe their own actions as they are performing them, can recognize a reflection of themselves in the mirror, and may become possessive with their toys for the first time. This growing awareness of and ability to recall one’s own emotional states leads to empathy, or the ability to appreciate the feelings and perceptions of others. Young children’s dawning awareness of their own potential for action inspires them to try to direct (or otherwise affect) the behaviour of others. This change is often accompanied by the urge to test the standards of behaviour held by parents, and, as a result, children’s second and third years are often called the “terrible twos.”",
  "With age, children acquire the ability to understand the perspective, or point of view, of other people, a development that is closely linked with the empathic sharing of others’ emotions. Even six-year-olds are aware that other people have different perspectives, thoughts, and feelings from their own, and they are able to empathize with the characteristics they observe in others. By eight to nine years of age a child recognizes that people can become aware of others’ point of view, and he likewise knows that others can become aware of his own perspective. By 10 years of age the child can consider a social interaction simultaneously from his own point of view and from that of another person. Owing to this increased awareness, children from age seven on are more conscious of what others think of them and show more concern over others’ opinion of their behaviour. Finally, older children understand that a person’s genuine emotions can be stronger or different from those he actually reveals, and they thus appreciate that a person can disguise his emotions.",
  "One major factor underlying these changes is the child’s increasing cognitive sophistication. For example, in order to feel the emotion of guilt, a child must appreciate the fact that he could have inhibited a particular action of his that violated a moral standard. The awareness that one can impose a restraint on one’s own behaviour requires a certain level of cognitive maturation, and, therefore, the emotion of guilt cannot appear until that competence is attained.",
  "Empathy and other forms of social awareness are important in the development of a moral sense. Morality embraces a person’s beliefs about the appropriateness or goodness of what he does, thinks, or feels. During the last few months of the second year, children develop an appreciation of right and wrong; these representations are called moral standards. Children show a concern over dirty hands, torn clothes, and broken cups, suggesting that they appreciate that certain events violate adult standards. By age two most children display mild distress if they cannot meet standards of behaviour imposed by others. After age two they will playfully violate rules on acceptable behaviour in order to test the validity of that standard. One of the signs of the child’s growing morality is the ability to control behaviour and the willingness to postpone immediate gratification of a desire.",
  "Childhood is thus the time at which moral standards begin to develop in a process that often extends well into adulthood. The American psychologist Lawrence Kohlberg hypothesized that people’s development of moral standards passes through stages that can be grouped into three moral levels. At the early level, that of preconventional moral reasoning, the child uses external and physical events (such as pleasure or pain) as the source for decisions about moral rightness or wrongness; his standards are based strictly on what will avoid punishment or bring pleasure. At the intermediate level, that of conventional moral reasoning, the child or adolescent views moral standards as a way of maintaining the approval of authority figures, chiefly his parents, and acts in accordance with their precepts. Moral standards at this level are held to rest on a positive evaluation of authority, rather than on a simple fear of punishment. At the third level, that of postconventional moral reasoning, the adult bases his moral standards on principles that he himself has evaluated and that he accepts as inherently valid, regardless of society’s opinion. He is aware of the arbitrary, subjective nature of social standards and rules, which he regards as relative rather than absolute in authority.",
  "Thus the bases for justifying moral standards pass from avoidance of punishment to avoidance of adult disapproval and rejection to avoidance of internal guilt and self-recrimination. The person’s moral reasoning also moves toward increasingly greater social scope (i.e., including more people and institutions) and greater abstraction (i.e., from reasoning about physical events such as pain or pleasure to reasoning about values, rights, and implicit contracts). This transition from one stage to another is characterized by gradual shifts in the most frequent type of reasoning; thus, at any given point in life, a person may function at more than one stage at the same time. Different people pass through the stages at varying rates. Finally, different people are likely to reach different levels of moral thinking in their lives, raising the possibility that some people may never reach the later, more abstract, stages.",
  "The evidence for these theoretical stages comes from children’s answers to moral dilemmas verbally presented to them by researchers, rather than their actual behaviour in time of conflict. Scientists have argued that many children display a more profound moral understanding than is evident in their responses on such tests. Others have argued that because even rather young children are capable of showing empathy with the pain of others, the inhibition of aggressive behaviour arises from this moral affect rather than from the mere anticipation of punishment. Some scientists have found that children differ in their individual capacity for empathy, and, therefore, some children are more sensitive to moral prohibitions than others. There is evidence suggesting that temperamentally inhibited children whose parents impose consistent socialization demands on them experience moral affect more intensely than do other children.",
  "One of the most important aspects of a child’s emotional development is the formation of his self-concept, or identity—namely, his sense of who he is and what his relation to other people is. The most conspicuous trend in children’s growing self-awareness is a shift from concrete physical attributes to more abstract characteristics. This shift is apparent in those characteristics children emphasize when asked to describe themselves. Young children—four to six years of age—seem to define themselves in terms of such observable characteristics as hair colour, height, or their favourite activities. But within a few years, their descriptions of themselves shift to more abstract, internal, or psychological qualities, including their competences and skills relative to those of others. Thus, as children approach adolescence, they tend to increasingly define themselves by the unique and individual quality of their feelings, thoughts, and beliefs rather than simply by external characteristics.",
  "One of the earliest and most basic categories of self to emerge during childhood is based on gender and is called sex-role identity. Children develop a rudimentary gender identity by age three, having learned to classify themselves and others as either males or females. They also come to prefer the activities and roles traditionally assigned to their own sex; as early as two years of age, most children select toys and activities that fit the sex-role stereotypes of their culture, and during the preschool years they begin to select same-sex playmates. Another component of a child’s self-concept concerns the racial, ethnic, or religious group of which he is a part. A child who is a member of a distinctive or specific group has usually created a mental category for that group by five to six years, and children from ethnic minorities tend to be more aware of ethnic differences than are nonminority children.",
  "One of the important processes that mediates a child’s self-concept is that of identification; this involves the child’s incorporation of the characteristics of parents or other persons by adopting their appearance, attitudes, and behaviour. Children tend to identify with those persons to whom they are emotionally attached and whom they perceive to be similar to themselves in some way. They seem to identify most strongly with parents who are emotionally warm or who are dominant and powerful. The role models children adopt may have negative as well as positive characteristics, however, and can thus influence children in undesirable as well as beneficial ways.",
  "More than 80 percent of American children have one or more sisters or brothers, and the presence of these siblings can influence a child’s personality development. Parents tend to be more involved and attentive toward the firstborn, stimulating him more (in the absence of other children) but then expecting and demanding more from him (as their oldest child). Because of this, firstborns tend to identify more closely with their parents, conform more closely to their values and expectations, and generally identify more closely with authority than do their younger siblings. Firstborns tend to be more strongly motivated toward school achievement, are more conscientious, more prone to guilt feelings, and less aggressive than those born later. A high proportion of eminent scientists and scholars have been firstborns, perhaps owing to the aforementioned traits, but firstborns also tend to be less receptive to ideas that challenge a popular ideological or theoretical position.",
  "During the first two years of life, infants do not spontaneously seek out other children for interaction or for pleasure. Although six-month-old infants may look at and vocalize to other infants, they do not initiate reciprocal social play with them. However, between two and five years of age, children’s interactions with each other become more sustained, social, and complex. Solitary or parallel play is dominant among three-year-olds, but this strategy shifts to group play by five years.",
  "An estimated 6–10 percent of all children develop serious emotional or personality problems at some point. These problems tend to fall into two groups: those characterized by symptoms of extreme anxiety, withdrawal, and fearfulness, on the one hand, and by disobedience, aggression, and destruction of property on the other. The former set is called internalizing; the latter is termed externalizing. As indicated earlier, some fearful, timid, socially withdrawn children inherit a temperamental predisposition to develop this form of behaviour; other children, however, acquire it as a result of a stressful upbringing, experiences, or social circumstances.",
  "Sex-linked differences in aggression are evident from about two or three years of age, with boys being more aggressive than girls. Although young children sometimes fight and quarrel, usually over possessions, such behaviour is generally not a serious problem in the first three or four years of life. Aggressive behaviour can become a serious problem in older children, however, and by seven years of age a small proportion of boys do display an extreme and consistent tendency to be aggressive with others. Children who are highly aggressive by age seven or eight tend to remain so later in life; these children are three times more likely to have police records as adults than are other children. By age 30 significantly more members of this group had been convicted of criminal behaviour, were aggressive with their spouses, and abused or severely punished their own children. Although biological factors can play a role in producing extreme aggression, the role of the child’s social environment is critical. Parents’ use of extreme levels of physical punishment, imposed inconsistently, is associated with high levels of aggression in children, as are extreme levels of parental permissiveness toward a child’s own aggressive acts. Psychologists frequently help parents deal with aggressive children by teaching them to observe what they do and to enforce rules consistently with their children. Parents can thereby learn effective but nonpunitive ways of controlling their aggressive children.",
  "Although precise information is difficult to obtain, it is estimated that each year about one million children in the United States are abused by their parents or other adults. Child abuse is more common in economically disadvantaged families than in affluent ones but occurs in all social classes, races, and ethnic groups. The abuse of children is often part of a pattern of family violence that is transmitted from parent to child for generations. Children who were abused as infants tend to show much more avoidant, resistant, and noncompliant behaviour than do other children.",
  "Parental behaviour affects the child’s personality and that child’s likelihood of developing psychological problems. The most important qualities in this regard are whether and how parents communicate their love to a child, the disciplinary techniques they use, and their behaviour as role models. There are, of course, cultural and class differences in the socialization values held by parents. In most modern societies, well-educated parents are more concerned with their children’s academic achievement and autonomy and are generally more democratic than are less well-educated parents. No single area of interaction can alone account for parents’ influence on a child’s behaviour and social functioning. One investigator has emphasized four factors, however: (1) the degree to which parents try to control the child’s behaviour, (2) the pressures imposed on the child to perform at high levels of cognitive, social, or emotional development, (3) the clarity of parent-child communications, and, finally, (4) the parents’ nurturance of and affection toward the child. Those children who appear to be the most mature and competent tend to have parents who were more affectionate, more supportive, more conscientious, and more committed to their role as parents. These parents were also more controlling and demanded more mature behaviour from their children. Although the parents respected their children’s independence, they generally held firm positions and provided clear reasons for them. This parental type is termed authoritative. A second class of children consists of those who are moderately self-reliant but somewhat withdrawn. The parents of these children tended to use less rational control and relied more heavily on coercive discipline. These parents were also slightly less affectionate, and they did not encourage the discussion of parental rules. This parental type is termed authoritarian. The least mature children had parents who were lax in discipline and noncontrolling but affectionate. They made few demands on the children for mature behaviour and allowed them to regulate their own activities as much as possible. This parental type is termed permissive.",
  "Specific characteristics in children that have been linked to different parenting styles range from responsible independence and ability to cooperate easily with others to anxiety, distress, and depression. In general, authoritativeness appears to be associated with positive outcomes in children and adolescents, with individuals being confident and able to balance societal demands with their own needs. Authoritarian parenting, on the other hand, is associated with maladaptive features of perfectionism, such as feeling pressured to succeed and being overly self-critical and self-doubting. Research has indicated that parents who pressure their children to excel academically, such as by urging children to earn good grades and by pointing out their mistakes, foster the development of aspects of maladaptive perfectionism. Such children may be at increased risk of developing symptoms of anxiety and depression.",
  "The effects of divorce on children appear to be very complicated. The major adverse impact of divorce on children is evident during the first year after the divorce and seems to be a bit more enduring for boys than for girls. Preschool children seem to be most vulnerable to the effect of divorce and adolescents the least.",
  "In most modern industrialized countries, the proportion of working mothers with children under 18 greatly increased in the last few decades of the 20th century, to the point that one-half of all mothers with children under 5 were in the workforce. However, there is no clear evidence that this change in Western society had a profound influence on child development, independent of other historical changes during that same period.",
  "Adolescence may be defined as that period within the life span when most of a person’s characteristics are changing from what is typically considered childlike to what is typically considered adultlike. Changes in the body are the most readily observed, but other, less definitive attributes such as thoughts, behaviour, and social relations also change radically during this period. The rate of such changes varies with the individual as well as with the particular characteristic.",
  "The physical and physiological changes of adolescence do not proceed uniformly; however, a general sequence for these changes applies to most people. It is useful to speak of phases of bodily changes in adolescence in order to draw important distinctions among various degrees and types of change. Bodily changes affect height, weight, fat and muscle distribution, glandular secretions, and sexual characteristics. When some of these changes have begun, but most are yet to occur, the person is said to be in the prepubescent phase. When most of those bodily changes that will eventually take place have been initiated, the person is in the pubescent phase. Finally, when most of those bodily changes have already occurred, the person is in the postpubescent phase; this period ends when all bodily changes associated with adolescence are completed.",
  "The bodily changes of adolescence relate to both primary and secondary sexual characteristics. Primary sexual characteristics are present at birth and comprise the external and internal genitalia ( e.g., the penis and testes in males and the vagina and ovaries in females). Secondary sexual characteristics are those that emerge during the prepubescent through postpubescent phases ( e.g., breasts in females and pigmented facial hair in males).",
  "Several important bodily changes occur specifically within each of the three periods that characterize adolescent physical maturation. The period of prepubescence begins with the first indication of sexual maturation. It ends with the initial appearance of pubic hair. In males, there is a continuing enlargement of the testicles, an enlargement and reddening of the scrotal sac, and an increase in the length and circumference of the penis. These changes all involve primary sexual characteristics. Insofar as secondary sexual characteristics are concerned, there is no true pubic hair at this stage, although down may be present. In females, prepubescent changes typically begin an average of two years earlier than in males. The first phenomena of female development in this period are the enlargement of the ovaries and the ripening of the ova. In contrast with those of males, these changes in primary sexual characteristics are not outwardly observable. However, changes involving secondary sex characteristics can be seen ( e.g., the rounding of the hips and the first phase of breast development). The latter begins with an elevation of the areola surrounding the nipple, which produces a small conelike growth called the breast bud. As with the male, there is no true pubic hair, although down may be present.",
  "The onset of pubescence in both sexes occurs with the appearance of pubic hair, and this period ends when pubic hair development is complete. The peak velocity of growth in height and weight also occurs during this phase. This so-called growth spurt occurs about two years earlier in females than in males. Another key change of pubescence in females is menarche, or the onset of menstruation, which occurs about 18 months after the maximum height increase of the growth spurt and typically is not accompanied initially by ovulation. In pubescence the primary sexual characteristics continue the development initiated in prepubescence. In females the vulva and clitoris enlarge; in males the testes continue to enlarge, the scrotum grows and becomes pigmented, and the penis becomes longer and increases in circumference. In regard to secondary sexual characteristics, in females there is increased breast development, with the breast buds enlarging to form the primary breast; in males, the voice deepens and pigmented axillary and facial hair appear, usually about two years after the emergence of pubic hair.",
  "The phase of postpubescence starts when pubic hair growth is complete, a deceleration of growth in height occurs, changes in the primary and secondary sexual characteristics are essentially complete, and the person is fertile. Some changes in primary and secondary sexual characteristics occur in this phase. For instance, in males, it is during this period that the beard begins to grow; in females, there may be further breast development.",
  "Although, as noted, the ordering of these bodily changes is fairly uniform among individuals, there is considerable variation in the rate of change. Some adolescents mature more rapidly and others more slowly than most of their peers. Of course, there are also youths who pass through the periods of bodily change at the average rate. Variations in the rate of bodily change in adolescence often affect psychological and social development. Early-maturing adolescent boys are typically better adjusted than late maturers and have more favourable interactions with peers and adults. These advantages of early maturation and disadvantages of late maturation tend to continue through the middle adult years for males. For females, however, early maturation is associated with more psychosocial disadvantages than is late maturation. Maturing at an average rate seems to be most advantageous for females. However, the relations between female maturation rates and personality and social functioning in later life have not been determined.",
  "Bodily changes among adolescents can also differ according to sociocultural and historical influences. The age of menarche, for example, varies among countries and even among different cultures within one country. Moreover, there has been a historical trend downward in the average age of menarche, translating into a decrease of several months per decade from about 1840 to the present. This phenomenon is generally ascribed to the improved health and nutrition of children and adolescents.",
  "The dramatic physical and physiological changes characteristic of adolescence have an equally dramatic impact on cognitive and social functioning. Adolescents think about their “new” bodies and their “new” selves in qualitatively new ways. In contrast with sensorimotor and more limited spatiotemporal modes of thinking—which according to Piaget characterize infancy and childhood—beginning at about puberty, the formal-operational mode of thought emerges, characterized by reasoning and abstraction. In the formal-operational stage, adolescents begin to discriminate between their thoughts about reality and reality itself and come to recognize that their assumptions have an element of arbitrariness and may not actually represent the true nature of experience. Thus, adolescent thinking becomes somewhat experimental in the scientific sense, employing hypotheses to test new ideas against outward reality.",
  "In forming hypotheses about the world, adolescent cognition can be seen to grow along with formal, scientific, logical thinking. Consider, for example, a problem of combinatorial thought: An adolescent is presented with five jars, each containing a colourless liquid. Combining the liquids from three particular jars will produce a colour, whereas using the liquid from either of the two remaining jars will not produce a colour. The adolescent is told that a colour can be produced but is not shown which combination produces this effect. Children at the concrete-operational stage typically try to solve this problem by combining liquids two at a time, but after combining all pairs, or possibly trying to mix all five liquids together, their search for the workable combination usually stops. An adolescent at the formal-operational stage, on the other hand, will explore all possible solutions, systematically testing all possible combinations of two and three liquids until a colour is produced. As another example, consider adolescent thinking in respect to certain types of verbal problems—for instance, as represented by the question “If Jane is taller than Doris and shorter than Francine, who is the shortest of the three?” Concrete-operational children may be able to solve an analogous problem ( e.g., one using sticks of various lengths, with the sticks actually present). Abstract verbal problems, however, are usually not solved until the capacity for formal operations has emerged.",
  "Formal-operational thought does not seem to be a stage characterizing all adolescents. Studies of older adolescents and adults in Western cultures show that not all individuals attain formal operations. In turn, in some non-Western groups there is a failure ever to attain formal operations. Some researchers have attributed these differences to the differences between rural and urban societies and the different kinds of schooling offered by each. There is, however, little evidence for socioeconomic or educational differences being associated with the achievement of formal-operational thought.",
  "Formal-operational thinking also has limitations, predicated in part on the fact that adolescents often think about their own thinking. Just as the infant is preoccupied with his physical self in a world of new stimuli, so the adolescent may be preoccupied with his own thinking in a world of new ideas. Such preoccupation often leads to a kind of egocentrism, which can manifest itself in two ways: First, the individual may presume that his own concerns, values, and preoccupations are equally important to everyone else; second, the urgency of this new thinking may paradoxically give rise to an overestimation of one’s uniqueness, often resulting in feelings of alienation or of being misunderstood. Although the formal-operational stage is the last stage of cognitive development in Piaget’s theory, the egocentrism of this stage diminishes over the course of the person’s life, largely as a consequence of interactions with peers and elders and—most importantly—with the assumption of adult roles and responsibilities.",
  "The adolescent’s social context is broader and more complex than that of the infant and the child. The most notable social phenomenon of adolescence is the emergence of the marked importance of peer groups. The adolescent comes to rely heavily on the peer group for support, security, and guidance during a time when such things are urgently needed and since perhaps only others experiencing the same transition can be relied upon to understand what that experience is. Contrary to cultural stereotype, however, the family is quite influential for adolescents. Indeed, no social institution has as great an influence throughout development as does the family. Most studies indicate that most adolescents have relatively few serious disagreements with parents. In fact, in choosing their peers, adolescents typically gravitate toward those who exhibit attitudes and values consistent with those maintained by the parents and ultimately adopted by the adolescents themselves. For instance, while peers influence adolescents in regard to such issues as educational aspirations and performance, in most cases there is convergence between family and peer influences. While it is the case that adolescents and parents have somewhat different attitudes about issues of contemporary social concern ( e.g., politics, drug use, and sexuality), most of these differences reflect contrasts in attitude intensity rather than attitude direction. That is to say, rather than adolescents’ and parents’ standing on opposite sides of a particular issue, most generational differences simply involve different levels of support for the same position. In sum, there is not much evidence supporting the cultural stereotype of adolescence as a period of storm and stress. Most adolescents continue their close and supportive relationships with their parents, and their relationships with peers tend to support parental ideals rather than run against them.",
  "The dramatic changes that characterize puberty present the adolescent with serious psychosocial challenges. A person who has lived for 12 years has developed a certain sense of self as well as of self-capacity. In adolescence, however, this knowledge of self is challenged. As has been discussed, the rather sudden bodily changes in this period are accompanied by equally dramatic changes in thoughts and feelings. Thus, not all the assumptions adolescents held about the self in earlier stages may still be relevant to the new individuals they find themselves to be. Because a coherent sense of self is necessary for functioning productively in society, adolescents ask a crucial psychosocial question: Who am I?",
  "At precisely the time that adolescents feel unsure about who they are, society begins to ask them related questions. For instance, adolescents are expected to make the first steps toward career objectives. Society asks adolescents, then, what roles they will play as adults—that is, what socially prescribed set of behaviours they will choose to adopt. Thus, a key aspect of this adolescent dilemma is that of finding a role, which is generally taken to be the outward expression of identity. The emotional upheaval provoked by this mandate is called the identity crisis. In order to resolve this crisis and achieve a sense of identity, it is necessary to synthesize psychological development and societal directives. The adolescent must find an orientation to life that not only fulfills the attributes of the self but at the same time is consistent with what society expects; that is, a role cannot be self-destructive ( e.g., sustained fasting) or socially disapproved ( e.g., criminal behaviour). In the search for an identity, the adolescent must discover what he believes in and what his attitudes and ideals are, for commitment to a role entails, to a greater or lesser degree, commitment to a set of values.",
  "If the adolescent fails to resolve the identity crisis by the time of entry into adulthood, he will feel a sense of role confusion or identity diffusion. Some young adults waver between roles in a kind of prolonged “moratorium,” or period of avoiding commitment. Others seem to avoid the crisis altogether and settle easily on an available, socially approved identity. Still others resolve their crises by adopting an available but socially disapproved role or ideology. This latter option is called negative identity formation and is often associated with delinquent behaviour. Resolution of the adolescent identity crisis has a profound influence on development during later adulthood.",
  "All societies traditionally prescribe stereotyped roles to each sex. These roles have adaptive significance; that is, they allow society to maintain and perpetuate itself. From this reasoning, it follows that differences in sex-role behaviour, at least initially, arose from the different tasks males and females performed for survival—especially those tasks centred on reproduction. Differing biologies exert differing pressures on psychosocial development; however, these pressures do not occur independently of the demands of cultural and historical milieus. The biological basis of one’s psychosocial functioning is believed to relate to adaptive orientations for survival. Many differences exist between males and females, but the nature of individual differences between the sexes is dependent on interactions among biological, psychological, sociocultural, and historical influences.",
  "In sheer number of years, the periods labeled adulthood and aging constitute the major portion of the human life span. Historically, however, these periods were seen as less significant and interesting developmentally than infancy, childhood, and adolescence. Adulthood was viewed as a time of continuity, a period when what had been developed earlier was utilized. Aging was viewed as a time of decline, a period when what had been developed earlier was lost. Contemporary opinion is that adulthood and aging are just as significant and interesting as the earlier periods of the life cycle. Adulthood and aging are characterized by both growth and decline.",
  "There is relatively clear evidence that, with advancing age, individuals show a tendency toward decreasing speed of response. This is a gradual change occurring across the entire life span that shows up in a variety of so-called speeded tasks (those in which errors would be unlikely if the individual had an unlimited amount of time to complete the tasks). For example, reaction time tests (which measure the time elapsing between the appearance of a signal and the beginning of a responding movement) are usually viewed as a measure of central nervous system processing. Mean speed of response on such tasks increases with age until the late teens, remains constant until the mid-20s, and then declines steadily throughout the remainder of the age range.",
  "Much evidence has been accumulated to link changes in brain electrical activity to the slowing of behaviour. The electroencephalogram (EEG) provides a record of the brain’s electrical activity. The normal human EEG displays continuous rhythmic activity in the form of wavelike patterns varying in frequency and amplitude. The dominant rhythm is the alpha wave, which reaches its maximum frequency in adolescence and begins to slow gradually after young adulthood. This slowing may be related to disease processes (particularly vascular disease) and to basic aging processes. The older adult’s central nervous system appears to be in a state of underarousal in comparison to that of the younger adult.",
  "Decline in the rate of central nervous system processing does not necessarily imply a similar change in learning, memory, or other intellectual functions. However, considerable evidence indicates that the learning ability of young adults is superior to that of older adults and that the faster the pace of the task the more difference age makes. Older learners benefit more from slower pacing of tasks than do younger learners. When allowed to regulate the pace of the task themselves, older learners often show an improvement in performance, whereas this is not necessarily the case with younger learners.",
  "However, in regard to memory, as opposed to the learning or acquisition of information, research suggests that there are relatively few age-related differences within the primary-memory system, the temporary maintenance system for conscious processing of information. Age is a significant factor, however, in the functioning of the secondary-memory system. Secondary memory depends on the elaboration and organization of information in terms of its semantic content or meaning. Compared with younger adults, older adults appear to be deficient in these processes. Generally, they do not spontaneously use organizational strategies as extensively as do younger adults, or, if they use them, they do so less effectively. But, when organizational strategies are built into the situation, the performance of older adults improves markedly.",
  "Most studies examining memory for general knowledge have found that older adults retrieve such information as well as or better than do younger adults. Within some contexts, older adults appear to integrate and retain the meaning of sets of sentences and texts as well as younger adults. For example, when young, middle-aged, and elderly adults are asked questions covering such topics as famous people, news events, history, geography, the Bible, literature, sports, and general information ( e.g., “What was the former name of Muhammad Ali?”; “What is the capital of Cambodia?”), their answers typically show no evidence of age differences in the retrieval of knowledge. In fact, elderly people may actually answer more questions correctly than younger groups. Older adults also appear to have accurate knowledge about their own memory processes—knowledge that has been labeled metamemory. For example, research has found no age differences regarding subjects’ assessments of the relative reliability of visual and verbal memory, regarding the use of memory strategies ( e.g., reminder notes), or regarding memory monitoring ( e.g., prediction of the number of items that would be recalled following memory tasks).",
  "Psychometric approaches to cognition suggest that intelligence is characterized by two distinct properties. Fluid intelligence, measured by tests that minimize the role of cultural knowledge, reflects the degree to which the individual has developed unique qualities of thinking through incidental learning. Crystallized intelligence, measured by tests that maximize the role of cultural knowledge, reflects the degree to which the individual has been acculturated through intentional learning. Fluid intelligence shows a steady decline from adolescence through middle age. Across the same age range, however, a steady increase occurs in crystallized intelligence. When measures of both properties are taken, few age-related differences appear.",
  "Finally, there are age-related differences on several measures of cognitive functioning. In general, older adults perform more poorly than younger adults on tasks requiring both concrete-operational thought and formal-operational thought.",
  "Some features of cognitive functioning—speed of response, secondary memory, and fluid intelligence—seem to decline with age. Others—contextual memory and crystallized intelligence—increase. Aging does not inevitably precipitate a decline in cognitive functioning. Indeed, there is growing evidence that older persons can largely modify their intellectual performance, documenting a clear lifelong capacity for cognitive change in human beings.",
  "Several theories of personality development stress that adulthood and aging are periods of qualitative change, of discontinuity, and of transformations of earlier life patterns. These changes are believed to arise in relation to the demands of the person’s changing biological status and social context—the family, the workplace, and society in general. Thus, personality development is both an individual and a social phenomenon.",
  "In the view of Erik Erikson, certain psychosocial demands, or crises, confront the individual at distinct intervals throughout life. The young adult, for instance, is expected to enter into an institution— i.e., marriage and family—that will perpetuate the society. The degree to which the basic need for intimacy on all levels—physical, emotional, and others—is met in such a relationship determines in most individuals the conception of the self as belonging or as isolated. In middle adulthood the crisis develops between the sense of generativity and the sense of stagnation. In this stage the individual is expected to play the role of a contributing, generative member of society. Generativity can take the form of providing the goods and services by which society functions or of producing, rearing, and socializing future members of society. The inability to develop a productive self-conception results in a feeling of stagnation. In maturity, according to Erikson, a crisis arises with regard to the sense of ego integrity versus the sense of despair. In this stage, individuals realize that they are reaching the end of life. If they have successfully progressed through the previous stages of development, they can face old age with satisfaction in the feeling that a full and complete life has been led. Individuals for whom this integrity of life is lacking often feel a sense of despair over “wasted” opportunity.",
  "The American psychologist Daniel J. Levinson also divides adult life into qualitatively distinct periods. Confining his study to men, Levinson identified five eras within their lives that are not stages of biological, psychological, or social development but that together constitute a life-cycle structure. The eras are (1) preadulthood (birth to age 22), (2) early adulthood (age 17 to 45), (3) middle adulthood (age 40 to 64), (4) late adulthood (age 60 to 85), and (5) late late adulthood (age 80 and over). Each of these eras is in turn made up of a series of developmental periods and transitions. For example, in early adulthood a first major transition, ordinarily beginning at age 17 to 18 and extending until age 22 to 23, represents a developmental link between preadulthood and early adulthood. The young man in this early adult transition faces two major tasks. The first task is to modify relationships with his family and with other persons, groups, and institutions significant to his preadult world. The second task is to take a preliminary step into the adult world. This requires making initial explorations and choices for adult living. Major life events within this transition may include graduating from high school, moving out of the family home, seeking gainful employment, or attending college. Entering the adult world begins in the early 20s and extends until the late 20s. The focus of this period is on exploration and provisional commitment to adult roles and responsibilities. The young man faces two antithetical tasks. On the one hand, he must explore alternate possibilities for adult living, keeping options open and avoiding strong commitments. On the other hand, he must create a stable life structure, becoming responsible and “making something” of himself. Crucial life events during this period include occupational choice, first job, marriage, and the birth of children.",
  "The age range of 28 to 33 years represents a transition between the period of entering the adult world and the next period of settling down. This transition provides the young man with an opportunity to adjust and enrich the provisional adult life structure that he created earlier. For most men, however, a moderate to severe crisis is common; divorce and occupational change are frequent during this time. A settling-down period then follows, beginning in the early 30s and extending until about age 40. This period, during which the man’s task is to become a full-fledged adult, emphasizes stability and security. The individual makes deeper commitments to his occupation, family, or whatever enterprises are significant to him. In addition, he often concentrates on “making it.” This involves long-range planning toward specific goals with a timetable for their achievement. Most men fix on a key life event, such as a promotion, as representative of ultimate affirmation by society. During the last years of the settling-down period, there is a distinctive phase designated as “becoming one’s own man,” ordinarily occurring at age 36 to 40. The man’s major task during this phase is to achieve greater independence and authority by striving for the goals of his various enterprises.",
  "The midlife transition spans four to six years, reaching a peak in the early 40s. It forms a developmental link between early adulthood and middle adulthood and, being part of both eras, represents a beginning and ending, a meeting of past and future. A task of the midlife transition is to work on and partially resolve this discrepancy between what is and what might be. The transition may be fairly smooth, but it is more likely to involve considerable turmoil. The period of entering middle adulthood begins at about age 45 and extends until about age 50. Sometimes the start of this new life structure is marked by a significant life event, such as a change in job or occupation or a divorce or love affair. In other cases, the changes are more subtle.",
  "Research evidence does not unequivocally support the discontinuous, stagelike changes in adult personality proposed by theorists such as Erikson and Levinson. In fact, several major studies of personality development during the adult and aged years present evidence for both change and constancy. For instance, studies of healthy adults between the ages of 40 and 80 residing in the area of Kansas City, Mo., U.S., during the 1950s found evidence for both continuity and change of adult personality. On the one hand, personality structure was stable; four personality types—integrated, defended, passive-dependent, and unintegrated—emerged among respondents regardless of age. Similarly, characteristics dealing with the socioadaptational aspects of personality ( e.g., goal-directed behaviour, coping styles, and life satisfaction) were not age-related. It seems, therefore, that the ways in which healthy adults interact with the environment may be stable even though the roles they adopt alter with age. On the other hand, individual styles of coping with the inner world of experience showed marked age differences. For example, 40-year-olds felt in charge of their environment, viewed the self as a source of energy, and were positive about risk taking, whereas 60-year-olds saw the environment as threatening and even dangerous and viewed the self as passive and accommodating.",
  "Other studies of personality development from birth through early adulthood have also found evidence for constancy and change. For example, behavioral dispositions of the early school years, including passive withdrawal from stressful situations, dependency on family, arousal of anger, involvement in intellectual mastery, sexual behaviour and sex-role identification, and anxiety over social interaction, have been found to carry over into adulthood. The degree of stability in these behaviours exhibited from childhood to adulthood seems to be closely related to cultural expectations of appropriate sex-role behaviour. If a pattern of childhood behaviour is consistent with sex-role expectations, it will more likely remain stable over time.",
  "Other studies, concentrating on the development from adolescence into adulthood among people born in California in the late 1920s and early 1930s, found different personality types for males and females that showed substantial stability over time. Personality characteristics reflecting socialization and self-presentation, for example, tended to remain stable. On the other hand, two major types of personality characteristics, those reflecting information processing and those reflecting interpersonal relations, tended to change. There were differences between the sexes both in what was constant and in what changed across life. For example, lifestyle patterns among the parents of the California children were more continuous between young adulthood and old age for fathers than they were for mothers. Fathers who in early adulthood were unwell and disengaged from their families showed these same characteristics in late adulthood. In regard to personality, however, there was more apparent continuity between young adulthood and old age among mothers than among fathers. For example, mothers who were group-centred showed a more psychologically healthy personality and had a more satisfying life in later years than in earlier years, whereas non-group-centred mothers were happy and healthy at age 30 but lost their health and physical stamina by age 70.",
  "In general, older adults tend to engage in greater introspection and self-reflection than younger adults, showing a general movement from the outer world toward the inner world. They tend to withdraw emotional investments, be less assertive, and avoid challenges. Adulthood and old age involve both constancy and change. These periods of life are continuations of the past as well as new phases in their own right.",
  "This article treats as separate various substantive spheres of human development (physical, perceptual, cognitive, linguistic, personality, and social), as it does various temporal phases of development (prenatal life, infancy, childhood, adolescence, adulthood, and old age). However, human beings are coherent wholes, and behavioral development is unified, so that development in any one arena of life at any one time is ineluctably interrelated with development in other arenas at the same and at other times in patterns of mutual influence. In the life course, genetic endowment and biology interact with cultural context and experience to shape the development of human behaviour. Each of these powerful sources of influence on development has distinctive characteristics, and it is their transaction over time as well as the degree of congruence between the two that influence outcome. Our elucidation of the processes that underpin human growth is central to understanding normal as well as abnormal development. Study of the development of human behaviour is unwieldy; life does not submit to elegant scientific analysis or to precise prediction. Therefore, developmental study takes as its goals the general description and explanation of origins, of constancy, and of change in perceiving, thinking, feeling, and behaving. Any such undertaking requires constant reconsideration in light of new data and new insights.",
  "Texts on various aspects of human development include David R. Shaffer and Katherine Kipp , Developmental Psychology: Childhood and Adolescence , 9th ed. (2014); Richard M. Lerner , Concepts and Theories of Human Development , 3rd ed. (2002); Robert V. Kail and John C. Cavanaugh , Human Development: A Life-Span View , 7th ed. (2015); Bruce J. Ellis and David F. Bjorklund (eds.), Origins of the Social Mind: Evolutionary Psychology and Child Development (2005); and Jeffrey Jensen Arnett , Human Development: A Cultural Approach , 2nd ed. (2016). An older work is Urie Bronfenbrenner , The Ecology of Human Development: Experiments by Nature and Design (1979).",
  "Aspects of development specifically in the infant are presented in Hiram E. Fitzgerald , Katherine Hildebrandt Karraker , and Tom Luster (eds.), Infant Development: Ecological Perspectives (2003); Alan Slater and Michael Lewis (eds.), Introduction to Infant Development , 2nd ed. (2006); and Gavin Bremner and Alan Slater (eds.), Theories of Infant Development (2004). The influence of parenting on child development is discussed in Marianna S. Klebanov and Adam D. Travis , The Critical Role of Parenting in Human Development (2015).",
  "Other insightful texts on human development include John H. Flavell , Patricia H. Miller , and Scott A. Miller , Cognitive Development , 4th ed. (2002); and Jean Berko Gleason and Nan Bernstein Ratner (eds.), The Development of Language , 9th ed. (2016). The series titled The Handbooks of Aging comprises 3 vol., all 6th ed. (2006): Edward J. Masoro and Steven N. Austad (eds.), Handbook of the Biology of Aging ; James E. Birren and K. Warner Schaie (eds.), Handbook of the Psychology of Aging ; and Robert H. Binstock and Linda K. George (eds.), Handbook of Aging and the Social Sciences .",
  "Historical works, presenting major theories of human development, include Sigmund Freud , An Outline of Psycho-analysis (1949, reissued 1989; originally published in German, 1940); Erik H. Erikson , Childhood and Society , 2nd ed. rev. and enlarged (1964, reissued 1985); and Jean Piaget , The Origins of Intelligence in Children (1952, reissued 1974; also published as The Origin of Intelligence in the Child , 1953, reprinted 1977; originally published in French, 1936)."
]