[
  " perception , in humans, the process whereby sensory stimulation is translated into organized experience. That experience, or percept, is the joint product of the stimulation and of the process itself. Relations found between various types of stimulation (e.g., light waves and sound waves) and their associated percepts suggest inferences that can be made about the properties of the perceptual process; theories of perceiving then can be developed on the basis of these inferences. Because the perceptual process is not itself public or directly observable (except to the perceiver himself, whose percepts are given directly in experience), the validity of perceptual theories can be checked only indirectly. That is, predictions derived from theory are compared with appropriate empirical data, quite often through experimental research.",
  "Historically, systematic thought about perceiving was the province of philosophy. Indeed, perceiving remains of interest to philosophers, and many issues about the process that were originally raised by philosophers are still of current concern. As a scientific enterprise, however, the investigation of perception has especially developed as part of the larger discipline of psychology.",
  "Philosophical interest in perception stems largely from questions about the sources and validity of what is called human knowledge (see epistemology ). Epistemologists ask whether a real, physical world exists independently of human experience and, if so, how its properties can be learned and how the truth or accuracy of that experience can be determined. They also ask whether there are innate ideas or whether all experience originates through contact with the physical world, mediated by the sense organs. For the most part, psychology bypasses such questions in favour of problems that can be handled by its special methods. The remnants of such philosophical questions, however, do remain; researchers are still concerned, for example, with the relative contributions of innate and learned factors to the perceptual process.",
  "Such fundamental philosophical assertions as the existence of a physical world, however, are taken for granted among most of those who study perception from a scientific perspective. Typically, researchers in perception simply accept the apparent physical world particularly as it is described in those branches of physics concerned with electromagnetic energy, optics, and mechanics. The problems they consider relate to the process whereby percepts are formed from the interaction of physical energy (for example, light) with the perceiving organism. Of further interest is the degree of correspondence between percepts and the physical objects to which they ordinarily relate. How accurately, for example, does the visually perceived size of an object match its physical size as measured (e.g., with a yardstick)?",
  "Questions of the latter sort imply that perceptual experiences typically have external referents and that they are meaningfully organized, most often as objects. Meaningful objects, such as trees, faces, books, tables, and dogs, are normally seen rather than separately perceived as the dots, lines, colours, and other elements of which they are composed. In the language of Gestalt psychologists, immediate human experience is of organized wholes ( Gestalten ), not of collections of elements.",
  "A major goal of Gestalt theory in the 20th century was to specify the brain processes that might account for the organization of perception. Gestalt theorists, chief among them the German-U.S. psychologist and philosopher, the founder of Gestalt theory, Max Wertheimer and the German-U.S. psychologists Kurt Koffka and Wolfgang Köhler, rejected the earlier assumption that perceptual organization was the product of learned relationships (associations), the constituent elements of which were called simple sensations. Although Gestaltists agreed that simple sensations logically could be understood to comprise organized percepts, they argued that percepts themselves were basic to experience. One does not perceive so many discrete dots (as simple sensations), for example; the percept is that of a dotted line.",
  "Without denying that learning can play some role in perception, many theorists took the position that perceptual organization reflects innate properties of the brain itself. Indeed, perception and brain functions were held by Gestaltists to be formally identical (or isomorphic), so much so that to study perception is to study the brain. Much contemporary research in perception is directed toward inferring specific features of brain function from such behaviour as the reports (introspections) people give of their sensory experiences. More and more such inferences are gratifyingly being matched with physiological observations of the brain itself.",
  "Many investigators relied heavily on introspective reports, treating them as though they were objective descriptions of public events. Serious doubts were raised in the 1920s about this use of introspection by the U.S. psychologist John B. Watson and others, who argued that it yielded only subjective accounts and that percepts are inevitably private experiences and lack the objectivity commonly required of scientific disciplines. In response to objections about subjectivism, there arose an approach known as behaviourism that restricts its data to objective descriptions or measurements of the overt behaviour of organisms other than the experimenter himself. Verbal reports are not excluded from consideration as long as they are treated strictly as public (objective) behaviour and are not interpreted as literal, reliable descriptions of the speaker’s private (subjective, introspective) experience. The behaviouristic approach does not rule out the scientific investigation of perception; instead, it modestly relegates perceptual events to the status of inferences. Percepts of others manifestly cannot be observed, though their properties can be inferred from observable behaviour (verbal and nonverbal).",
  "One legacy of behaviourism in contemporary research on perception is a heavy reliance on very simple responses (often nonverbal), such as the pressing of a button or a lever. One advantage of this Spartan approach is that it can be applied to organisms other than man and to human infants (who also cannot give verbal reports). This restriction does not, however, cut off the researcher from the rich supply of hypotheses about perception that derive from his own introspections. Behaviourism does not proscribe sources of hypotheses; it simply specifies that only objective data are to be used in testing those hypotheses.",
  "Behaviouristic methods for studying perception are apt to call minimally on the complex, subjective, so-called higher mental processes that seem characteristic of adult human beings; they thus tend to dehumanize perceptual theory and research. Thus, when attention is limited to objective stimuli and responses, parallels can readily be drawn between perceiving (by living organisms) and information processing (by such devices as electronic computers). Indeed, it is from this information-processing approach that some of the more intriguing theoretical contributions (e.g., abstract models of perception) are currently being made. It is expected that such practical applications as the development of artificial “eyes” for the blind may emerge from these man–machine analogies. Computer-based machines that can discriminate among visual patterns already have been constructed, such as those that “read” the code numbers on bank checks.",
  "Many philosophers and psychologists have commonly accepted as fundamental a distinction made on rational grounds between sensing and perceiving (or between sensations and percepts). To demonstrate empirically that sensing and perceiving are indeed different, however, is quite another matter. It is often said, for example, that sensations are simple and that percepts are complex. Yet, only if there is offered some agreed upon (a priori) basis for separating experiences into two categories—sensations and percepts—can experimental procedures demonstrate that the items in one category are “simpler” than those in the other. Clearly, the arbitrary basis for the initial categorization itself cannot be subjected to empirical test. (See also sensory reception .)",
  "Problems of verification aside, the simplicity–complexity distinction derives from the assumption that percepts are constructed of simple elements that have been joined through association. Presumably, the trained introspectionist can dissociate the constituent elements of a percept from one another, and in so doing, experience them as simple, raw sensations. Efforts to approach the experience of simple sensations might also be made by presenting very simple, brief, isolated stimuli; e.g., flashes of light.",
  "Another commonly offered basis for distinction is the notion that perceiving is subject to the influence of learning while sensing is not. It might be said that the sensations generated by a particular stimulus will be essentially the same from one time to the next (barring fatigue or other temporary changes in sensitivity), while the resulting percepts may vary considerably, depending on what has been learned between one occasion and the next.",
  "Some psychologists have characterized percepts as typically related to external objects and sensations as more nearly subjective, personal, internally localized experiences. Thus, a spontaneous pain in the finger would be called a sensation; however, if the salient feature of experience is that of a painfully sharp, pointed object, such as a pin located “out there,” it would be called a percept.",
  "The above definitional criteria all relate to properties of experience; that is, they are psychological. An alternative way of distinguishing between sensing and perceiving that has become widely accepted is physiological-anatomical rather than psychological. In this case, sensations are identified with neural events occurring immediately beyond the sense organ, whereas percepts are identified with activity farther “upstream” in the nervous system, at the level of the brain. This assignment of anatomical locations to sensory and to perceptual processes seems consistent with psychological criteria. That is, the complexity and variability of percepts (both a product of learning) are attributed to the potential for physiological modification inherent in the vastly complex neural circuitry of the brain.",
  "Clearly, many subjective processes (such as problem solving) take time to run their courses. This is true even for such relatively simple activities as perceptual discriminations in the size of different objects. It is not readily apparent, however, whether percepts themselves—which, for example, might enter as elements in problem solving—take time to form. To the naıve observer, percepts probably do seem essentially instantaneous: the moment a square is shown, a square seems to be seen. Yet, experimental evidence suggests that percepts, even of simple geometric forms, follow a measurable, developmental time course. In some instances the temporal development of percepts is relatively long (on the order of seconds), and in some it is quite brief (on the order of thousandths of a second).",
  " Pictures that are incomplete or ambiguous provide good examples of relatively long-term temporal development of percepts. Look at Figure 1 and continue looking until you see something more than a pattern of black, gray, and white patches. Abruptly, you probably will perceive a familiar face that, on subsequent viewing, will reappear to you without difficulty. How long it takes for such a percept to develop will vary considerably from one person to another, perhaps revealing fundamental differences among individuals in their speed of perceptual processing. It might be instructive to show Figure 1 to several people, and with the aid of a stopwatch, measure the time it takes each of them to achieve the desired percept, both initially and then on some later occasion. ( Figure 1 commonly is seen by most people as the face of Abraham Lincoln.)",
  "A somewhat different way in which percepts may change with time is illustrated in illusion and hallucination . On initial viewing of this type of drawing, one will probably immediately see a meaningful picture. After continued gazing at the drawing, the initial percept may abruptly be replaced by another. Thereafter, the two percepts should alternate with the passage of time. Stimuli of this sort (which can yield more than one percept) raise such questions as, for example, what determines the initial percept; why do some people first see a vase whereas others see two profiles; why does the initial percept give way to the alternate; what determines the rate of fluctuation from one percept to the other; do differences from one person to another in the rate of fluctuation of ambiguous figures indicate fundamental differences in perceptual activity? Tentative answers to such questions continue to be proposed.",
  "Instances of slowly developing percepts require relatively simple procedures to uncover. Those percepts with a very rapid time course may be studied with the aid of instruments known as tachistoscopes that permit the durations of visual stimuli to be precisely controlled. Sophisticated electronic tachistoscopes flash reliably for periods as brief as one millisecond (one-thousandth of a second). Such precision permits study of the short-term development (microgenesis) of such percepts as those of simple geometric figures. Thus, it has been found that perception of a small black disk is disrupted (masked) by the rapidly successive tachistoscopic presentation of a second stimulus: a black ring that fits snugly around the disk. Indeed, as far as experimental subjects can tell, the disk target simply does not appear, though when flashed without being followed by the ring, it is readily detectable. Other target and mask stimuli also have been successfully employed.",
  "It has been theorized that it takes time for any percept to develop; that one’s experience of a figure such as a disk develops from the figure’s centre outward; that one’s percept of the disk becomes stable only when the outer contour is appreciated; and that the ring functions in backward masking (metacontrast) because in the course of its own emergence as a percept the inner contour of the ring “absorbs” the perceptually developing contour of the disk. (Unless the viewer becomes aware of its contour, the disk theoretically cannot be perceived.) This interpretation is consistent with evidence of an optimal time interval between disk and ring onsets (about 30 to 50 milliseconds) for the best masking effect. Thus, masking is most evident at the moment developing awareness of disk contour is held to coincide in space and time with the initial perceptual growth of the ring’s inner contour. If the ring is presented too soon or too late, theoretically, the contour absorption on which masking presumably depends is ineffective.",
  "While such theories are controversial, masking experiments in general do clearly indicate that in human beings there is a brief period (100 to 200 milliseconds at most) during which a percept is highly vulnerable to disruption. Whatever its exact mechanism, the phenomenon of masking manifestly demonstrates that percepts do not emerge instantaneously and full-blown at the moment of sensory stimulation. Thus, assuming that percepts are synthesized from simpler elements, relatively complex percepts would be expected to take longest to develop and, hence, to be most vulnerable to masking. Yet empirical studies show just the opposite, indicating that the more complex the visual target, the more difficult it is to mask.",
  "The organization apparent in percepts has been attributed by some to learning, as being built up through arbitrary associations of elements that have repeatedly occurred together in the person’s experience. Other theorists (particularly Gestaltists) stress the view that perceptual organization is physiologically inborn, being inherent in innate aspects of brain functioning rather than depending on a synthesizing process of learning to combine simpler elements into more complex, integrated wholes. One way of resolving such theoretical disputes would be to deprive people from birth of all visual sensory experience and, hence, of all opportunity for visual perceptual learning. Then at the time normal sensory function was restored, they would need to be tested to determine what perceptual functions, if any, were intact. Such a strategy was proposed in a letter to the British philosopher John Locke by a fellow philosopher William Molyneux in 1690. Molyneux’s suggestion waited until the 20th century to be taken seriously, after surgical methods had been found to restore the sight of people born blind because of cataract (clouded lens within the eye).",
  "After removal of their cataracts, such newly sighted people are found to be normally sensitive to changes in intensity of illumination and to colour. Though they are able initially to tell when a figure is present, they cannot at first discriminate one simple shape from another, nor can they readily remember the shape of a just-exposed object. This deficiency extends to such socially important visual stimuli as people’s faces. Only after a long and painstaking period of experience—perhaps of several months duration—do such seemingly primitive visual performances as discriminating a square from a triangle come easily. Until then, the person must count corners, for example, to achieve accurate discrimination.",
  "Findings derived from cataract surgery have provided a rich source of hypotheses for further research, including posited neurophysiological mechanisms (e.g., assemblies of brain cells) that might serve as the medium for the structural changes presumed to accompany perceptual learning. This situation led to experimental attempts to show how, through repeated stimulation, the perceptual system could progress from performance of only very primitive functions to the highly complex operations (such as form identification and discrimination) that are characteristic of the mature organism.",
  "A host of experiments using laboratory animals as subjects (e.g., pigeons, rats, cats, dogs, monkeys, and chimpanzees) have been conducted to determine, under rigorous experimental control, the extent to which learning early in life contributes to later perceptual functioning. By analogy with humans born with cataract, such animals were deprived of visual experience from as close to birth (or hatching) as possible; e.g., chimpanzees were reared in darkness. In another type of experiment, animals were reared in environments that provided more than the normal amount and variety of stimulation or were exposed to specific stimuli they might not ordinarily encounter. These research strategies are said to provide impoverished or enriched environments. Experiments of both sorts have consistently provided verification of the general hypothesis that early perceptual experience plays an important role in later perceptual (as well as intellectual and emotional) development, even producing changes in brain weight and biochemistry. This research also offers a strong scientific rationale for efforts to enrich the environments of so-called disadvantaged or culturally deprived children.",
  "Studies of human infants indicate that their early perceptual experiences are not the “blooming, buzzing confusion” postulated by the U.S. psychologist William James late in the 19th and early in the 20th century. Rather, even infants one or two days old are capable of refined visual discriminations. Recording of the infants’ visual fixations as their eyes move indicates them to have reliable preference for one paired stimulus over another, giving evidence of visual discrimination. Research employing this technique shows that preferences among various visual patterns or shapes generally are related to the complexity and novelty of the stimuli, for infants and for older human subjects as well. Evidence of this sort seems out of keeping with the findings of cataract surgery, which suggest that figural discrimination is not innate for the visually naïve. It may be, however, that adults who were blind with cataracts at birth suffer more than mere lack of normal visual experience; they are not quite comparable to visually naïve, but otherwise intact, infants. It may be that visual experience is necessary, not to generate pattern perception but to maintain it; that is, the infant’s built-in (innate) perceptual abilities may somehow deteriorate through disuse.",
  "Similar research has dealt with visual depth perception in laboratory animals and human babies. One technique (the visual cliff) depends on the evident reluctance of young animals to step off the edge of what seems to be a steep cliff. The so-called visual cliff apparatus in one of its versions consists of a narrow platform on which the subject is placed and two wide platforms on either side of it. Although both flanking platforms are equally and only slightly lower than the central platform, the subject sees visual patterns designed so that one looks much deeper than the other. Typically, the subject explores the central platform and then investigates the flanks, finally stepping down onto the shallow-appearing side. By this response, the subject indicates sensitivity to visual depth cues. To discover if prior visual experience is necessary for the typical avoidance of the flanking platform that looks deepest requires subjects able to locomote well from the start (e.g., chicks) or those deprived of visual experience (e.g., rats) until their locomotor ability has developed. Research with the visual cliff clearly demonstrates the presence of depth perception in visually naıve subjects.",
  "In summary, there is evidence among cataract sufferers of the necessity of early visual experience in human visual pattern discrimination; laboratory animals reared in impoverished or enriched environments demonstrate the importance (if not necessity) of early visual stimulation for perceptual development; human infants and other visually naïve animals behave as if they are innately capable of pattern and depth perception (e.g., without the need for learning). These data together suggest that some basic visual functions, including pattern perception, are built in but that visual experience serves to maintain and elaborate them.",
  "In a theory called structuralism, that everyday perceptual experience is structured or synthesized from “sensations,” psychologists such as the English-U.S. introspectionistic psychologist Edward Bradford Titchener even devised a formal method of introspection for experimentally analyzing (or taking apart) percepts in an effort to reveal their constituent elements. The procedure required that the introspecting experimental subjects learn to avoid reporting on their experiences as they naıvely seemed. To establish this way of treating experience required careful training. One consequence of this training is that the observer’s introspective reports may be contaminated by his expectations and hence may, in all honesty, reflect little more than his theoretical biases.",
  "But the problem remains interesting: If percepts are indeed syntheses of simpler elements, can those elements be made to appear in experience? If so, what will they turn out to be? Can this problem be investigated without recourse to the structuralist’s method of introspection and reliance on the reports of strongly biassed observers?",
  "Evidence that percepts have constituent elements emerged serendipitously from research on stabilized retinal images. The image cast on the retina of the eye by a fixed object normally is continually moving because the perceiver himself is always in motion. Even when dampened by physical restraint, some residual movement will be left, attributable largely to high-frequency tremors (nystagmus) of the eyeballs. If the perceiver functioned as if he were a camera, the normal instability of the retinal image would produce a blurred percept and a concomitant impairment of visual acuity.",
  "It is not feasible to eliminate eye movements, but it is possible to stabilize or fix the location of the retinal image by coupling the source of the image to the eyeball itself. An optical lever system can be so adjusted that when the eye moves the image source moves with it, and potential motion in the retinal image is eliminated. As expected, visual acuity is slightly enhanced when the retinal image is kept motionless. A remarkable, unexpected finding, however, was that such stabilized images rapidly seem to disappear, the perceiver losing awareness of them. It would seem that some movement in retinal image is needed to maintain perception over extended periods of time.",
  "One limitation of the optical lever system is that it permits the use of only very simple targets, such as straight, vertical lines. With a different device (in effect, a miniature projector attached to the eyeball), stabilized images of complex patterns may be presented. Complex patterns are found to produce percepts that are relatively slow to deteriorate; furthermore, they do not disappear in toto. The manner of the fragmentation is perhaps revealing of the way in which complex percepts are synthesized. Speaking metaphorically, observing how percepts “come apart” under retinal stabilization may be very much like discovering the structure of a rock by striking it with a powerful hammer blow.",
  "Indeed, under retinal stabilization, single lines seem to disappear and reappear in a unitary (altogether) fashion. In a figure comprised of several lines (say, a square), percepts of parallel lines are likely to disappear and reappear together; proximity also affects the joint perceptual fate of pairs of lines. Retinally stabilized segments of such geometric figures as circles and triangles can seem to disappear and reappear without implicating the entire figure. In the disappearance of percepts of triangles, lines rather than angles are the functional units. (This finding is embarrassing to earlier theorizing about the crucial role of angles in the development of the neural network underlying the percept of a triangle.)",
  "Clearly, with stabilized images, the constituent perceptual elements of complex geometric forms are lines, straight or curved; and lines with the same orientation are likely to have similar perceptual fates, as though forming a higher-order component of complex patterns than do individual lines. These conclusions are remarkably similar to those drawn from studies of the effect of visual stimuli on the electrical activity of single neurons in the cerebral cortex. A finding of major theoretical significance is the failure of percepts of circles, squares, and triangles to act as units. Such percepts are treated in classical Gestalt theory, however, as though they are basic and unitary and not readily decomposable.",
  "Gestalt theory was meant to have general applicability; its main tenets, however, were induced almost exclusively from observations on visual perception. Whatever their ultimate theoretical significance, these observations have been raised to the level of general principles. It is conventional to refer to them as Gestalt principles of perceptual organization.",
  "The overriding theme of the theory is that stimulation is perceived in organized or configurational terms ( Gestalt in German means “configuration”). Patterns take precedence over elements and have properties that are not inherent in the elements themselves. One does not merely perceive dots; he perceives a dotted line. This notion is captured in a phrase often used to characterize Gestalt theory: “The whole is more than the sum of its parts.”",
  "Of the many principles of organization that have been enunciated by various Gestalt theorists, the most general is referred to as Prägnanz . In effect, according to the principle of Prägnanz , the particular perceptual configuration achieved, out of a myriad of potential configurations, will be as good as prevailing conditions permit. What constitutes a “good” configuration, or a poor one, is unfortunately not clearly specified, though several properties of good configurations can be listed, chief among them being simplicity, stability, regularity, symmetry, continuity, and unity. What happens when these properties of figures come into conflict is not specified, but should be possible to determine empirically.",
  "The principle of closure often operates in the service of Prägnanz ; for example, a circular figure with small gaps in it will be seen as a complete or closed circle. Similarly, if a portion of the image of a figure falls on the blind spot of the retina, a complete figure often will still be perceived. Some distortions from good configuration may be so large as to preclude closure; in those cases, the figures may be a source of tension for the observer.",
  "Prägnanz may also be achieved through good continuation; this principle describes a tendency for smooth continuity of contour to be dominant over discrete, irregular, abruptly changing contours. Thus, a figure composed of the overlapping outlines of an ellipse and a rectangle will probably be seen as such rather than as three figures, each with irregular, noncontinuous borders.",
  "Closure and good continuation represent two of the factors that are held to determine what percepts will emerge from a complex stimulus. Implicit in them (and in the general principle of Prägnanz ) is the assumption that whenever possible some figure will be perceived; more specifically, that the visual field will be articulated into figures and patterns of figures. It is understood that such emerging patterns are not in the stimulus. Although they are permitted by the stimulus, they are created by the perceptual system; that is, by the perceiver himself.",
  " Examples of Gestalt principles of organization Examples of Gestalt principles of organization. In the illustrations in Figure 2 , in the panel on the left, the vertical distance between elements is less than the horizontal distance. By virtue of this differential proximity, the elements become perceptually organized into columns. In the right-hand panel, similarity, another principle of organization, is operative. Here, by virtue of similarity in brightness, the visual field tends to be perceptually articulated into alternating sets of black and gray rows.",
  "It is not at all obvious why organization by similarity should occur; physical stimulation allows but does not demand it. Clearly in that case the articulation of the visual field into columns reflects a tendency in the perceptual system itself. Organization by proximity may not seem to reveal anything more than a close correspondence between perception and stimulation. (Though as argued by the Gestalt theorist Kurt Koffka, it is not an adequate explanation to say that “things look as they do because they are what they are.”) Yet, when a proximity pattern like the one shown in Figure 2 was briefly presented and subjects were asked (under guise of another task) to reproduce what they saw, many people failed to indicate a differentiated percept of columns. Instead, they reproduced a homogeneous matrix of elements. After repeated exposures, some of those subjects began to draw proximity-based columns of elements. Organization according to the principle of proximity seems to be neither universal nor, for those who achieve it, immediate.",
  "In the latter experiment, people who failed to obtain the differentiated percept of columns scored significantly lower on a test of verbal intelligence than did those who succeeded at some point in the experiment. Perhaps the Gestalt principles of organization apply to perceivers (such as Gestalt theorists) whose intellectual development has reached a high degree of maturity. When organized percepts are easy to come by, gradations in intelligence do not seem to matter; when some barrier to organization is imposed (as by brief stimulus exposure), however, then the effect on perception of such differences among individuals may show up.",
  "If people see a pattern of columns in the left panel of Figure 2 because that is how the stimulus is constructed, then why do some people not see it that way? Both achieving and failing to achieve an organized percept must be explained. Surely, part of the explanation must lie in the nature of the perceptual process itself. Thus, the experimental results indicate that perceptual organization is not universal and immediate; rather, they support the major tenet of Gestalt theory that things look as they do because of the organization imposed by the perceptual process (e.g., by the perceiver).",
  "One Gestalt principle, that of common fate, depends on movement and is quite striking when observed. According to the principle of common fate, stimulus elements are likely to be perceived as a unit if they move together. An illustration of this principle is provided by a well-camouflaged object, such as a military vehicle; when stationary, the elements of the vehicle are integrated, through proximity, similarity, and so on, into patterns of background elements, and the object is difficult to detect. But it is easy to see it once it starts moving; with all of its elements moving in unison, the vehicle is readily perceived as a unitary figure, clearly segregated from its background.",
  "Movement is also at the heart of a set of observations of considerable significance in the historical development of Gestalt theory. These observations concern circumstances in which people perceive movement in the absence of actual physical motion of the stimulus. One familiar instance of this class of events is referred to as the phi phenomenon. In simplest form, the phi phenomenon can be demonstrated by successively turning two adjacent lights on and off. Given appropriate temporal and spatial relations between the two lights, an observer will perceive the first light as if it were moving from its location to that of the second light. The phi phenomenon is basic to the eye-catching displays used on theatre marquees and to cinematic and television presentations. The motion-picture screen, for example, presents a series of briefly flashed, still images; the movement people see is a creation of their own perceptual systems.",
  "It is the lack of one-to-one correspondence between stimulation and perception, as dramatically illustrated in the phi phenomenon, that underscores the Gestaltists’ dissatisfaction with stimulus-bound models of perception and their insistence on the priority of patterns and relations. What people perceive is determined not only by what is present at the point under direct observation but also by what is occurring in the total stimulus context or display.",
  "One of the simplest instance of relational (or context) effects in perception is that of brightness contrast. Thus, the apparent brightness of a stimulus depends not only on its own luminance but also on that of the surrounding stimulation. The same gray square looks whiter against a dark background and blacker when placed in a bright surround. Similarly, a white or gray patch will take on an apparent hue that is complementary to the colour of the surround (e.g., the patch will seem tinged with yellow when it is placed against a blue background).",
  "Analogous context effects are evident in many commonplace experiences. A man of average height seems to be a runt when he is on a basketball court with much taller players; yet the same man looms like a giant when refereeing a game played by little boys. It is known that a typical winter’s day seems delightfully balmy when temperatures rise after a week of subfreezing weather.",
  "To the Gestaltist, contrast effects dramatize the relational nature of perception. They also play a significant role in a more recently developed adaptation-level theory, which also provides a general perceptual model. At the core of the model is the notion that the manner in which a stimulus is perceived depends not only on its own physical characteristics but also on those of surrounding stimuli and of stimuli previously experienced by the observer. In other words, the perceiver is said to be perceptually adapted to past sensory stimuli; his adaptation level forms a kind of zero point against which any new stimulus is perceived. An example is provided by the almost overwhelming silence one experiences when the sound of an air conditioner (to which he has adapted) suddenly ceases.",
  "Gestalt theorists also attached significance to the observer’s history of stimulation; indeed, some of them interpreted so-called figural aftereffects within a Gestaltist model of brain functioning. Figural aftereffects refer to changes in the perceived shape or location of a figure following its inspection; for example, a curved line will appear to get straighter after prolonged inspection. Or the distance between two parallel lines seems to change as an aftereffect of previous inspection.",
  "In a typical experiment one looks at a point adjacent to a dark vertical bar (the inspection figure) on a screen. Following this inspection period, the dark bar is replaced by two identical pairs of vertical lines, one pair on either side of the region where the bar had been, the second pair alongside in a region not previously exposed to the inspection figure. The subject again fixates the same point. A figural aftereffect shows up as a greater apparent distance between the pair of lines surrounding the region of the inspection figure even though the other pair is actually identical. This distortion is not simply a generalized contrast effect because it occurs only in the small area along the borders of the inspection figure; that is, the effect is localized and restricted.",
  "It thus has been speculated that visual exposure to a figure induces in the brain a condition of localized satiation. The passage of electrical activity is assumed to be impeded in satiated areas of the brain. Moreover, it is postulated that the perceived distance between two borders of a figure is directly related to the time it takes for electrical currents to pass between them. Thus, it is held that one effect of satiation is to increase the apparent distance between the borders of a figure that straddles a satiated region. Whatever the merits of such physiological speculations, they have stimulated a vast amount of research on figural aftereffects. Good evidence for similar effects in other senses, such as touch, also has been obtained. Clearly, perception can be influenced not only by the context of current background but also by the residues (after-effects) of previous stimulation.",
  "Concurrent visual stimulation may modify one’s acuity in detecting auditory stimuli. Similar interactions are claimed to occur for other combinations of senses. Some dentists report success in using audioanalgesia, in which stimulation with sound waves is said to reduce the experience of pain in the mouth. The high specificity of some of the reported sensory interactions seems to preclude an explanation that concurrent stimulation works by changing the subject’s general level of alertness. However these intersensory effects might be mediated, they do suggest that the brain does not function as a collection of entirely independent sensory channels. As a physical system, the brain follows physical principles; thus overlapping and spreading or waning fields of neural excitation in the brain have been theorized to underlie such phenomena as closure and audioanalgesia. Köhler referred to these models of neural analogues of perceptual phenomena as physical Gestalten; unfortunately, there is little direct physiological evidence for them.",
  "An alternative to field effects in brain functioning is the assumption that local stimulation gives rise, in one-to-one fashion, to a mosaic of local responses. Implicit in the mosaic hypothesis is a kind of telephone switchboard model of the brain as a machine in which the electrical activity is strictly confined to separate pathways of neurons that are well insulated (isolated) from one another. The Gestaltists rejected this model because in its early formulations it did not explain intersensory and intrasensory perceptual phenomena. A more sophisticated machine model, however, provides for fieldlike effects through the operation of complex networks of neural elements. It is held that electrical activity remains confined to discrete pathways, but that these pathways do not simply travel straight through the system; that they also interconnect, with both excitatory and inhibitory consequences. Supporting evidence comes from records of the electrical activity in single neurons in the cat brain; when the cat’s eye is probed by a small spot of light, a specific area on the retina can be found that serves to excite a given brain neuron.",
  "Further mapping of the cat retina often uncovers inhibitory areas adjacent to the one that is excitatory; that is, when light strikes those retinal areas the activity in the brain neuron being monitored is depressed. The excitatory and inhibitory areas thus comprise the brain neuron’s retinal receptive field. Analogous inhibitory effects have also been found in research on the eye of the crab, Limulus . Such context effects as brightness contrast could be based on these simple inhibitory mechanisms. It remains to be seen, however, just how many perceptual phenomena that fit Gestalt field theory also can be handled by sophisticated variants of the machine or mosaic model.",
  "Even though the retinal image of a receding automobile shrinks in size, the normal, experienced person perceives the size of the object to remain constant. Indeed, one of the most impressive features of perceiving is the tendency of objects to appear stable in the face of their continually changing stimulus features. Though a dinner plate itself does not change, its image on the retina undergoes considerable changes in shape and size as the perceiver and plate move. What is noteworthy is stability in perception despite gross instability in stimulation. Such matches between the object as it is perceived and the object as it is understood to actually exist (regardless of transformations in the energy of stimulation) are called perceptual constancies.",
  "Dimensions of visual experience that exhibit constancy include size, shape, brightness, and colour. Perceptual constancy tends to prevail for these dimensions as long as the observer has appropriate contextual cues; for example, perception of size constancy depends on cues that allow one a valid assessment of his distance from the object. With distance accurately perceived, the apparent size of an object tends to remain remarkably stable, especially for highly familiar objects that have a standard size. Thus, people’s heads all tend to look the same size regardless of distance; similarly, an object identified as a lump of coal tends to look black even when intensely illuminated.",
  "The experience of constancy may break down under extreme conditions. If distance is sufficiently great, for example, the perceived size of objects will decrease; thus, viewed from an airplane in flight, there seem to be “toy” houses, cars, and people below. To the extent that they prevail, the constancies lend the perceiver’s experience and behaviour relative stability. Imagine an alternative, kaleidoscopic perceptual world in which everything seems to change, solid objects apparently swelling, shrinking, and warping with every movement. Breakdown in perceptual constancy seems to complicate the course of some psychiatric disorders in which the perceptual boundary between the sufferer and the external world is weakened. Normal constancies also can be intentionally overcome, as in paintings of flabby watches and distorted people that apparently depict the unique perceptual world of the artist.",
  "Theoretical assertions about perceiving are often made as though they apply indiscriminately to all organisms, or at least to all people. Perhaps perceptual principles of such great generality eventually will be uncovered. In the meantime it is evident that there are clear differences in perceptual functioning among individuals, among classes of individuals, and within the same individual from one occasion to another.",
  "That perceptual functioning should change with the perceiver’s age is expected on the grounds that psychological development stems from maturation and learning. Indeed, empirical evidence for age-related changes in perceiving is substantial. There are, for example, reliable data that perceptual constancies are enhanced with the person’s increasing age, improvement leveling off at about age ten. Similarly, there is a great deal of evidence for both decreased and increased susceptibility to various optical illusions with increasing age. Those illusions that become less pronounced with increasing age probably depend on the subject’s changes in scanning and on his increased ability to segregate parts of a pattern from one another; illusions that become more pronounced probably reflect the operation of expectancies that develop through experience. Anatomical and physiological changes in the eye itself also may account for some age-related perceptual changes.",
  "Historically, the perceptual role of learning was a source of controversy. Vigorous denials that perceiving is influenced by learning are found in arguments of early Gestalt psychologists (e.g., Max Wertheimer, 1880–1943, a German). By contrast, heavy reliance is placed on learning processes in the writings of the German philosopher and scientist H.L.F. von Helmholtz (1821–94). Today, there is virtually full agreement that perceiving is modified by learning. Disputes now focus on the process of perceptual learning itself. Most theoretical alternatives reflect two underlying themes: discovery and enrichment. The discovery thesis is reflected in Eleanor J. Gibson’s view that perceptual learning is a process of discovering how to transform previously overlooked potentials of sensory stimulation into effective information. Enrichment theories depict perceptual learning as enriching sensory experience with specific associations and with rules for its interpretation that derive from past experience. Discovery theories propose that perceptual modification results from learning to respond to new aspects of sensory stimuli, while enrichment theories hold that such modification results from learning to respond differently to the same sensory stimuli.",
  "Direct confrontations of these positions are rare, their advocates tending to differ in their selection of experimental procedures and learning situations. It may be that discovery and enrichment theories are compatible, simply accounting for different forms of perceptual learning.",
  "General acceptance of the perceptual role of learning should not be taken to endorse the claim that perceiving originally depends on learning. Indeed, studies of human newborn and very young infants indicate highly organized and stable perceptual functions. Learning is to be regarded as supplementary to unlearned factors that mediate perceiving.",
  "The most direct examination of perceptual learning is provided by investigating the effects of practice. In so-called detection tasks the observer is required to detect the presence or absence of a selected stimulus. For example, effects of practice on visual acuity were studied by requiring observers to detect simple orientation (left or right) in a row of leaning letters; e.g., . Practice tended to lower acuity thresholds, defined as the lowest intensity of illumination at which each observer could detect the orientation. Or, observers were asked to say when they just could see that an approaching pair of parallel bars was double. With practice they continued to report seeing the narrow space between the bars at increasing distances. Such improvements suggest that sensitivity to simple (unidimensional) stimuli is not immutable, being modifiable through practice.",
  "Improvement is not limited to simple variables. In one visual-search procedure, subjects scanned a long list of letters to find a single letter that appeared only once. Search time was reduced by a factor of 10 following extensive practice, after which 10 different letters could be detected as quickly as a single letter. Practice effects with complex targets also have been studied. In one experiment, two rows of figures were displayed on each trial, one with four simple outlines of geometrical figures, the other containing three complicated figures. Subjects were to guess or detect which one of the simple figures was concealed (embedded) in all three of the complex figures. Again, ability to identify the correct simple figure improved with practice.",
  "Tasks involving absolute judgment require much more of the observer than does simple or complex detection. For example, he may be asked to estimate the diameters of circular targets numerically (e.g., in inches or centimetres). In a similar study, two groups of subjects made absolute judgments of widely varying distances outdoors, both before and after interpolated activity. One group spent the interpolated period estimating a large number of other distances, none the same as in the original series. The other group spent the interval on unrelated paper-and-pencil work. In the first (extra-practice) group, judgments became more accurate and less variable than among the pencil-and-paper workers. Increased precision following practice also has been reported for absolute judgments of odour intensities, and of multidimensional visual (colour) and auditory stimuli. Improvement with practice is observed even when the subject remains uninformed of his accuracy; correcting him seems to confer slight benefit.",
  "Many studies have failed to establish a clear basis for observed improvements in altered perceptual sensitivity or discriminability. For example, better performance on an acuity test may result from adopting a new criterion of visual doubleness or from learning how to use characteristics of blur to infer slant among leaning Es. Such uncertainties cloud the theoretical and practical significance of much available data.",
  "U.S. psychologist William James (1842–1910) probably introduced the notion that practice in labelling stimuli can alter their discriminability. Indeed, sometimes vague visual forms that are distinctively named are easier to discriminate (acquired distinctiveness). If several such stimuli have the same verbal label, discriminability may be reduced (acquired equivalence).",
  "Labelling effects in the laboratory have been discouragingly fragile, however, and factors that favour them are poorly understood. Perhaps labelling affects one’s efforts to discover distinguishing characteristics of stimuli. Having him learn distinctive labels may encourage him to analyze sensory features more fully. Or it may be that he begins to perceive a compound stimulus that includes the visual form and its associated label. If labels differ, the presumed compound stimuli are different, and discrimination should be enhanced. These hypotheses express both the discovery and enrichment theses.",
  "According to one version of the enrichment thesis, exposure to recurrent regularities among stimuli prompts one to assume specific relationships between the environment and his sensory experience. For example, one learns that a continuous sequence of projective transformation (e.g., the circular profile of a dinner plate seems to become elliptical) is associated with changing positions of the object in view, or that continuous symmetrical expansion of the retinal image is associated with approach. In addition, one presumably learns to make assumptions about what is called reality; e.g., despite alterations in retinal image, one perceives the plate to stay the same size. Psychologists Adelbert Ames, Jr., and Egon Brunswik proposed that one perceives under the strong influence of his learned assumptions and inferences, these providing a context for evaluating sensory data (inputs). In keeping with enrichment theory, Brunswik and Ames contended that sensory stimuli alone inherently lack some of the information needed for mature, adaptive perceiving; enrichment was held necessary to reduce ambiguity.",
  " Much of the evidence for the contention that all perceiving is modified by one’s assumptions comes from investigations in which most of the visual, everyday stimuli are eliminated. Often, the subject may view an isolated target in total darkness or look at a motionless display while keeping his head steady. To show that learned assumptions about physical size affect perceived distance, the observer may be asked to judge how far he is from a rectangle of light displayed against total darkness. He is told at one time that the rectangle is a calling card; at another it is called a business envelope. His assumptions about these objects in relation to the size of his retinal image are invoked as prompting him to say that the “envelope” looks more distant than does the “calling card.” Dramatic examples of this effect were invented by Ames, including his famous distorted room (see Figure 3 ).",
  "Ames held that perceiving under unusual conditions (e.g., in a dark room) follows the same principles that govern more ordinary experience. The special conditions are said to permit experimental scrutiny of the same processes that are so difficult to examine under ordinary, uncontrolled conditions.",
  "An opposing view is that such perceptual assumptions and inferences operate only under specific experimental conditions. It is asserted that only when commonly available sources of information are eliminated is the subject forced to rely on assumptions.",
  "In the tradition of Helmholtz, Ames and Brunswik seemed to liken perceiving to reasoning, although not as a conscious process. They held that perceptual assumptions, once established, are influenced only slightly by logic. Although the floor and ceiling of the distorted room are sloped and all windows are of different size, it projects the same retinal pattern as a normal room; and a naıve subject will report that he sees an ordinary room. But even after he explores the room he remains likely to say it looks rectangular as before, despite his new information. Comparable observations have been reported for a variety of situations. Familiarization or instruction seems to have little effect on long-established perceptual assumptions.",
  "Psychoanalytic theory explicitly calls for motivational influences on such functions as memory, thinking, and perceiving. In particular, the theory is concerned with unconscious motives and conflicts and with unconscious defenses (such as repression) used to control them. According to the psychoanalytic hypothesis, there should be wide perceptual variation among individuals in response to stimuli that have motivational significance. At any rate, a host of experiments have been designed to show that perceiving is indeed subject to unconscious influences.",
  "In some studies, for example, it seemed that so-called obscene words flashed on a screen had to be exposed longer than apparently neutral (control) words before their meaning could be perceived. In the other studies, children of poor families have been found to overestimate the size of coins as compared with the judgments of children of richer families. One major problem with such research lies in finding or creating appropriate experimental and control stimuli. Considering differences in the use of language, for example, it is most unlikely that what once were widely called obscene words would currently evoke the conflicts and defenses of more than a few subjects.",
  "Assuming suitable stimuli can be found, an even more serious problem arises around the interpretation of the subjects’ behaviour; for example, do people really find it more difficult to recognize obscene words or are they simply reluctant to admit recognition? Problems of this sort have plagued researchers, and unambiguously interpretable experiments in this field are most difficult to produce. The hypothesis of such individual influences as motivation on perception remains appealing and viable, but unproved.",
  "Striking examples of perceptual learning are observed when one receives sensory data that contradict earlier experiences. For example, spectacles containing a wedge prism will bend light rays to displace images on the retina. An object thus will be seen as if it were somewhere other than its ordinarily perceived position. The subject’s initial attempts to touch the target will be misdirected, and there is a discrepancy between its location as seen and as felt. A right-angle prism will tilt the visual scene to any desired degree, altering the customary direction in which retinal images move. Usually, images of stationary objects move parallel to the direction of head movement; now their motion is at an angle to the head’s path.",
  "However, if an observer wears such eyeglasses for an extended period, objects no longer seem displaced, nor does the scene continue to appear tilted. The observer has adapted to the prismatic distortions and comes to perceive the environment as he did pre-experimentally. Similarly adaptation to the perceptual aftereffects rapidly occurs after the prism is removed in such experiments.",
  "Adaptation may be interpreted as perceptual learning that results from exposure to discrepancy. People who wear prism spectacles during active, self-initiated movement tend to show a greater degree of adaptation than do those who sit still or who are moved passively. Apparently conditions that heighten exposure to discrepancies facilitate adaptation. It seems likely that adaptation reflects a learning process during which the perceiver re-evaluates one or more sources of sensory information to reduce his experience of discrepancy. For example, information generated by receptors that respond to tension in skeletal muscles may be re-evaluated to resolve a discrepancy between felt and seen position.",
  "It often is suggested that adaptation to prism eyeglasses may involve the same processes that serve perceptual development in infants. Indeed, some conditions that experimentally facilitate adaptation to prism distortion also seem necessary for everyday perceptual development (e.g., active, self-initiated movement). In work reported by Richard Held ( Scientific American , November 1965), actively moving kittens developed visually guided movements normally. When each of these was yoked to a littermate that was pulled passively over the same path, the passive partner failed to develop normal perceptual function. Yet both kittens apparently received identical visual stimuli.",
  "The effects of learning on perceiving are varied. Most of these involve learning to respond to new stimuli or to make new responses to old stimuli. The one case consists of differentiating previously neglected stimulus characteristics; the other is a matter of re-evaluating stimuli and learning to respond to them differently.",
  "It is difficult to assess the degree to which differences related to the sex of the perceiver are biologically based or are the cultural product of traditional differences in sex role. Biological sex and sex role thus far have been hopelessly confounded in experiments with human subjects.",
  "Sex differences in perceiving, whatever their basis, can be illustrated in research on differences in the style with which people perceive. This stylistic difference emerges in extremes of response to context. If a person perceives the world as highly differentiated, he tends to resist contextual influences and is said to be field independent; the person who perceives in an extremely diffuse style, the field-dependent individual, tends to be highly susceptible to contextual effects. Thus, field-independent people are superior in locating a simple visual figure (e.g., a triangle) embedded in a complex pattern; similarly, field-independent subjects can better adjust a rod in a tilted frame to the true vertical when no other visual cues to verticality are present.",
  "Both age and sex are found to be implicated in these differences in perceptual style. Specifically, field dependence declines with increasing age, as does the closely related susceptibility to optical illusions. In North American studies, female subjects tend to be more field dependent than are males, especially after puberty. Perhaps these results are distinctive of cultures in which females are at least implicitly trained to be passive and perceptually diffuse, and in which males are encouraged to assume an active, perceptually articulated stance. This hypothesis has received some support in studies of the parent–child interactions characteristic of the early years of the two types of subject.",
  "Beyond sex differences in perceiving that seem to be culturally imposed, there is evidence for more general cultural influences on perception. The burden of much research is to show that the type of physical environment people construct for themselves or choose to inhabit can influence their style of perceiving. There are African groups (e.g., Zulu and San), for example, whose environments are virtually lacking in rectangular forms, by contrast with the carpentered, right-angled world of people in Western cultures. People in these African groups also make no use in their art work of two-dimensional representations of three-dimensional objects. Such differences in visual environments show up in tests of susceptibility to illusions. Zulu and San subjects are relatively resistant to those visual illusions that depend for their effectiveness on the subjects’ treating the lines comprising the pictures as borders of three-dimensional, rectangular objects. Analogous effects with different classes of illusion have been shown for other peoples who live in a perceptually unique environment.",
  "A clear presentation of Gestalt theory and its case against structuralism and behaviourism is found in Wolfgang Köhler , Gestalt Psychology: An Introduction to New Concepts in Modern Psychology (1947, reissued 1992). A comprehensive historical overview is available in Edwin G. Boring , Sensation and Perception in the History of Experimental Psychology (1942, reissued 1977). Illustrations and discussions of Gestalt principles of organization along with material on illusions, context effects, and related phenomena are provided in William N. Dember and Joel S. Warm , Psychology of Perception , 2nd ed. (1979); James J. Gibson , The Perception of the Visual World (1950, reissued 1974); and Julian E. Hochberg , Perception , 2nd ed. (1978). Also of interest are studies by Hermann von Helmholtz , Helmholtz’s Treatise on Physiological Optics , ed. by James P. Southall , 3 vol. (1924, reissued 1962; originally published in German, 3rd ed., 1909–11), the classic work on visual perception and its physiological basis; Shimon Ullman , The Interpretation of Visual Motion (1979), an original and accessible account of how we connect successive views of a moving object; and David Marr , Vision: A Computational Investigation into the Human Representation and Processing of Visual Information (1982), the book that triggered the computer revolution in vision science.",
  "Implications of research on early experience for perceptual and intellectual development are spelled out in J. McVicker Hunt , Intelligence and Experience (1961). Two excellent collections of technical articles, covering a wide range of topics, are Ralph Norman Haber (compiler), Contemporary Theory and Research in Visual Perception (1968), and Information-Processing Approaches to Visual Perception (1969). A scholarly discussion of depth perception and a lucid description of an elegant series of experiments are contained in Bela Julesz , Foundations of Cyclopean Perception (1971)."
]