[
  "  animal social behaviour , the suite of interactions that occur between two or more individual animals , usually of the same species , when they form simple aggregations, cooperate in sexual or parental behaviour, engage in disputes over territory and access to mates, or simply communicate across space.",
  "Social behaviour is defined by interaction, not by how organisms are distributed in space. Clumping of individuals is not a requirement for social behaviour, although it does increase opportunities for interaction. When a lone female moth emits a bouquet of pheromones to attract male potential mates, she is engaging in social behaviour. When a male red deer ( Cervus elaphus ) gives a loud roar to signal dominance and keep other males away, he is also being social.",
  "Animal social behaviour has piqued the interest of animal behaviorists and evolutionary biologists, and it has also engaged the public, thanks to life science filmmakers who captured the drama and stunning diversity of animal social interactions in documentaries and other media programs.",
  "Social behaviour ranges from simple attraction between individuals to life in complex societies characterized by division of labour, cooperation, altruism , and a great many individuals aiding the reproduction of a relative few. The most widely recognized forms of social behaviour, however, involve interaction within aggregations or groups of individuals. Social behaviours, their adaptive value, and their underlying mechanisms are of primary interest to scientists in the fields of animal behaviour , behavioral ecology, evolutionary psychology, and biological anthropology.",
  "The word social often connotes amicable interaction, accounting for the common misconception that social behaviour always involves cooperation toward some mutually beneficial end. Biologists no longer believe that cooperative behaviours necessarily evolve for the good of the species . Instead, they believe that the unit of natural selection is usually the individual and that social behaviour is fraught with competition . English naturalist Charles Darwin , who first brought evolution by natural selection to the attention of the world, introduced this paradigm for thinking about social behaviour, noting that it is the best competitors within a species, the “fittest” individuals, that survive and reproduce. Once genetics was integrated into this concept of evolution, it became apparent that such individuals will transmit the most copies of their genes to future generations.",
  "Consistent with Darwin’s ideas, social organisms are often seen to be fiercely competitive and aggressive. For example, friendly interactions among children on a playground can quickly dissolve into fierce competition if there are too few balls or swings. In addition, intense competitive interactions resulting in bodily harm can occur even among family members. Social behaviour is designed to enhance an individual’s ability to garner resources and form the alliances that help it to survive and to reproduce. The modern view of social behaviour is that it is a product of the competing interests of the individuals involved. Individuals evolve the capacity to behave selfishly and to cooperate or compete when it benefits them to do so. A delicate balance of cooperative and competitive behaviours is thus expected to characterize animal societies.",
  " Bison bonasus  Social behaviour encompasses a wide variety of interactions, from temporary feeding aggregations or mating swarms to multigenerational family groups with cooperative brood care. Over the years, there have been many attempts to classify the diversity of social interactions and understand the evolutionary progression of social behaviour.",
  "A series of veteran American entomologists—starting in the 1920s with William Morton Wheeler and continuing into the 1970s with Howard Evans, Charles Michener, and E.O. Wilson —developed a categorization of sociality following two routes, called the parasocial sequence and the subsocial sequence. This classification is based primarily on the involvement of insect parents with their young, whereas classifications of vertebrate sociality are frequently based on spacing behaviour or mating system. Both routes culminate in “eusociality,” a system in which the young are cared for cooperatively and the society is segregated into different castes that provide different services.",
  "In the parasocial sequence, adults of the same generation assist one another to varying degrees. At one end of the spectrum are females of communal species; these females cooperate in nest construction but rear their broods separately. In quasisocial species, broods are attended cooperatively, and each female may still reproduce. Semisocial species also practice cooperative brood care, but they possess within the colony a worker caste of individuals that never reproduce. Eusocial species typically engage in cooperative brood care; in addition, they have distinct castes that perform different functions and an overlap of generations within the colony.",
  "The subsocial sequence, the alternate route to eusociality, involves increasingly close association between females and their offspring. In primitively subsocial species, the female provides direct care for a time but departs before the young emerge as adults. This stage is followed by two intermediate subsocial stages: one where the care of young is extended to the point where the mother is present when her offspring mature, and the other where offspring are retained that assist in the rearing of additional broods. At the eusocial end of this sequence, some mature offspring are differentiated into a permanently sterile worker caste—a stage that mirrors the same eusocial outcome achieved by the parasocial sequence described above.",
  "E.O. Wilson, whose Sociobiology: The New Synthesis provided a blueprint for research in this field when it was published in 1975, felt that general classifications of societies invariably fail because they depend on the qualities chosen to divide species, which vary markedly from group to group. Instead, Wilson compiled a set of 10 essential qualities of sociality, including (1) group size, (2) distributions of different age and sex classes, (3) cohesiveness, (4) amount and pattern of connectedness, (5) “permeability,” or the degree to which societies interact with one another, (6) “compartmentalization,” or the extent to which subgroups operate as discrete units, (7) differentiation of roles among group members, (8) integration of behaviours within groups, (9) communication and information flow, and (10) fraction of time devoted to social behaviour as opposed to individual maintenance. These overlapping qualities of societies provide a good indication of the complexities involved with classifying, much less understanding, the highly varied social behaviour of animals.",
  "While categories of social behaviour can be useful, they can also be confusing and misleading. The current tendency is to view sociality as a multifaceted continuum from simple aggregations to the highly organized and complex levels of social organization found in eusocial species. Biologists interested in sociality focus on how cooperation increases an individual’s genetic legacy, either by increasing its ability to produce offspring directly or by increasing the number of offspring produced by relatives.",
  "The range of social behaviour is best understood by considering how sociality benefits the individuals involved. Because interacting with other individuals is inherently dangerous and potentially costly, both the costs and benefits of social behaviour and the costs and benefits of aggregating with others play a role in the evolution of aggregation.",
  "On the positive side, aggregation may provide individuals with increased access to food through information sharing and cooperative defense against non-group members. Conversely, close contact with members of the same species increases the risk of cannibalism , parasitism , and disease . This is illustrated by studies of cliff swallows ( Hirundo pyrrhonota ), which suggest that the original benefit of nesting near other individuals and forming colonies was information sharing and increased ability to exploit a highly variable insect food resource. Once colonies were formed, other benefits arose including more efficient detection of predators. These benefits are countered by several costs of coloniality, including increased susceptibility to ectoparasites (that is, parasites such as fleas and ticks that live on the body surface of the host), increased incidence of food stealing (kleptoparasitism), and the need to travel greater distances to foraging areas.",
  "Some costs and benefits overlap. For example, coloniality increases the opportunity for some males to mate with females other than their primary mate (extra-pair matings); it is a benefit for the males succeeding in obtaining extra-pair matings and a cost to the cuckolded males. Similarly, coloniality allows some females to lay eggs in the nests of other females in the colony (conspecific brood parasitism); it is beneficial to them but costly to the parasitized pair. The outcome of these multiple factors, which include the extent to which each individual involved is affected, is a delicate balance leading to wide variation in group sizes ranging from solitary nesting to nesting in colonies of several thousand pairs.",
  "In groups, potential benefits of efficient predator detection and prey acquisition may be diluted by the costs of sharing food and reproductive opportunities. Furthermore, all individuals within groups are not equal; as dominant individuals monopolize a group’s resources more effectively, group living becomes less beneficial for subordinates. If social behaviour is to be maintained in a population, even subordinate individuals must gain more from being social than from leaving the group and trying to survive and reproduce on their own.",
  "On the other hand, aggregation may be advantageous due to the energy saved by huddling during cold weather, increased survival through group defense, or increased ability to acquire, hold, and make efficient use of resources. Animals may aggregate by mutual attraction to each other, by mutual attraction to limited resources, or as a side effect of having hatched from eggs laid together in a clutch. In some cases more than one mechanism of attraction is involved. For example, bark beetles (family Scolytidae) form large aggregations by mutual attraction to the bark of a fallen log and also to the odours of other members of their species.",
  "Regardless of the mechanism of attraction, once animals are grouped there is selection to evolve increasing degrees of communication, cooperation, individual recognition, and efficiency to better exploit the potential advantages of group living. For example, in some treehopper (family Membracidae) aggregations, nymphs communicate the threat of a predator by using vibrations, which humans can detect only with electronic instruments. A more sophisticated form of communication is found in eastern tent caterpillars ( Malacosoma americanum ), which rest in a communal tent that increases in size as they grow and add silk . Colony members leave the tent on brief forays to feed on foliage within their tree, at which point they lay chemical trails that other group members follow to locate high-quality feeding sites. A similar kind of central-place foraging is practiced by some colonial birds, such as cliff swallows, among which unsuccessful individuals often cue in on other birds returning to their nest with food and follow them to productive foraging sites.",
  "In addition to feeding and defensive aggregations, some aggregations are based exclusively on mating. These include the explosive breeding assemblages of frogs and toads , the aggregations of male birds and mammals at leks (display sites used only for mating), and various insect aggregations including bees and wasps (order Hymenoptera), flies (order Diptera), and butterflies (superfamily Papilionoidea). Some species in each of these groups congregate at conspicuous landmarks visited by females. Frequently, the aggregation of one sex provides opportunities for the other. For example, when females aggregate due to the clumping of food or nest sites, males are likely to aggregate at these sites as well because they are the most efficient places to find females with which to mate.",
  "Other groups include flocks or herds that form during migration and coalitions that form due to group advantages in holding or acquiring a reproductive vacancy. Coalitions of male African lions ( Panthera leo ) that compete for control of groups of females (called prides) are a classic example of the latter. Migration in herds is common and can involve tremendous numbers of individuals. For example, more than one million blue wildebeest (gnu; Connochaetes taurinus ) typically migrate in a clockwise fashion over the plains of East Africa, covering a distance of over 2,500 km (about 1,550 miles) each year in search of rain-ripened grass. The record size for migratory aggregations is probably the African desert locust ( Schistocerca gregaria ), which forms huge swarms covering as much as 200 square km (about 80 square miles); each swarm contains upward of 10 billion individuals moving more or less cohesively in search of food. Among vertebrates , the largest known aggregations were probably those of the now-extinct passenger pigeon ( Ectopistes migratorius ) of North America. Vast groups of these birds migrating together in search of food, particularly large acorn crops, reportedly exceeded three to five billion individuals.",
  "When group members are genetically related, interactions will potentially involve nepotism, the tendency for individuals to favour kin. Examples of this sort of favouritism include parents favouring their own offspring, siblings forming alliances, and a tendency for individuals to favour their closest relatives. In Siberian jays ( Perisoreus infaustus ), parents tolerate their offspring on their territories for up to three years, allowing them preferential access to food. Like the African lions mentioned previously, acorn woodpeckers ( Melanerpes formicivorus ) in southwestern North America and Central America form same-sex sibling coalitions to better compete for reproductive vacancies. European long-tailed tits ( Aegithalos caudatus ) return home to help feed young still residing in their parents’ nests when their own breeding attempts fail. All these behaviours are facilitated by the genetic relatedness between the individuals involved.",
  "The pinnacle of social behaviour is found in eusocial species. Eusocial species live in multigenerational family groups in which the vast majority of individuals cooperate to aid relatively few reproductive group members (or even a single member). Eusocial behaviour is found in ants , bees, some wasps in the family Vespidae, termites (order Isoptera; sometimes placed in the cockroach order, Blattodea), some thrips (order Thysanoptera), aphids (family Aphididae), and possibly some species of beetles (order Coleoptera). Blesmols , such as the naked mole rat ( Heterocephalus glaber ) and the Damaraland mole rat ( Cryptomys damarensis ), engage in truly eusocial behaviour; they are the only vertebrate species known to do so. Eusocial species often exhibit extreme task specialization, which makes colonies potentially very efficient in gathering resources. Workers in eusocial colonies are thought to forgo reproduction due to constraints on independent breeding. Such constraints include shortages of food, territories, protection, skill, nest sites, appropriate weather for breeding, and available mates. Workers may never reproduce during their entire lives, but they nonetheless gain inclusive fitness benefits by aiding the reproduction of a queen, who is typically their mother. Such assistance often takes the form of foraging for food, caring for the young, and maintaining and protecting the nest.",
  "The cost-benefit approach can also be applied to reproductive interactions. For example, the reproductive behaviour of many species is designed to achieve multiple mating, but this behaviour may be associated with certain costs, such as the increased risk of injury or of contracting a sexually transmitted disease . Among many species, mating is essentially promiscuous, with individuals either shedding their gametes into the environment without mating or with individuals pairing briefly, just long enough to effect fertilization . The other extreme includes long-lived animals such as Bewick’s swans ( Cygnus columbianus ), which may live for up to 25 years and mate for life. In addition, it has been shown that within many species some individuals engage in same-sex mating; the individual and group costs and benefits of these behaviours likewise vary among species. Mating behaviour in animals includes the signaling of intent to mate, the attraction of mates, courtship , copulation, postcopulatory behaviours that protect a male’s paternity, and parental behaviour. Parental behaviour ranges from none to vigilant care by both parents and even by additional group members. Biologists refer to the investment in interactions that influence the likelihood of parenting offspring as “mating effort” and the investment that increases the survival or condition of offspring as “parental effort.”",
  "Social behaviour is also involved in social dominance and the maintenance of territories , regardless of whether dominance status or territories are held by individuals or by groups of individuals. Territorial species tend to be distributed over the landscape in a more regular fashion than would be predicted if they used the landscape randomly. An important concept in understanding territorial behaviour is the notion of economic defendability. Economic defendability postulates that, in order to be territorial, the benefits of maintaining exclusive access to a space must outweigh the individual’s or group’s costs of defending the space from other members of its own kind. In the territorial systems of many species, overt defense in the form of direct aggressive behaviour against intruders has given way to indirect defense in the form of vocalization and scent marking.",
  "Social behaviour is a complex combination of the costs and benefits of living in groups, dominance interactions, conflict between the sexes, nepotism when groups are composed of relatives, and cooperation. The diversity of social behaviour has provided significant material for evolutionary biologists interested in understanding natural selection and the process of evolution.",
  "Various aspects of animal social behaviour intrigued humans for hundreds, if not thousands, of years. Social behaviour has been documented by writers starting with Aristotle ( c. 330 bce ); however, it was Charles Darwin’s On the Origin of Species in 1859 that initiated the modern approach with its assertion that behaviour, like morphology and physiology, evolves through natural selection. Darwin is also remembered for being the first to discuss sexual selection, the special form of natural selection that acts via competition for mates and female choice of mating partners, accounting for such elaborate traits as the antlers of red deer ( Cervus elaphus ) and the tails of peacocks ( Pavo cristatus ).",
  "The study of social behaviour during the remainder of the 19th century focused largely on description and gradual acceptance of Darwinian evolution. Starting in the early part of the 20th century, however, several workers embarked on the study of animal social behaviour from an evolutionary standpoint—for example, British naturalist H. Eliot Howard ( Territory in Bird Life , 1920), American entomologist William Morton Wheeler ( Social Life Among the Insects , 1923; and The Social Insects, Their Origin and Evolution , 1928), British statistician and scientist R.A. Fisher ( The Genetical Theory of Natural Selection , 1930), American ecologist W.C. Allee ( Animal Aggregations , 1931; and The Social Life of Animals , 1938), English ecologist Fraser Darling ( A Herd of Red Deer , 1937; and Bird Flocks and the Breeding Cycle , 1938), and English ornithologist David Lambert Lack ( The Life of the Robin , 1943). In addition, English biologist Sir Julian Huxley’s Evolution, The Modern Synthesis (1942) merged Darwin’s thinking with new knowledge of genetics to transform evolutionary biology into a comprehensive paradigm for understanding evolutionary change.",
  "Lack became particularly influential in the second half of the 20th century, championing the view that virtually all aspects of behaviour could be understood in an evolutionary context by focusing on benefits for individuals. His career peaked with the publication of Ecological Adaptations for Breeding in Birds (1968). This work was one of the first major studies of social behaviour to make extensive use of the comparative method, which attempts to understand how natural selection favours particular traits by comparing the ecology of related species.",
  "Other particularly influential workers in that era included Austrian zoologists Konrad Lorenz , who first described the social phenomenon of imprinting, and Karl von Frisch , who made extensive observations of the social communication and dance-language of honeybees, and Dutch-born British zoologist and ethologist Nikolaas Tinbergen , who was one of the first to perform field experiments to test hypotheses of social behaviour. These three are often considered the founders of ethology , and they shared the Nobel Prize in Physiology or Medicine in 1973 for their “discoveries concerning organization and elicitation of individual and social behaviour patterns.” That was the only time workers in this field have been so honoured.",
  "Several watershed events in the study of social behaviour took place in the 1960s and ’70s. First was the challenge to Lack by English zoologist V.C. Wynne-Edwards, whose controversial Animal Dispersion in Relation to Social Behaviour (1962) proposed a pervasive role for group selection, allowing sacrificial behaviour for the good of the group or species. Although largely discounted by the majority of workers, who believed that such altruism should rarely evolve, Wynne-Edwards’s advocacy of this view prompted a careful reappraisal of the evolutionary basis of social behaviour that continues to this day.",
  "Second was British evolutionary biologist W.D. Hamilton’s proposal in 1964 that kin selection plays a role in the evolution of altruism, cooperation, and sociality. Kin selection is based on the concept of inclusive fitness, which is made up of individual survival and reproduction (direct fitness) and any impact that an individual has on the survival and reproduction of relatives (indirect fitness). The elements of kin selection lead directly to the concept now known as Hamilton’s rule, which states that aid-giving behaviour can evolve when the indirect fitness benefits of helping relatives compensate the aid giver for any losses in personal reproduction incurred by helping. Hamilton’s theory of kin selection is now considered one of the foundations of the modern study of social behaviour.",
  "The third major advance in social behaviour during this era was the sweeping summary and prospectus of the field provided by American biologist E.O. Wilson with Sociobiology: the New Synthesis (1975), which laid the cornerstone for the modern interdisciplinary study of animal behaviour. Although the bulk of Wilson’s book is not controversial, a final chapter attempting to understand the evolution of human social behaviour using adaptationist principles ignited such an intense debate that the very word  sociobiology  , until that time used synonymously with animal social behaviour, is now usually restricted to the application of such principles to human behaviour . Although some people remain disturbed by the idea of applying sociobiological principles to human behaviour, the approach has flourished and provided insights into human behaviour that could not have come to light with alternative, nonevolutionary worldviews.",
  "The study of social behaviour remains active, involving the investigation of proximate mechanisms (that is, behaviour triggered by immediate stimuli coming from the outside world or inside the body), the survival and reproductive consequences of sociality, and the evolution of human behaviour and cultural traditions. Social behaviorists today study a wide range of species from ants to whales and an equally wide range of topics that span from the genetic basis of particular social characters to the evolutionary origins of group living.",
  "Social behaviour is best understood by differentiating its proximate cause (that is, how the behaviour arises in animals) from its ultimate cause (that is, the evolutionary history and functional utility of the behaviour). Proximate causes include hereditary, developmental, structural, cognitive, psychological, and physiological aspects of behaviour. In other words, proximate causes are the mechanisms directly underlying the behaviour. For example, an animal separated from the herd may exhibit behaviours associated with fear reactions (such as elevated heart rate, shaking, and hypersensitivity to sounds), which cause it to behave in ways that increase its chances of reuniting with the group. The underlying hormonal response, which is triggered by separation from the herd, is a proximate cause of these fear-based behaviours. In contrast, the ultimate causes of social behaviours include their evolutionary or historical origins and the selective processes that have shaped their past and current functions. In the case of the isolated herd animal, the development of a better defense against predators that results in increased survival of individuals remaining in groups would be an ultimate cause for the tendency to reunite with the herd.",
  "Dutch-born British zoologist and ethologist Nikolaas Tinbergen was first to clarify these levels of explanation, naming four which he referred to as “survival value,” “causation,” “development,” and “evolutionary history.” Tinbergen also emphasized the importance of addressing questions at the appropriate level of explanation. For example, determining the underlying mechanism (causation) of a behaviour does not address the hypotheses regarding its historical origin (evolutionary history) or current survival value. This still causes confusion among evolutionary biologists interested in adaptation, and many examples of unproductive arguments across levels of explanation can be found in the scientific literature.",
  "Use of the scientific method to study social behaviour permits biologists to deduce the proximate and ultimate functions by using strong inference based on a set of critical predictions. If experiments to test these predictions indicate that the predictions are not met, then the hypothesis is falsified and discarded. If the predictions are met, the hypothesis is supported, but that does not prove it is true.",
  "This is illustrated by examining a question: Why do male birds sometimes adopt and feed offspring of widowed females? One possible explanation is that they have mated with the female and have genetic offspring in the female’s nest (current benefits hypothesis). An alternative hypothesis is that the adoptive male gains future benefits because his foster-parenting increases the likelihood that the female will mate with him during her next breeding attempt (future benefits hypothesis). The current benefits hypothesis predicts that some of the female’s nestlings were sired by the adoptive father, whereas the future benefits hypothesis predicts that the adoptive male will mate sooner, usually with the widowed female, and produce more offspring in the future than an unpaired male that fails to adopt. While mutually exclusive hypotheses are ideal, in many cases behaviours have more than one current function and, as in the example of adoption, one or both hypotheses may be true.",
  "Strong inference relies on critical predictions that are capable of distinguishing between alternative hypotheses, whether proximate or ultimate. It also relies on devising clear tests in which each alternative can be falsified by using one or more predictions. In general, predictions can be tested either with data collected from field observations or with experiments. Experiments are considered preferable to field observations because confounding factors are more easily controlled. Unfortunately, manipulations involved in experiments may alter other factors beyond those which the scientist intended, especially where social behaviour is concerned. In order to minimize such problems, researchers take great pains to avoid biases in their experimental procedures and to test their hypotheses by using multiple lines of evidence.",
  "For example, consider the question of why offspring of some species of birds and mammals delay dispersal and remain on their natal territory where they may help raise younger siblings. One of the many basic questions raised by such “helpers-at-the-nest” is the importance of genetic relatedness and kinship to the evolution of the behaviour. Experimentally, cross-fostering young so as to eliminate any genetic relatedness between nestlings and helpers does not typically alter or reduce helping behaviour, but does this demonstrate that kinship is not important? The current thinking on this matter is that cross-fostering leads to a situation where totally unrelated young occur in the nest, a situation that has never been found in the wild. Other studies, meanwhile, have shown that the vast majority of helpers normally feed closely related young. When given the choice, helpers whose own nests have failed preferentially choose to aid closely related young over more distantly related or unrelated young. This behaviour was demonstrated even when the latter were closer to the helper’s own failed nesting site. Such results indicate that kin selection plays a key role in the evolution of helping behaviour, despite the experiments suggesting otherwise.",
  "The advantages of behaviours such as mating and caring for offspring are obvious in that they increase the number and survival of an individual’s own young. In contrast, social behaviours such as living in groups and helping others do not always bear obvious links to individual fitness. Because such behaviours are complex and paradoxical, their ultimate cause has been a key focus of biologists interested in how social behaviour evolves.",
  "Social interactions can be characterized as mutualism (both individuals benefit), altruism (the altruist makes a sacrifice and the recipient benefits), selfishness (the actor benefits at the expense of the recipient), and spite (the actor hurts the recipient and both pay a cost). Mutualistic associations pose no serious evolutionary difficulty since both individuals derive benefits that exceed what they would achieve on their own. In general, altruism is less likely to evolve, since a gene for altruism should be selected against. Often individuals acting altruistically are close relatives, in which case the likely resolution of this paradox is kin selection, with altruistic individuals gaining indirect fitness benefits by helping relatives produce additional offspring. Altruism between unrelated individuals is rare, but it occurs and remains the focus of considerable research. Game theory is often applied to research involving cases of altruism between unrelated individuals.",
  "Reciprocal altruism or reciprocity is one solution to the evolutionary paradox of one individual making sacrifices for another unrelated individual. If individuals interact repeatedly, altruism can be favoured as long as the altruist receives a reciprocal benefit that is greater than its initial cost. Reciprocal altruism can be a potent evolutionary force , but only if there is a mechanism to punish cheaters that accept help without reciprocating. Models of reciprocal altruism suggest that even subtle cheating that is difficult to detect eventually results in the loss of the altruistic trait. Consequently, it is not surprising that unambiguous examples of reciprocal altruism outside of humans are rare. Studies have suggested, however, that it plays an important role in the evolution of food sharing by vampire bats ( Desmodus rotundus ) and the interactions between cleaner fish ( Labroides dimidiatus ) with the client fish they attend. The possibility remains that reciprocity could turn out to be more common than currently recognized.",
  "A second solution for how altruism can evolve among unrelated individuals comes from a study in humans . In this study, individuals punished unrelated cheaters (altruistic punishment), even though they received no material benefit for doing so and were unlikely to interact with them in the future. Furthermore, there may be benefits of advertising one’s altruism that allow it to flourish among unrelated individuals. This is suggested by the finding that people are more likely to give blood when they receive a badge advertising their donation. Indirect reciprocation has been used to describe situations in which individuals that give tend to be repaid by individuals other than those they help. This special form of reciprocation can also maintain altruism through the impact of an individual’s reputation on his or her likelihood of receiving aid or cooperation in the future. Models indicating the role of reputation in sustaining altruism have been proposed as solutions to the “tragedy of the commons,” a key explanation for why gaining the cooperation needed to protect and sustain public resources (such as biological diversity , air and water, and the ozone layer ) is so difficult.",
  "Selfish behaviour occurs when one individual benefits at the expense of another. Examples, unsurprisingly, are common. In birds , females sometimes exhibit egg-dumping behaviour or intraspecific brood parasitism (that is, the laying of eggs in nests of other pairs, thus parasitizing their parental care). Even though female birds usually cannot tell their eggs from those of other conspecific females, this sort of parasitism is not particularly common, probably because territoriality and nest guarding help to minimize it. Conspecific brood parasitism, however, occurs in over 30 species of ducks and geese as well as in the northern bobwhite quail ( Colinus virginianus ), ring-necked pheasant ( Phasianus colchicus ), wood pigeon ( Columba palumbus ), European starling ( Sturnus vulgaris ), cuckoo (Cuculidae), and a variety of other species. Heterospecific brood parasitism is even more common with cuckoos and cowbirds ( Molothrus ), which lay eggs in the nests of a diversity of other species.",
  "Spite as a social interaction presents an interesting puzzle. It is a behaviour that causes harm to the actor and recipient. Spite is thought to evolve in situations where it serves as a signal of status that helps the actor in the future; in the absence of such future benefits, it should not evolve.",
  "  Mating behaviour describes the social interactions involved in joining gametes (that is, eggs and sperm ) in the process of fertilization . In most marine organisms, planktonic gametes are shed (or broadcast) into the sea where they float on the tides and have a small but finite chance of encountering one another. In contrast, the majority of terrestrial animals mate in order to bring together their gametes. On land there has been an evolutionary progression. The earliest land animals needed to return to the water in order to breed. This requirement, however, gave way to the practice of placing sperm packets in the terrestrial environment in locations where they would be picked up by females. While both methods are still used by some species, reproduction in many land animals now involves copulation with internal fertilization. Selectivity on the part of females in externally fertilizing species favours males that engage in behaviours, such as courtship , which entice females to pick up their sperm. Away from water, the requirement for internal fertilization favours copulation, because it allows males to place their sperm closer to the site of fertilization. The ultimate example of this is traumatic insemination found in bedbugs (family Cimicidae), where males pierce the female’s body cavity with their genitalia, placing sperm inside her abdomen. Traumatic insemination is costly for females, with multiple inseminations reducing the female’s survival and reproductive success. This indicates that males evolved this strategy at the female’s expense, resulting in a persistent conflict of interest between the sexes.",
  " Hetaerina americana  Biologists have long been fascinated with the diversity of ways in which copulation is achieved. Research has typically focused on the means by which males and females use to locate one another and the processes of courtship, mate selection, copulation, and insemination. In addition, biologists have become interested in what happens after insemination, noting that, when females mate with multiple partners, males are selected to take whatever measures they can to ensure that their sperm supersede those of the female’s other mates. Because natural selection usually works at the level of the individual, members of both sexes are adapted to behave selfishly, and behaviours that increase the male’s chances of successful reproduction, despite being detrimental to females, have arisen.",
  "As a result, mating is not a simple cooperative endeavour. On the contrary, male and female interests often conflict each step of the way, from mating to allocation of parental effort. The end result of these conflicts has been an extraordinary diversity of sexual ornaments, sexual signals, genital morphology, and parental behaviour. There is, however, a diversity of solutions that range from the colourful sexual displays and elegant melodies of male songbirds to the sex-role reversal in sea horses and pipefishes (family Syngnathidae), where males carry fertilized eggs in a kangaroo-like brood pouch.",
  "Mating interactions are usually described in terms of how many mates individuals have, how stable mating pairs or breeding groups are over time, how males and females locate one another, and how mating groups occupy space. In marine invertebrates with broadcast promiscuity, both eggs and sperm are shed into the sea to drift or swim in search of each other. Promiscuous mating, on the other hand, refers to cases in which males and females do not form long-term pair bonds and individuals of at least one sex, usually males, fertilize more than one member of the opposite sex. In promiscuous species, the sexes may meet at mating arenas or conventional encounter sites, in areas of home range overlap, or during a brief liaison in one or the other’s territory . Examples include species such as the sage grouse ( Centrocercus urophasianus ), whose males congregate at communal display sites (leks), and a wide variety of insects species whose mating is brief and pairing is transient.",
  "Although polygamy also involves mating with multiple partners, it often refers to cases in which individuals form relatively stable associations with two or more mates. Most such species exhibit polygyny, in which males have multiple partners. Some examples include the red-winged blackbird ( Agelaius phoeniceus ) and house wren ( Troglodytes aedon ) in North America and the great reed warbler ( Acrocephalus arundinaceus ) in Europe. In a few polygamous species, however, females mate with and accept care from multiple partners, a phenomenon referred to as polyandry, examples of which include spotted sandpipers ( Actitis macularia ), phalaropes ( Phalaropus ), jacanas (tropical species in the family Jacanidae), and a few human societies such as those once found in the Ladakh region of the Tibetan plateau. Monogamy, where a single male and female form a stable association, is rare in most taxa except for birds, where at least 90 percent of species are socially monogamous. Rarest of all are stable breeding groups made up of multiple males and multiple females. In such groups, all males can potentially breed with any of the females. This pattern is referred to as cooperative polygamy or polygynandry. Examples of this type of mating system include the acorn woodpecker ( Melanerpes formicivorus ) in western North America, the dunnock ( Prunella modularis ) in Europe, a few primate societies including chimpanzees ( Pan troglodytes ), and at least one human society, the Pahari of northern India.",
  "The distinction between promiscuous and polygamous mating associations is a function of pair stability. In the latter, mates come together for longer than is required to fertilize eggs. Within polygamous species, however, there is considerable variation in stability. In some cases, females have one mate at a time but change mates periodically. This pattern may be referred to as serial polyandry, sequential polyandry, or serial monogamy, depending on whether the focus is on mate-switching behaviour or the number of mates at a given time. Serial monogamy can be used to describe species such as the milkweed leaf beetle ( Labidomera clivicollis ), in which males and females remain together for hours or days. Serial monogamy can also be used to refer to bird species such as the European house martin ( Delichon urbica ) and greater flamingo ( Phoenicopterus ruber ), in which males and females are socially monogamous within a season but acquire a new mate each year.",
  "In contrast, simultaneously polygamous species (such as red-winged blackbirds) and simultaneously polyandrous species (such as the jacanas ) also occur. Red-winged blackbird males often have two or more females breeding on their territories, whereas jacana females are bigger than males and defend large territories encompassing the smaller territories of their male mates. The distribution of these mating systems varies considerably among groups. For example, although social monogamy is common and polygamy rare in birds, the converse is true in mammals; a large fraction of mammals are polygamous. Only a handful of mammal species, including most human societies, are socially monogamous.",
  "In addition to classification schemes based on number of mates and stability, mating associations are sometimes categorized on the basis of how individuals occupy space. Many species of songbirds defend “all-purpose” territories that provide individuals or small groups with both nesting habitat and a significant degree of exclusivity when it comes to exploiting the resources in a particular area. Other birds, particularly many seabirds, nest in colonies and defend only a small area around their nest.",
  "The distribution of resources can influence the use of space and consequently the nature of the mating system. When females are clumped, either because of clumping of food and nest sites or because of the benefits of forming social alliances with other females, dominant males are able to defend females directly and gain multiple mating opportunities (female-defense polygyny). Alternatively, if males defend clumped resources, they can gain access to multiple fertile females attracted to the resources (resource-defense polygyny). Scramble competition polygyny is thought to occur when neither female-attracting resources nor females themselves are economically defendable. Scramble competition polygyny involves males competing for access to mates based on differences in their ability to move about and locate females. Finally, in lekking species, males aggregate at display sites that may not be tied to either resources or females. These terms focus on ways in which the ecology of space use by females influences a male’s ability to monopolize mating opportunities.",
  "Of the various kinds of mating systems, polygyny is relatively common and polyandry rare. This prevalence of polygyny is thought to result from the greater resource investment females have in their large, immobile eggs compared with males’ investment in small, motile sperm.",
  "  Originally, all gametes were probably similar in size and mobility, with the defining feature being that they fused to produce a new individual. Eggs and sperm are thought to have diverged in size due to the contrasting advantages of being either small and mobile or sedentary and large. It is easiest to understand this concept by thinking of a single-celled organism that divides into two equal sex cells. Each cell contains half of the organism’s genetic material. Because organisms are inherently variable, the sex cells will tend to vary somewhat in size. Assume that smaller cells move faster, thereby increasing their chances of locating another cell with which to join. In contrast, larger cells move more slowly but have more resources to devote to survival and reproduction. The increased ability of small, motile sex cells to find cells with which to fuse and the greater survival conferred upon large, slow gametes would put gametes of intermediate size and mobility at a selective disadvantage. In this context, motile cells that preferred to join with larger, more sedentary sex cells would be favoured. Consequently, gametes of intermediate size and mobility would be selected out of the population through the greater success of the two extremes. The process of selecting against intermediate individuals in favour of those individuals with extreme forms of a critical trait is known as disruptive selection .",
  "In multicellular organisms, males produce sperm, and females, which typically have a greater investment in large eggs, are usually the caretakers of eggs and young. Because males typically produce a great many relatively inexpensive sperm, they can increase the number of offspring they sire by fertilizing additional females. Thus, their reproduction is less constrained by the availability of time and resources than is female reproduction. To the extent that a male’s offspring can survive without further contribution on his part, the male is free to move on and search for additional mates. Females, on the other hand, are potentially limited by time and the availability of nutrients needed to produce eggs. Unless they receive additional resources to turn into eggs, the acceptance of additional matings will not help them produce more offspring.",
  "One consequence of this difference is that females are frequently more selective than males. There are at least three hypotheses that attempt to explain the near ubiquity of female choice. First, females may benefit by preferring to mate with males that contribute to the physical care of offspring and thus augment the level of care their young receive or relieve females of some of their parental duties. More specifically, females should prefer males that provide resources that increase their survival and breeding success. These constitute potential “direct benefits” of mate choice.",
  "Second, a female may choose a mate based on some apparently arbitrary male character (such as “attractiveness”). This character will allow her to produce more sons possessing that character, and these sons will ultimately attract more females and produce more grandchildren. Through a process referred to as the “sexy son hypothesis,” this can result in runaway selection, a preference for exaggerated traits that are advantageous solely because of their attractiveness to females.",
  "Runaway selection was first proposed by English statistician R.A. Fisher in the 1930s. Evidence supporting this process has been found in several species. One of the most dramatic may be the African long-tailed widowbird ( Euplectes progne ); the male of this species possesses an extraordinarily long tail. This feature can be explained by the females’ preference for males with the longest tails, as demonstrated experimentally by artificially elongating the tails of male widowbirds. Similarly, male European sedge warblers ( Acrocephalus schoenobaenus ) with the longest and most elaborate birdsongs are the first to acquire mates in the spring.",
  "In both of these cases, the traits females prefer may be arbitrary indicators of attractiveness. Alternatively, they may be most elaborately developed in males that are otherwise of high genetic quality, in which case they fall into a third possibility, where female choice is due to what is called the “good genes hypothesis.” This hypothesis suggests that the traits females choose are honest indicators of the male’s ability to pass on copies of genes that will increase the survival or reproductive success of the female’s offspring. Although no completely unambiguous examples are known, evidence in support of the good genes hypothesis is accumulating, primarily through the discovery of male traits that are simultaneously preferred by females and correlated with increased offspring survival. For example, female North American house finches ( Carpodacus mexicanus ) prefer to mate with bright, colourful males, which also have high overwinter survivorship. This suggests that preference for mating with such males increases offspring survival.",
  "The initial size asymmetry in the gametes produced by the sexes sets the stage for sexual conflict over when and with whom females mate and the amount of resources males contribute to the female and her offspring. Females may try to control the situation by choosing mates that will provide them with resources or help with parental care. They might assess males on the basis of the quality of their territory, how much food they provide during courtship, or how long a male is able to produce a particularly intricate display.",
  "True genetic monogamy is rare. Although females do not gain in numbers of fertilizations the way males do when they mate with multiple partners, females often mate with multiple males. Why they do so is not clear. If females mate opportunistically, then happen to come across a more-preferred male, they may “trade up” in quality to increase the breeding success of their sons or the growth and performance of their offspring. Offspring performance may increase because the new male offers “good genes” or because his genes better complement those of the female. Otherwise, females may mate with multiple partners as insurance against the possibility that sperm from their first mate are inviable or in exchange for resources provided by additional males.",
  "Multiple mating by females is not always obvious. In birds, over 90 percent of species are socially monogamous, breeding as simple pairs made up of one male and one female. Paternity tests with DNA fingerprinting , however, have revealed that females of many socially monogamous birds accept copulations from males in addition to their social mate. Such extra-pair copulations may provide females or their young with benefits. For example, female blue tits ( Cyanistes caeruleus ) that accept copulations with males in addition to their mates have faster-growing offspring, suggesting genetic benefits of extra-pair mating. In red-winged blackbirds, the females not only benefit through increased offspring performance, but they are allowed access to food on the extra-pair male’s territory. In these cases, as both the females and their social mates feed nestlings, the male-female conflict appears to have been resolved in favour of females.",
  "In insects and spiders, females commonly mate with multiple males. In some species, females benefit by receiving nutrients that are shunted into egg production. For example, males of certain crickets (family Gryllidae), katydids (family Tettigoniidae), butterflies , and moths (order Lepidoptera) contribute up to 25 percent of their body weight at mating, packaging their sperm in a nutritious envelope that the female consumes or absorbs. Male scorpionflies ( Panorpa ) hand off gifts of insect prey in exchange for copulation, saving the female the energy and risk of predation incurred by foraging for herself. Some crickets even allow females to consume their nutritious fleshy wing pads during mating and, in the most extreme cases, represented by red-back or black widow spiders ( Lactrodectus ), males may be partially or entirely consumed by their mates during mating.",
  "The special form of mating competition that occurs when females accept multiple mating partners over a relatively short period of time is known as “sperm competition.” The potential for overlap between the sperm of different males within the female has resulted in a diversity of behavioral adaptations and bizarre male strategies for maximizing paternity. Sperm competition, for example, is thought to be the primary reason why males offer nuptial gifts to females or allow females to cannibalize them. Such nuptial gifts are best thought of as mating effort (that is, effort directed at increasing the number of offspring a male sires) rather than parental effort, because these resources are usually not mobilized in time to benefit the offspring that are sired by the male making the donation. In addition, the male’s paternity and the number of sperm he transfers often correlate with the size of the donation, suggesting that the donation functions to increase the number of offspring he sires.",
  "Sperm competition favours the evolution of paternity guards or mechanisms for reducing the impact of sperm competition. In many animals, sperm competition results in mate-guarding behaviour, whereby males remain near the female following mating in an attempt to keep additional mates away from her prior to the fertilization of her eggs. For example, in the cobalt milkweed beetle ( Chrysochus cobaltinus ) the male rides on the back of the female for several hours. By engaging in this behaviour, the male sacrifices time he could use to locate a new mate in favour of preventing the female from copulating with other males before she can lay her eggs. Male damselflies and dragonflies (order Odonata) use their genitalia to physically remove or compact the sperm of the female’s prior mates before inseminating her with their own sperm. In the polygynandrous dunnock or hedge sparrow ( Prunella modularis ), a common English backyard bird, males peck at the female’s cloaca. This activity causes her to release a droplet of semen containing the sperm of prior mates before a new male begins to mate with her. In acorn woodpeckers, another polygynandrous species, the threat to a male’s paternity comes from other males within the same breeding group. As a result, males spend virtually all their time within a few metres of fertile females, guarding them from other breeder males in the group. Birdsong and territorial defense behaviours have also been shown to function as paternity protection, although these behaviours have other primary functions.",
  "Courtship behaviour refers to interactions specifically directed at enticing members of the opposite sex to mate. This behaviour can involve display or direct physical contact. Historically, courtship was viewed as a mechanism of species recognition. More recently, biologists have focused on how courtship might also function in mate choice. Except in polyandrous species where sex roles are reversed, males are typically the ones that court. If females elect to mate with males with elaborate courtship signals (such as the greatly elongated tail of the male long-tailed widowbird), then this preference will be reinforced over time by the greater ability of the male offspring that possess the signal to attract mates. This preference will also be reinforced if both the courtship signal and the preference for it are inherited. After generations of successful reinforcement, the preference for the courtship signal will become common in the local population. Other populations that are physically separated from this population may not adopt this courtship signal. If this occurs, courtship behaviour may become so different that members of the local population will no longer interbreed with members of other populations. Eventually, this difference in courtship behaviour between one population and another may lead to the formation of two separate species.",
  "The potential for rapid evolution of sexual displays due to female choice may be enhanced if females have a preexisting sensory bias to prefer a particular male trait. Examples of such biases include a preference for a lower or deeper call (in some frogs ) or a long, pointed swordlike tail (in swordfishes ). Once this bias is in place, any mutation that permits males to possess such a feature will be favoured and spread rapidly through the population.",
  "Courtship can be used to mitigate danger in predatory species if there is a risk that the male will be mistaken for prey and eaten by the female. Although courtship signals are typically used before copulation to entice females to mate, they are sometimes used during copulation (copulatory courtship) to stimulate the female to accept additional sperm or after copulation (postcopulatory courtship) to improve the chance that a male’s sperm will outcompete the sperm of rivals. Copulatory courtship is quite common in some species of leaf beetles (family Chrysomelidae) and appears to be related to success in spermatophore (a package or capsule containing sperm) transfer and sperm competition.",
  "Courtship signals can be costly to produce and dangerous to bear. For example, the nocturnal trills of crickets attract parasitic flies. On the other hand, the elaborate and conspicuous displays of courtship of bowerbirds (family Ptilonorhynchidae) may be less costly than previously assumed if they are largely a function of experience. When courtship signals are costly, it is presumably difficult for males of low quality to trick females by producing signals that are as attractive as those produced by males of higher quality. Consequently, courtship behaviour is often considered an honest or reliable indicator of male quality.",
  "The costs and benefits of parental care will determine whether parents care for their offspring and the degree to which they are involved. Parental care is expensive in terms of both current and future costs of reproduction, which explains why the majority of animals do not care for their young. Current costs are illustrated by the example of a female guarding a clutch of eggs at the expense of laying another clutch or a male that cares for nestlings rather than attracting additional mates. An example of a future cost is the reduction in postbreeding survival suffered by willow tit ( Poecile montanus ) parents that fledge a large brood of offspring.",
  "The main benefit of parental care is offspring survival, although care can also influence an offspring’s condition and future reproductive success. The simplest form of parental care is guarding or protection of eggs in egg-laying, or oviparous , species. Investment in egg protection ranges from construction of an egg case to guarding exposed eggs, carrying eggs on the body surface, in a brood pouch, or in the mouth, and nest building or active nest defense. In some insects there is a continuum that ranges from laying eggs to retaining eggs inside the female’s body until they hatch and are borne as larvae or live young (ovoviviparity). Parental behaviour can be extended beyond hatching or birth. Examples include treehopper females that stay with nymphs until they mature, emperor penguin ( Aptenodytes forsteri ) parents that feed young for several months after the eggs hatch, and human parents who frequently provide substantial parental care to their children through puberty and beyond.",
  "In animals that provide parental care, females are generally the ones that primarily bear the costs. They spend time laying eggs, creating egg cases, guarding eggs or larvae, building nests, incubating and brooding young, carrying young ( gestation ), nursing ( lactation ), and subsequently feeding and defending offspring. Parental care by both sexes (biparental care) is much less common, however, and exclusive care by the male is rare. For example, in terrestrial arthropods , female-only care occurs in 72 orders, biparental care occurs in 13, and male-only care occurs in just 4. In addition, females in 19 orders bear live young, caring for eggs or for eggs and larvae inside their bodies.",
  "Because parental care is costly, it is expected that a conflict of interest will arise between the sexes over whether to care for offspring and how much care to provide. Frequently one sex or the other is able to “win” this conflict by being first to abandon the offspring, leaving the remaining parent, often the female, with the choice of providing all the necessary care by herself or suffering total reproductive failure.",
  "There are several possible reasons why males are able to abandon more frequently than females. First, because fathers lose opportunities to fertilize additional eggs by caring for young, the costs of parental care may be relatively greater for males than for females. Second, if females engage in extra-pair or multi-male mating, they will experience greater benefits of care because their share of parentage is greater than that of their social mate. For example, in an insect where females mate with multiple males and store sperm for long periods, all eggs will belong to the female, but it is unlikely that all will be sired by a single male. The lower a male’s expected share of paternity, the less likely he should be to provide care for the offspring. Surprisingly, even though over 90 percent of socially monogamous birds have extra-pair fertilizations, this does not appear to result in male desertion in many cases, and sensitivity of male care to loss of paternity is uncommon.",
  "Third, because of physiological constraints, females are sometimes more crucial for offspring survival than males. This is particularly true in placental mammals where the father can desert immediately after fertilization, often with little or no effect on offspring survival. In contrast, the mother cannot desert because she carries the offspring internally through gestation and subsequently provides essential care through lactation after birth.",
  "Timing of gamete release could also be a factor in desertion. A testable hypothesis involves predictions of an association between order of gamete release and which sex deserts in externally fertilizing species. A researcher could then ask: Is the sex that releases gametes first more likely to desert? There is superficial support for this hypothesis to the extent that male parental care is most prevalent in fishes with external fertilization. In such fishes, males often release sperm after females release eggs. A second prediction of this hypothesis, however, is that the frequency of single-parent care by males and females should be equal in species of fishes where males and females release gametes simultaneously. This prediction is not borne out. Instead, males are significantly more likely to provide care in such species than females. Thus, the opportunity to desert does not provide a general explanation for why it is usually the females that provide care. Instead, it is possible that females give care more often because they are more likely to be close to the eggs or offspring at the time when care is required. This hypothesis predicts that males should be more likely to provide care in species whose females lay eggs immediately after copulation than in species that require a period of time between copulation and the egg-laying period. Since such delays tend to occur in fishes with internal fertilization, simple proximity to the young and the suite of factors contributing to a separation of time between fertilization and egg laying probably play important roles in determining which sex provides parental care.",
  " Lions ( Panthera leo ) provide a good example of females doing the majority of parental care. Lionesses not only carry the fetus and lactate, but they perform most of the hunting for the social group, including for the larger, more dominant males. Cases in which males contribute the majority or all of the care are relatively rare; however, since these instances are so unusual, they have attracted wide attention. Well-known examples of male care include giant water bugs (family Belostomatidae), in which the female lays eggs on the male’s back, and sea horses and pipefishes (family Syngnathidae), in which males carry the eggs and brood the young. Other examples include mouth-brooding frogs, fish, and various shorebirds (such as jacanas) in which females lay eggs in the nests of several incubating males. Exactly what has emancipated the females of the relatively few species with male care remains a mystery. Modern research is directed at uncovering the reasons why, in these cases, the ratio of benefits to costs for males is apparently greater than that of females.",
  "Biparental care is almost nonexistent in insects, fish, reptiles , and amphibians . It is rare in mammals and relatively common in birds. In some species of birds with biparental care, the absence of the male results in increased or even complete nestling mortality. In other species, however, male absence has little effect. In addition, male parenting in birds may be favoured by the female’s tendency to divorce males that fail to provide care or by the female’s preference for males that contribute to parenting.",
  "Some forms of parental care (such as the defense of a nest) can be shared among offspring, whereas others (such as providing food) cannot be partitioned without reducing the average offspring benefit. When parental care cannot be shared, it results in competition among siblings. If resources are scarce, offspring may compete through cannibalism, siblicide, and by directly interfering with each other’s access to food, shelter, or other resources. In great egrets ( Casmerodius albus ), for example, the first-hatched chick typically kills its younger sibling. Younger siblings avoid this fate only in years when food is particularly abundant.",
  "Young birds also compete for food by begging, displaying colourful gapes, or by special plumage signals to induce their parents to deliver food. Within a nest, it is often the loudest, most vigorous beggar or the chick closest to the nest cavity entrance that is fed. Use of these signals will be favoured if they help parents avoid investing in young that are weak, sickly, and less likely to survive.",
  " Colias interior  Although it has been established that many animals group together because it is beneficial for individuals to interact, aggregation may sometimes occur because each individual requires access to a limited resource with a patchy distribution. In such cases, clumped individuals may only appear to form a social group. In fact, each individual is exploiting the resource without interacting socially. In practice, however, the absence of interaction between individuals is difficult to demonstrate. The difficulty of distinguishing aggregations on the basis of interaction is also exemplified by some insect aggregations in which individuals communicate by using chemical or vibrational signals. Often, these signals can be detected only by using specialized equipment. Nevertheless, whether aggregations form through the attraction of individuals to one another or to a site, members experience costs that must be balanced by group benefits if aggregations are to persist.",
  "The stability of aggregations is variable. Group stability ranges from temporary aggregations of bees at watering sites to gull colonies that persist on islands year after year. Among the many names used to refer to animal aggregations are covey (quail), gaggle ( geese ), herd ( ungulates ), pod ( whales ), school (fish), and tribe (humans) and more generalized terms such as  colony  , den , family , group , or pack . An even greater diversity of names is used to describe human social groups. Names such as class , congregation , platoon , squad , regiment , corps , county , town , state , and nation attest to the importance of social behaviour in virtually all aspects of human life.",
  "The question of how aggregations form is quite different from the question of how they function. For example, use of conventional hilltop mating sites by desert butterflies is thought to involve a mutual attraction to a site, but the function of site affinity is to locate or attract a mate. Even if the proximate cause of aggregation is attraction to the site rather than to each other, this attraction to the site is thought to have arisen from benefits provided by the ultimate cause—that is, the mating opportunities the site provides.",
  "Aggregations form for numerous reasons and in a variety of contexts. Animals benefit by forming groups when they engage in activities such as mating, nesting, feeding, sleeping, huddling, hibernating, and migrating. The plains of sub-Saharan Africa provide many examples, including lions sleeping in groups under thorn acacia trees , packs of hyenas (family Hyaenidae) cooperating to bring down a zebra ( Equus quagga , E. grevyi , or E. zebra ), migrating herds of wildebeest ( Connochaetes ), and lekking male antelopes (family Bovidae).",
  "In order for aggregations to persist, however, the costs of group living must be balanced by the benefits. Such costs include increased competition for resources and mates, increased transmission of disease and parasites, and increased conspicuousness. Costs may increase over evolutionary time as parasites and predators evolve to take advantage of the opportunities group living provides. Nevertheless, group living also gives rise to new behaviours that can potentially counter these increased costs. Examples of such behaviours include nepotism (preferential treatment of kin), the formation of alliances within groups, allogrooming and allopreening (that is, activities that allow another to clean one’s fur or maintain one’s feathers), and communication systems that increase the benefits of group foraging and defense.",
  " Lutjanus apodus  Aggregations have been explored extensively from the standpoint of their impact on survival. The primary functions of aggregation appear to be feeding and defense. A general theory explaining why individuals should prefer to aggregate was first proposed by the Briton W.D. Hamilton, one of the most important evolutionary biologists of the 20th century. Hamilton hypothesized that animals might come together to form a so-called “selfish herd,” where an individual’s chances of being eaten are substantially reduced, especially if that individual remains in the interior of the group. For example, it may be better to be in the centre of a school of fish if predators tend to attack and capture fish in the outer layer. Where location within the group matters, social interactions will likely sort out social status, with some individuals gaining favoured positions by dominance or by nepotism (that is, preferential treatment shown to one’s relatives).",
  "Living in groups also protects group members through a dilution effect. The general idea is that a predator can consume prey at only a given rate and can usually eat just one prey animal at a time. Consequently, animals in groups tend to overwhelm a predator’s consumption capacity. Thus, any given individual has a smaller chance of being eaten. In the simplest example, when a group-living individual encounters a predator that will eat just one prey item, his likelihood of being eaten is reduced from p , the probability when alone, to p / N , the probability when the individual is a member of a group of size N . For example, if a tadpole joins a group with just one other individual, it reduces its chance of being eaten by one-half. Furthermore, if that tadpole joins with 99 others, its chance of being eaten drops by 99 percent. The dilution effect functions even if the group is more easily detected by predators than lone individuals are, provided that the cost of increased conspicuousness does not overtake the benefit of dilution. In other words, if the group attracts too many predators, a given individual may be better off living alone.",
  " Rangifer tarandus  Alarm calls and other complex signaling behaviour within aggregations can also reduce the likelihood of predation. Calls may coordinate a group’s escape from danger, confuse a predator, and prompt individuals to seek protected sites or shelter. Group members presumably benefit because the overall risk of a successful predation attempt is reduced. Alarm calls may also convey information about the type of predator and lead to the appropriate evasive behaviour. Alarm calls might even provide information regarding an individual predator’s identity and habits.",
  "Alarm calling is usually considered a good example of an altruistic behaviour. Why individuals give an alarm call to begin with is not necessarily obvious, since the act of calling may attract a predator and endanger the caller. In the Sierra Nevada mountains of California, Belding’s ground squirrels ( Spermophilus beldingi ) call more frequently when they have close relatives nearby, suggesting that alarm calling has evolved through kin selection. Alarm calls are also given by birds in flocks of mixed species and aggregations where kin selection is unlikely to be important. Such actions suggest that there are advantages of sharing the tasks associated with vigilance even in the absence of nepotism.",
  "Group membership may also permit cooperation in defense against predators. An insect example of cooperative defense against predators is an Australian sawfly (family Pergidae); its larvae aggregate on leaves and jointly regurgitate noxious substances when attacked. A well-known mammalian example is the circle formation of musk oxen ( Ovibos moschatus ) in the Arctic; this arrangement serves as an effective defense against wolves ( Canis lupus ).",
  "Furthermore, aggregation may augment and bolster signaling systems. This is particularly true in species with an aposematic mechanism (that is, a feature that allows a species to advertise its dangerous nature to potential predators). The grouping of aposematic prey increases the chance that a predator will have prior experience of the species, recognize the prey as distasteful, and avoid it.",
  "Groups of animals may also confuse predators by looking larger than they actually are or by moving apart in unpredictable ways. These actions often cause the predator to hesitate just long enough to permit the prey’s escape. In some beetles it is common for a male to ride on the female’s back for long periods. Although this behaviour may have several costs, one possible benefit is that both the male and the female may confuse the predator; a puff of breath from the predator or its sudden movement causes the pair to separate from one another. Both individuals may have time to escape before the predator understands what took place.",
  "In addition to increased vigilance and group defense, individuals in groups may benefit by cooperating to gain access to food and other resources. There is evidence that some newly hatched insect larvae overcome the physical defenses of plants better in groups than alone; they are able to enter the surfaces of leaves or pine needles more easily. In other plant-feeding insects, feeding itself affects the quality of the food. Substances in the insect’s saliva that overcome chemical defenses or alter the metabolism of the host plant may allow the release of more nutrients.",
  "When predators hunt in groups, their prey may become confused. Confusion can lead to the so-called “beater effect,” a condition where prey flushed out by group activity become easy to capture. Where predators cooperate (such as in the hunting practices of lions, hyenas, and wolves), they can corner and bring down prey more easily.",
  "Group living often selects for sophisticated systems of communication and cooperation that enhance the group’s overall foraging success. For example, eastern tent caterpillars ( Malacosoma americanum ) follow silk-and-chemical trails. When unhomogenized milk was home-delivered in English cities, it was shown that English blue tits ( Cyanistes caeruleus ) could observe and learn from one another how to open the tops of milk bottles and skim off the cream.",
  "The home range of an animal is the area where it spends its time; it is the region that encompasses all the resources the animal requires to survive and reproduce. Competition for food and other resources influences how animals are distributed in space. Even when animals do not interact, clumped resources may cause individuals to aggregate. For example, clumping may occur if individuals settle in an area one by one. Each individual weighs the costs and benefits of settling and sharing resources in high-quality areas versus settling in less dense, low-quality areas. This sort of spacing is predicted by algebraic cost-benefit models and is called the ideal free distribution. For example, if one person throws pieces of bread into a pond at twice the rate of a second person nearby on the same pond, ducks will distribute themselves between the two sources of food. The distribution will occur in approximately the same ratio as the food being provided. In other words, twice as many ducks will congregate near the person throwing the double lot of food.",
  "Spacing patterns may occur for other reasons. Clumping may arise if individuals exhibit a mutual attraction to each other. Conversely, if individuals repel each other, they may be overdispersed (that is, more spread out and regular than would be predicted by random settlement). Social interactions that commonly influence spacing include territoriality and dominance; both are major means of monopolizing access to resources.",
  "  Territoriality refers to the monopolization of space by an individual or group. While territories have been defined variously as any defended space, areas of site-specific dominance, or sites of exclusive monopolization of space, they can be quite fluid and short-term. For example, sanderlings ( Calidris alba ) may defend feeding territories involving a short stretch of beach during high tides, while individual male white-tailed skimmers (family Libellulidae) defend small sections of ponds as mating territories for only a few hours, effectively “time-sharing” the same area with several other males within a day. Consequently, the current approach is to view territoriality as a fluid space-use system. In this system, a resource or area is defended to varying degrees and with varying success, depending on the costs and benefits of defense.",
  "The tendency to hold territories varies among closely related species, within species, and through time. The same individual may blink in and out of territorial behaviour as the distribution of resources, the competitive environment, or the individual’s internal physiological state changes. Biologists believe that territoriality is favoured where resources are economically defendable (that is, where the benefits of restricting access outweigh the costs of defense). Costs of territoriality depend upon the energy required to keep out intruders and the potential costs of direct combat. These costs are balanced by benefits that include exclusive access to food, mates, breeding sites, and shelter.",
  "A territory’s extent varies among species. Typically, territories include sites of egg deposition, burrow entrances, nest sites, food plants, feeding space, advertisement perches or display sites, roosting sites, shelters, grazing areas, food stores or communal caches, foraging space, and even patches of sunlight in the forest. Territories may contain a single critical resource, such as the bee nests defended by male orange-rumped honey guides ( Indicator xanthonotus ) in the Himalayas. In other cases, as in many territorial songbirds, males defend multipurpose territories for which it is difficult to identify a single key resource.",
  "The costs and benefits of competing for space, and ultimately resources, depend on the density of competitors and on how resources are distributed. When resources are clumped, they are more easily managed and defended. In contrast, as they become increasingly spread out or as their relative quality declines, the benefits and ease of defense are reduced. Conversely, when resources are too high in quality, competition may be so intense that exclusivity is impossible or simply too costly to maintain. Consequently, territoriality is generally expected when resources are of intermediate quality.",
  "If the quality of a resource varies by season, there may be periods when the resource no longer provides enough benefits to warrant defense. If this is true, territoriality should correspond to the period of greatest benefit. For example, Yarrow’s spiny lizards ( Sceloporus jarrovii ) appear to maintain mating territories only when the majority of females are receptive to mating. As more preferred areas are taken, some individuals forgo territoriality. In rufous-collared sparrows ( Zonotrichia capensis ), for example, males without access to high-quality territories live on the fringes of the territories of older, more dominant males.",
  "  Territoriality is one way that animals compete for and partition resources. Within groups, individuals may compete for resources and space by means of social dominance. Dominance interactions refer to the behaviours occurring within or between social groups that result in hierarchical access to resources or mates; they do not refer to the use of space. Dominant individuals are characterized as being more aggressive and successful in winning competitive interactions than other group members. Dominance may be established through direct or indirect aggression or by mutual display, where the dominant individual usually assumes a higher stature and the subordinate often bows or mimics juvenile behaviour.",
  "As with many other aspects of social behaviour, an economic argument is used to explain why dominance is sometimes resolved by display rather than fighting. Because symmetrical contests involve contestants that by definition have an equal chance of winning, contests involving individuals close in dominance status should involve the most fighting. In contrast, when one individual is clearly superior, the lesser individual will gain little by challenging and may even suffer injury in the process of trying. Thus, clearly established dominance hierarchies are thought to be advantageous to both dominants and subordinates due to a reduction in the frequency of energetically expensive and dangerous fighting. Often, life is smooth within social groups not because of a lack of competition, but because dominance is established and the hierarchy is clear.",
  "Dominance hierarchies have been shown to play a critical role in mating patterns in black-capped chickadees ( Poecile atricapillus ), where more dominant males tend to mate with more dominant females. Higher-status pairs then experience greater overwinter survival, presumably compete more effectively for high-quality breeding space, and produce more offspring.",
  "Dominance often correlates with mating success in polygynous societies. In some cases, dominant males gain preferred positions in mating arenas and are more likely to be chosen by females. An understanding of why subordinates should accept their lower-status can be gained by examining the options available to lower status individuals. A subordinate has a finite number of choices: remain in its social group, join another group where its chances are better, or become solitary. Solitary individuals will lose the benefit of being in a group, and individuals that emigrate will face the difficulties of locating and joining a new group. If the new group offers greater opportunities for achieving high status, emigration will be favoured. Familiarity with group members and with foraging and shelter sites will favour remaining with the group. The future opportunities of young animals may be enhanced by the skills they learn as subordinates, and, when groups comprise relatives, nepotism may also favour staying. Often, subordinates are willing to bear the costs of reduced access to mates and resources when the alternatives available to them are even worse.",
  "Subordinates often exhibit an array of tactics or behaviours that help them make the best of their low status. These alternative strategies include the sneaky mating tactics of subordinate male bullfrogs ( Lithobates catesbeianus ) and the specialized group of small male (“jack”) coho salmon ( Oncorhynchus kisutch ), which act as “satellites” and try to intercept females as they are attracted to the territories of large males. Other examples include the female-mimicking behaviour of subordinate male rove beetles (family Staphylinidae) and the satellite behaviour of horseshoe crab ( Limulus polyphemus ) males. In the former example, mimicks benefit from reduced aggression and thus increased access to matings; in the latter, subordinate male horseshoe crabs may fertilize some of a female’s eggs while she is mating with a more dominant male. Such alternative reproductive tactics enable males to circumvent the constraints of low status. In some cases, these activities may allow subordinate males to achieve fitness benefits comparable to those of more dominant individuals.",
  "The benefits of forming dispersal swarms, flocks, and coalitions are considered similar to the advantages of living in aggregations as both exploit the potential benefits of living in groups. Moving about in groups can provide additional advantages, such as the reduction in turbulence and energy savings accrued by geese migrating in V-formations. However, dispersal and migration are energetically expensive and fraught with danger because they require facing unfamiliar surroundings.",
  "If group size is associated with the ability to compete for and monopolize space, specialized breeding areas, or wintering sites, group dispersal may yield advantages when it comes time to settle. For example, increased group size makes coalitions of lions and coalitions of acorn woodpeckers more competitive in fights for the infrequent breeding vacancies arising in other groups. In the case of lions, however, these benefits do not extend to the female prides for which the males compete; males often kill unrelated infants upon joining a pride to increase their own chances of siring offspring with the group’s females.",
  "Cooperative breeding occurs when more than two individuals contribute to the care of young within a single brood. This behaviour is found in birds, mammals, amphibians, fish, insects, and arachnids ; however, cooperative breeding is generally rare because it requires parental care, which is itself an uncommon behaviour. In birds, which have a high taxonomic commitment to biparental care, about 3 percent of species are cooperative breeders. Cooperative breeding is generally linked to cases of restricted dispersal and cases where opportunities for prolonged contact between close relatives occur (such as in species inhabiting mild climates with year-round residency).",
  "In vertebrates , most cases of cooperative breeding involve helpers at the nest (such as offspring from prior years that remain near their parents and help rear younger siblings). Species with helpers include common crows ( Corvus brachyrhynchos ), Florida scrub jays ( Aphelocoma coerulescens ), and a variety of tropical species—particularly in Australia. Relatively few cases involve cooperative polygamy or mate sharing, in which there are multiple cobreeders of one or both sexes. Examples of mate-sharing behaviour occur in acorn woodpeckers ( Melanerpes formicivorus ), dunnocks ( Prunella modularis ), and common moorhens ( Gallinula chloropus ).",
  "The outcome of mate sharing in birds and other taxa where reproduction is potentially shared is highly variable. In so-called egalitarian societies, two or sometimes three breeders may share maternity equally (as occurs in joint-nesting female acorn woodpeckers). In contrast, in some societies reproduction is highly biased toward the activities of a single individual (frequently referred to as “reproductive skew” or “skewed reproduction”). For example, in some ant colonies a single female (the queen) lays all the eggs.",
  "Reproductive sharing is costly and occurs in a variety of organisms. Cooperation and competition over shared reproduction may even occur in simple multicellular organisms, such as the “social amoeba” ( Dictyostelium discoideum ). Clones of Dictyostelium form a multicellular fruiting body called a plasmodium. Superficially, the plasmodium resembles a slug, but it is essentially an aggregation of free-living, haploid, amoeba-like, cells that will later grow a sterile stalk. The stalk raises the spores off the ground and facilitates their dispersal. Sometimes cells that come from different clones cooperate to form the plasmodium. When slugs form from two different haploid cells, the clones do not contribute equally to the reproductive spores; often a “cheater” can be identified that contributes proportionally more to spores than to the sterile stalk.",
  "In birds, cooperative breeding is generally believed to be a result of a shortage of high-quality territories or mates, and helpers will typically become breeders if given the opportunity to do so. These constraints favour philopatric individuals (that is, those individuals who do not disperse). Those individuals stay home, where they may augment their fitness by helping their parents raise younger offspring. In some cases, there is good evidence that young birds weigh the inclusive fitness benefit of staying home and helping against the fitness benefits of settling in available, lower-quality territories. Helpers often behave parentally by feeding nestlings and defending the nest. They may vary in how much they feed or defend, but the division of labour is neither extreme nor does it tend to be fixed or stereotyped.",
  "In Kalahari meerkats ( Suricata suricatta ), breeding individuals of both sexes live in cooperative groups, with dominant members accounting for the bulk of reproduction. Group augmentation, a positive group-size effect on reproduction, arises because helpers enhance pup growth and survival by babysitting, which is only done by subordinates. Babysitting sometimes involves remaining in the burrow without food for up to 24 hours. The sacrifice of helpers is measurable as weight loss, but helpers of both sexes have been shown to benefit from living in the group with fitness gains through both direct reproduction and the raising of nondescendant kin. Female subordinates become pregnant, albeit less successfully than dominants, and compete for reproductive success within the group by committing infanticide . Male subordinates have been shown to foray to other groups, where they compete to sire extragroup young. While these strategies are not equivalent to breeding as a dominant, they provide young animals with fitness-enhancing options in a breeding environment constrained by food, predation, and availability of breeding vacancies.",
  "Eusocial insects show more extreme forms of sociality with a reproductive division of labour in which individuals form castes that perform different colony functions. The classic example of this phenomenon is the honeybee ( Apis mellifera ) colony. The colony is made up of a single large queen, who lays eggs, and tens of thousands of workers, who perform the work associated with foraging and colony maintenance. Similarly, in some species of termites , queens become so large with eggs that their abdomens are stretched to several times the normal body length. Their enormous size renders them virtually immobile.",
  "Honeybee workers are effectively sterile daughters with reduced ovaries that only occasionally lay unfertilized eggs which develop into males. Workers start out by tending eggs and larvae and by defending the colony. As they age, they switch to foraging outside the hive, a dangerous task that requires navigational ability and spatial memory. Termites and ants also have workers that tend to the queen and perform colony tasks. In addition, some termite, ant, and aphid species have specialized soldier castes that are designed for defense.",
  "Throughout the eusocial insects, there is a tremendous bias in reproduction favouring one or a few individuals and a great deal of self-sacrifice on the part of workers. Most workers will never have the opportunity to reproduce. Multiple queens occur in some social insects like paper wasps ( Polistes ), in which one to three females will found a colony together and share reproduction to a greater or lesser extent.",
  "The important advance of kin selection theory as proposed by W.D. Hamilton was that individuals have an inclusive fitness that combines kin-selected fitness benefits with direct reproductive benefits into a single measure of “offspring equivalents.” Normally, sisters have half their genes in common, and individuals who help parents produce an additional sister gain as much inclusive fitness as if they had an offspring of their own. What intrigued Hamilton is that certain insects of the order Hymenoptera , particularly ants, bees, and wasps, have a bizarre genetic system called haplodiploidy.",
  "Under this system, males are derived from unfertilized (haploid) eggs with half the number of gene copies of a normal fertilized (diploid), female-destined egg. This means that haploid fathers have only one set of genes to give their daughters and that all of their sperm are identical. Diploid mothers, however, produce a multitude of genetically different eggs by assorting half their genes into eggs at random. In a group of sisters with a common father, the genes they receive from their mother are 50 percent identical, whereas all the genes they receive from their father are 100 percent identical. The result is that ant, bee, and wasp sisters share 75 percent of their genes through common ancestry, whereas they share only 50 percent of their genes with their own daughters.",
  "In other words, because of haplodiploidy, full sisters are worth 1.5 offspring equivalents, and female workers potentially transmit more copies of their genes by helping their mother produce more sisters than by producing their own daughters and sons. This result excited Hamilton because it provided a potential explanation for why social hymenopterans often have large, apparently altruistic colonies with large numbers of workers that forgo their own reproduction to help their mother (the queen) produce more sisters. Additional study has revealed that this bizarre genetic system may be a predisposing, rather than a causal, factor in the evolution of eusociality. There is evidence, for example, that haplodiploidy is unlikely to be an exclusive cause of social behaviour in the Hymenoptera. Queens regularly mate with multiple males, and thus sperm is provided by more than one source, thereby diluting the haplodiploidy effect on sister relatedness. In addition, multiple queens may found wasp colonies, and each foundress may help to raise nieces instead of sisters.",
  "The most widely accepted explanation for the extreme social behaviour seen in eusocial insects and mole rats is a more generalized form of kin selection combined with a reduction in opportunities for personal reproduction. Declines in personal reproduction are thought to result from high predation rates, a shortage of available nest sites, and a short breeding season. As in the case of cooperatively breeding birds, opportunities to survive and reproduce away from the colony are limited, favouring individuals that stay home. If individuals remain in their natal groups, within-colony relatedness will be high, in general, and kin selection will be a potentially important evolutionary force that favours cooperation.",
  "Once individuals live in eusocial colonies, the selection for traits that improve colony efficiency will be strong, whereas the selection for survival of individual workers will be weak. This type of colonial living can lead to the evolution of suicidal behaviour. For example, a worker honeybee may sting a predator and die leaving its sting lodged in the victim. Hamilton’s rule provides an explanation of why this and other self-sacrificial behaviours might evolve in social species. As colony size increases, a honeybee worker’s survival becomes proportionally less important to her own inclusive fitness (that is, the sum total of her ability to pass on her genes or the genes of close relatives to the next generation) than the survival of the colony.",
  " Communication plays a critical role in aggregation, reproductive behaviour, territoriality, dominance interactions, parental care, and cooperative interactions within families. By definition, communication involves at least one sender producing a signal conveying information that in some way alters the response of the receiver. Signaling systems are favoured when sender and receiver both gain from the interaction.",
  "When individuals advertise their strength or condition, costly signals are favoured, because they more honestly convey individual quality. When signals are deceptive, an evolutionary arms race ensues, favouring receivers that disregard dishonest signals and senders that are increasingly deceptive. It is generally less costly to receive a signal than to send one, but receivers may also incur costs when discriminating among and responding to signals.",
  "Signals exhibit extraordinary diversity and may involve specialized plumage, elaborate morphological characters, vocalizations , pheromones , vibrations, or chemicals that are perceived by taste. Like most adaptations, signals are usually modifications of previously existing structures or behaviours. For example, behaviours such as preening and feeding have become increasingly ritualized to function as signals in certain groups of animals. In many cases, displays appear to involve redirected, ritualized aggression , during which individuals compete for dominance (and thus indirectly for access to mates or resources) via contests of strength or endurance. Contestants appear to avoid using deadly force, even though in some species—such as wolves and rattlesnakes ( Crotalus )—individuals appear well equipped to kill or significantly harm each other. In others, signals may have functioned originally in species recognition but were modified later to convey information about the relative quality of individuals within a species. In general, signals of mate attraction will be shaped both by the mating advantages they confer and by the advantages of avoiding the costs of hybridization.",
  "By tracing the evolutionary history of a group of organisms, it is sometimes possible to examine how signals have evolved. For example, pheromones used by herbivorous insects may have originated with the use of plant compounds. Later evolved species produced a synthesis and a blending of chemicals that generated increasingly complex and informative mixtures. In some frogs, a preference for certain components of the male’s call occurred in the ancestor of species producing the call. This modern preference suggests that the call was favoured by a preexisting bias in ancestral females.",
  "Signals are often special modifications of starting material that either had no function or previously functioned in an entirely different context. For example, insects often produce song by stridulating (that is, rubbing body parts together). The structures used are legs and wings, although signaling in many crickets and katydids is enhanced by special rasplike modifications of the cuticle.",
  "The breeding plumage, display behaviour, and elaborate vocal behaviour of male birds are energetically costly to produce and maintain, suggesting that they are honest indicators of age, status, and condition. Such signals also typically increase the conspicuousness of the sender. In the cases where species use elaborate signals (such as in the long tails of male African widowbirds), the ability to use a structure for its original function ( flight and balance) may be compromised. In widowbirds, flight and balance costs are countered by benefits related to the female’s mating preference for long-tailed males. Another classic example of a costly signal is the chuck call of the túngara frog ( Physalaemus pustulosus ). Females prefer the chuck call; however, by producing the call, males increase their risk of predation by bats.",
  "The honesty of signals produced by widowbirds and Túngara frogs is maintained because only superior individuals can bear the costs of reduced flight performance or greater conspicuousness to predators. In some cases, bright plumage in male birds appears to be an honest signal of disease resistance through its complex relation to the endocrine and immune systems . Bright plumage is associated with high testosterone levels; however, testosterone itself appears to suppress the immune system. In the superb fairy wrens ( Malurus cyaneus ) of Australia, males vary considerably in timing of their nuptial molt , and females prefer males that molt into bright plumage earlier in the season. As a result, it is possible that only the fittest males can afford the immunity costs of maintaining bright plumage, and females might prefer bright males because they are better able to resist disease and pass on to their offspring copies of genes for resistance.",
  "The design of a signal depends upon its function and the type of information it conveys. Function will dictate how far the signal must travel, whether or not it should convey information about an animal’s location, how persistently the signal is given, the signal’s variability, and how informative or arbitrary the signal is. Design will differ along these lines depending on whether it is used in mate attraction, courtship, territorial defense, aggression, or alarm. Signal evolution is also influenced by costs. For example, mate attraction signals are often highly conspicuous, whereas alarm calls are often simple tones that are difficult to locate. Signal costs can be greatly increased when other species evolve the ability to “eavesdrop” on the signaling animal. For example, the tachinid fly (family Tachinidae) may cue in on a male cricket’s song and lay a parasitic egg on the cricket while he is busy attracting a mate.",
  "The proximate causes of social behaviour include the underlying genetic, developmental, physiological (that is, neural and endocrine), and morphological mechanisms. Proximate mechanisms are required to trigger the onset of a particular behaviour—such as sexual behaviour in rats ( Rattus ), the development of singing behaviour and song recognition in white-crowned sparrows ( Zonotrichia leucophrys ), the cessation of brood care and the onset of foraging behaviour in worker honeybees, and the development of bright plumage and sexual display in the superb fairy wren. While proximate mechanisms do not explain the evolutionary basis of a behaviour, they provide insight into the ways in which organisms are adapted to perform remarkably intricate and complex functions.",
  "Early on, researchers debated the relative importance of “nature,” or genetic predisposition, and “nurture,” or environment, in the development of behaviour. Through extensive observation and experimentation, biologists have come to recognize that the argument is futile. Ultimately, both are important, and the interesting questions lie in how genetic predisposition and the environment interact. The environment includes such factors as nutrition , the animal’s hormones , its experience of the outside world, and various features of the social milieu. Examples of the interplay between nature and nurture in the development of social behaviour can be found in studies of the inheritance of IQ in humans, song type and song learning in birds, performance of specialized tasks in eusocial species, and the mate and kin recognition systems of animals.",
  "An excellent example of a genetic predisposition comes from studies of the migratory behaviour of blackcap warblers ( Sylvia atricapilla ) in Europe. When reared in captivity, the directional orientation of warblers from southwestern Germany is southwest as they begin their migration, whereas birds from Austria orient west. When the German and Austrian birds hybridize, the orientation of their offspring is intermediate between the preferred directions of the parents. The resulting change in orientation demonstrates a genetic role in determining the direction of migration.",
  "Other behaviours for which a clear genetic basis has been established include the dichotomy between roving and sedentary foraging in fruit flies (families Trypetidae and Drosophilidae) and the maternal behaviour of mice (family Muridae). In genetic crosses of great tits ( Parus major ), genetic effects accounted for variation in individual boldness and the tendency to explore new environments. In addition, newly available molecular genetic techniques have begun to generate considerable information on how genes influence behavioral development. In honeybees the switch from working in the hive to foraging is associated with a 39 percent change in gene product expression in the brain, indicating that developmental change is associated with changes in gene regulation. Behavioral genetics is a growing field with significant potential for uncovering new information on the relative inputs of nature and nurture to behavioral development.",
  "Some of the most widely recognized evidence for the inheritance of behaviour comes from comparison of identical and fraternal twins reared apart. Identical twins come from a single egg and are genetically identical, whereas fraternal twins develop from separate eggs and share only half their genes by common inheritance. When raised in separate homes, identical twins are far more similar to each other than are fraternal twins, indicating that a variety of behaviours and preferences have a genetic basis. One such twin study suggested that 70 percent of the variation in IQ in the study population had a genetic basis, although environmental variables (such as early nutrition and opportunities for early learning) still played important roles. Specific alleles of the dopamine receptor gene (DRD2) are associated with susceptibility to post-traumatic stress disorder and alcoholism , and this gene also appears to influence children’s resilience to stress and family trauma.",
  "Hormones, developmental mechanisms, neural mechanisms, learning, the social environment, and the physical environment all exert proximate influences on behaviour. The development of birdsong provides examples of several of these. The songbird brain has two main neural pathways. The first is a motor pathway involved in song production, and the second is a pathway in the anterior forebrain that is involved in song learning and recognition. In some species, learning is restricted to the first year of life. In others, learning is open-ended and continues long after the first year. By using a technique that destroys brain cells, biologists have been able to narrow down and identify parts of the songbird brain that are differentially involved in learning and recognition. Compared with crickets, which produce a highly stereotyped species-specific call without ever hearing another cricket, young birds must hear and practice the songs of conspecifics. The experience of hearing and practicing provides the necessary link between the auditory and song systems required to sing properly as adults. Most authorities contend that early song memories are stored in the brain as a “song template.” The bird then refers to the song template as it practices the song.",
  "The song of the zebra finch ( Taeniopygia guttata ) illustrates the hormonal influences on song development and singing behaviour. After the birds hatch, male and female brains develop differently. Injecting females with estrogen early in development causes them to develop malelike brains, but they will not sing male song unless they receive an implant of the male hormone, testosterone . In this example, both the early injection of estrogen and an implant of testosterone later on are necessary to produce females that sing male song. The estrogen allows females to develop the neural circuitry to undergo the learning required to produce song and the testosterone is required to stimulate females to sing.",
  "Hormones can be used to stimulate females to exhibit malelike behaviour in other organisms. Female rats injected with testosterone as newborns will exhibit male copulatory behaviour as adults, and males castrated at birth will develop femalelike brains and behaviours. Hormones can even be transferred among fetuses. For example, fetal mice that develop in the uterus between two males will be more aggressive later on than mice that develop between two females.",
  "In honeybees, juvenile hormone (an insect developmental hormone) primarily influences larval development. Juvenile hormone also affects adult behaviour by stimulating development of a brain region known as the mushroom bodies. In addition, this hormone causes workers to cease brood care and begin foraging. Mushroom bodies are thought to be involved in spatial memory, an ability that enables an animal to use landmarks during trips to favoured foraging sites.",
  "The critical importance of social influences on behavioral development can be seen throughout the period of song learning in song sparrows ( Melospiza melodia ). There is a sensitive period in the first summer of life when young birds learn much of their song, but field studies show that learning also continues through the first year. In song sparrows this involves developing and storing fairly exact copies of older neighbours’ songs in a region of the brain called the forebrain song nuclei. A young song sparrow occupying a territory learns the songs of his near neighbours and then strings together elements from several to produce his own song. Males are more likely to store and learn song types that are shared among two or more of their neighbours. The end result is that each song sparrow holds roughly half its eight to nine song types in common with its neighbours. The adaptive function of such song sharing behaviour may be that it facilitates the rapid detection of intruders.",
  "Mechanisms of recognition are essential if individuals are to discriminate members of their social group, choose a mate of the appropriate sex, locate their parents, care for the right offspring, and offer preferential treatment to kin. Early work in this area involved precocial birds, which often forage shortly after hatching, creating a need for mechanisms that allow them to recognize their parents. Austrian zoologist Konrad Lorenz , one of the fathers of ethology, demonstrated that graylag geese ( Anser anser ) imprint on their mothers shortly after hatching. When goslings imprinted on Lorenz, they followed him around just as they would their mother. After these geese became adults, they even courted human beings.",
  "Sex-recognition mechanisms show imprinting effects as well. In a bill-painting experiment, young albino zebra finches were exposed to parents with bills painted different colors. After the finches became adults, males could be tricked into courting the wrong sex by reversing male and female bill colours of adults.",
  "Parents engaging in parental care also require mechanisms that permit them to recognize their offspring. Offspring recognition probably involves odour in most insects and mammals. When they recognize their offspring, birds tend to use markings or vocalizations rather than scent. In many species of birds, parents do not recognize nestlings of other pairs that are artificially fostered into their nests; this lack of recognition is probably due to the fact that nestlings do not move around from one nest to another in the wild. Consequently, there has been no selection for such recognition. Conversely, nestlings of colonial bank swallows ( Riparia riparia ) often move between adjacent holes, and parents are able to recognize their own chicks on the basis of their vocalizations. In addition, offspring recognition can be extraordinarily precise as in Mexican free-tailed bats ( Tadarida brasiliensis ). In this species, mothers are 70 percent accurate in picking out their own pups from among thousands of pups huddled in a small area of cave ceiling.",
  "Kin recognition systems also play a role in contexts where it pays to favour close over distant kin. The three mechanisms of kin recognition are the use of environmental cues, prior experience, and phenotype matching (that is, looking or smelling right). Examples can be found in the joint-nesting behaviour of paper wasps and the kin-directed alarm calls of ground squirrels.",
  "Paper wasp foundresses pick up odours and odour preferences from their natal nests that are later used to discriminate and preferentially associate with nest mates when it is time to found a colony. In contrast, recognition in Belding’s ground squirrels involves a combination of prior association and phenotype matching. Unrelated Belding’s ground squirrels reared together treat each other as kin, whereas siblings reared apart do not. There is a component of kin recognition in ground squirrels, however, that must be based on genes or contact between individuals in the womb. Even though they have been reared apart, siblings are more likely than nonsiblings to associate with each other. The most compelling evidence for phenotype matching comes from house mice ( Mus musculus ): they use odour cues associated with genetic variation in the major histocompatibility complex (MHC) to recognize and avoid mating with relatives. (The MHC is a group of genes that code for proteins found on the surfaces of cells that help the immune system recognize foreign substances.)",
  "Understanding the ultimate and proximate causes of social behaviour in various animals provides a compelling case that evolutionary history, natural selection, development, endocrine and neural mechanisms, and the social environment all might well affect the expression of social behaviour in human beings. The process of explaining human behaviour, however, is a daunting exercise. If songbird social and sexual behaviour is the complex outcome of a large number of developmental and physiological processes, then it is unlikely that simplistic approaches to understanding human behaviour will be accurate.",
  "For example, American psychologist John Money considered the social environment to be of overriding importance in gender identity. In treating children whose sex was ambiguous at birth, such as those with underdeveloped genitalia, he recommended that they be raised according to the parents’ initial perceptions of the child’s gender rather than the actual genetic sex of the child. This resulted in parents raising genetic boys as girls and vice versa, often requiring surgery and hormonal treatments later on in life. The complex nature of sexual behaviour observed in various animal studies and studies of human adults and adolescents suggests that Money’s social approach to sexual identity has a weak scientific foundation. These studies also suggest that decisions regarding how to treat cases of ambiguous gender should instead be based on a comprehensive knowledge of the neural, hormonal, physiological, genetic, and social bases of sexuality.",
  "Similarly, the relatively new discipline of evolutionary psychology can easily go too far in extending evolutionary principles to human behaviour. Extant behavioral traits in humans were not shaped by the current environment. Rather, the environmental context in which humans evolved was probably quite different from that of the modern world. People in ancestral societies lived in smaller groups, had more-cohesive cultures, and had more stable and rich contexts for identity and meaning. As a result, it is important to be cautious when using present circumstances to discern the selective bases of human behaviour. Despite this difficulty, there have been many careful and informative studies of human social behaviour from an evolutionary perspective. Infanticide , intelligence , marriage patterns, promiscuity, perception of beauty, bride price, altruism, and the allocation of parental care have all been explored by testing predictions derived from the idea that conscious and unconscious behaviours have evolved to maximize inclusive fitness. The findings have been impressive. As with other species, however, it is important to critically evaluate and avoid overextending the evidence.",
  "One of the key criticisms of human sociobiology is borne of fear that the findings will be used to effect unfair or immoral policies. Examples include use of social Darwinism to justify discriminatory practices , economic policies that benefit relatively few at the expense of many, genocide , eugenics, and legal systems that fail to protect the vulnerable segments within populations. These potential problems suggest the need for deep ethical consideration of the implications of evolutionary psychology. Such an approach would investigate how results might be used ethically, to benefit society, or unethically, to cause harm.",
  "For example, consider the finding that stepfathers are more likely than biological fathers to abuse and kill nonbiological children in the household. This finding could be used to justify an increase in the social services available to blended families, particularly those in which the mother has biological children from a previous marriage. In developing countries, an understanding of the evolutionary context of bride-price (monetary or other resources given to the family of a potential bride) could be used to predict and ameliorate the detrimental impacts of rapid social change that accompanies an influx of Western culture and technology.",
  "The real danger lies not in the scientific findings of evolutionary psychology but in the failure to recognize that scientific findings should never dictate ethics and morality. Policies that affect the rights, opportunities, and dignity of human beings occur within the moral rather than the scientific realm of human endeavour.",
  "General texts with a major focus on social behaviour include John Alcock , Animal Behavior , 8th ed. (2001); Aubrey Manning and Marian Stamp Dawkins , An Introduction to Animal Behaviour , 5th ed. (1998); John W. Bradbury and Sandra L. Vehrencamp , Principles of Animal Communication (1998); and J.R. Krebs and N.B. Davies , An Introduction to Behavioural Ecology , 3rd ed. (1993). James F. Wittenberger , Animal Social Behavior (1981), is older but still among the best and most comprehensive treatises covering sociality. Several other older texts providing valuable interpretations of the field include Andrew Cockburn , Social Behaviour in Fluctuating Populations (1988); Robert Trivers , Social Evolution (1985); Martin Daly and Margo Wilson , Sex, Evolution, and Behavior , 2nd ed. (1983); David P. Barash , Sociobiology and Behavior , 2nd ed. (1982); and John Tyler Bonner , Cells and Societies (1955, reprinted 1966).",
  "A series of excellent nontechnical books covering evolutionary theory in general and social behaviour in particular are by Richard Dawkins : The Extended Phenotype: The Long Reach of the Gene , rev. ed. (1999), The Blind Watchmaker (1986, reissued 1996), Climbing Mount Improbable (1996, reissued 2006), and River out of Eden: A Darwinian View of Life (1995). Other nontechnical books covering general issues in the field of social behaviour, often related to human behaviour, include John Alcock , The Triumph of Sociobiology (2001), a defense of sociobiology by one of its leading proponents; Tim Birkhead , Promiscuity: An Evolutionary History of Sperm Competition (2000), a nice account of the evolution of mating behaviour in animals; Lee Dugatkin , Cheating Monkeys and Citizen Bees: The Nature of Cooperation in Animals and Humans (1999), a popular book discussing cooperation in animals and how it relates to sociality in humans; Jared Diamond , Guns, Germs, and Steel: The Fates of Human Societies (1998, reissued 2005), a thoughtful treatment explaining the development of human societies; Helena Cronin , The Ant and the Peacock: Altruism and Sexual Selection from Darwin to Today (1991), an excellent introduction to sexual selection; Sarah Blaffer Hrdy , The Woman That Never Evolved , rev. ed. (1999), and Mother Nature: A History of Mothers, Infants, and Natural Selection (1999), two highly readable books covering the evolution of female social behaviour; Michael Nichols and Jane Goodall , Brutal Kinship (1999), a book about violence and competition in humans and primates; and Frans de Waal , Good Natured: The Origins of Right and Wrong in Humans and Other Animals (1996), a discussion of the evolutionary origins of morality.",
  "Volumes that are either more technical in nature or that focus on more specific topics in social evolution include Luc-Alain Giraldeau and Thomas Caraco , Social Foraging Theory (2000), a synthesis of theory and empirical evidence on the ways in which animals search and compete for food in groups; Sue Boinski and Paul A. Garber (eds.), On the Move: How and Why Animals Travel in Groups (2000), focusing on the organization of group movement; and Paul W. Sherman and John Alcock (eds.), Exploring Animal Behavior , 4th ed. (2005), a collection of behavioral papers written for a general scientific audience, several of which focus on the adaptive value of social behaviour. Other such works include Douglas W. Mock and Geoffrey A. Parker , The Evolution of Sibling Rivalry (1997), a discussion of the evolution of competition within families; Amotz Zahavi and Avishag Zahavi , The Handicap Principle: A Missing Piece of Darwin’s Puzzle , trans. from Hebrew (1997), a discussion of a novel and potentially unifying principle of animal behaviour; Jacob Höglund and Rauno V. Alatalo , Leks (1995), an authoritative monograph covering the evolution of mating arenas; Malte Andersson , Sexual Selection (1994), a summary of theory and research related to mate attraction and male-male competition; T.H. Clutton-Brock , The Evolution of Parental Care (1991), a review of the diversity of parental care systems; and Nikolaas Tinbergen , Social Behaviour in Animals, with Special Reference to Vertebrates (1953, reissued 1990), the classic popular account by one of the founders of modern ethology. Lastly, Lee Dugatkin , Cooperation Among Animals: An Evolutionary Perspective (1997); and Robert Axelrod , The Evolution of Cooperation , rev. ed. (2006), are works that focus on the mechanisms by which cooperation can evolve.",
  "Works that provide the foundation for modern evolutionary studies of social behaviour include Edward O. Wilson , Sociobiology: The New Synthesis (1975, reissued 2000); Richard Dawkins , The Selfish Gene , new ed. (1989, reissued 2006); and George C. Williams , Adaptation and Natural Selection (1966, reissued 1996). A collection of technical papers by the founder of inclusive fitness theory and one of the 20th century’s most brilliant theoretical biologists is W.D. Hamilton , Narrow Roads of Gene Land , 3 vol. (1996–2006).",
  "Classic texts that consider the social behaviour of insects include Bert Hölldobler and Edward O. Wilson , The Ants (1990); Randy Thornhill and John Alcock , The Evolution of Insect Mating Systems (1983); and Edward O. Wilson , The Insect Societies (1971). Other, mostly technical, volumes dealing with insect social behaviour include Leigh W. Simmons , Sperm Competition and Its Evolutionary Consequences in the Insects (2001); Darryl T. Gwynne , Katydids and Bush-crickets (2001); Gilbert Waldbauer , Millions of Monarchs, Bunches of Beetles: How Bugs Find Strength in Numbers (2000); Jae C. Choe and Bernard J. Crespi (eds.), The Evolution of Social Behavior in Insects and Arachnids (1997); Ross H. Crozier and Pekka Pamilo , Evolution of Social Insect Colonies: Sex Allocation and Kin Selection (1996); and Andrew F.G. Bourke and Nigel R. Franks , Social Evolution in Ants (1995).",
  "Books that primarily focus on the social behaviour of birds include Peter Bennett and Ian P.F. Owens , Evolutionary Ecology of Birds (2002); Charles R. Brown and Mary Bamberger Brown , Coloniality in the Cliff Swallow (1996); N.B. Davies , Dunnock Behaviour and Social Evolution (1992); Bernd Heinrich , Ravens in Winter (1989); Nikolaas Tinbergen , The Herring Gull’s World: A Study of the Social Behaviour of Birds , rev. ed. (1961, reprinted 1989); Jerram L. Brown , Helping and Communal Breeding in Birds (1987); and David Lack , Ecological Adaptations for Breeding in Birds (1968).",
  "For mammals other than primates, notable volumes include Scott Creel and Nancy Marusha Creel , The African Wild Dog: Behavior, Ecology, and Conservation (2002); Nigel C. Bennett and Chris G. Faulkes , African Mole-rats: Ecology and Eusociality (2000); Janet Mann et al. (eds.), Cetacean Societies: Field Studies of Dolphins and Whales (2000); Karen Pryor and Kenneth S. Norris (eds.), Dolphin Societies: Discoveries and Puzzles (1991); John A. Byers , American Pronghorn: Social Adaptations & the Ghosts of Predators Past (1997); John L. Hoogland , The Black-Tailed Prairie Dog: Social Life of a Burrowing Mammal (1995); and T.M. Caro , Cheetahs of the Serengeti Plains: Group Living in an Asocial Species (1994). Three books focusing on social behaviour in domesticated animals include L.J. Keeling and H.W. Gonyou (eds.), Social Behavior in Farm Animals (2001), a work containing a variety of fairly technical articles covering livestock and other common farm animals; John Paul Scott and John L. Fuller , Genetics and the Social Behavior of the Dog (1965, reprinted 1998; also reprinted as Dog Behavior: The Genetic Basis , 1974), a classic, comprehensive study of dog behaviour; and Stuart J. Dimond , The Social Behaviour of Animals (1970), a discussion of experiments on the development of social behaviour in domestic and caged animals. A treatment of the contributions of lizards to the study of social behaviour is Stanley F. Fox , Kelly McCoy , and Troy A. Baird (eds.), Lizard Social Behavior (2003).",
  "Worthy primate volumes include Jeanne Altmann , Baboon Mothers and Infants (1980, reissued 2001); Christophe Boesch and Hedwige Boesch-Achermann , The Chimpanzees of the Taï Forest (2000); Frans de Waal and Frans Lanting , Bonobo: The Forgotten Ape (1998); Barbara B. Smuts et al. (eds.), Primate Societies (1987); Jane Goodall , The Chimpanzees of Gombe: Patterns of Behavior (1986); R.I.M. Dunbar , Reproductive Decisions: An Economic Analysis of Gelada Baboon Social Strategies (1984); Frans de Waal , Chimpanzee Politics: Power and Sex Among Apes (1982, reissued 2007; originally published in Dutch, 1982); and Sarah Blaffer Hrdy , The Langurs of Abu: Female and Male Strategies of Reproduction (1977). Several excellent volumes focusing specifically on human social behaviour include Bobbi S. Low , Why Sex Matters: A Darwinian Look at Human Behavior (2000); Matt Ridley , The Origins of Virtue: Human Instincts and the Evolution of Cooperation (1997); Robert Wright , The Moral Animal (1994, reissued 2004); and Richard D. Alexander , The Biology of Moral Systems (1987)."
]