[
  "   wood ,  the principal strengthening and nutrient-conducting tissue of trees and other plants and one of the most abundant and versatile natural materials. Produced by many botanical species, including both gymnosperms and angiosperms , wood is available in various colours and grain patterns. It is strong in relation to its weight, is insulating to heat and electricity , and has desirable acoustic properties. Furthermore, it imparts a feeling of “warmth” not possessed by competing materials such as metals or stone, and it is relatively easily worked. As a material, wood has been in service since humans appeared on Earth. Today, in spite of technological advancement and competition from metals , plastics , cement , and other materials, wood maintains a place in most of its traditional roles, and its serviceability is expanding through new uses. In addition to well-known products such as lumber, furniture, and plywood, wood is the raw material for wood-based panels, pulp and paper , and many chemical products. Finally, wood is still an important fuel in much of the world.",
  "  In botanical terms, wood is part of the system that conveys water and dissolved minerals from the roots to the rest of the plant, stores food created by photosynthesis , and furnishes mechanical support. It is produced by an estimated 25,000 to 30,000 species of plants, including herbaceous ones, though only 3,000 to 4,000 species produce wood that is suitable for use as a material. Wood-producing forest trees and other woody plants are of two categories: gymnosperms and angiosperms . Gymnosperms, or cone-bearing trees, produce softwoods, such as pine and spruce , and angiosperms produce temperate and tropical hardwoods, such as oak , beech , teak , and balsa . It should be noted that the distinction implied by hardwood and softwood is not true in all cases. Some hardwoods—e.g., balsa—are softer than some softwoods—e.g., yew .",
  "Wood is a material of great economic importance. It is found throughout the world and can be sustainably managed as a renewable resource—in contrast to coal , ores, and petroleum , which are gradually exhausted. By means of its harvesting in forests , its transportation, its processing in workshops and industries, and its trade and use, wood provides jobs and supports economic development and, in some countries, basic subsistence. Indicative of this importance is the continued high demand for wood and wood products.",
  "On a weight basis, the consumption of wood exceeds by far that of other materials. More than half of roundwood (log) production is consumed as fuel, mainly in less-developed countries. Production of paper and paperboard has shown the most rapid increase among wood products; this trend is expected to continue as consumption per person in the less-developed countries approaches that in the developed nations. Rising world population is the driving force of increasing consumption of wood and consequent deforestation . The depletion of many forests, especially in the tropics, makes uncertain the provision of an adequate wood supply to satisfy the anticipated need. Efforts to stop the reduction of Earth’s forest cover and increase the productivity of existing forests, establishment of extensive reforestation programs and plantations of fast-growing tree species, recycling of paper, and improved utilization of wood through research could ease the problem of wood supply and help to lessen the environmental toll of the lumber industry.",
  "Harvesting of wood differs radically from harvesting of other crops. The yearly growth of each individual tree cannot be detached from the living plant. Rather, new wood is added inseparably to preexisting growth until the entire tree is harvested, after a waiting period that varies widely depending on intended use of the wood—for example, 2–3 years on energy plantations (where biomass is produced as fuel for power generation), 6–8 years for pulpwood ( eucalypts ), 12–15 years for fast-growing poplar hybrids, 30–50 years for fast-growing pines , and 100 years or more in temperate and tropical forests producing wood of large dimensions.",
  "A prerequisite to harvesting is a management plan, which determines the yearly yield and the method of removal. The harvest method chosen can involve clear-cutting large areas or selective cutting of individual trees or groups of trees. For a forest harvested under the sustained-yield concept, the volume of timber removed at periodic intervals is dependent on the net growth of all trees—as estimated by statistical sampling—during that interval. This concept, combined with natural and artificial seeding and planting, ensures a continuous production of wood and conservation of forests. To promote sustained-yield management, efforts have been made to introduce appropriate ecological labeling (ecolabeling) of marketed wood and wood products. Ecolabeling is intended to ensure that goods offered to the consumer have not been produced in a way detrimental to the environment.",
  "The season of harvest is not determined by the time of ripening, as it is for agricultural crops, but by such factors as the conditions of work for personnel, machines, and animals, such as nesting birds, and the danger of damage to the remaining forest and to the harvested wood. Because felled trees are vulnerable to attack by fungi and insects , the harvest may be timed to avoid conditions favourable for these organisms. Time of harvesting becomes a consideration mainly when the felled trees will not be removed quickly from the forest for processing. Otherwise—for example, in the United States—harvesting is a year-round activity.",
  "Harvesting includes marking the trees to be removed (in selective cutting), felling and processing (conversion) of trees, and transportation of the wood from the felling site, or stump area, to a roadside storage site or a central processing yard (landing) in the forest. Processing includes top removal (topping), delimbing, crosscutting into logs (bucking), debarking, and sometimes chipping of undesirable trees or logging residues. Processing may be done totally or partially in the forest; in the latter case, the remaining work is completed in a sawmill or other woodworking facility.",
  "Felled trees are handled by one of three harvesting systems: shortwood, longwood (or tree-length), or whole-tree. In shortwood harvesting, trees are completely processed (except perhaps for debarking) at the felling site; the logs are then transported to a storage yard or site and eventually to the factory where, if needed, they are debarked by machine. In longwood harvesting, the trees are only topped and delimbed at the felling site; the resulting long logs are then transported to the factory to be debarked and bucked. The whole-tree system omits processing at the felling site; topping and delimbing are done in a central processing yard, and debarking and bucking are performed either there or at the factory. In general, the shortwood system has the widest application.",
  "Marking of trees is done with a branding hammer or paint. Felling is commonly accomplished by chain saw; ax and handsaw are seldom used today. The standard technique for felling is to make an angular front cut, or undercut, on the side of the tree in the chosen direction of felling and then to saw a back cut so that the narrow strip of wood left between undercut and back cut breaks when the tree falls. The chain saw is also used for delimbing and bucking, and debarking is sometimes done in the forest by ax or spud (a combination of spade and chisel). In various forests of the world, animals such as horses, mules, oxen, and elephants are employed for skidding (dragging) the wood from the felling site to a concentration yard.",
  "  In contrast to the labour intensiveness of such traditional harvesting, a great variety of machines are available for all the above operations. Felling machines (fellers) are equipped with shears, chain saws, or circular saws; they are usually employed on small-diameter trees (e.g., for pulpwood), but larger machines are available for trees up to about 50 cm (20 inches) in diameter. Some machines are specialized to perform separate operations such as delimbing or debarking, whereas others carry out combined operations. For example, feller-bunchers fell and pile (bunch) trees. Harvesters combine felling, delimbing, and bucking; the logs are then loaded on forwarders for transport to a landing. Processors top, delimb, and bunch felled trees and pile the logs after the trees are bucked. Feller-skidders combine felling and skidding operations. Chippers can chip whole trees and load the chips into trucks or trailers. Also available are portable debarkers and portable machines called tree monkeys that can delimb (actually prune) and debark standing trees. Mechanical transportation is by wheeled or crawler (tracked) equipment, by cable systems, and seldom by helicopter or giant balloon. In cable systems (also called highland, or skyline, systems) the logs are transported while lifted partially or wholly off the ground. In the northwestern United States tall trees 80–100 metres (about 250–300 feet) high, their tops cut off by a climbing logger, are employed as masts, or spar trees, to attach the cables. Pulpwood logs are sometimes bundled at the felling site and transported on trailers to storage yards or directly to pulp mills. Loading is generally mechanized. If an operation, such as bucking or debarking, is not completed in the forest, it is performed in the factory by stationary machines or, in the case of debarking, by water jets.",
  "  Mechanization of harvesting is the trend, but regions of small annual yield and unfavourable topography restrict the potential of expensive machines, and in many countries human and animal labour is still commonly used. High mechanization in combination with extensive clear-cutting has very adverse environmental consequences, both in terms of carbon sequestration and in terms of the impact on biodiversity . Even when the forest is not entirely cleared, what remains is often a fragmented patchwork of forest habitat and fields or, in the event of more intensive logging, “islands” of forest surrounded by a “sea” of cleared areas. In mechanized selective logging, forests must be open enough to accommodate the machinery, which necessitates the removal of nontarget trees and understory growth. Selective logging often increases the flammability of the forest because it converts a closed, wetter forest into a more open, drier one. Heavy machinery compacts the soil , making it difficult for plant species to naturally recover. (For a detailed discussion of the management and conservation of forested land, see  forestry .)",
  "This section discusses the products of primary mechanical processing of wood—roundwood products (e.g., poles and pilings), sawn wood (primarily lumber), veneer, plywood and laminated wood, particleboard, fibreboard, and pulp and paper. It also discusses treatments (drying and preservation) that have been devised to improve the performance of wood in use and the chemical products that are derived or extracted from wood. Some products of primary manufacture, such as poles and posts, are used directly, but many constitute intermediate materials that by further processing are turned into secondary products such as furniture , building structures and components, containers, and musical instruments.",
  "Poles, posts, and certain mine timbers are products in round form. Poles are used in supporting telegraph and telephone lines and as pilings (foundations for wharves and buildings); posts are used in fences, highway guards, and various supports. As a rule, roundwood products are subjected to preservative treatment. The bark is removed in the forest or factory, and poles and posts are further processed by shaving to remove surface irregularities, by framing (boring holes and making necessary cuts), and by incising (punching slitlike depressions to facilitate the entrance of preservative chemicals).",
  "Lumber is the main sawn wood product. Lumber of large dimensions—more than about 10 cm (4 inches) in width and thickness—and suitable for heavy constructions is called timber. This loose term, however, is also applied to wood of a forest stand and to products of round form. Another important product made by sawing, and sometimes by hewing, is railroad ties. Although this section concentrates on lumber, production of other sawn products (such as parquet flooring) is similar in principle.",
  "Lumber is the product of the sawmill and ordinarily is not manufactured further than by sawing. It is produced in varying sizes, the usual approximate dimensions being 2–10 cm (about  3  4  –4 inches) in thickness, 8 cm (about 3 inches) and greater in width, and 2–6 metres (about 6–20 feet) in length. The conversion of logs to lumber involves breaking them down into boards of various thicknesses, resawing, ripping (edging), and crosscutting.",
  "The organization of production varies in its detail in different manufacturing plants but can be described in general terms. After transport from the forest, logs are stored in water, usually a pond or river, or in a ground storage yard. Each log enters the mill on a conveyor; in large operations it is mechanically debarked, and in some it is crosscut to length. Supported on a carriage, it is brought to a headsaw (the first saw ), which is one of three types: band saw, frame (gang) saw, or circular saw. A band saw consists of an endless band of steel, equipped with teeth usually on one edge only, that moves around two wheels—one powered and the other free-running. Frame saws commonly consist of a reciprocating frame in which a number of saw blades are mounted parallel to each other at predetermined lateral distances. A circular saw consists of a circular blade having teeth on its periphery and mounted on a shaft. Band and frame saws have relatively thin blades and are therefore less wasteful than circular saws. Band and circular saws permit changing board thickness and turning the log after each cut; therefore, breakdown is more advantageous in terms of yield and grade. Frame saws require that logs be sorted according to diameter, because the position of the blades (and thus the thickness of the lumber) is determined accordingly. Frame saws are being largely replaced by band saws. Machines for other operations can be sited behind the headsaw in the production flow; they include resaws (band or circular saws), edgers (band or circular saws, or chippers equipped with knives), and trimmers (circular saws for transverse cutting).",
  "  Breakdown is accomplished in one or more operations. For example, a combination of circular and frame saws, or two frame saws in series, may be used. The first saw removes slabs (the outside pieces cut from a log) and, in certain cases, some boards. The piece produced is then turned 90° and introduced into the second saw, which converts it into boards (cant sawing). The second operation may be considered resawing; in general, resawing consists of either dividing thick boards into thinner ones or producing boards from slabs. Ripping, or edging, is the removal of wane (edge areas with bark or some missing wood) from the sides of boards, frequently done by passing the board through a machine that has two small circular saw blades mounted on a shaft; one blade is stationary and the other can be moved sideways to set board width. Edging can also be done by chipping in a simultaneous sawing and chipping operation, with the chips directed to pulp, fibreboard, or particleboard manufacture. (Some valuable furniture woods are not edged in the sawmill.) Finally, certain boards are crosscut with trimmers to square their ends and remove defects. Other examples of combinations of machines used for breakdown include two band saws (used as headsaw and resaw), followed by edger and trimmer, or a series of double band saws with chipping edgers. In some sawmills (and other wood-using industries) computers are employed to regulate positioning of logs and other operations.",
  "The yield of lumber in a sawmill (lumber volume compared with roundwood input) varies widely, from about 30 to 70 percent, depending on the types of machines used, the diameter of logs (the larger the diameter, the higher the yield), and the quality of wood (the more defects, the lower the yield). The rest is changed to sawdust, slabs, trimmings, or chips. Residues that cannot be turned into products (usually including bark) are burned to produce energy. It should be noted that, if the lumber is to be marketed as planed (dressed), it is sawed “oversize” in thickness to compensate for subsequent shrinkage and planing.",
  "After production the lumber may be treated with a preservative chemical to prevent attack by fungi and insects and is measured (classified according to dimensions), graded, and piled to dry. Grading of lumber is usually visual and based on defects. The grading rules for softwood lumber differ from those for hardwoods. Softwood grading is based on the kind, number, and size of defects; it does not take into account the further processing of the wood into final products. Most structural lumber is graded this way. Hardwood grading is based on the proportion of a board that is usable in smaller clear pieces (“units”) and requires only that one surface be clear. Such grading is made on the assumption that the lumber will be cut into smaller pieces for the manufacture of furniture or parts of other woodwork. (The relationship of wood’s strength to grading is discussed in the section Mechanical properties.)",
  " Veneer is a thin sheet of wood of uniform thickness—commonly 0.5–1.0 mm (about 0.02–0.04 inch) and sometimes as much as 10 mm (about 0.4 inch). According to the method of production, it is classified as rotary-cut (cut on a lathe by rotating a log against a knife blade in a peeling operation), sliced (cut with a knife blade sheet by sheet from a log section, or flitch), or sawn (produced with a special tapered saw). More than 90 percent of all veneer is rotary-cut, but figured woods producing veneer for furniture and other decorative purposes are sliced. Sawn veneer is seldom produced, because it is a wasteful operation.",
  "Logs of harder species of wood, intended for rotary-cut or sliced veneer, are first softened by submersion in hot water or treatment with steam. After production, the veneer is passed through specialized dryers, usually prefabricated metallic chambers where temperature, air circulation, and speed of transport are controlled. Rotary-cut veneer is “clipped,” either before drying or afterward (when the continuous sheet goes directly to a dryer), by a guillotine-type knife to remove defects and produce individual sheets of acceptable size for the intended use. In some modern factories all operations, from handling the logs (bolts) to cutting, clipping, and drying, are automated by use of computers.",
  "Veneers are used primarily for plywood and furniture, but they are also used in toys, various containers, matches, battery separations, and other products. The yield of veneer can be less than 50 percent of the original roundwood volume, but veneer sheets, especially decorative ones, are much more valuable than lumber.",
  "Plywood and laminated wood are both made of layers (laminae) of wood glued together. The basic difference is that in plywood the grain of alternate layers is crossed, in general at right angles, whereas in laminated wood it is parallel. The development of these products (as well as particleboard, described in the next section) was made possible by the production of improved adhesives—especially synthetic resins—in the 1930s and ’40s.",
  "  Plywood is a panel product manufactured by gluing one or more veneers to both sides of a central veneer layer or a lumber-strip core. Most plywood is all-veneer; lumber-core plywood is produced only in small quantities. Lumber cores are made by the lateral gluing of strips of wood. In both plywood products, the species, thickness, and grain direction of each layer are matched with those of its counterpart on the other side of the central layer. Consequently, the total number of layers is usually odd (three, five, or more), the exception being when the central veneer layer consists of two sheets glued together with their grains parallel. After the glue is spread, the panels are assembled and brought for pressing, usually in large, multistoried hot presses, where loading is automatic. Adhesives are thermosetting synthetic resins— phenol-formaldehyde for exterior-use plywood and urea-formaldehyde for interior-use plywood. Phenol-formaldehyde resin can produce joints more durable than the natural wood itself—highly resistant to weather, microorganisms, cold water, hot water, boiling water, seawater (“marine” plywood), steam, and dry heat. After pressing, the panels are stacked to cool and then are sanded, graded, and stored. Plywood ranges in thickness from 3 mm (about 0.12 inch) for all-veneer to 30 mm (1.2 inches) for lumber-core.",
  "Plywood has many advantages over natural wood; among them are dimensional stability (the primary advantage), uniformity of strength, resistance to splitting, panel form, and decorative value. These characteristics make it adaptable to various uses. Plywood (and the panel products particleboard and fibreboard) serve in building construction, including walls, floors, roofs, and doors; exterior siding and interior finishing (e.g., wall paneling); furniture; shelving; shipbuilding; automobile manufacture; refrigeration cars; toys; concrete formwork; and many other applications. Special types combine decorative value with thermal- and sound-insulating properties.",
  "In addition to being made into flat panels, plywood is manufactured in curved form (molded plywood), which is used for boats, furniture, and other products. Molded plywood is made by bending and gluing veneer sheets in one operation; the process employs curved forms in a press or fluid pressure applied with a flexible “bag” or “blanket” of impermeable material.",
  "Some panels of special construction are overlaid with aluminum or reinforced plastics; others are made with hollow cores (parallel or crossed wooden strips, planer shavings, undulating veneer, honeycombed paperboard, or foamed plastic) or cores of particleboard or fibreboard. Many of these products are not plywood by definition, because they lack the characteristic crossing of wood grain in alternate layers.",
  "Laminated wood is usually built by the parallel gluing of lumber boards in a variety of sizes and shapes according to intended use. The main products are load-carrying members, such as beams and arches. Parallel-glued veneers are sometimes used to produce specialized items (for example, furniture, sporting goods, and novelties).",
  "Laminated wood possesses several advantages over solid wood. It can be used to fabricate large members that are impossible to make from solid wood. The individual boards used in laminated wood, because of their relative thinness, can be properly dried without checking (cracking), and defects, such as knots, can be removed. Structures can be designed with laminated wood on the basis of required strength, and wood of low grade can be positioned accordingly. In addition, because laminated wood is glued, wood of small dimensions can be used, thus reducing waste.",
  "  Particleboard, another panel product, is manufactured of particles of wood glued together. Particles are flakes or flakelike forms such as wafers and strands, planer shavings, slivers (or splinters), and fines produced from wood by cutting, breaking, or friction. Sources of particles include residues from sawmills (including sawdust) and other wood-using industries, small-diameter roundwood, defective logs, and harvesting residues. Bark is tolerated in limited amounts, and debarking is not necessary if the bark is thin and the particles are placed in the interior of the panel. Particle production or delivery to the factory is followed by screening, drying, classification of particles, mixing with resin adhesive and such additives as water repellents and preservatives, board formation (either in batches or in a continuous process), and pressing.",
  "Particleboard is made in several forms—single-layer, in which particle size is practically homogeneous throughout; three-layer, in which particle size is different in core and surface layers; and graded, in which there is a gradual, symmetrical reduction of particle size from the centre of a board to its surface layers. Particle grain is usually parallel to the surfaces, and panels are produced as separate boards, as in plywood manufacture. Perpendicular arrangement of particle grain exists only in so-called extruded boards, made from a continuous supply of particles and simultaneous pressing; the continuous product is sectioned to desired lengths as it exits a special press. Variation in such characteristics as particle morphology and arrangement, method of production, board thickness (2–40 mm [about 0.08–1.6 inches]), presence of perforations, and type and amount of adhesive allow the production of particleboards with different properties. They are classified as low-density (used for insulation), medium-density, and high-density. Low- and high-density boards are rare.",
  "Particleboard is made for interior use (for example, for furniture, paneling, and doors) or for structural purposes (to support loads). Interior-type boards are usually overlaid with veneer or plastic laminate (such as melamine). Two relatively new products, waferboard and oriented strand board (OSB), belong to the structural type. Waferboard is made with large, nearly square flakes, whereas OSB is a three-layer product in which the particles (strands) of surface layers are parallel to the direction of panel production and those of the middle layer are crosswise. Both products are used as nonveneered panels.",
  "Strands are also employed in making certain structural, lumber-type products—parallel structural lumber (PSL), laminated strand lumber (LSL), and oriented strand lumber (OSL). PSL, or paralam, is produced from oriented long strands of veneer, LSL from shorter strands, and OSL from strands similar to those in OSB. Another structural product, made of thin lumber and veneer and called lumber-veneer-lumber (LVL), is used to produce a variety of I-beam products in combination with OSB.",
  "In addition to being produced in its flat-board form, particleboard is sometimes molded under high pressure and temperature to various shapes. Some forms of particleboard are consolidated with mineral binders, such as cement or gypsum, rather than synthetic resins; the wood in this product is usually in the form of excelsior (long, thin ribbons), although particles also can be used.",
  "  The panel product fibreboard is made of wood fibres. (In the pulp, paper, and fibreboard industry fibre refers to all cells of wood and is not limited to the specific cell type found in hardwoods; see the section Microstructure .) A resin adhesive is not always used in fibreboard manufacture; in some cases the boards are held together by physical forces (hydrogen bonding), the flow of the natural lignin present among the fibres, or interweaving of the fibres. As in the case of particleboard, residues and wood of low quality can be used, and bark is usually tolerated.",
  "Production of fibreboard involves reduction of the wood to particles, pulping, sheet (mat) formation, pressing, and finishing treatment. Pulping is mechanical; the main method is the thermomechanical process, in which wood particles are steamed and then reduced to fibres by the action of special mills. Some factories use a so-called explosion (Masonite) process, in which steamed chips are transformed into fibres by the application and sudden release of pressure. Before sheet formation, the pulp is blended with certain materials to improve water resistance, strength, and other properties. Either of two basic processes, dry or wet, is employed in the formation of the fibre mat. In dry (or air) forming, fibres are transported by air, and a synthetic resin is added. In wet forming, the fibres are carried in a water suspension, and a resin adhesive is not used. Because dry forming consumes no water and is less polluting, it is preferred over the wet process. Pressing is considered either wet or dry depending on the moisture content of the fibre mat. The properties of wet-pressed boards are improved by “tempering” treatments (exposure to heat or application of drying oils). The appearance of fibreboard can be enhanced by overlays or patterns of perforations, tiles, simulated leather, and other designs.",
  "There are two types of fibreboard, insulation and compressed (represented mainly by hardboard); the distinction is based on density and the method of production. Insulation board is used in construction as insulation and cushioning; hardboard has a wide variety of uses, including furniture, house siding, wall paneling, and concrete forms. A relatively new compressed product is medium-density fibreboard (MDF). MDF is manufactured in a range of thicknesses (6–40 mm [about 0.2–1.6 inches]), usually by the dry process, and it is less dense than hardboard. It can be machined as solid wood and has many uses, including furniture, paneling, and siding.",
  "Wood is the main source of pulp and paper . Preliminary production steps are debarking and chipping. Pulping processes are of three principal types: mechanical, or grinding; chemical, or cooking with added chemicals; and semichemical, or a combination of heat or chemical pretreatment with subsequent mechanical reduction to fibres. The yield of pulp ranges from about 40 percent by chemical methods to 95 percent by mechanical ones. Chemical processes are based on either acids (i.e., sulfite pulping ) or alkalies (alkaline pulping, including soda and sulfate [ kraft ] processes). The pulp so produced is washed, screened, thickened by the removal of most of the water, and bleached. Paper manufacture involves beating or refining (defibring) the pulp, sizing and filling or loading (introducing various additives), and running the pulp into the proper machine (see papermaking ).",
  "  Lumber and other wood products usually contain considerable moisture after their production, and drying is essential to prepare them for further use. Proper drying reduces the magnitude of dimensional changes due to shrinkage and swelling, protects wood from microorganisms, reduces weight and transportation costs, better prepares wood for most finishing and preservation methods, and increases its strength. Drying is accomplished in yards in the open air or in closed kilns. Other methods of drying also exist.",
  "The object of open-air drying is to reduce the moisture content of wood to the lowest value permitted by weather conditions in the shortest time without producing defects. The level of moisture reduction attainable depends on temperature and relative humidity. Wind reduces the time required, but direct contact with rain and snow hinders the progress of drying.",
  "The air-drying yard is located close to the lumber plant, on a dry site where air movement is not obstructed by tall trees or buildings. The ground surface is kept free of debris and vegetation, and alleys are provided for working areas and air movement. The bottom row of lumber is kept about 40 cm (16 inches) above the ground, with space for air circulation provided as layers are added. When piling is done mechanically, the lumber is first prepiled in packages. A suitable roof, usually made of low-grade lumber or panel material, is placed on top of each pile. The time required to air-dry from green condition to 20 percent moisture content varies from about 20 to 300 days for wood 2.5 cm (1 inch) thick, depending on species, place, and time of year.",
  "Air drying can be accelerated by means of fans, sometimes in combination with low-temperature heating. When this technique is used, the piled lumber is placed in sheds. In the case of beech, walnut, and some other woods, steaming is employed before air drying. This practice reduces drying time by increasing the rate of drying and at the same time darkens the wood, making it more desirable for use in furniture.",
  "Kiln drying is conducted in a closed chamber, under artificially induced and controlled conditions of temperature, relative humidity, and air circulation. This method permits much faster reduction of moisture content to levels that are independent of weather conditions. In wood 2.5 cm (1 inch) thick, moisture is reduced from 20 to 6 percent in 2–15 days and from green condition to 6 percent in 2–50 days. The source of heat is usually steam circulating in pipe coils. Relative humidity is controlled by allowing steam to enter the chamber through a perforated pipe; such control regulates the exit of moisture from the wood and so avoids defects such as splitting and warping. For satisfactory results, air movement is needed to carry the heat from its source to the lumber and to carry away the evaporated moisture. Air circulation is produced by fans located within the kiln and sometimes by blowers placed outside.",
  "Regulation of conditions is usually automatic, and drying is accomplished by the use of drying schedules that have been derived experimentally for various species and thicknesses of wood. Schedules start with high humidity and low temperature and end inversely with high temperature and low humidity. As moisture removal proceeds, samples of wood are removed periodically and weighed. Sometimes moisture content is read from outside the kiln by way of samples wired to moisture meters. Kiln drying normally involves temperatures in the range of 40–75 °C (about 100–170 °F). Such temperatures are high enough to kill insects—another advantage of kiln drying over air drying.",
  "In addition, wood can be dried by special methods that include solar drying (use of greenhouse-type dryers or those equipped with solar collectors), high-temperature drying, dehumidification kiln drying (in which the evaporated wood moisture is condensed and the latent heat recaptured and used for additional evaporation), and boiling in oils (a combination of drying and preservation, usually with creosote). Some other methods, such as drying with applied chemicals (salt seasoning), organic vapours (e.g., xylene), a solvent (specifically acetone), high-frequency electricity, centrifuging, infrared radiation, a vacuum, and microwaves, are inhibitively expensive and therefore are not commercially applicable.",
  "Wood can be protected from the action of destructive agents such as fungi, insects, and marine organisms (see the section Degradation ) by impregnation with toxic chemicals. Preservatives used against such organisms are of three groups: oils, oil-soluble chemicals, and water-soluble chemicals.",
  "Oils are exemplified by coal tar creosote (i.e., creosote obtained from bituminous coal). Creosote is very effective for treatment of railroad ties, poles, and pilings and can extend their useful life severalfold. Creosote-treated wood, however, resists painting and gluing and can exude the preservative, which is a pollutant. The main representative of oil-soluble preservatives is pentachlorophenol (see chlorophenol ). When used with a suitable organic solvent, pentachlorophenol has advantages over creosote in that the preserved wood is kept clean and can be painted or glued. The compound is also polluting, however, and its use is banned in several countries, including the United States. Water-soluble preservatives are salt solutions of various inorganic chemicals such as copper, chromium, arsenic, and mercury. Their main disadvantage is that they leach from the wood under damp conditions, but this can be overcome by the formation of insoluble compounds in the wood—for example, with preservatives prepared from a combination of copper, chromium, and arsenic (CCA).",
  "Wood can be made resistant to fire with chemical retardants. Fire retardants are water-soluble and not toxic. They contain silica and other chemical compounds and act by creating a barrier (charred wood or foam) to the spread of flame or by generating noncombustible gases.",
  "Wood to be treated with preservative is prepared by removing bark (as a rule) and excess moisture (to below the fibre saturation point; see the section Hygroscopicity ), machining to final shape, and drilling holes or making incisions to facilitate entrance of the preservative. Preservatives can be applied by brushing, spraying, dipping, steeping, sequential immersion in hot and cold baths, and diffusion (applied to green wood), but impregnation under pressure in closed tanks or cylinders is the most efficient method. (Bark is retained in treating by hydrostatic pressure.) Factors that affect penetration of preservatives include species and structure of wood, density, moisture content, direction of grain, preparation of wood for treatment, type of preservative, and the treatment process used.",
  "Wood is a source of a wide variety of chemical products. In theory, at least, the number and kind of possible chemical products are equal to those of the products made from petroleum. In practice, however, the chemical products of wood fall into two general groups: products of the chemical processing of wood or its components and wood extractives and their derivatives.",
  "Products of chemical processing, made by chemical modification of wood and wood components, include pulp and paper (if pulp is produced by chemical or semichemical methods; see the section Pulp and paper ), products of cellulose and other molecular constituents of wood (see the section Ultrastructure and chemical composition), and products of pyrolysis, gasification, and hydrolysis.",
  " Cellulose is produced from chemical pulp after complete removal of the other constituents (lignin, hemicelluloses, and extractives). It is used in the production of synthetic fibres (e.g., rayon ), cellophane , plastics, varnishes, lacquers, inks, adhesives, photographic films, magnetic tapes, artificial sponges, explosives, and many other products. The uses for lignin continue to grow, although great quantities are wasted or burned as fuel because its molecular structure and chemistry are not completely known. Lignin is used in making vanillin (synthetic vanilla), pharmaceuticals, plastics, solvents, ceramics, adhesives, synthetic rubber, foam materials, insecticides, fungicides, herbicides, soil conditioners, and other products.",
  "Pyrolysis involves heating wood at temperatures as high as 1,000 °C (about 1,800 °F) in the absence of air. It includes carbonization, destructive distillation, and liquefaction. Carbonization is carried out either by the traditional method of building cone-shaped stacks of wood that are then covered with earth and fired or by heating the wood in metallic kilns. This process yields charcoal, which is used as a fuel, as activated (highly porous and absorptive) charcoal, and in dynamite, fireworks, and pharmaceuticals. In destructive distillation the wood is heated by a stepwise raising of temperature in closed ceramic or stainless-steel chambers. Products of destructive distillation include tar and pitch (which, in turn, are used in the manufacture of such products as wood creosote, plastics, and insulating materials), acetic acid (as wood vinegar), methanol (also called wood alcohol), acetone, and phenols. Liquefaction is conducted in tanks and produces pyrolytic oil, a liquid fuel. Gasification of wood, a high-temperature process conducted with limited and controlled air or oxygen, produces wood gas—mainly methane, carbon monoxide, and hydrogen—which can be used as a fuel or to produce methanol and other organic compounds. A chemical process called hydrolysis—more specifically, saccharification, or breakdown into simple sugars by the action of acids—yields sugars that are used in the manufacture of such products as animal feeds, ethanol (ethyl alcohol), plastics, and glycerol (glycerin).",
  "The main wood extractives of practical importance are pine resin and tannins . Resin is produced inside living trees by epithelial cells (specialized parenchyma) lining the resin canals (see the section Rays and resin canals ), and it exits when the trees are wounded. In resin harvesting, the trunk is usually debarked systematically in strips, and resin is collected in plastic bags. Not all pine species produce significant amounts of resin to justify harvesting; the main harvestable species occur in Mediterranean countries, the United States, China, India, Pakistan, Indonesia, and the Philippines.",
  "Resin produced as above is called oleoresin and is an exudate rather than an extractive; other examples of tree exudates are sugar maple sap, which is concentrated to make maple syrup , and latex , which can be made into rubber. Resin, however, can also be obtained as an extractive by distillation of wood or as a by-product of pulping (by the alkaline process); these processes give the components of resin: rosin (colophony) and turpentine . Production of resin by tapping living trees is a declining operation, but pulping offers the alternative of deriving the components of resin even from such species as Scotch pine and Douglas fir, which do not produce appreciable amounts of resin by tapping. Chemically, rosin and turpentine are terpenoid acids and monoterpenes, respectively. Rosin dissolved in turpentine constitutes resin. Turpentine is volatile, and, when it separates from resin, solid rosin remains. Rosin is used in the production of paper (as sizing to control water absorption), soap, synthetic resins, synthetic rubber, paints, and varnishes. Turpentine is employed as an industrial solvent and is increasingly used as a raw material for the manufacture of adhesives, synthetic vitamins, perfumes, and flavourings.",
  "Tannins are phenolic substances contained in wood, bark, and other plant materials. Among the major sources are oak, chestnut, quebracho ( Schinopsis species), wattle ( Acacia species), pine, and hemlock. Tannins are extracted with water or organic chemicals. There are two types—hydrolyzable and condensed. Hydrolyzable tannins are usually mixtures of simple phenols, and their decomposition often occurs simply in warm water, with which they react to form other substances. Condensed tannins are mainly condensation products of various types and form insoluble precipitates. Tannins are used in the tanning of leather, preservation of fishing nets, and manufacture of inks, plastics, and adhesives. Condensed tannins, when reacted with formaldehyde, form adhesives that can replace synthetic resins in the production of plywood and particleboard.",
  "Wood’s content of extractives influences its utilization both positively and negatively. Extractives impart durability to wood, confer colour and odour, and affect painting, varnishing, and glue adhesion. They can also interfere with pulp and paper manufacture by causing pitch trouble (contamination with resin or other extractives) and bleaching problems and by increasing the consumption of chemicals, and they can cause health problems (e.g., bronchitis, dermatitis, and other irritant or allergic reactions in workers in wood-processing industries). Many tropical woods are rich in extractives.",
  "As is indicated in the preceding sections of this article, the total number of products made from wood is enormous—as high as 10,000, by some estimates. Such wide application is made possible by the versatility of wood and its many desirable qualities, such as high strength for its weight, workability, and aesthetic appeal. But wood also has certain undesirable characteristics. It can burn and decay, for instance. It is hygroscopic (moisture-absorbing), and in gaining or losing moisture it changes dimensions. As a biological product, moreover, wood is variable in quality. In order to reduce the effects of these inherent undesirable properties and also to make proper use of the many existing wood-producing plant species and produce the best possible wood quality in the forest, it is essential to understand the complex nature of this material. Such an understanding can be gained by a study of the structure, chemical composition, and properties of wood.",
  "  Examination of a stump or the transverse section (cross section) of a tree trunk shows three parts—pith, wood, and bark . Between the wood and bark is the cambium , although this thin layer of tissue is indistinguishable with the naked eye or a hand lens. Pith is normally small and located at the centre of the transverse section. Wood is marked by the presence of concentric layers known as growth rings or annual rings. In temperate regions one growth ring is normally produced during each season of growth, but false rings may also be present, and in some cases certain rings may be locally discontinuous. In tropical regions growth rings are formed in response to wet and dry periods or other, incompletely understood factors. For these reasons the term growth ring is preferred over annual ring . Barring the above deviations, however, the number of growth rings, as counted in a transverse section near the ground, can be used to find the age of a tree.",
  "Bark surrounds the central cylinder of wood. It is differentiated into inner bark, which is relatively light-coloured and conducts synthesized food from the leaves downward, and outer bark, which is dark-coloured and dry, with an insulating function (see the section Bark and bark products ).",
  "Growth rings are visible because of macroscopic differences in structure between earlywood and latewood—i.e., wood produced in the spring and later in a season of growth. The two kinds of wood may differ in density, colour, or other characteristics. In coniferous species, latewood is darker in colour and has a greater density. In the wood of broad-leaved species, the presence of pores is a characteristic macroscopic feature of growth rings.",
  "According to the relative size and distribution of pores, woods of broad-leaved species are further classified into ring-porous and diffuse-porous types. In ring-porous woods, such as oak and chestnut, the pores of earlywood are large compared with those of latewood. In diffuse-porous woods, such as basswood and poplar, all pores are about the same size and evenly distributed.",
  "In many tree species the central part of the transverse section of trunk is darker in colour than the peripheral wood. This inner part is called heartwood , and the surrounding zone sapwood . Sapwood comprises the newer growth rings and participates in the life processes of a tree. As the diameter of the tree increases with growth, the older, inner layers no longer take part in the transport and storage of water and nutrients and become heartwood. After a certain age, heartwood exists in all species, even though there may be no colour change.",
  "A transverse section of trunk also shows linear features called rays radiating from pith to bark and ranging in width from very distinct, as in oak, to indistinct to the naked eye, as in pine and poplar. Certain softwoods, such as pine, spruce, larch, and Douglas fir, possess resin canals. In a transverse section examined with the naked eye or a hand lens, resin canals appear as small dark or whitish dots.",
  "Sections of trunk that are made perpendicular to the transverse section present a different picture of macroscopic features. Radial sections—that is, longitudinal sections passing through the pith—are characterized by parallel arrangement of growth rings and the appearance of rays in the form of streaks called flecks (in species with conspicuous rays, such as oak). In tangential sections—longitudinal sections cut at a tangent to the rings—growth-ring arrangement takes the form of a series of arches or parabolas.",
  "  The microscope reveals that wood is composed of minute units called cells. According to estimates, 1 cubic metre (about 35 cubic feet) of spruce wood contains 350 billion–500 billion cells. The basic cell types are called tracheids , vessel members, fibres, and parenchyma . Softwoods are made of tracheids and parenchyma, and hardwoods of vessel members, fibres, and parenchyma. A few hardwood species contain tracheids, but such instances are rare. Tracheids are considered a primitive cell type that gave rise, through evolution, to both vessel members and fibres.",
  "The wood of softwood species is composed predominantly of tracheids. These cells are mainly longitudinal, or axial—their long axis runs parallel to the axis of the trunk (vertical in the standing tree). Axial parenchyma is present in certain softwood species, but radial parenchyma is always present and constitutes the rays, sometimes together with radial tracheids.",
  "In hardwoods the proportion of constituent cell types—vessel members, fibres, and parenchyma—depends mainly on species. Vessel members and fibres are always present and axially oriented; axial parenchyma is seldom absent. Rays in hardwoods are made entirely of radial parenchyma cells.",
  "Axial tracheids of softwoods are the longest cells of wood; they average 3–5 mm (about 0.12–0.2 inch) in length and are seldom more than 1 cm (about 0.4 inch). Fibres are shorter, usually 1–2 mm (0.04–0.08 inch). Vessel members vary widely in length, from 0.2 to 1.3 mm (0.008 to 0.05 inch), mainly between earlywood and latewood of ring-porous hardwoods. Diameters range, in general, from about 0.01 to 0.5 mm (0.0004 to 0.02 inch); the narrowest are fibres, and the largest are vessel members of earlywood.",
  "All the above cells are tubelike. Tracheids and fibres have closed ends. Vessel members have ends wholly or partly open; in wood tissue, vessel members are connected end to end to form vertical pipelike stacks (vessels) of indeterminate length. The characteristic pores visible in the transverse section of hardwoods are actually vessel members. Axial tracheids in softwood species and vessel members in hardwood species are the principal water-conducting cells. Although fibres in hardwood trees may also participate in conduction, their main function is to provide mechanical support.",
  "Parenchyma cells are bricklike in shape and very small, with a length of 0.1–0.2 mm (about 0.004–0.008 inch) and a width of 0.01–0.05 mm (0.0004–0.002 inch). They are mainly concerned with the storage of food and its transport (horizontally in the case of radial parenchyma). Radial tracheids somewhat resemble parenchyma in shape and length, although their shape can be more irregular.",
  "Almost all wood cells, even in living trees, are dead—that is, devoid of protoplasm and nucleus. The exceptions are a few layers of young cells produced during current growth by the cambium and by parenchyma cells located in sapwood. Cambium derives by differentiation of cells of the apical meristem , generative tissue that comprises the growing tips (stem, branches, and roots) of the plant and is responsible for primary growth, or growth in length. Cambium is considered to be lateral meristem; by producing new wood and bark, it carries out secondary growth, or growth in diameter. Microscopic observation of thin transverse sections shows the cambium to be a one-cell-wide layer of dividing initials and of a small but varying number of undifferentiated derivative cells, which together form the cambial zone. Further division and differentiation of the derivative cells gives rise to wood and bark.",
  "Observed microscopically, the cells of wood appear to be composed of cell wall and cell cavity; in dead cells the cavity is empty. Gaps of various shapes, called pits, are often seen in great numbers in the cell walls. Pits serve as passages of communication between neighbouring cells and come in pairs—one in each of the adjoining cell walls—separated by a membrane. Other microscopic features are tyloses, plugs comprising various plant materials that obstruct the vessel members of hardwoods and that form mainly when sapwood is transformed to heartwood. Under the microscope, the resin canals of softwoods are revealed to be not cells but tubular spaces between cells, lined with specialized parenchyma; they also are plugged in heartwood.",
  "Polarization microscopy, X rays, electron microscopy, and other techniques provide information regarding the structure of cell walls and other features hidden to light microscopes. Cell walls are crystalline. They are composed of a thin, outer primary wall and a much thicker secondary wall, the latter made of three layers. The smallest visible building units of cell walls are the microfibrils , which appear stringlike under the electron microscope, about 10–30 nanometres (billionths of a metre) in diameter and of indeterminate length. The orientation and weaving of microfibrils varies; this makes possible the distinction of three layers (called S 1 , S 2 , and S 3 ), with the microfibrils having an axial direction in the middle (S 2 ) layer and a generally transverse direction in the outer layers. The inner surface of cell walls is covered by a warty layer. Pit membranes vary in structure; in softwood tracheids they possess a central thickening (torus), whereas in other cell types they are made of randomly arranged microfibrils.",
  "Chainlike cellulose molecules, which constitute the microfibrils, provide the skeleton of wood. Noncellulosic constituents ( hemicelluloses , lignin , and pectic substances ) are located among microfibrils but do not form microfibrils. Cellulose is mostly concentrated in the secondary cell wall, and lignin in the middle lamella, the layer that separates the walls of adjacent cells. Quantitatively, cellulose and the other chemical constituents are contained in wood in the following proportions (in percentage of the oven-dry weight of wood): cellulose 40–50 percent (about the same in softwoods and hardwoods), hemicelluloses 20 percent in softwoods and 15–35 percent in hardwoods, lignin 25–35 percent in softwoods and 17–25 percent in hardwoods, and pectic substances in very small proportion. In addition, wood contains extractives (gums, fats, resins, waxes, sugars, oils, starches, alkaloids, and tannins) in various amounts (usually 1–10 percent but sometimes 30 percent or more). Extractives are not structural components but inclusions in cell cavities and cell walls; they can be removed without changing the wood structure (see the section Extractives ).",
  "Because of differences in cellular composition and arrangement, the structure of wood varies among species. This variation influences appearance and properties and makes for a wide choice of woods for different uses, and it provides the basis for wood identification. Variation also exists among trees of the same species (because of environmental and genetic influences) and within a single tree. Characters that vary within a tree are mainly cell length, proportion of latewood, angle of microfibrils, and proportion of cellulose. In most woods, from the pith outward, their values all increase progressively and rapidly until, after a number of growth rings (20 or more), they attain a “typical” level; in the outer rings (200th and beyond) of very old trees, they decrease again. The atypical wood near the pith is called juvenile wood, having been produced in the earliest stages of tree development. Another source of variation is the progressive formation of heartwood from sapwood by deposition of extractives and structural changes.",
  "Relatively more important from the practical point of view is variation caused by the presence of defects such as knots, spiral grain, compression and tension wood, shakes, and pitch pockets. Knots are caused by inclusion of dead or living branches. Because branches are indispensable members of a living tree, knots are largely unavoidable, but they can be reduced by silvicultural means, such as spacing of trees and pruning. Spiral grain is the spiral arrangement of cells with respect to the tree axis. Compression and tension wood are structural abnormalities in trees (softwoods and hardwoods, respectively) that are caused to deviate from their normal, vertical position by wind or other forces. Shakes are separations of wood tissue, and pitch pockets (in softwoods with resin canals) are separations filled with resin. Defects, depending on their kind and extent, can adversely affect the appearance, strength, dimensional stability, and other properties of wood.",
  "Sensory characteristics include colour, lustre, odour, taste, texture, grain, figure, weight, and hardness of wood. These supplementary macroscopic characteristics are helpful in describing a piece of wood for identification or other purposes.",
  " Colour covers a wide range—yellow, green, red, brown, black, and nearly pure white woods exist, but most woods are shades of white and brown. Variations may show on a single piece of wood, depending on colour differences between heartwood, sapwood, earlywood, latewood, rays, and resin canals. Natural colour is subject to change by prolonged exposure to the atmosphere and by bleaching or dyeing. Some woods (for example, black locust, honey locust, and several tropical species) are fluorescent.",
  " Natural lustre is characteristic of some species (for example, spruce, ash, basswood, and poplar) and more prominent on radial surfaces. Odour and taste are due to volatile substances contained in wood. Although difficult to describe, they are helpful distinguishing characteristics in some cases. The term texture describes the degree of uniformity of appearance of a wood surface, usually transverse. Grain is often used synonymously with texture , as in coarse, fine, or even texture or grain , and also to denote direction of wood elements, whether straight, spiral, or wavy, for example. Grain sometimes is used in place of figure , as in silver grain in oak . The term figure applies to natural designs or patterns of wood surfaces (normally radial or tangential).",
  "As sensory characteristics, weight and hardness are included in a diagnostic rather than technical sense—weight as judged by simple hand-lifting and hardness by pressing with the thumbnail. Common temperate-climate woods range in weight from about 300 to 900 kg per cubic metre (about 20 to 55 pounds per cubic foot) in air-dry condition, but lighter and heavier woods exist in the tropics, ranging from 80 to 1,300 kg per cubic metre (5 to 80 pounds per cubic foot) for balsa and lignum vitae, respectively.",
  " Density is the weight or mass of a unit volume of wood, and specific gravity the ratio of the density of wood to that of water. In the metric system of measurement, density and specific gravity are numerically identical; for example, the average density of the wood of Douglas fir is 0.45 gram per cc, and its specific gravity 0.45, because 1 cc of water weighs 1 gram. (Expressed as weight per unit volume, 1 gram per cc is about 62.4 pounds per cubic foot.)",
  "Determination of the density of wood is more difficult than for other materials because wood is hygroscopic (see the section Hygroscopicity ); both its weight and volume are greatly influenced by moisture content. In order to obtain comparable figures, weight and volume are determined at specified moisture contents. Standards are oven-dry weight (practically zero moisture content) and either oven-dry or green volume ( green referring to moisture content above the fibre saturation point, which averages about 30 percent). Other expressions of density, such as those based on air-dry weight and volume or on weight and volume of green wood, have a certain practical importance, as in shipping wood, but are not accurate.",
  "The dry mass of wood in a given volume is determined by density, which is obtained by dividing the oven-dry weight by the volume, either oven-dry or green. Oven-dry volume is difficult to determine, at least by immersion in water, because of wood’s hygroscopicity. Oven-dry samples are first immersed in hot molten paraffin, to build a thin protective coating, before being immersed in water. With small wood samples, mercury is sometimes used instead of water; a special apparatus (Breuil volumeter) is available. For specimens that are regular in shape, volume can be calculated on the basis of their dimensions. In addition, radiation methods are used for direct measurement of density.",
  "The density of a sample of wood can be appraised visually by observing the width (thickness) of growth rings and the proportion of latewood. In general, latewood, because of its thicker cell walls and smaller cell cavities, is denser than earlywood, and with increasing ring width its proportion decreases in softwoods and increases in ring-porous hardwoods. Therefore, wider rings indicate lower density in softwoods and higher density in ring-porous hardwoods. In diffuse-porous hardwoods latewood is not clearly distinct, and ring width is not an indication of density.",
  "The density of temperate woods varies from about 0.3 to 0.9 gram per cc, but the range worldwide is approximately from 0.2 to 1.2 grams per cc. Differences among species or samples of the same species are due to varying proportions of wood substance and void volume and to content of extractives. The density of wood substance is about 1.5 grams per cc, and practically no differences in this value exist among species.",
  "Density affects the amount of moisture that wood can hold, its shrinkage and swelling, and its mechanical and other properties. In general, density is a measure of the quality of clear wood—that is, wood without defects.",
  "Wood can absorb water as a liquid, if in contact with it, or as vapour from the surrounding atmosphere. Although wood can absorb other liquids and gases, water is the most important. Because of its hygroscopicity, wood, either as a part of the living tree or as a material, always contains moisture. (The terms water and moisture are used here without distinction.) Moisture affects all wood properties, but it should be noted that only moisture contained in cell walls is important; moisture in the cell cavities merely adds weight.",
  "The amount of moisture held in cell walls varies from about 20 to 40 percent, but for practical purposes it is taken to be 30 percent (expressed as percentages of the oven-dry weight of wood). The theoretical point at which cell walls are completely saturated and cell cavities are empty is known as the fibre saturation point. Beyond this point, moisture goes into the cavities, and, when they are completely filled, the maximum moisture content that wood can hold is reached. This maximum, which depends mainly on density, can be very high. For example, a very light wood, such as balsa, can hold as much as 800 percent moisture, pine 250 percent, and beech 120 percent.",
  "The moisture content of the wood of living trees varies from about 30 to 300 percent depending on species, position of the wood in the tree, and season of the year. When green wood is exposed to the atmosphere, its moisture content gradually decreases. Moisture in the cell cavities is lost first. In time, moisture content falls to levels ranging (for temperate-zone localities and under shelter) from about 6 to 25 percent (average 12 to 15 percent). Local conditions of air temperature and relative humidity dictate the final moisture level. Species and dimensions of wood have no practical influence on the final moisture level, although refractory species and wood of larger dimensions require more time to reach it. It is important to note, however, that, because of hygroscopicity, the moisture content of air-dry wood does not remain unchanged, even when the wood is kept under shelter. On the contrary, it is subject to continuous change, within certain limits, as a result of changing air temperature and relative humidity.",
  "The moisture content of a sample of wood is calculated on the basis of its current and oven-dry weight. It also can be determined directly with portable electric moisture meters, which measure the change of electrical properties of wood as a function of changing moisture content.",
  "Hygroscopicity is of primary importance because moisture in wood affects all wood properties. For example, moisture content can increase weight 100 percent or more, with consequent effects on transportation costs. Variation in moisture content causes wood to shrink or swell, altering its dimensions. Resistance to decay and insects is greatly affected. The working, gluing, and finishing of wood and its mechanical, thermal, and acoustic properties are all influenced by moisture content. Also affected are processing operations, such as drying, preservative treatment, and pulping.",
  "  Wood undergoes dimensional changes when its moisture fluctuates below the fibre saturation point. Loss of moisture results in shrinkage, and gain in swelling. It is characteristic that these dimensional changes are anisotropic—different in axial, radial, and tangential directions. Average values for shrinkage are roughly 0.4 percent, 4 percent, and 8 percent, respectively. Shrinkage in volume averages 12 percent, but large variations are exhibited among species. These values refer to changes from green to oven-dry condition and are expressed in percentage of green dimensions. The differential shrinkage and swelling in different growth directions is attributed mainly to cell wall structure. The difference between axial and the two lateral (radial and tangential) directions can be explained on the basis of respective orientation of microfibrils in the layers of the secondary cell wall, but the reasons for the differences between radial and tangential directions are not well understood.",
  "In general, the factors that affect shrinkage and swelling are moisture content, density, content of extractives, mechanical stresses, and abnormalities in wood structure. The amount of shrinkage or swelling that occurs is approximately proportional to the change in moisture content. The higher the density of wood, the greater is its shrinkage and swelling, because denser (heavier) woods contain more moisture in their cell walls. For example, at the same moisture content, say, 15 percent, 1 cubic metre of a wood having a density of 0.8 gram per cc contains 120 kg of water, whereas the same volume of a wood having a density of 0.4 gram per cc contains only 60 kg of water. Extractives reduce shrinkage and swelling because they occupy spaces within cell walls that otherwise could be taken by water. Mechanical stresses (compression or tension) may cause permanent deformation of wood cells, which in turn affects shrinkage and swelling. Finally, abnormal structure results in greater shrinkage longitudinally but less in radial and tangential directions; change in volume remains about the same.",
  "Dimensional changes in wood caused by shrinkage and swelling can result in opening or tightening of joints, change of cross-sectional shape, warping, checking (formation of cracks), case-hardening (release of stresses in resawing or other machining, with consequent warping), honeycombing (internal checking), and collapse (distortion of cells, causing a corrugated appearance of the surface of lumber). Thus, the fact that wood shrinks and swells constitutes a great obstacle to its utilization.",
  "Several methods are used to improve the dimensional stability of wood. They include mechanical modification (reconstruction into such products as plywood, particleboard, and fibreboard), application of water-repellent coatings (paint or varnish), bulking treatment (maintaining the wood in swollen condition by use of salts, sugars, polyethylene glycol, synthetic resins, or other substances), and other (thermal or chemical) treatments. Except for reconstructing into products and surface coating, however, other methods are experimental or sufficiently expensive to limit their application to specialty items. Coatings do not reduce the quantity of moisture the wood can hold, but they slow the exchange of moisture between wood and atmosphere and, therefore, reduce the magnitude of dimensional changes of the wood in use. Most dimensional problems are caused by the use of wood with excessive moisture content. Instead, at the time of use the wood should have a moisture content at the approximate midpoint of the expected range in a particular location. This practice minimizes moisture content changes and, therefore, the adverse effects of shrinkage and swelling.",
  "The mechanical, or strength, properties of wood are measures of its ability to resist applied forces that might tend to change its shape and size. Resistance to such forces depends on their magnitude and manner of application and to various characteristics of the wood such as moisture content and density. It is important to note that wood has drastically different strength properties parallel to the grain (i.e., in the axial direction) than it does across the grain (in the transverse direction).",
  "The mechanical properties of wood include strength in tension and compression (as measured in axial and transverse directions), shear, cleavage, hardness, static bending, and shock (impact bending and toughness). Respective tests determine stresses per unit of loaded area (at the elastic limit and maximum load) and other criteria of strength, such as the modulus of elasticity (a criterion of stiffness), the modulus of rupture (bending strength), and toughness. Tests are normally conducted with small, clear specimens, usually 2 × 2 cm or 2 × 2 inches in cross section. Laboratory data are analyzed to produce working values of stresses, which are made available for use by engineers and architects in designing wooden structures. Tests are sometimes conducted with structural components of actual size. Individual cells (tracheids and fibres) also are subject to testing, since their strength relates to the strength of products—paper, for example. (The testing of materials to ascertain their mechanical, thermal, electrical, and other properties is discussed in the article materials testing .)",
  "Density is the best index of the strength of clear wood; higher density indicates greater strength. The strength of wood is also influenced by its moisture content when it fluctuates below the fibre saturation point. Generally, a decrease in moisture content is accompanied by an increase in most strength properties. Temperature and duration of loading also affect strength. In general, strength falls as temperature rises. Wood loaded permanently will support a smaller maximum load than that indicated by short-term laboratory tests. The most important strength-reducing factors are wood defects, such as knots, compression and tension wood, and grain deviations. Their adverse effect depends on the kind and extent of the defects, their position, and the manner in which the wood is loaded.",
  "Defects constitute the basis for rules by which lumber and other wood products are visually graded. These rules set limits on sizes of defects and other wood characteristics that affect strength—for example, rate of growth, which is expressed as rings per centimetre or inch. Also available are nondestructive grading techniques based on vibration, sound transmission, and mechanics. The latter technique makes use of a correlation established between the modulus of rupture and the modulus of elasticity. This relationship allows the strength of a wooden member (e.g., a lumber board) to be determined with fair accuracy simply by passing it through a machine that applies a bending force. The less the deflection, the higher the predicted strength. Use of such machines in industry is still limited, however, and the main method remains the visual inspection of wood by skilled graders. Grading leads to more efficient utilization of wood and is essential in order to achieve adequate standards of safety in wooden structures. (Grading of hardwood and softwood lumber is discussed in the section Yield and grading .)",
  "Although wood expands and contracts with varying temperature, these dimensional changes are small compared with shrinkage and swelling caused by varying moisture content. In most cases, such temperature-related expansion and contraction are negligible and without practical importance. Only temperatures below 0 °C (32 °F) have the potential to cause surface checks; in living trees, unequal contraction of outer and inner layers may result in frost cracks.",
  "Wood exhibits a low thermal conductivity (high heat-insulating capacity) compared with materials such as metals, marble, glass, and concrete. Thermal conductivity is highest in the axial direction and increases with density and moisture content; thus, light, dry woods are better insulators.",
  "When exposed to sufficiently high temperatures, wood burns. This property makes wood suitable for heating purposes but is disadvantageous for its technical utilization. The maximum heating value of one kilogram of oven-dry wood averages about 4,500 kilocalories (with a range of 4,100–6,800 kilocalories). In general, softwoods possess a higher heating value than hardwoods, and extractives have an important influence; for example, a kilogram of the oleoresin in pines has a heating value of about 8,500 kilocalories. Moisture reduces the heating value; air-dry wood has about 15 percent less heating value than oven-dry wood.",
  "Wood must be raised to a temperature of about 250 °C (about 480 °F) for a spark or flame to ignite it, but at a temperature of about 500 °C (about 930 °F) ignition is spontaneous. The flammability of wood can be reduced by chemical treatment (see the section Preservation ).",
  "Oven-dry wood is electrically insulating. As moisture content increases, however, electric conductivity increases such that the behaviour of saturated wood (wood with maximum moisture content) approaches that of water. Noteworthy is the spectacular decrease of electric resistance as moisture content increases from zero to the fibre saturation point. Within this range, electric resistance decreases more than a billion times, whereas from the fibre saturation point to maximum moisture content, it decreases no more than about 50 times. Other factors, such as species and density, have little effect on the electric resistance of wood; differences among species are attributed to the chemistry of the extractives. Axial resistance is about half that of the transverse. Resistance increases with decreasing temperature; in oven-dry wood it doubles over a temperature drop of 12.5 °C (22.5 °F). Practical use of the relationship of wood’s moisture content to its electric resistance is made in electric moisture meters.",
  "Important also are the dielectric , or poor-conductor, properties of wood. These properties—dielectric constant and power factor—assume a practical importance in drying wood with electric current (a theoretical possibility, although not presently a reality), gluing wood with high-frequency electric current, or making electric meters (capacity and radio-frequency power-loss type) for measuring its moisture content.",
  "Wood exhibits the piezoelectric effect —that is, electric polarization (the appearance of opposite electric charges on opposite sides of a piece) occurs under mechanical stress. Conversely, when subjected to an electric field, wood exhibits mechanical deformation (changes in size).",
  "Wood can produce sound (by direct striking) and can amplify or absorb sound waves originating from other bodies. For these reasons, it is a unique material for musical instruments and other acoustic applications. The pitch of sound produced depends on the frequency of vibration, which is affected by the dimensions, density, moisture content, and modulus of elasticity of the wood. Smaller dimensions, lower moisture content, and higher density and elasticity produce sounds of higher pitch.",
  "When sound waves of extrinsic origin strike wood, they are partly absorbed and partly reflected, and the wood is set in vibration. The sound can be amplified, as in violins, guitars, organ pipes, and other musical instruments, or it can be absorbed, as in wooden partitions. Normally, wood absorbs a very small portion of acoustic energy (3–5 percent), but special constructions incorporating empty spaces and porous insulation boards can increase absorption to as high as 90 percent. The speed of sound in wood is about 3,500–5,000 metres (about 11,500–16,400 feet) per second axially and 1,000–1,500 metres (3,300–4,900 feet) per second transversely; the axial value approaches the speed of sound in iron and is 10 times higher than that in air. The velocity of sound in wood is reduced by moisture, which therefore contributes to faster damping of sound. For musical instruments, a preference exists for selected spruce wood, but fir, pine, maple, and tropical woods also are used. Abnormalities such as decay affect acoustic properties; use of this fact is made in nondestructive testing of wood.",
  "Wood is subject to degradation by bacteria, fungi, insects, marine borers, and climatic, mechanical, chemical, and thermal factors. Degradation can affect wood of living trees, logs, or products, causing changes in appearance, structure, or chemical composition; these changes range from simple discoloration to alterations that render wood completely useless. It should be noted that wood can last for hundreds or thousands of years, as demonstrated, for example, by furniture and other wooden items found in excellent condition in the tombs of ancient Egyptian pharaohs (see Egyptian art ). Wood is degraded or destroyed not with the passage of time but only under the action of external factors.",
  "Bacteria are considered to be the cause of discolorations in the form of darker-coloured heartwood in living trees (a phenomenon called wetwood in fir and black heartwood in hybrid poplars). The colour lightens on exposure to air, and the properties of the wood are not seriously affected. Bacteria also appear during prolonged storage of wood in water, including seawater (e.g., in the case of old sunken ships). Acting in combination with physical and chemical factors related to submersion, they can cause considerable structural changes, leading to breakdown of the wood after exposure to air.",
  "Fungi that attack wood are responsible for discoloration (stain) or decay. Blue stain (sap stain) of pines is the most common and serious consequence of attack by stain fungi. The sapwood becomes bluish or blackish, usually in wedge-shaped patches. Blue stain may appear very quickly in warm weather, sometimes within hours or days after the tree is felled or the green wood is sawed or otherwise processed. The degradation is mainly aesthetic (with a large reduction in the market value of the wood); among properties, only toughness appears to be affected.",
  "Decay fungi are, by far, the most important cause of wood loss. Decay is not an innate property of wood, however; it takes place only if the conditions of exposure—namely, moisture, air, and temperature—are suitable for growth and activity of fungi. A moisture content below 20 percent inhibits growth of fungi, as do temperatures lower than 10 °C (50 °F) and higher than 30 °C (86 °F). If wood is kept under water, it cannot be attacked by fungi, because of insufficient oxygen. Toxic extractives contained in wood are a delaying factor and are the main reason for differences in resistance to decay among species, but no wood is immune.",
  "Insects, like fungi, can attack the wood of living trees, logs, or products. Once trees are felled, the region between wood and bark (rich in nutrients) is especially vulnerable to insect attack, and for this reason prompt debarking is a protective measure. Insects bore holes and tunnels, and some reduce the interior of wood to dust, leaving only a thin outer layer. Conditions of exposure are the same as for fungi—suitable temperature, moisture, and air. Infested wood can be rendered free of insects at temperatures of 50–60 °C (122–140 °F), by the introduction of insecticides, or by exposure to toxic gases. Surface coatings of paint or varnish also offer some protection, reducing egg-laying sites.",
  "Marine borers (certain species of mollusks and crustaceans) attack wooden structures in seawater (wharf pilings, boats, and other submerged wood) and cause severe damage. All wood species are vulnerable, but toxic extractives (as in certain tropical woods) provide some temporary protection. Preservative treatment imparts considerable resistance to these organisms.",
  "Wood is also subject to degradation by changing climatic conditions (e.g., by rain and sunlight causing repeated wetting and drying), mechanical stresses (e.g., imposed on railroad ties), and exposure to chemicals (e.g., acids and alkalies). Furthermore, wood is destroyed by fire. Large-dimension timbers (such as glued laminated beams) offer more resistance for a certain time, and fire-retardant treatments are also available.",
  " Bark constitutes, on the average, about 10 percent of the volume of a tree, but the figure varies depending on tree species and age. Although inner and outer bark can be distinguished by eye, growth rings are not macroscopically distinct. The cellular composition of bark has certain similarities to that of wood but also important differences. Nutrient-conducting cells—sieve cells and sieve tube members (which in wood correspond to the axial tracheids of softwoods and the vessel members of hardwoods, respectively)—are thin-walled and nonlignified, serving usually only one season of growth. Fibres and parenchyma cells also are contained in bark, as well as some specialized cells, and the bark of some softwood species possesses resin canals. Annual growth increments are very thin, and cells are deformed a short distance from the cambium, because of the pressure exercised by the growing wood. Consequently, growth rings are generally difficult to distinguish even under a microscope. Content of cellulose and hemicelluloses is lower in bark than in wood, and the properties of lignin are different. Differences also exist in physical and mechanical properties—density, hygroscopicity, dimensional stability (shrinkage and swelling), and others. Like wood, bark is anisotropic with regard to dimensional stability and strength. Thermal properties and heating value are similar to those of wood.",
  "Bark can be used in products such as particleboard and fibreboard, and small amounts are tolerated in semichemical and kraft pulping processes. Bark also has utility as a source of adhesives and other chemicals (e.g., tannins, dyes, and waxes), in environmental protection applications (e.g., absorption of spilled oil, industrial wastes, and sewage effluents), and as a fuel. Nevertheless, differences in the structure and chemical composition of different barks, difficulties of separating bark from wood when in the form of particles, and differences in the properties of inner and outer bark have impeded fuller utilization.",
  " Cork is also bark—the outer bark of a western Mediterranean oak, Quercus suber . It is stripped without adverse effects to the trees and grows again; it can be collected every 8–10 years. Aside from its use as bottle stoppers, cork is incorporated in life preservers and fishing equipment. As a reconstituted material (after chipping, grinding, and gluing), it finds uses as thermal and sound insulation, gaskets, flooring, bulletin boards, and various other products.",
  "Broad overviews of the wood industry and the economic importance of wood are given in Forest Products Research Society , Wood Product Demand and the Environment (1992); Forest Products Society , The Globalization of Wood (1994); and Birger Solberg , Matti Palo , and Pentti Hyttinen (eds.), Forest Industries Towards the Third Millennium (1996).",
  " George Tsoumis , Harvesting Forest Products (1992), is a generalized presentation of harvesting wood (and pine resin). Other comprehensive treatments of harvesting are K.A.G. Staaf and N.A. Wiksten , Tree Harvesting Techniques (1984; originally published in Swedish, 1972); Steve Conway , Logging Practices , rev. ed. (1982), covering North America; George Stenzel , Thomas A. Walbridge, Jr. , and Kenneth Pearce (eds.), Logging and Pulpwood Production , 2nd ed. (1985); and M. Patricia Marchak , Logging the Globe (1995), an environmental approach.",
  " George Tsoumis , Science and Technology of Wood (1991), is a comprehensive treatment of the structure, properties, and industrial utilization of wood (and bark) with keys for identification of North American, European, and important tropical woods. A.J. Panshin and Carl De Zeeuw , Textbook of Wood Technology , 4th ed. (1980), covers the structure, identification (by means of keys), and uses of commercial woods of North America and includes a brief description of properties. John G. Haygreen and Jim L. Bowyer , Forest Products and Wood Science , 3rd ed. (1996), covers wood structure, properties, and technology of major forest products in the United States. Forest Products Laboratory , Wood Engineering Handbook , 2nd ed. (1990), provides basic information on wood as a material of construction, with data for its use in design and specification. Other useful treatments of wood science and technology are K. Wilson and D.J.B. White , The Anatomy of Wood (1986); M.N.B. Nair , Wood Anatomy and Major Uses of Wood (1998); H.E. Desch , Timber: Structure, Properties, Conversion, and Use , 7th ed. rev. by J.M. Dinwoodie (1996); R. Bruce Hoadley , Understanding Wood (1980), and Identifying Wood (1990); Arno P. Schniewind (ed.), Concise Encyclopedia of Wood & Wood-Based Materials (1989); Otto Suchsland and George E. Woodson , Fiberboard Manufacturing Practices in the United States (1987, reissued 1990), which includes board properties and markets; and William T. Simpson (ed.), Dry Kiln Operator’s Manual (1991, reprinted 1997). The chemistry and chemical products of wood are discussed in Menachem Lewin and Irving S. Goldstein (eds.), Wood Structure and Composition (1991), and David N.-S. Hon and Nobuo Shiraishi (eds.), Wood and Cellulosic Chemistry (1991). Wood deterioration and preservative treatments are discussed in Robert A. Zabel and Jeffrey J. Morrell , Wood Microbiology: Decay and Its Prevention (1992); J.W. Creffield , Wood Destroying Insects , 2nd ed. (1996); R.A. Eaton and M.D.C. Hale , Wood: Decay, Pests, and Protection (1993); Forest Products Society , Wood Preservation in the ’90s and Beyond (1995); and Wood Protection Council , Wood Protection Guidelines: Protecting Wood from Decay, Fungi, and Termites (1993).",
  "Among major journals devoted to wood and wood products are Journal of Forest Engineering (semiannual); Forest Products Journal (monthly), published by the Forest Products Society; IAWA Journal (quarterly), published by the International Association of Wood Anatomists; Wood and Fiber Science (quarterly); Wood Science and Technology (quarterly), published by the International Academy of Wood Science; and Journal of the Institute of Wood Science (semiannual)."
]