[
  "  light ,  electromagnetic radiation that can be detected by the human eye . Electromagnetic radiation occurs over an extremely wide range of wavelengths , from gamma rays with wavelengths less than about 1 × 10 −11 metre to radio waves measured in metres. Within that broad spectrum the wavelengths visible to humans occupy a very narrow band, from about 700 nanometres (nm; billionths of a metre) for red light down to about 400 nm for violet light. The spectral regions adjacent to the visible band are often referred to as light also, infrared at the one end and ultraviolet at the other. The speed of light in a vacuum is a fundamental physical constant, the currently accepted value of which is exactly 299,792,458 metres per second, or about 186,282 miles per second.",
  "  No single answer to the question “What is light?” satisfies the many contexts in which light is experienced, explored, and exploited. The physicist is interested in the physical properties of light, the artist in an aesthetic appreciation of the visual world. Through the sense of sight, light is a primary tool for perceiving the world and communicating within it. Light from the Sun warms the Earth , drives global weather patterns, and initiates the life-sustaining process of photosynthesis . On the grandest scale, light’s interactions with matter have helped shape the structure of the universe . Indeed, light provides a window on the universe, from cosmological to atomic scales. Almost all of the information about the rest of the universe reaches Earth in the form of electromagnetic radiation. By interpreting that radiation, astronomers can glimpse the earliest epochs of the universe, measure the general expansion of the universe, and determine the chemical composition of stars and the interstellar medium . Just as the invention of the telescope dramatically broadened exploration of the universe, so too the invention of the microscope opened the intricate world of the cell . The analysis of the frequencies of light emitted and absorbed by atoms was a principal impetus for the development of quantum mechanics . Atomic and molecular spectroscopies continue to be primary tools for probing the structure of matter, providing ultrasensitive tests of atomic and molecular models and contributing to studies of fundamental photochemical reactions .",
  "Light transmits spatial and temporal information. This property forms the basis of the fields of optics and optical communications and a myriad of related technologies, both mature and emerging. Technological applications based on the manipulations of light include lasers , holography , and fibre-optic  telecommunications systems .",
  "In most everyday circumstances, the properties of light can be derived from the theory of classical electromagnetism , in which light is described as coupled electric and magnetic fields propagating through space as a traveling wave. However, this wave theory, developed in the mid-19th century, is not sufficient to explain the properties of light at very low intensities. At that level a quantum theory is needed to explain the characteristics of light and to explain the interactions of light with atoms and molecules . In its simplest form, quantum theory describes light as consisting of discrete packets of energy, called photons . However, neither a classical wave model nor a classical particle model correctly describes light; light has a dual nature that is revealed only in quantum mechanics. This surprising wave-particle duality is shared by all of the primary constituents of nature (e.g., electrons have both particle-like and wavelike aspects). Since the mid-20th century, a more comprehensive theory of light, known as quantum electrodynamics (QED), has been regarded by physicists as complete. QED combines the ideas of classical electromagnetism, quantum mechanics, and the special theory of relativity .",
  "This article focuses on the physical characteristics of light and the theoretical models that describe the nature of light. Its major themes include introductions to the fundamentals of geometrical optics, classical electromagnetic waves and the interference effects associated with those waves, and the foundational ideas of the quantum theory of light. More detailed and technical presentations of these topics can be found in the articles optics , electromagnetic radiation , quantum mechanics , and quantum electrodynamics . See also  relativity for details of how contemplation of the speed of light as measured in different reference frames was pivotal to the development of Albert Einstein ’s theory of special relativity in 1905.",
  "  While there is clear evidence that simple optical instruments such as plane and curved mirrors and convex lenses were used by a number of early civilizations, ancient Greek philosophers are generally credited with the first formal speculations about the nature of light. The conceptual hurdle of distinguishing the human perception of visual effects from the physical nature of light hampered the development of theories of light. Contemplation of the mechanism of vision dominated these early studies. Pythagoras ( c. 500 bce ) proposed that sight is caused by visual rays emanating from the eye and striking objects, whereas Empedocles ( c. 450 bce ) seems to have developed a model of vision in which light was emitted both by objects and the eye. Epicurus ( c. 300 bce ) believed that light is emitted by sources other than the eye and that vision is produced when light reflects off objects and enters the eye. Euclid ( c. 300 bce ), in his Optics , presented a law of reflection and discussed the propagation of light rays in straight lines. Ptolemy ( c. 100 ce ) undertook one of the first quantitative studies of the refraction of light as it passes from one transparent medium to another, tabulating pairs of angles of incidence and transmission for combinations of several media.",
  "  With the decline of the Greco-Roman realm, scientific progress shifted to the Islamic world. In particular, al-Maʾmūn , the seventh ʿAbbāsid  caliph of Baghdad, founded the House of Wisdom (Bayt al-Hikma) in 830 ce to translate, study, and improve upon Hellenistic works of science and philosophy. Among the initial scholars were al-Khwārizmī and al-Kindī . Known as the “philosopher of the Arabs,” al-Kindī extended the concept of rectilinearly propagating light rays and discussed the mechanism of vision. By 1000, the Pythagorean model of light had been abandoned, and a ray model, containing the basic conceptual elements of what is now known as geometrical optics, had emerged. In particular, Ibn al-Haytham (Latinized as Alhazen), in Kitab al-manazir ( c. 1038; “Optics”), correctly attributed vision to the passive reception of light rays reflected from objects rather than an active emanation of light rays from the eyes. He also studied the mathematical properties of the reflection of light from spherical and parabolic mirrors and drew detailed pictures of the optical components of the human eye. Ibn al-Haytham’s work was translated into Latin in the 13th century and was a motivating influence on the Franciscan friar and natural philosopher Roger Bacon . Bacon studied the propagation of light through simple lenses and is credited as one of the first to have described the use of lenses to correct vision.",
  "With the dawn of the 17th century, significant progress was reawakened in Europe. Compound microscopes were first constructed in the Netherlands between 1590 and 1608 (probably by Hans and Zacharias Jansen), and most sources credit another Dutchman, Hans Lippershey , with the invention of the telescope in 1608. The Italian astronomer Galileo quickly improved upon the design of the refracting telescope and used it in his discoveries of the moons of Jupiter and the rings of Saturn in 1610. (Refraction refers to the passage of light from one medium into another—in this case, from air into a glass lens.) The German astronomer Johannes Kepler presented an approximate mathematical analysis of the focusing properties of lenses in Dioptrice (1611). An empirical advance was made by the Dutch astronomer Willebrord Snell in 1621 with his discovery of the mathematical relation ( Snell’s law ) between the angles of incidence and transmission for a light ray refracting through an interface between two media. In 1657 the French mathematician Pierre de Fermat presented an intriguing derivation of Snell’s law based on his principle of least time , which asserted that light follows the path of minimum time in traveling from one point to another. The posthumous publication of the Jesuit mathematician Francesco Grimaldi’s studies in 1665 first described what are now called diffraction effects, in which light passing an obstacle is seen to penetrate into the geometrical shadow. In 1676 the Danish astronomer Ole Rømer used his measurements of the changes in the apparent orbital periods of the moons of Jupiter over the course of a year to deduce an approximate value for the speed of light. The significance of Rømer’s work was the realization that the speed of light is not infinite.",
  "  Seminal physical models of the nature of light were developed in parallel with the many empirical discoveries of the 17th century. Two competing models of light, as a collection of fast-moving particles and as a propagating wave, were advanced. In La Dioptrique (1637), French philosopher-mathematician René Descartes described light as a pressure wave transmitted at infinite speed through a pervasive elastic medium. The prominent English physicist Robert Hooke studied diffraction effects and thin-film interference and concluded in Micrographia (1665) that light is a rapid vibration of any medium through which it propagates. In his Traité de la Lumière (1690; “Treatise on Light”), the Dutch mathematician-astronomer Christiaan Huygens formulated the first detailed wave theory of light, in the context of which he was also able to derive the laws of reflection and refraction.",
  "The most prominent advocate of a particle theory of light was Isaac Newton . Newton’s careful investigations into the properties of light in the 1660s led to his discovery that white light consists of a mixture of colours. He struggled with a formulation of the nature of light, ultimately asserting in Opticks (1704) that light consists of a stream of corpuscles, or particles. To reconcile his particle model with the known law of refraction, Newton speculated that transparent objects (such as glass) exert attractive forces on the particles, with the consequence that the speed of light in a transparent medium is always greater than the speed of light in a vacuum. He also postulated that particles of different colours of light have slightly different masses, leading to different speeds in transparent media and hence different angles of refraction. Newton presented his speculations in Opticks in the form of a series of queries rather than as a set of postulates, possibly conveying an ambivalence regarding the ultimate nature of light. Because of his immense authority in the scientific community, there were few challenges to his particle model of light in the century after his death in 1727.",
  "Newton’s corpuscular model survived into the early years of the 19th century, at which time evidence for the wave nature of light became overwhelming. Theoretical and experimental work in the mid to late 19th century convincingly established light as an electromagnetic wave, and the issue seemed to be resolved by 1900. With the arrival of quantum mechanics in the early decades of the 20th century, however, the controversy over the nature of light resurfaced. As will be seen in the following sections, this scientific conflict between particle and wave models of light permeates the history of the subject.",
  "A detailed understanding of the nature of light was not needed for the development, beginning in the 1600s, of a practical science of optics and optical instrument design. Rather, a set of empirical rules describing the behaviour of light as it traverses transparent materials and reflects off smooth surfaces was adequate to support practical advances in optics. Known collectively today as geometrical optics, the rules constitute an extremely useful, though very approximate, model of light. Their primary applications are the analysis of optical systems— cameras , microscopes, telescopes—and the explanation of simple optical phenomena in nature.",
  "The basic element in geometrical optics is the light ray, a hypothetical construct that indicates the direction of the propagation of light at any point in space. The origin of this concept dates back to early speculations regarding the nature of light. By the 17th century the Pythagorean notion of visual rays had long been abandoned, but the observation that light travels in straight lines led naturally to the development of the ray concept. It is easy to imagine representing a narrow beam of light by a collection of parallel arrows—a bundle of rays. As the beam of light moves from one medium to another, reflects off surfaces, disperses, or comes to a focus, the bundle of rays traces the beam’s progress in a simple geometrical manner.",
  "Geometrical optics consists of a set of rules that determine the paths followed by light rays. In any uniform medium the rays travel in straight lines. The light emitted by a small localized source is represented by a collection of rays pointing radially outward from an idealized “point source.” A collection of parallel rays is used to represent light flowing with uniform intensity through space; examples include the light from a distant star and the light from a laser . The formation of a sharp shadow when an object is illuminated by a parallel beam of light is easily explained by tracing the paths of the rays that are not blocked by the object.",
  " 1 2  2 1     Light rays change direction when they reflect off a surface, move from one transparent medium into another, or travel through a medium whose composition is continuously changing. The law of reflection states that, on reflection from a smooth surface, the angle of the reflected ray is equal to the angle of the incident ray. (By convention, all angles in geometrical optics are measured with respect to the normal to the surface—that is, to a line perpendicular to the surface.) The reflected ray is always in the plane defined by the incident ray and the normal to the surface. The law of reflection can be used to understand the images produced by plane and curved mirrors. Unlike mirrors, most natural surfaces are rough on the scale of the wavelength of light, and, as a consequence, parallel incident light rays are reflected in many different directions, or diffusely. Diffuse reflection is responsible for the ability to see most illuminated surfaces from any position—rays reach the eyes after reflecting off every portion of the surface.",
  "  When light traveling in one transparent medium encounters a boundary with a second transparent medium (e.g., air and glass), a portion of the light is reflected and a portion is transmitted into the second medium. As the transmitted light moves into the second medium, it changes its direction of travel; that is, it is refracted. The law of refraction, also known as Snell’s law , describes the relationship between the angle of incidence (θ 1 ) and the angle of refraction (θ 2 ), measured with respect to the normal (“perpendicular line”) to the surface, in mathematical terms: n  1 sin θ 1 = n  2 sin θ 2 , where n  1 and n  2 are the index of refraction of the first and second media, respectively. The index of refraction for any medium is a dimensionless constant equal to the ratio of the speed of light in a vacuum to its speed in that medium.",
  "By definition, the index of refraction for a vacuum is exactly 1. Because the speed of light in any transparent medium is always less than the speed of light in a vacuum, the indices of refraction of all media are greater than one, with indices for typical transparent materials between one and two. For example, the index of refraction of air at standard conditions is 1.0003, water is 1.33, and glass is about 1.5.",
  "The basic features of refraction are easily derived from Snell’s law. The amount of bending of a light ray as it crosses a boundary between two media is dictated by the difference in the two indices of refraction. When light passes into a denser medium, the ray is bent toward the normal. Conversely, light emerging obliquely from a denser medium is bent away from the normal. In the special case where the incident beam is perpendicular to the boundary (that is, equal to the normal), there is no change in the direction of the light as it enters the second medium.",
  "  Snell’s law governs the imaging properties of lenses . Light rays passing through a lens are bent at both surfaces of the lens. With proper design of the curvatures of the surfaces, various focusing effects can be realized. For example, rays initially diverging from a point source of light can be redirected by a lens to converge at a point in space, forming a focused image. The optics of the human eye is centred around the focusing properties of the cornea and the crystalline lens . Light rays from distant objects pass through these two components and are focused into a sharp image on the light-sensitive retina . Other optical imaging systems range from simple single-lens applications, such as the magnifying glass, the eyeglass, and the contact lens , to complex configurations of multiple lenses. It is not unusual for a modern camera to have a half dozen or more separate lens elements, chosen to produce specific magnifications, minimize light losses via unwanted reflections, and minimize image distortion caused by lens aberrations .",
  " B C A  One interesting consequence of the law of refraction is associated with light passing into a medium with a lower index of refraction. As previously mentioned, in this case light rays are bent away from the normal of the interface between the media. At what is called the critical angle of incidence (Θ), the refracted rays make an angle of 90° with the normal—in other words, they just skim the boundary of the two media. The sine of the critical angle is easily derived from the law of refraction: sin Θ =   n  2    n  1   .",
  "For any incident angle greater than the critical angle, light rays are completely reflected inside the material. This phenomenon, called total internal reflection, is commonly taken advantage of to “pipe” light in a curved path. When light is directed down a narrow fibre of glass or plastic, the light repeatedly reflects off the fibre-air interface at a large incident angle—larger than the critical angle (for a glass-air interface the critical angle is about 42°). Optical fibres with diameters from 10 to 50 micrometres can transmit light over long distances with little loss of intensity ( see  fibre optics ). Optical communications uses sequences of light pulses to transmit information through an optical fibre network. Medical instruments such as endoscopes rely on the total internal reflection of light through an optical fibre bundle to image internal organs.",
  "  Through his careful investigation of the refraction of white light as it passed through a glass  prism , Newton was famously credited with the discovery that white light consists of a spectrum of colours . The dispersion of white light into its constituent colours is caused by a variation of the index of refraction of glass with colour. This effect, known as chromatic dispersion, results from the fact that the speed of light in glass depends on the wavelength of the light. The speed slightly decreases with decreasing wavelength; this means that the index of refraction, which is inversely proportional to the speed, slightly increases with decreasing wavelength. For glass, the index of refraction for red light (the longest visible wavelength) is about 1 percent less than that for violet light (the shortest visible wavelength).",
  "The focusing properties of glass lenses, being determined by their indices of refraction, are slightly dependent on colour. When a single lens images a distant white-light point source, such as a star, the image is slightly distorted because of dispersion in the lens; this effect is called chromatic aberration . In an effort to improve upon the chromatic aberration of the refracting telescope, Isaac Newton invented the reflecting telescope, in which the imaging and magnification are accomplished with mirrors.",
  "  Dispersion is not restricted to glass; all transparent media exhibit some dispersion. Many beautiful optical effects are explained by the phenomena of dispersion, refraction, and reflection. Principal among them is the rainbow , for which René Descartes and Newton are credited with the first solid quantitative analyses. A rainbow is formed when sunlight is refracted by spherical water droplets in the atmosphere; two refractions and one reflection, combined with the chromatic dispersion of water, produce the primary arcs of colour. The laws of geometrical optics also explain the formation of mirages and halos and the rarely observed “green flash” of a setting Sun.",
  "The rules of geometrical optics, developed through centuries of observation, can be derived from the classical electromagnetic-wave model of light. However, as long as the physical dimensions of the objects that light encounters (and the apertures through which it passes) are significantly greater than the wavelength of the electromagnetic wave, there is no need for the mathematical formalism of the wave model. In those circumstances, light is adequately modeled as a collection of rays following the rules of geometrical optics. Most everyday optical phenomena can be handled within this approximation, since the wavelengths of visible light are relatively short (400 to 700 nm). However, as the dimensions of objects and apertures approach the wavelength of light, the wave character of light cannot be disregarded. Many optical effects, often subtle in nature, cannot be understood without a wave model. For example, on close inspection the shadows of objects in parallel light are seen not to be infinitely sharp. This is a consequence of the “bending” of waves around corners—a phenomenon best explained by the wave model. Another class of phenomena involves the polarization of light waves. These issues are addressed below.",
  " Isaac Newton ’s corpuscular model of light ( see  Early particle and wave theories ) was championed by most of the European scientific community throughout the 1700s, but by the start of the 19th century it was facing challenges. About 1802 Thomas Young , an English physician and physicist, showed that an interference pattern is produced when light from two sources overlaps. Though it took some time for Young’s contemporaries fully to accept the implications of his landmark discovery, it conclusively demonstrated that light has wavelike characteristics. Young’s work ushered in a period of intense experimental and theoretical activity that culminated 60 years later in a fully developed wave theory of light. By the latter years of the 19th century, corpuscular theories were abandoned. Before describing Young’s work, an introduction to the relevant features of waves is in order.",
  "From ripples on a pond to deep ocean swells, sound waves, and light, all waves share some basic characteristics. Broadly speaking, a wave is a disturbance that propagates through space. Most waves move through a supporting medium, with the disturbance being a physical displacement of the medium. The time dependence of the displacement at any single point in space is often an oscillation about some equilibrium position. For example, a sound wave travels through the medium of air, and the disturbance is a small collective displacement of air molecules—individual molecules oscillate back and forth as the wave passes.",
  "Unlike particles, which have well-defined positions and trajectories, waves are not localized in space. Rather, waves fill regions of space, and their evolutions in time are not described by simple trajectories. Nevertheless, some waves are more localized than others, and so it is useful to distinguish two broad classes. (1) A wave pulse is a relatively localized disturbance. For example, when a stone is dropped into a pond, the resulting ripples, which constitute a surface wave, extend over only a small portion of the surface at any instant of time. (2) At the opposite extreme, periodic waves can extend over great distances. In the example above, if the water surface is repeatedly disturbed at one point for a long period of time, the surface ripples eventually will blanket a large area.",
  "  A simple and useful example of a periodic wave is a harmonic wave. The wavelength λ of the wave is the physical separation between successive crests. The maximum displacement of the wave, or amplitude, is denoted by A . The time between successive oscillations is called the period τ of the wave. The number of oscillations per second is the wave frequency f , which is the reciprocal of the period,  1  τ  .",
  "Harmonic waves propagate with well-defined velocities that are related to their frequency and wavelength. Fixing attention on a single point in space, the number of wave crests that pass that point per second is the wave frequency f . The distance traveled past that point by any one crest in one second—the wave velocity v —is equal to the distance between crests λ multiplied by the frequency: v = λ f .",
  "The properties of harmonic waves are illustrated in the mathematical expression for the displacement in both space and time. For a harmonic wave traveling in the x -direction, the spatial and time dependence of the displacement ϕ is   ",
  "A defining characteristic of all waves is superposition, which describes the behaviour of overlapping waves. The superposition principle states that when two or more waves overlap in space, the resultant disturbance is equal to the algebraic sum of the individual disturbances. (This is sometimes violated for large disturbances; see below  Nonlinear interactions .) This simple underlying behaviour leads to a number of effects that are collectively called interference phenomena.",
  "  There are two extreme limits to interference effects. In constructive interference the crests of two waves coincide, and the waves are said to be in phase with each other. Their superposition results in a reinforcement of the disturbance; the amplitude of the resulting combined wave is the sum of the individual amplitudes. Conversely, in destructive interference the crest of one wave coincides with the valley of a second wave, and they are said to be out of phase. The amplitude of the combined wave equals the difference between the amplitudes of the individual waves. In the special case where those individual amplitudes are equal, the destructive interference is complete, and the net disturbance to the medium is zero.",
  "The observation of interference effects definitively indicates the presence of overlapping waves. Thomas Young postulated that light is a wave and is subject to the superposition principle; his great experimental achievement was to demonstrate the constructive and destructive interference of light (c. 1801). In a modern version of Young’s experiment, differing in its essentials only in the source of light, a laser equally illuminates two parallel slits in an otherwise opaque surface. The light passing through the two slits is observed on a distant screen. When the widths of the slits are significantly greater than the wavelength of the light, the rules of geometrical optics hold—the light casts two shadows, and there are two illuminated regions on the screen. However, as the slits are narrowed in width, the light diffracts into the geometrical shadow, and the light waves overlap on the screen. (Diffraction is itself caused by the wave nature of light, being another example of an interference effect—it is discussed in more detail below.)",
  "  The superposition principle determines the resulting intensity pattern on the illuminated screen. Constructive interference occurs whenever the difference in paths from the two slits to a point on the screen equals an integral number of wavelengths (0, λ, 2λ,…). This path difference guarantees that crests from the two waves arrive simultaneously. Destructive interference arises from path differences that equal a half-integral number of wavelengths (λ/2, 3λ/2,…). Young used geometrical arguments to show that the superposition of the two waves results in a series of equally spaced bands, or fringes, of high intensity, corresponding to regions of constructive interference, separated by dark regions of complete destructive interference.",
  "An important parameter in the double-slit geometry is the ratio of the wavelength of the light λ to the spacing of the slits d . If λ/ d is much smaller than 1, the spacing between consecutive interference fringes will be small, and the interference effects may not be observable. Using narrowly separated slits, Young was able to separate the interference fringes. In this way he determined the wavelengths of the colours of visible light. The very short wavelengths of visible light explain why interference effects are observed only in special circumstances—the spacing between the sources of the interfering light waves must be very small to separate regions of constructive and destructive interference.",
  "Observing interference effects is challenging because of two other difficulties. Most light sources emit a continuous range of wavelengths, which result in many overlapping interference patterns, each with a different fringe spacing. The multiple interference patterns wash out the most pronounced interference effects, such as the regions of complete darkness. Second, for an interference pattern to be observable over any extended period of time, the two sources of light must be coherent with respect to each other. This means that the light sources must maintain a constant phase relationship. For example, two harmonic waves of the same frequency always have a fixed phase relationship at every point in space, being either in phase, out of phase, or in some intermediate relationship. However, most light sources do not emit true harmonic waves; instead, they emit waves that undergo random phase changes millions of times per second. Such light is called incoherent. Interference still occurs when light waves from two incoherent sources overlap in space, but the interference pattern fluctuates randomly as the phases of the waves shift randomly. Detectors of light, including the eye, cannot register the quickly shifting interference patterns, and only a time-averaged intensity is observed. Laser light is approximately monochromatic (consisting of a single wavelength) and is highly coherent; it is thus an ideal source for revealing interference effects.",
  "After 1802, Young’s measurements of the wavelengths of visible light could be combined with the relatively crude determinations of the speed of light available at the time in order to calculate the approximate frequencies of light. For example, the frequency of green light is about 6 × 10 14 Hz ( hertz , or cycles per second). This frequency is many orders of magnitude larger than the frequencies of common mechanical waves. For comparison, humans can hear sound waves with frequencies up to about 2 × 10 4 Hz. Exactly what was oscillating at such a high rate remained a mystery for another 60 years.",
  "Observable interference effects are not limited to the double-slit geometry used by Thomas Young. The phenomenon of thin-film interference results whenever light reflects off two surfaces separated by a distance comparable to its wavelength. The “film” between the surfaces can be a vacuum, air, or any transparent liquid or solid. In visible light, noticeable interference effects are restricted to films with thicknesses on the order of a few micrometres. A familiar example is the film of a soap bubble. Light reflected from a bubble is a superposition of two waves—one reflecting off the front surface and a second reflecting off the back surface. The two reflected waves overlap in space and interfere. Depending on the thickness of the soap film, the two waves may interfere constructively or destructively. A full analysis shows that, for light of a single wavelength λ, there are constructive interference for film thicknesses equal to λ/4, 3λ/4, 5λ/4,… and destructive interference for thicknesses equal to λ/2, λ, 3λ/2,….",
  "When white light illuminates a soap film, bright bands of colour are observed as different wavelengths suffer destructive interference and are removed from the reflection. The remaining reflected light appears as the complementary colour of the removed wavelength (e.g., if red light is removed by destructive interference, the reflected light will appear as cyan). Thin films of oil on water produce a similar effect. In nature, the feathers of certain birds, including peacocks and hummingbirds , and the shells of some beetles display iridescence , in which the colour on reflection changes with the viewing angle. This is caused by the interference of reflected light waves from thinly layered structures or regular arrays of reflecting rods. In a similar fashion, pearls and abalone shells are iridescent from the interference caused by reflections from multiple layers of nacre. Gemstones such as opal exhibit beautiful interference effects arising from the scattering of light from regular patterns of microscopic spherical particles.",
  "There are many technological applications of interference effects in light. Common antireflection coatings on camera lenses are thin films with thicknesses and indices of refraction chosen to produce destructive interference on reflection for visible light. More-specialized coatings, consisting of multiple layers of thin films, are designed to transmit light only within a narrow range of wavelengths and thus act as wavelength filters. Multilayer coatings are also used to enhance the reflectivity of mirrors in astronomical telescopes and in the optical cavities of lasers. The precision techniques of interferometry measure small changes in relative distances by monitoring the fringe shifts in the interference patterns of reflected light. For example, the curvatures of surfaces in optical components are monitored to fractions of an optical wavelength with interferometric methods.",
  "The subtle pattern of light and dark fringes seen in the geometrical shadow when light passes an obstacle, first observed by the Jesuit mathematician Francesco Grimaldi in the 17th century, is an example of the wave phenomenon of diffraction. Diffraction is a product of the superposition of waves—it is an interference effect. Whenever a wave is obstructed, those portions of the wave not affected by the obstruction interfere with one another in the region of space beyond the obstruction. The mathematics of diffraction is considerably complicated, and a detailed, systematic theory was not worked out until 1818 by the French physicist Augustin-Jean Fresnel .",
  "  The Dutch scientist Christiaan Huygens first stated the fundamental principle for understanding diffraction: every point on a wave front can be considered a secondary source of spherical wavelets. The shape of the advancing wave front is determined by the envelope of the overlapping spherical wavelets. If the wave is unobstructed, Huygens’s principle will not be needed for determining its evolution—the rules of geometrical optics will suffice. (However, note that the light rays of geometrical optics are always perpendicular to the advancing wavefront; in this sense, the progress of a light ray is ultimately always determined by Huygens’s principle.) Huygens’s principle becomes necessary when a wave meets an obstacle or an aperture in an otherwise opaque surface. Thus, for a plane wave passing through a small aperture, only wavelets originating within the aperture contribute to the transmitted wave, which is seen to spread into the region of the aperture’s geometric shadow.",
  "  Fresnel incorporated Young’s principle of interference into Huygens’s construction and calculated the detailed intensity patterns produced by interfering secondary wavelets. For a viewing screen a distance L from a slit of width a , light of wavelength λ produces a central intensity maximum that is approximately λ L / a in width. This result highlights the most important qualitative feature of diffraction: the effect is normally apparent only when the sizes of obstacles or apertures are on the order of the wavelength of the wave. For example, audible sound waves have wavelengths of about one metre, which easily diffract around commonplace objects. This is why sound is heard around corners. On the other hand, visible light has wavelengths of a fraction of a micrometre, and it therefore does not noticeably bend around large objects. Only the most careful measurements by Young, Fresnel, and their early 19th-century contemporaries revealed the details of the diffraction of visible light.",
  "Fresnel presented much of his work on diffraction as an entry to a competition on the subject sponsored by the French Academy of Sciences . The committee of judges included a number of prominent advocates of Newton’s corpuscular model of light, one of whom, Siméon-Denis Poisson , pointed out that Fresnel’s model predicted a seemingly absurd result: If a parallel beam of light falls on a small spherical obstacle, there will be a bright spot at the centre of the circular shadow—a spot nearly as bright as if the obstacle were not there at all. An experiment was subsequently performed by the French physicist François Arago , and Poisson’s spot was seen, vindicating Fresnel.",
  "Circular apertures also produce diffraction patterns. When a parallel beam of light passes through a converging lens, the rules of geometrical optics predict that the light comes to a tight focus behind the lens, forming a point image. In reality, the pattern in the lens’s image plane is complicated by diffraction effects. The lens, considered as a circular aperture with diameter D , produces a two-dimensional diffraction pattern with a central intensity maximum of angular width about λ/ D . Angular width refers to the angle, measured in radians, that is defined by the two intensity minima on either side of the central maximum.",
  "Diffraction effects from circular apertures have an important practical consequence: the intensity patterns in optical images produced by circular lenses and mirrors are limited in their ability to resolve closely spaced features. Each point in the object is imaged into a diffraction pattern of finite width, and the final image is a sum of individual diffraction patterns. Baron Rayleigh , a leading figure of late 19th-century physics, showed that the images of two point sources are resolvable only if their angular separation, relative to an imaging element of diameter D , is greater than about 1.2λ/ D (“Rayleigh’s criterion”).",
  "Circular aperture diffraction effects limit the resolving power of telescopes and microscopes. This is one of the reasons why the best astronomical telescopes have large-diameter mirrors; in addition to the obvious advantage of an increased light-gathering capability, larger mirrors decrease the resolvable angular separation of astronomical objects. To minimize diffraction effects, optical microscopes are sometimes designed to use ultraviolet light rather than longer-wavelength visible light. Nevertheless, diffraction is often the limiting factor in the ability of a microscope to resolve the fine details of objects.",
  "The late 19th-century French painter Georges Seurat created a new technique, known as pointillism , based on diffraction effects. His paintings consist of thousands of closely spaced small dots of colour. When viewed up close, the individual points of colour are apparent to the eye. Viewed from afar, the individual points cannot be resolved because of the diffraction of the images produced by the lens of the eye. The overlapping images on the retina combine to produce colours other than those used in the individual dots of paint. The same physics underlies the use of closely spaced arrays of red, blue, and green phosphors on television screens and computer monitors; diffraction effects in the eye mix the three primary colours to produce a wide range of hues.",
  "  Diffraction is also responsible for certain optical effects in Earth’s atmosphere . A set of concentric coloured rings, known as an atmospheric corona , often overlapping to produce a single diffuse whitish ring, is sometimes observed around the Moon . The corona is produced as light reflected from the Moon diffracts through water droplets or ice crystals in Earth’s upper atmosphere. When the droplets are of uniform diameter, the different colours are clearly distinct in the diffraction pattern. A related and beautiful atmospheric phenomenon is the glory. Seen in backscattered light from water droplets, commonly forming a fog or mist, the glory is a set of rings of coloured light surrounding the shadow of the observer. The rings of light, with angular diameters of a few degrees, are created by the interplay of refraction, reflection, and diffraction in the water droplets. The glory, once a phenomenon rarely observed, is now frequently seen by airline travelers as coloured rings surrounding their airplane’s shadow on a nearby cloud. Finally, as pointed out in the section Dispersion , the primary and secondary arcs of a rainbow are adequately explained by geometrical optics. However, the more subtle supernumerary bows—weak arcs of light occasionally seen below the primary arc of colours—are caused by diffraction effects in the water droplets that form the rainbow.",
  "In 1842 Austrian physicist Christian Doppler established that the apparent frequency of sound waves from an approaching source is greater than the frequency emitted by the source and that the apparent frequency of a receding source is lower. The Doppler effect , which is easily noticed with approaching or receding police sirens, also applies to light waves. The light from an approaching source is shifted up in frequency, or blueshifted, while light from a receding source is shifted down in frequency, or redshifted. The frequency shift depends on the velocity of the source relative to the observer; for velocities much less than the speed of light, the shift is proportional to the velocity.",
  "The observation of Doppler shifts in atomic spectral lines is a powerful tool to measure relative motion in astronomy. Most notably, redshifted light from distant galaxies is the primary evidence for the general expansion of the universe. There are a host of other astronomical applications, including the determination of binary star orbits and the rotation rates of galaxies. The most common terrestrial application of the Doppler effect occurs in radar systems. Electromagnetic waves reflected from a moving object undergo Doppler shifts that can then be used to determine the object’s speed. In these applications, ranging from monitoring automobile speeds to monitoring wind speeds in the atmosphere, radio waves or microwaves are used instead of visible light.",
  "In spite of theoretical and experimental advances in the first half of the 19th century that established the wave properties of light, the nature of light was not yet revealed—the identity of the wave oscillations remained a mystery. This situation dramatically changed in the 1860s when the Scottish physicist James Clerk Maxwell , in a watershed theoretical treatment, unified the fields of electricity , magnetism , and optics . In his formulation of electromagnetism, Maxwell described light as a propagating wave of electric and magnetic fields. More generally, he predicted the existence of electromagnetic radiation : coupled electric and magnetic fields traveling as waves at a speed equal to the known speed of light. In 1888 German physicist Heinrich Hertz succeeded in demonstrating the existence of long-wavelength electromagnetic waves and showed that their properties are consistent with those of the shorter-wavelength visible light.",
  "The subjects of electricity and magnetism were well developed by the time Maxwell began his synthesizing work. English physician William Gilbert initiated the careful study of magnetic phenomena in the late 16th century. In the late 1700s an understanding of electric phenomena was pioneered by Benjamin Franklin , Charles-Augustin de Coulomb , and others. Siméon-Denis Poisson , Pierre-Simon Laplace , and Carl Friedrich Gauss developed powerful mathematical descriptions of electrostatics and magnetostatics that stand to the present time. The first connection between electric and magnetic effects was discovered by Danish physicist Hans Christian Ørsted in 1820 when he found that electric currents produce magnetic forces. Soon after, French physicist André-Marie Ampère developed a mathematical formulation ( Ampère’s law ) relating currents to magnetic effects. In 1831 the great English experimentalist Michael Faraday discovered electromagnetic induction , in which a moving magnet (more generally, a changing magnetic flux) induces an electric current in a conducting circuit.",
  "Faraday’s conception of electric and magnetic effects laid the groundwork for Maxwell’s equations . Faraday visualized electric charges as producing fields that extend through space and transmit electric and magnetic forces to other distant charges. The notion of electric and magnetic fields is central to the theory of electromagnetism, and so it requires some explanation. A field is used to represent any physical quantity whose value changes from one point in space to another. For example, the temperature of Earth’s atmosphere has a definite value at every point above the surface of Earth; to specify the atmospheric temperature completely thus requires specifying a distribution of numbers—one for each spatial point. The temperature “field” is simply a mathematical accounting of those numbers; it may be expressed as a function of the spatial coordinates. The values of the temperature field can also vary with time; therefore, the field is more generally expressed as a function of spatial coordinates and time: T ( x , y , z , t ), where T is the temperature field, x , y , and z are the spatial coordinates, and t is the time.",
  "Temperature is an example of a scalar field; its complete specification requires only one number for each spatial point. Vector fields, on the other hand, describe physical quantities that have a direction and magnitude at each point in space. A familiar example is the velocity field of a fluid. Electric and magnetic fields are also vector fields; the electric field is written as E ( x , y , z , t ) and the magnetic field as B ( x , y , z , t ).",
  "In the early 1860s, Maxwell completed a study of electric and magnetic phenomena. He presented a mathematical formulation in which the values of the electric and magnetic fields at all points in space can be calculated from a knowledge of the sources of the fields. By Faraday’s time, it was known that electric charges are the source of electric fields and that electric currents (charges in motion) are the source of magnetic fields. Faraday’s electromagnetic induction showed that there is a second source of electric fields—changing magnetic fields. In a significant step in the development of his theory, Maxwell postulated that changing electric fields are sources of magnetic fields. In its modern form, Maxwell’s electromagnetic theory is expressed as four partial differential equations for the fields E and B . Known as Maxwell’s equations , these four statements relating the fields to their sources, along with the expression for the forces exerted by the fields on electric charges, constitute the whole of classical electromagnetism.",
  "A manipulation of the four equations for the electric and magnetic fields led Maxwell to wave equations for the fields, the solutions of which are traveling harmonic waves. Though the mathematical treatment is detailed, the underlying origin of the waves can be understood qualitatively: changing magnetic fields produce electric fields, and changing electric fields produce magnetic fields. This implies the possibility of an electromagnetic field in which a changing electric field continually gives rise to a changing magnetic field, and vice versa.",
  "Electromagnetic waves do not represent physical displacements that propagate through a medium like mechanical sound and water waves; instead, they describe propagating oscillations in the strengths of electric and magnetic fields. Maxwell’s wave equation showed that the speed of the waves, labeled c , is determined by a combination of constants in the laws of electrostatics and magnetostatics—in modern notation:   where ε 0 , the permittivity of free space, has an experimentally determined value of 8.85 × 10 −12 square coulomb per newton square metre, and μ 0 , the magnetic permeability of free space, has a value of 1.26 × 10 −6 newton square seconds per square coulomb. The calculated speed, about 3 × 10 8 metres per second, agreed with the known speed of light. In an 1864 lecture before the Royal Society of London, “A Dynamical Theory of the Electro-Magnetic Field,” Maxwell asserted:",
  "We have strong reason to conclude that light itself—including radiant heat and other radiation, if any—is an electromagnetic disturbance in the form of waves propagated through the electro-magnetic field according to electro-magnetic laws.",
  "Maxwell’s achievement ranks as one of the greatest advances of physics. For the physicist of the late 19th century, the study of light became a study of an electromagnetic phenomenon—the fields of electricity, magnetism, and optics were unified in one grand design. While an understanding of light has undergone some profound changes since the 1860s as a result of the discovery of light’s quantum mechanical nature, Maxwell’s electromagnetic wave model remains completely adequate for many purposes.",
  "  Heinrich Hertz’s production in 1888 of what are now called radio waves, his verification that these waves travel at the same speed as visible light, and his measurements of their reflection, refraction, diffraction, and polarization properties were a convincing demonstration of the existence of Maxwell’s waves. Visible light is but one example of a much broader set of phenomena—an electromagnetic spectrum with no theoretical upper or lower limit to frequencies and wavelengths. While there are no theoretical distinctions between electromagnetic waves of any wavelength, the spectrum is conventionally divided into different regions on the basis of historical developments, the methods of production and detection of the waves, and their technological uses.",
  "The sources of classical electromagnetic waves are accelerating electric charges. (Note that acceleration refers to a change in velocity, which occurs whenever a particle’s speed or its direction of motion changes.) A common example is the generation of radio waves by oscillating electric charges in an antenna . When a charge moves in a linear antenna with an oscillation frequency f , the oscillatory motion constitutes an acceleration, and an electromagnetic wave with the same frequency propagates away from the antenna. At frequencies above the microwave region, with a few prominent exceptions ( see  bremsstrahlung ; synchrotron radiation ), the classical picture of an accelerating electric charge producing an electromagnetic wave is less and less applicable. In the infrared, visible, and ultraviolet regions, the primary radiators are the charged particles in atoms and molecules. In this regime a quantum mechanical radiation model is far more relevant.",
  "  Measurements of the speed of light have challenged scientists for centuries. The assumption that the speed is infinite was dispelled by the Danish astronomer Ole Rømer in 1676. French physicist Armand-Hippolyte-Louis Fizeau was the first to succeed in a terrestrial measurement in 1849, sending a light beam along a 17.3-km round-trip path across the outskirts of Paris . At the light source, the exiting beam was chopped by a rotating toothed wheel; the measured rotational rate of the wheel at which the beam, upon its return, was eclipsed by the toothed rim was used to determine the beam’s travel time. Fizeau reported a light speed that differs by only about 5 percent from the currently accepted value. One year later, French physicist Léon Foucault improved the accuracy of the technique to about 1 percent.",
  "In the same year, Foucault showed that the speed of light in water is less than its speed in air by the ratio of the indices of refraction of air and water:   ",
  "This measurement established the index of refraction of a material as the ratio of the speed of light in vacuum to the speed within the material. The more general finding, that light is slowed in transparent media, directly contradicted Isaac Newton’s assertion that light corpuscles travel faster in media than in vacuum and settled any lingering 19th-century doubts about the corpuscle–wave debate.",
  "The German-born American physicist A.A. Michelson set the early standard for measurements of the speed of light in the late 1870s, determining a speed within 0.02 percent of the modern value. Michelson’s most noteworthy measurements of the speed of light, however, were yet to come. From the first speculations on the wave nature of light by Huygens through the progressively more refined theories of Young, Fresnel, and Maxwell, it was assumed that an underlying physical medium supports the transmission of light, in much the same way that air supports the transmission of sound. Called the ether , or the luminiferous ether, this medium was thought to permeate all of space. The inferred physical properties of the ether were problematic—to support the high-frequency transverse oscillations of light, it would have to be very rigid, but its lack of effect on planetary motion and the fact that it was not observed in any terrestrial circumstances required it to be tenuous and chemically undetectable. While there is no reference to the properties of a supporting medium in the mathematics of Maxwell’s electromagnetic theory, even he subscribed to the ether’s existence, writing an article on the subject for the ninth edition of the Encyclopædia Britannica in the 1870s. ( See the Britannica Classic “ Ether .”) In 1887 Michelson, in collaboration with American chemist Edward Morley , completed a precise set of optical measurements designed to detect the motion of Earth through the ether as it orbited the Sun.",
  " A B  The measurements in the Michelson-Morley experiment were based on the assumption that an observer at rest in the ether would determine a different speed from an observer moving through the ether. Because Earth’s speed relative to the Sun is about 29,000 metres per second, or about 0.01 percent of the speed of light, Earth provides a convenient vantage point for measuring any change in the relative speed of light due to motion. Using a Michelson optical interferometer , interference effects between two light beams traveling parallel to, and perpendicular to, Earth’s orbital motion were monitored during the course of its orbit. The instrument was capable of detecting a difference in light speeds along the two paths of the interferometer as small as 5,000 metres per second (less than 2 parts in 100,000 of the speed of light). No difference was found. If Earth indeed moved through the ether, that motion seemed to have no effect on the measured speed of light.",
  "What is now known as the most famous experimental null result in physics was reconciled in 1905 when Albert Einstein , in his formulation of special relativity , postulated that the speed of light is the same in all reference frames ; i.e., the measured speed of light is independent of the relative motion of the observer and the light source. The hypothetical ether, with its preferred reference frame, was eventually abandoned as an unnecessary construct.",
  "Since Einstein’s work, the speed of light is considered a fundamental constant of nature. Its significance is far broader than its role in describing a property of electromagnetic waves. It serves as the single limiting velocity in the universe, being an upper bound to the propagation speed of signals and to the speeds of all material particles. In the famous relativity equation, E = m  c  2 , the speed of light ( c ) serves as a constant of proportionality linking the formerly disparate concepts of mass ( m ) and energy ( E ).",
  "Measurements of the speed of light were successively refined in the 20th century, eventually reaching a precision limited by the definitions of the units of length and time—the metre and the second. In 1983 the 17th General Conference on Weights and Measures fixed the speed of light as a defined constant at exactly 299,792,458 metres per second. The metre became a derived unit, equaling the distance traveled by light in 1/299,792,458 of a second ( see  International System of Units ).",
  "Waves come in two varieties. In a longitudinal wave the oscillating disturbance is parallel to the direction of propagation. A familiar example is a sound wave in air—the oscillating motions of the air molecules are induced in the direction of the advancing wave. Transverse waves consist of disturbances that are at right angles to the direction of propagation; for example, as a wave travels horizontally through a body of water, its surface bobs up and down.",
  "  A number of puzzling optical effects, first observed in the mid-17th century, were resolved when light was understood as a wave phenomenon and the directions of its oscillations were uncovered. The first so-called polarization effect was discovered by the Danish physician Erasmus Bartholin in 1669. Bartholin observed double refraction , or birefringence, in calcite (a common crystalline form of calcium carbonate). When light passes through calcite, the crystal splits the light, producing two images offset from each other. Newton was aware of this effect and speculated that perhaps his corpuscles of light had an asymmetry or “sidedness” that could explain the formation of the two images. Huygens, a contemporary of Newton, could account for double refraction with his elementary wave theory, but he did not recognize the true implications of the effect. Double refraction remained a mystery until Thomas Young , and independently the French physicist Augustin-Jean Fresnel , suggested that light waves are transverse. This simple notion provided a natural and uncomplicated framework for the analysis of polarization effects. (The polarization of the entering light wave can be described as a combination of two perpendicular polarizations, each with its own wave speed. Because of their different wave speeds, the two polarization components have different indices of refraction, and they therefore refract differently through the material, producing two images.) Fresnel quickly developed a comprehensive model of transverse light waves that accounted for double refraction and a host of other optical effects. Forty years later, Maxwell’s electromagnetic theory elegantly provided the basis for the transverse nature of light.",
  " E H  Maxwell’s electromagnetic waves are transverse, with the electric and magnetic fields oscillating in directions perpendicular to the propagation direction. The fields are also perpendicular to one another, with the electric field direction, magnetic field direction, and propagation direction forming a right-handed coordinate system. For a wave with frequency f and wavelength λ (related by λ f = c ) propagating in the positive x -direction, the fields are described mathematically by   ",
  "The equations show that the electric and magnetic fields are in phase with each other; at any given point in space, they reach their maximum values, E  0 and B  0 , at the same time. The amplitudes of the fields are not independent; Maxwell’s equations show that E  0 = c  B  0 for all electromagnetic waves in a vacuum.",
  "In describing the orientation of the electric and magnetic fields of a light wave, it is common practice to specify only the direction of the electric field; the magnetic field direction then follows from the requirement that the fields are perpendicular to one another, as well as the direction of wave propagation. A linearly polarized wave has the property that the fields oscillate in fixed directions as the wave propagates. Other polarization states are possible. In a circularly polarized light wave, the electric and magnetic field vectors rotate about the propagation direction while maintaining fixed amplitudes. Elliptically polarized light refers to a situation intermediate between the linear and circular polarization states.",
  "The atoms on the surface of a heated filament, which generate light, act independently of one another. Each of their emissions can be approximately modeled as a short “wave train” lasting from about 10 −9 to 10 −8 second. The electromagnetic wave emanating from the filament is a superposition of these wave trains, each having its own polarization direction. The sum of the randomly oriented wave trains results in a wave whose direction of polarization changes rapidly and randomly. Such a wave is said to be unpolarized. All common sources of light, including the Sun, incandescent and fluorescent lights , and flames, produce unpolarized light. However, natural light is often partially polarized because of multiple scatterings and reflections.",
  "  Polarized light can be produced in circumstances where a spatial orientation is defined. One example is synchrotron radiation , where highly energetic charged particles move in a magnetic field and emit polarized electromagnetic waves. There are many known astronomical sources of synchrotron radiation, including emission nebulae , supernova remnants , and active galactic nuclei ; the polarization of astronomical light is studied in order to infer the properties of these sources.",
  "  Natural light is polarized in passage through a number of materials, the most common being polaroid . Invented by the American physicist Edwin Land , a sheet of polaroid consists of long-chain hydrocarbon molecules aligned in one direction through a heat-treatment process. The molecules preferentially absorb any light with an electric field parallel to the alignment direction. The light emerging from a polaroid is linearly polarized with its electric field perpendicular to the alignment direction. Polaroid is used in many applications, including sunglasses and camera filters, to remove reflected and scattered light.",
  "In 1808 the French physicist Étienne-Louis Malus discovered that, when natural light reflects off a nonmetallic surface, it is partially polarized. The degree of polarization depends on the angle of incidence and the index of refraction of the reflecting material. At one extreme, when the tangent of the incident angle of light in air equals the index of refraction of the reflecting material, the reflected light is 100 percent linearly polarized; this is known as Brewster’s law (after its discoverer, the Scottish physicist David Brewster ). The direction of polarization is parallel to the reflecting surface. Because daytime glare typically originates from reflections off horizontal surfaces such as roads and water, polarizing filters are often used in sunglasses to remove horizontally polarized light, hence selectively removing glare.",
  "The scattering of unpolarized light by very small objects, with sizes much less than the wavelength of the light (called Rayleigh scattering , after the English scientist Lord Rayleigh ), also produces a partial polarization. When sunlight passes through Earth’s atmosphere, it is scattered by air molecules. The scattered light that reaches the ground is partially linearly polarized, the extent of its polarization depending on the scattering angle. Because human eyes are not sensitive to the polarization of light, this effect generally goes unnoticed. However, the eyes of many insects are responsive to polarization properties, and they use the relative polarization of ambient sky light as a navigational tool. A common camera filter employed to reduce background light in bright sunshine is a simple linear polarizer designed to reject Rayleigh scattered light from the sky.",
  "Polarization effects are observable in optically anisotropic materials (in which the index of refraction varies with polarization direction) such as birefringent crystals and some biological structures and in optically active materials. Technological applications include polarizing microscopes, liquid crystal displays , and optical instrumentation for materials testing.",
  "The transport of energy by light plays a critical role in life. About 10 22  joules of solar radiant energy reaches Earth each day. Perhaps half of that energy reaches Earth’s surface, the rest being absorbed or scattered in the atmosphere. In turn, Earth continuously reradiates electromagnetic energy (predominantly in the infrared). Together, these energy-transport processes determine Earth’s energy balance, setting its average temperature and driving its global weather patterns. The transformation of solar energy into chemical energy by photosynthesis in plants maintains life on Earth. The fossil fuels that power industrial society— natural gas , petroleum , and coal —are ultimately stored organic forms of solar energy deposited on Earth millions of years ago.",
  "The electromagnetic-wave model of light accounts naturally for the origin of energy transport. In an electromagnetic wave, energy is stored in the electric and magnetic fields; as the fields propagate at the speed of light, the energy content is transported. The proper measure of energy transport in an electromagnetic wave is its irradiance, or intensity, which equals the rate at which energy passes a unit area oriented perpendicular to the direction of propagation. The time-averaged irradiance I for a harmonic electromagnetic wave is related to the amplitudes of the electric and magnetic fields: I = ε 0  c  2  E  0  B  0 /2 watts per square metre.",
  "The irradiance of sunlight at the top of Earth’s atmosphere is about 1,350 watts per square metre; this factor is referred to as the solar constant. Considerable efforts have gone into developing technologies to transform this solar energy into directly usable thermal or electric energy.",
  "In addition to carrying energy, light transports momentum and is capable of exerting mechanical forces on objects. When an electromagnetic wave is absorbed by an object, the wave exerts a pressure ( P ) on the object that equals the wave’s irradiance ( I ) divided by the speed of light ( c ): P = I / c newtons per square metre.",
  "Most natural light sources exert negligibly small forces on objects; this subtle effect was first demonstrated in 1903 by the American physicists Ernest Fox Nichols and Gordon Hull. However, radiation pressure is consequential in a number of astronomical settings. Perhaps most important, the equilibrium conditions of stellar structure are determined largely by the opposing forces of gravitational attraction on the one hand and radiation pressure and thermal pressure on the other. The outward force of the light escaping the core of a star, working with thermal pressure, acts to balance the inward gravitational forces on the outer layers of the star. Another, visually dramatic, example of radiation pressure is the formation of cometary tails, in which dust particles released by cometary nuclei are pushed by solar radiation into characteristic trailing patterns.",
  "Terrestrial applications of radiation pressure became feasible with the advent of lasers in the 1960s. In part because of the small diameters of their output beams and the excellent focusing properties of the beams, laser intensities are generally orders of magnitude larger than the intensities of natural light sources. On the largest scale, the most powerful laser systems are designed to compress and heat target materials in nuclear fusion inertial confinement schemes. The radiation forces from table-top laser systems are used to manipulate atoms and microscopic objects. The techniques of laser cooling and trapping, pioneered by the Nobelists Steven Chu , William Phillips , and Claude Cohen-Tannoudji , slow a gas of atoms in an “optical molasses” of intersecting laser beams. Temperatures below 10 −6 K (one-millionth of a degree above absolute zero ) have been achieved. “Optical tweezers” is a related technique in which a tightly focused laser beam exerts a radiation force large enough to deflect, guide, and trap micron-sized objects ranging from dielectric spheres to biological samples such as viruses , single living cells, and organelles within cells.",
  "The transmission of light through a piece of glass, the reflections and refractions of light in a raindrop, and the scattering of sunlight in Earth’s atmosphere are examples of interactions of light with matter. On an atomic scale, these interactions are governed by the quantum mechanical natures of matter and light, but many are adequately explained by the interactions of classical electromagnetic radiation with charged particles.",
  "A detailed presentation of the classical model of an interaction between an electromagnetic wave and an atom can be found in the article electromagnetic radiation . In brief, the electric and magnetic fields of the wave exert forces on the bound electrons of the atom, causing them to oscillate at the frequency of the wave. Oscillating charges are sources of electromagnetic radiation; the oscillating electrons radiate waves at the same frequency as the incoming fields. This constitutes the microscopic origin of the scattering of an electromagnetic wave. The electrons initially absorb energy from the incoming wave as they are set in motion, and they redirect that energy in the form of scattered light of the same frequency.",
  "Through interference effects, the superposition of the reradiated waves from all of the participating atoms determines the net outcome of the scattering interactions. Two examples illustrate this point. As a light beam passes through transparent glass, the reradiated waves within the glass interfere destructively in all directions except the original propagation direction of the beam, resulting in little or no light’s being scattered out of the original beam. Therefore, the light advances without loss through the glass. When sunlight passes through Earth’s upper atmosphere, on the other hand, the reradiated waves generated by the gaseous molecules do not suffer destructive interference, so that a significant amount of light is scattered in many directions. The outcomes of these two scattering interactions are quite different, primarily because of differences in the densities of the scatterers. Generally, when the mean spacing between scatterers is significantly less than the wavelength of the light (as in glass), destructive interference effects significantly limit the amount of lateral scattering; when the mean spacing is greater than, or on the order of, the wavelength and the scatterers are randomly distributed in space (as in the upper atmosphere), interference effects do not play a significant role in the lateral scattering.",
  "Lord Rayleigh’s analysis in 1871 of the scattering of light by atoms and molecules in the atmosphere showed that the intensity of the scattered light increases as the fourth power of its frequency; this strong dependence on frequency explains the colour of the sunlit sky. Being at the high-frequency end of the visible spectrum, blue light is scattered far more by air molecules than the lower-frequency colours; the sky appears blue. On the other hand, when sunlight passes through a long column of air, such as at sunrise or sunset, the high-frequency components are selectively scattered out of the beam and the remaining light appears reddish.",
  "The interactions of light waves with matter become progressively richer as intensities are increased. The field of nonlinear optics describes interactions in which the response of the atomic oscillators is no longer simply proportional to the intensity of the incoming light wave. Nonlinear optics has many significant applications in communications and photonics, information processing , schemes for optical computing and storage, and spectroscopy .",
  "Nonlinear effects generally become observable in a material when the strength of the electric field in the light wave is appreciable in comparison with the electric fields within the atoms of the material. Laser sources, particularly pulsed sources, easily achieve the required light intensities for this regime. Nonlinear effects are characterized by the generation of light with frequencies differing from the frequency of the incoming light beam. Classically, this is understood as resulting from the large driving forces of the electric fields of the incoming wave on the atomic oscillators. As an illustration, consider second harmonic generation, the first nonlinear effect observed in a crystal (1961). When high-intensity light of frequency f passes through an appropriate nonlinear crystal (quartz was used in the first observations), a fraction of that light is converted to light of frequency 2 f . Higher harmonics can also be generated with appropriate media, as well as combinations of frequencies when two or more light beams are used as input.",
  "By the end of the 19th century, the battle over the nature of light as a wave or a collection of particles seemed over. James Clerk Maxwell ’s synthesis of electric, magnetic, and optical phenomena and the discovery by Heinrich Hertz of electromagnetic waves were theoretical and experimental triumphs of the first order. Along with Newtonian mechanics and thermodynamics , Maxwell’s electromagnetism took its place as a foundational element of physics. However, just when everything seemed to be settled, a period of revolutionary change was ushered in at the beginning of the 20th century. A new interpretation of the emission of light by heated objects and new experimental methods that opened the atomic world for study led to a radical departure from the classical theories of Newton and Maxwell— quantum mechanics was born. Once again the question of the nature of light was reopened.",
  " Blackbody radiation refers to the spectrum of light emitted by any heated object; common examples include the heating element of a toaster and the filament of a light bulb. The spectral intensity of blackbody radiation peaks at a frequency that increases with the temperature of the emitting body: room temperature objects (about 300 K) emit radiation with a peak intensity in the far infrared ; radiation from toaster filaments and light bulb filaments (about 700 K and 2,000 K, respectively) also peak in the infrared, though their spectra extend progressively into the visible; while the 6,000 K surface of the Sun emits blackbody radiation that peaks in the centre of the visible range. In the late 1890s, calculations of the spectrum of blackbody radiation based on classical electromagnetic theory and thermodynamics could not duplicate the results of careful measurements. In fact, the calculations predicted the absurd result that, at any temperature, the spectral intensity increases without limit as a function of frequency.",
  "In 1900 the German physicist Max Planck succeeded in calculating a blackbody spectrum that matched experimental results by proposing that the elementary oscillators at the surface of any object (the detailed structure of the oscillators was not relevant) could emit and absorb electromagnetic radiation only in discrete packets, with the energy of a packet being directly proportional to the frequency of the radiation, E = h  f . The constant of proportionality, h , which Planck determined by comparing his theoretical results with the existing experimental data, is now called Planck’s constant and has the approximate value 6.626 × 10 −34 joule∙second.",
  "Planck did not offer a physical basis for his proposal; it was largely a mathematical construct needed to match the calculated blackbody spectrum to the observed spectrum. In 1905 Albert Einstein gave a ground-breaking physical interpretation to Planck’s mathematics when he proposed that electromagnetic radiation itself is granular, consisting of quanta, each with an energy h  f . He based his conclusion on thermodynamic arguments applied to a radiation field that obeys Planck’s radiation law . The term photon , which is now applied to the energy quantum of light, was later coined by the American chemist Gilbert N. Lewis .",
  "Einstein supported his photon hypothesis with an analysis of the photoelectric effect , a process, discovered by Hertz in 1887, in which electrons are ejected from a metallic surface illuminated by light. Detailed measurements showed that the onset of the effect is determined solely by the frequency of the light and the makeup of the surface and is independent of the light intensity. This behaviour was puzzling in the context of classical electromagnetic waves, whose energies are proportional to intensity and independent of frequency. Einstein supposed that a minimum amount of energy is required to liberate an electron from a surface—only photons with energies greater than this minimum can induce electron emission. This requires a minimum light frequency, in agreement with experiment. Einstein’s prediction of the dependence of the kinetic energy of the ejected electrons on the light frequency, based on his photon model, was experimentally verified by the American physicist Robert Millikan in 1916.",
  "In 1922 American Nobelist Arthur Compton treated the scattering of X-rays from electrons as a set of collisions between photons and electrons. Adapting the relation between momentum and energy for a classical electromagnetic wave to an individual photon, p = E / c = h  f / c = h /λ, Compton used the conservation laws of momentum and energy to derive an expression for the wavelength shift of scattered X-rays as a function of their scattering angle. His formula matched his experimental findings, and the Compton effect , as it became known, was considered further convincing evidence for the existence of particles of electromagnetic radiation.",
  "The energy of a photon of visible light is very small, being on the order of 4 × 10 −19  joule . A more convenient energy unit in this regime is the electron volt (eV). One electron volt equals the energy gained by an electron when its electric potential is changed by one volt : 1 eV = 1.6 × 10 −19 joule. The spectrum of visible light includes photons with energies ranging from about 1.8 eV (red light) to about 3.1 eV (violet light). Human vision cannot detect individual photons, although, at the peak of its spectral response (about 510 nm, in the green), the dark-adapted eye comes close. Under normal daylight conditions, the discrete nature of the light entering the human eye is completely obscured by the very large number of photons involved. For example, a standard 100-watt light bulb emits on the order of 10 20 photons per second; at a distance of 10 metres from the bulb, perhaps 10 11 photons per second will enter a normally adjusted pupil of a diameter of 2 mm.",
  "Photons of visible light are energetic enough to initiate some critically important chemical reactions, most notably photosynthesis through absorption by chlorophyll molecules. Photovoltaic systems are engineered to convert light energy to electric energy through the absorption of visible photons by semiconductor materials . More-energetic ultraviolet photons (4 to 10 eV) can initiate photochemical reactions such as molecular dissociation and atomic and molecular ionization. Modern methods for detecting light are based on the response of materials to individual photons. Photoemissive detectors, such as photomultiplier tubes , collect electrons emitted by the photoelectric effect ; in photoconductive detectors the absorption of a photon causes a change in the conductivity of a semiconductor material.",
  "A number of subtle influences of gravity on light, predicted by Einstein’s general theory of relativity , are most easily understood in the context of a photon model of light and are presented here. (However, note that general relativity is not itself a theory of quantum physics.)",
  "Through the famous relativity equation  E = m  c  2  , a photon of frequency f and energy E = h  f can be considered to have an effective mass of m = h  f / c  2 . Note that this effective mass is distinct from the “rest mass” of a photon, which is zero. General relativity predicts that the path of light is deflected in the gravitational field of a massive object; this can be somewhat simplistically understood as resulting from a gravitational attraction proportional to the effective mass of the photons. In addition, when light travels toward a massive object, its energy increases, and its frequency thus increases (gravitational blueshift). Gravitational redshift describes the converse situation where light traveling away from a massive object loses energy and its frequency decreases.",
  "The first two decades of the 20th century left the status of the nature of light confused. That light is a wave phenomenon was indisputable: there were countless examples of interference effects—the signature of waves—and a well-developed electromagnetic wave theory. However, there was also undeniable evidence that light consists of a collection of particles with well-defined energies and momenta. This paradoxical wave-particle duality was soon seen to be shared by all elements of the material world.",
  "In 1923 the French physicist Louis de Broglie suggested that wave-particle duality is a feature common to light and all matter. In direct analogy to photons, de Broglie proposed that electrons with momentum p should exhibit wave properties with an associated wavelength λ = h / p . Four years later, de Broglie’s hypothesis of matter waves, or de Broglie waves , was experimentally confirmed by Clinton Davisson and Lester Germer at Bell Laboratories with their observation of electron diffraction effects.",
  "A radically new mathematical framework for describing the microscopic world, incorporating de Broglie’s hypothesis, was formulated in 1926–27 by the German physicist Werner Heisenberg and the Austrian physicist Erwin Schrödinger , among others. In quantum mechanics, the dominant theory of 20th-century physics, the Newtonian notion of a classical particle with a well-defined trajectory is replaced by the wave function , a nonlocalized function of space and time. The interpretation of the wave function, originally suggested by the German physicist Max Born , is statistical—the wave function provides the means for calculating the probability of finding a particle at any point in space. When a measurement is made to detect a particle, it always appears as pointlike, and its position immediately after the measurement is well defined. But before a measurement is made, or between successive measurements, the particle’s position is not well defined; instead, the state of the particle is specified by its evolving wave function.",
  "The quantum mechanics embodied in the 1926–27 formulation is nonrelativistic—that is, it applies only to particles whose speeds are significantly less than the speed of light. The quantum mechanical description of light was not fully realized until the late 1940s ( see below  Quantum electrodynamics ). However, light and matter share a common central feature—a complementary relation between wave and particle aspects—that can be illustrated without resorting to the formalisms of relativistic quantum mechanics.",
  "The same interference pattern demonstrated in Young’s double-slit experiment is produced when a beam of matter, such as electrons , impinges on a double-slit apparatus. Concentrating on light, the interference pattern clearly demonstrates its wave properties. But what of its particle properties? Can an individual photon be followed through the two-slit apparatus, and if so, what is the origin of the resulting interference pattern? The superposition of two waves, one passing through each slit, produces the pattern in Young’s apparatus. Yet, if light is considered a collection of particle-like photons, each can pass only through one slit or the other. Soon after Einstein’s photon hypothesis in 1905, it was suggested that the two-slit interference pattern might be caused by the interaction of photons that passed through different slits. This interpretation was ruled out in 1909 when the English physicist Geoffrey Taylor reported a diffraction pattern in the shadow of a needle recorded on a photographic plate exposed to a very weak light source, weak enough that only one photon could be present in the apparatus at any one time. Photons were not interfering with one another; each photon was contributing to the diffraction pattern on its own.",
  "In modern versions of this two-slit interference experiment, the photographic plate is replaced with a detector that is capable of recording the arrival of individual photons. Each photon arrives whole and intact at one point on the detector. It is impossible to predict the arrival position of any one photon, but the cumulative effect of many independent photon impacts on the detector results in the gradual buildup of an interference pattern. The magnitude of the classical interference pattern at any one point is therefore a measure of the probability of any one photon’s arriving at that point. The interpretation of this seemingly paradoxical behaviour (shared by light and matter), which is in fact predicted by the laws of quantum mechanics, has been debated by the scientific community since its discovery more than 100 years ago. The American physicist Richard Feynman summarized the situation in 1965:",
  "We choose to examine a phenomenon which is impossible, absolutely impossible, to explain in any classical way, and which has in it the heart of quantum mechanics. In reality, it contains the only mystery.",
  "In a wholly unexpected fashion, quantum mechanics resolved the long wave-particle debate over the nature of light by rejecting both models. The behaviour of light cannot be fully accounted for by a classical wave model or by a classical particle model. These pictures are useful in their respective regimes, but ultimately they are approximate, complementary descriptions of an underlying reality that is described quantum mechanically.",
  "Quantum optics, the study and application of the quantum interactions of light with matter, is an active and expanding field of experiment and theory. Progress in the development of light sources and detection techniques since the early 1980s has allowed increasingly sophisticated optical tests of the foundations of quantum mechanics. Basic quantum effects such as single photon interference, along with more esoteric issues such as the meaning of the measurement process, have been more clearly elucidated. Entangled states of two or more photons with highly correlated properties (such as polarization direction) have been generated and used to test the fundamental issue of nonlocality in quantum mechanics ( see  quantum mechanics: Paradox of Einstein, Podolsky, and Rosen ). Novel technological applications of quantum optics are also under study, including quantum cryptography and quantum computing .",
  "  That materials, when heated in flames or put in electrical discharges, emit light at well-defined and characteristic frequencies was known by the mid-19th century. The study of the emission and absorption spectra of atoms was crucial to the development of a successful theory of atomic structure. Attempts to describe the origin of the emission and absorption lines (i.e., the frequencies of emission and absorption) of even the simplest atom, hydrogen , in the framework of classical mechanics and electromagnetism failed miserably. Then, in 1913, Danish physicist Niels Bohr proposed a model for the hydrogen atom that succeeded in explaining the regularities of its spectrum. In what is known as the Bohr atomic model , the orbiting electrons in an atom are found in only certain allowed “stationary states” with well-defined energies. An atom can absorb or emit one photon when an electron makes a transition from one stationary state, or energy level, to another. Conservation of energy determines the energy of the photon and thus the frequency of the emitted or absorbed light. Though Bohr’s model was superseded by quantum mechanics, it still offers a useful, though simplistic, picture of atomic transitions.",
  "When an isolated atom is excited into a high-energy state, it generally remains in the excited state for a short time before emitting a photon and making a transition to a lower energy state. This fundamental process is called spontaneous emission. The emission of a photon is a probabilistic event; that is, the likelihood of its occurrence is described by a probability per unit time. For many excited states of atoms, the average time before the spontaneous emission of a photon is on the order of 10 −9 to 10 −8 second.",
  "The absorption of a photon by an atom is also a probabilistic event, with the probability per unit time being proportional to the intensity of the light falling on the atom. In 1917 Einstein, though not knowing the exact mechanisms for the emission and absorption of photons, showed through thermodynamic arguments that there must be a third type of radiative transition in an atom—stimulated emission. In stimulated emission the presence of photons with an appropriate energy triggers an atom in an excited state to emit a photon of identical energy and to make a transition to a lower state. As with absorption, the probability of stimulated emission is proportional to the intensity of the light bathing the atom. Einstein mathematically expressed the statistical nature of the three possible radiative transition routes (spontaneous emission, stimulated emission, and absorption) with the so-called Einstein coefficients and quantified the relations between the three processes. One of the early successes of quantum mechanics was the correct prediction of the numerical values of the Einstein coefficients for the hydrogen atom.",
  "Einstein’s description of the stimulated emission process showed that the emitted photon is identical in every respect to the stimulating photons, having the same energy and polarization, traveling in the same direction, and being in phase with those photons. Some 40 years after Einstein’s work, the laser was invented, a device that is directly based on the stimulated emission process. (The acronym laser stands for “light amplification by stimulated emission of radiation.”) Laser light, because of the underlying properties of stimulated emission, is highly monochromatic, directional, and coherent. Many modern spectroscopic techniques for probing atomic and molecular structure and dynamics, as well as innumerable technological applications, take advantage of these properties of laser light.",
  "The foundations of a quantum mechanical theory of light and its interactions with matter were developed in the late 1920s and ’30s by Paul Dirac , Werner Heisenberg , Pascual Jordan , Wolfgang Pauli , and others. The fully developed theory, called quantum electrodynamics (QED), is credited to the independent work of Richard Feynman , Julian S. Schwinger , and Tomonaga Shin’ichirō . QED describes the interactions of electromagnetic radiation with charged particles and the interactions of charged particles with one another. The electric and magnetic fields described in Maxwell’s equations are quantized, and photons appear as excitations of those quantized fields. In QED, photons serve as carriers of electric and magnetic forces. For example, two identical charged particles electrically repel one another because they are exchanging what are called virtual photons. (Virtual photons cannot be directly detected; their existence violates the conservation laws of energy and momentum.) Photons can also be freely emitted by charged particles, in which case they are detectable as light. Though the mathematical complexities of QED are formidable, it is a highly successful theory that has now withstood decades of precise experimental tests. It is considered the prototype field theory in physics; great efforts have gone into adapting its core concepts and calculational approaches to the description of other fundamental forces in nature ( see  unified field theory ).",
  "QED provides a theoretical framework for processes involving the transformations of matter into photons and photons into matter. In pair creation, a photon interacting with an atomic nucleus (to conserve momentum) disappears, and its energy is converted into an electron and a positron (a particle-antiparticle pair). In pair annihilation, an electron-positron pair disappears, and two high-energy photons are created. These processes are of central importance in cosmology—once again demonstrating that light is a primary component of the physical universe.",
  "Excellent general science books on the nature of light and special visual effects include David K. Lynch and William Livingston , Color and Light in Nature , 2nd ed. (2001); and David Greenler , Rainbows, Haloes, and Glories (1980). Three excellent histories of the study of light and its role in human experience are David Park , The Fire Within the Eye (1997); Sidney Perkowitz , Empire of Light: A History of Discovery in Science and Art (1998); and Arthur Zajonc , Catching the Light (1995).",
  "Textbooks aimed at nonscience majors and requiring minimal mathematics are Thomas Rossing and Christopher Chiaverina , Light Science: Physics and the Visual Arts (1999); Gary Waldman , Introduction to Light: The Physics of Light, Vision, and Color (1983); and David Falk , Dieter Brill , and David Stork , Seeing the Light (1986). Edmund Whittaker , A History of the Theories of Aether & Electricity , rev. and enlarged ed., 2 vol. (1951–53, reissued in 1 vol., 1989), is a detailed presentation of the development of electromagnetic theory in the 19th century. Technical presentations of the science of optics can be found in the comprehensive treatise by Eugene Hecht , Optics , 4th ed. (2001). Introductions to the quantum mechanical nature of light include Richard Feynman , QED: The Strange Theory of Light and Matter (1986); and Bruce Wheaton , The Tiger and the Shark: Empirical Roots of Wave-Particle Dualism (1983)."
]