[
  " illusion , a misrepresentation of a “real” sensory stimulus—that is, an interpretation that contradicts objective “reality” as defined by general agreement. For example, a child who perceives tree branches at night as if they are goblins may be said to be having an illusion. An illusion is distinguished from a hallucination , an experience that seems to originate without an external source of stimulation. Neither experience is necessarily a sign of psychiatric disturbance, and both are regularly and consistently reported by virtually everyone.",
  "Illusions are special perceptual experiences in which information arising from “real” external stimuli leads to an incorrect perception, or false impression, of the object or event from which the stimulation comes.",
  "Some of these false impressions may arise from factors beyond an individual’s control (such as the characteristic behaviour of light waves that makes a pencil in a glass of water seem bent), from inadequate information (as under conditions of poor illumination), or from the functional and structural characteristics of the sensory apparatus (e.g., distortions in the shape of the lens in the eye). Such visual illusions are experienced by every sighted person.",
  "Another group of illusions results from misinterpretations one makes of seemingly adequate sensory cues. In such illusions, sensory impressions seem to contradict the “facts of reality” or fail to report their “true” character. (For more-profound philosophical considerations, see  epistemology .) In these instances the perceiver seems to be making an error in processing sensory information. The error appears to arise within the central nervous system (brain and spinal cord); this may result from competing sensory information, psychologically meaningful distorting influences, or previous expectations (mental set). Drivers who see their own headlights reflected in the window of a store, for example, may experience the illusion that another vehicle is coming toward them even though they know there is no road there. ( See also  concept formation .)",
  "This type of illusory sense perception arises when the environment changes or warps the stimulus energy on the way to the person, who perceives it in its distorted pattern (as in the case of the “bent” pencil referred to above).",
  "A common phenomenon is the auditory impression that a blowing automobile horn changes its pitch as it passes an observer on a highway. This is known as the Doppler effect , for Christian Doppler , an Austrian physicist, who in 1842 noted that the pitch of a bell or whistle on a passing railroad train is heard to drop when the train and the perceiver are moving away from each other and to grow higher when they are approaching each other. The sound heard is also affected by factors such as a wind blowing toward or away from the person.",
  "Another auditory illusion was described in 1928 by Paul Thomas Young, an American psychologist, who tested the process of sound localization (the direction from which sound seems to come). He constructed a pseudophone, an instrument made of two ear trumpets, one leading from the right side of the head to the left ear and the other vice versa. This created the illusory impression of reversed localization of sound. While walking along the street wearing the pseudophone, he would hear footsteps to his right when they actually came from the left.",
  "When two sources of sound in the same vicinity emit sound waves of slightly different frequencies (i.e., vibrations per second), there will come intervals when waves from both sources arrive at the ear in phase (simultaneously) and produce the experience of a combined, louder sound. These intervals of combined sound will be perceived as “beats,” or periodic alternations of sound intensity. When such auditory beats occur too rapidly to be discriminated, a harsh, continuous noise, commonly called interference , may result. Another case of interference results when two tones sounded together produce a subjectively heard third tone. When this third tone is lower in pitch than the original two, it is called a difference tone; i.e., its frequency is the difference between the frequencies of the two original tones. When the third tone is higher, it is called a summation tone; i.e., its frequency is the sum of the frequencies of the two original tones. Piano tuners depend in part upon their ability to hear these tones in a reliable way when tightening and loosening the strings in order to reach the correct pitch on the instrument.",
  "  Numerous optical illusions are produced by the refraction (bending) of light as it passes through one substance to another in which the speed of light is significantly different. A ray of light passing from one transparent medium (air) to another (water) is bent as it emerges. Thus, the pencil standing in water seems broken at the surface where the air and water meet; in the same way, a partially submerged log in the water of a swamp gives the illusion of being bent.",
  "   Rainbows also result from refraction. As the sun’s rays pass through rain, the droplets separate (refract) the white light into its component colours. As rays of white light from any source pass through a prism , they are refracted to give the appearance of a spectrum of colour, as in the rainbow of a summer morning. Another illusion that depends on atmospheric conditions is a mirage , in which, for example, the vision of a pool of water is created by light passing through layers of air above the heated surface of a highway. In effect, cooler layers of air refract the sun’s rays at different angles than do less-dense strata of heated air, giving the appearance of water where there is none; nearby objects may even appear to be reflected in it. Under certain conditions, elaborate mirages that look like cities, forests, or “unidentified flying objects” may appear on the horizon, or ships in a nearby body of water may appear to be plying the sky of a desert.",
  "Some illusions are related to characteristics of the perceiver, namely the functioning of the brain and the senses, rather than to physical phenomena that distort a stimulus. Many common visual illusions are perceptual: they result from the brain’s processing of ambiguous or unusual visual information. Other illusions result from the aftereffects of sensory stimulation or from conflicting sensory information. Still others are associated with psychiatric causes.",
  "When an observer is confronted with a visual assortment of dots, the brain may group the dots that “belong together.” These groupings are made on the basis of such things as observed similarity (e.g., red versus black dots), proximity, common direction of movement, perceptual set (the way one is expecting to see things grouped), and extrapolation (one’s estimate of what will happen based on an extension of what is now happening).",
  "Closure (a term used in Gestalt psychology ) is the illusion of seeing an incomplete stimulus as though it were whole. Thus, one unconsciously tends to complete (close) a triangle or a square that has a gap in one of its sides. While a person watches a movie, closure occurs to fill the intervals between what are really rapidly projected still pictures—giving the illusion of uninterrupted motion.",
  "  The “figure-ground” illusion is commonly experienced when one gazes at the illustration of a white vase, the outline of which is created by two black profiles. At any moment, one will be able to see either the white vase (in the centre area) as “figure” or the black profiles on each side (in which case the white is seen as “ground”). The fluctuations of figure and ground may occur even without conscious effort. Seeing one aspect usually excludes seeing the other.",
  " Examples of optical illusions.  Another example of ambiguity and object reversibility is the Necker cube, which may seem to flip-flop. Some studies have suggested that younger people tend to perceive these reversals more readily than do their elders.",
  "The Müller-Lyer illusion is based on the Gestalt principles of convergence and divergence: the lines at the sides seem to lead the eye either inward or outward to create a false impression of length. The Poggendorff illusion depends on the steepness of the intersecting lines. As obliqueness is decreased, the illusion becomes less compelling. In the Zöllner illusion, the cross-hatching disturbs the perception of parallel lines. A figure seen touching converging lines, as in the Ponzo illusion, seems larger than another figure of the same size placed between the lines where they are farther apart. In a related experience, linear perspective creates the illusion that parallel lines or contours (such as railroad tracks) converge as they recede from the viewer.",
  "In studies of visual verticality, experimenters investigated the conditions that determine perception of the “upright.” A tilted chair that could be mechanically controlled by the subject was placed in a slanted room containing visual indicators of verticals and horizontals. When various persons were asked to sit in the chair and align themselves in a vertical position, some of the subjects aligned themselves with the “true vertical” determined by gravity, while others experienced the illusion of verticality by aligning themselves with the visual directions they saw in the slanted room. Closing the eyes made “true” alignment easier.",
  "Staring at a single bright spot in an otherwise darkened room creates the illusion that the stationary light is moving (autokinetic effect). One theory to account for this is that the impression is caused by minute eye movements of the observer. The so-called phi phenomenon is an illusion of movement that arises when stationary objects—light bulbs, for example—are placed side by side and illuminated rapidly one after another. The effect is frequently used on theatre marquees to give the impression of moving lights.",
  "Perhaps the best real-life example of a perceptual illusion is the Moon illusion. When the Moon is at the horizon, it appears to be much larger than it does when it is high in the sky. Yet when the Moon is photographed at various points across the sky, all the images on the negatives are the same size. Considerable debate surrounds the source of the Moon illusion. Some explanations have attributed it to the paradoxical idea that the Moon at the horizon seems larger because the brain perceives it as being farther away than the Moon at the sky’s zenith. Another explanation is that the lack of distance cues in the night sky causes the eyes to adjust to a near-focus position, which makes the high Moon appear smaller.",
  "Many sensory illusions may be described as the aftereffects of the stimulation, or overstimulation, of the senses. Sensitivity in any of the senses may be measured as the just-perceptible intensity (threshold, or limen) of the appropriate stimulus. The smallest detectable stimulus is called the absolute threshold, while the smallest detectable change in the intensity of a stimulus is called the difference threshold. Such thresholds can serve as points of reference, or anchors, against which subsequent stimuli are judged or perceived. Yet sensory anchors fluctuate within the same individual under different conditions, and in some cases they can mislead a person about the properties of subsequent stimuli. For example, two successive stimuli may be identical but nevertheless give the illusion of being different.",
  "This illusion may be explained in part by a “fading trace” theory, proposed by Gestalt psychologists. The theory suggests that a physical trace (in the form of temporarily excited nerve cells) of an original stimulus remains in the brain even after that stimulus stops and that this trace influences the estimate or appreciation of a subsequent stimulus.",
  "The strength of the trace, also called an aftereffect, and the speed of its disappearance vary greatly in individual cases. People who are field dependent (that is, who tend to observe a field in its totality) are said to show weaker aftereffect traces. Conversely, field-independent subjects (those who, by selective attention , are more likely to consider a specific stimulus apart from its context) show stronger aftereffects.",
  "The normal human eye can detect about 130 gradations of colour in the visible spectrum (as in the rainbow), about 20 barely noticeable differences within a given colour, and about 500 variations of brightness. However, when two spots of equally bright light are observed in close succession, the first intensity may seem brighter. The first light may be said to serve the function of brightness adaptation (or adjustment) in the eye; therefore, the second light will fall on a partly adapted and therefore less sensitive retina. In a brief time, such excitement in the retina (or even in the brain) tends to subside, or fade. As a result of the fading traces of excitement, various hues of a given colour may appear to be lighter or darker when looked at successively.",
  "Contrast-colour phenomena also may result from such fading traces. A successive contrast occurs when, after one has stared at a red surface, a green surface looks much brighter. As one enters a dark room from bright sunshine, the room at first seems quite dark by contrast. A simultaneous contrast occurs when an area of brightness is seen against a less intense or a more intense background. If a gray patch of paper is placed on a black background, it looks whiter than it did before; if placed on a white background, it looks darker.",
  "The felt perception of differences in weights received experimental attention in 1899, when experiments indicated that a second weight feels either heavier or lighter than an immediately preceding identical weight. This illusion results partially from the expectancy of the person doing the lifting. Having lifted the first weight, the subject is “set” for a certain effort on the next try. If the second weight is lifted quickly and easily, it will feel lighter than the first; if it comes up more slowly, it will feel heavier. Expectancy, or set, is also often invoked in efforts to explain the size-weight illusion, in which a large cardboard box feels lighter than a smaller box even though both weigh the same.",
  "Smell (olfactory) discrimination is influenced by any odour to which the olfactory structures already have adapted. Receptors in the nose, however, adapt quickly and cease to respond to a particular stimulus. This effect is called olfactory fatigue. Thus, an odour that is strong at first will gradually become imperceptible, as happens when one becomes unaware of the smell of one’s own body. There also may be present the phenomenon of masking; this is a decrease in sensitivity to one odour after exposure to another (for example, a strong-smelling disinfectant).",
  "The human ear typically serves to distinguish between about 1,500 levels of pitch. For loudness, differential-threshold studies reveal about 325 separately perceived levels in the region of greatest auditory sensitivity (about 1,000 to 4,000 cycles per second). For humans, the number of discriminable tones is in the hundred thousands. Yet when two sounds are heard in close succession, the intensity or loudness of the second is judged by comparing it with the first. Thus, a murmur may sound loud when compared to a whisper, or a “deafening” noise may make all other sounds inaudible. The steady hum of an electric fan may help to diffuse the noises of traffic outside and thus improve the discrimination of sounds in the room.",
  "The skin contains numerous “spots” that respond selectively either to cold or to warmth but generally not to both. It can happen, however, that a very warm stimulus will produce a sensation of cold when placed on a spot that responds to cold. Thus, when a warm stimulus is perceived as cold, the illusion is called paradoxical cold.",
  "Paradoxical heat, a less frequent experience, results from stimulating warm and cold spots simultaneously. It appears to be a fusion of warm and paradoxical cold effects, producing a strange, somewhat unpleasant sensation of “heat” that seems to be attended by uneasiness resembling that of pain. The sensation is sometimes called psychological heat.",
  "Sudden temperature contrasts can play tricks on the tactile sense. If hot water is run over one hand and cold water over the other long enough for both to adjust to the temperatures and then both hands are plunged into lukewarm water, the cold hand will feel warm and the hot, cold. It would seem that, in plunging the cold-adapted hand, nerve cells for perceiving cold are suddenly inhibited and those for perceiving heat are suddenly stimulated, while in the heat-adapted hand the reverse takes place.",
  "Normally, the senses combine to produce a kind of common, unitary, or integrated perceptual experience. In dining, for example, the visual array on the table, the conversational tones or background music, and the tactile sensations, aromas, and taste of the food all combine to enhance the gustatory experience, with each sense contributing to it. Physiologically, taste and smell appear to be particularly subject to intersensory effects (interdependent). In other situations, seeing, hearing, touching, and often smelling and tasting are all employed in an intersensory way in object identification or location. Sometimes, however, the stimulation of one sense may activate an illusory sensation that is normally perceived by another sense, or a strong sensation may mask the perceptions of other senses.",
  " Synesthesia is a “crossing” of the senses. For example, “colour-hearing,” in which people say that specific sounds evoke in them the actual experience of certain colours, is relatively frequent. Some musicians and others report that they see particular colours whenever they hear given tones and musical passages; poets sometimes claim to hear sounds or musical tones when they see words, images, and colours. Synesthesia may be induced with drugs, and, in rare psychiatric disorders, sufferers may not be able to tell whether they are seeing or hearing.",
  "Stimulation through one sense may enhance the function of another. Seeing a boat rocked by waves may activate the sense of balance in an observer on a pier to the point at which it causes seasickness. A painting of an Arctic scene of frost and snow may evoke the sensation of cold or a shiver that produces gooseflesh. An explosion or gunshots may give a bystander the illusion of being struck. A picture of appetizing food may evoke sensations of taste and smell.",
  "Sensory rivalry, in which one stimulus inhibits the perception of another, may result from a conflict of cues if sensory information is ambiguous or discrepant, as in the tilted-room experiment discussed above, during which the visual sense conflicts with cues from the sense of equilibrium. States of pain, panic, monotony, or fatigue may create conditions in which various senses mask or inhibit each other. A witness of a terrifying sight, for example, may become oblivious to all sounds. Distraction also can elevate the pain threshold, as in the case of wounded soldiers whose injuries become painful only after the stress of combat has subsided. Similarly, some dentists have used auditory analgesia (a masking of pain by sound).",
  "Illusions called pseudohallucinations occur at times when feelings of anxiety or fear are projected on external objects, as when a child perceives threatening faces or monsters in shadows at night or sees goblins in trees. A soldier tense with apprehension may in his fear perceive inanimate objects as an attacking enemy or one of his own comrades as the foe. In literature the character Don Quixote perceived windmills as enemy knights. Psychiatric patients have perceived people as machines, teddy bears, and devils.",
  "The déjà vu phenomenon is a feeling that a past episode is repeating itself in the present; what occurs is a fusion of past and present to create an illusion that one is reliving an experience and therefore knows its outcome. It could be called a “hallucination” of familiarity; some theorists interpret the experience as being based on reactivation of old memory traces by stimuli resembling those experienced in the past—in the way that a pressed rose discovered in a long-forgotten dance program, for example, may trigger a flood of old memories ( see also  memory ).",
  "Emotions, compelling associations, and strong expectations frequently cause illusional misperceptions in everyday life. Hostile listeners may hear someone say “wire” and think they are being called a “liar”; self-conscious obese people may misinterpret the word “fate” as “weight.” There is also the mistaken identification of people. John may think Tom is Gary because he is hoping to see Gary or because he definitely wants to avoid Tom.",
  "Works on the psychology of illusion include R.L. Gregory , Eye and Brain , 5th ed. (1997), an entertaining account of how we see and are sometimes deceived by appearances; Jacques Ninio , The Science of Illusions , trans. by Franklin Philip (2001), a popular look at illusion; and Samuel Tolansky , Optical Illusions (1964), which illustrates most of the known visual illusions."
]