[
  "  biology , study of living things and their vital processes. The field deals with all the physicochemical aspects of life . The modern tendency toward cross-disciplinary research and the unification of scientific knowledge and investigation from different fields has resulted in significant overlap of the field of biology with other scientific disciplines. Modern principles of other fields— chemistry , medicine , and physics , for example—are integrated with those of biology in areas such as biochemistry , biomedicine, and biophysics .",
  "Biology is subdivided into separate branches for convenience of study, though all the subdivisions are interrelated by basic principles. Thus, while it is custom to separate the study of plants ( botany ) from that of animals ( zoology ), and the study of the structure of organisms ( morphology ) from that of function ( physiology ), all living things share in common certain biological phenomena—for example, various means of reproduction , cell division , and the transmission of genetic material.",
  "Biology is often approached on the basis of levels that deal with fundamental units of life. At the level of molecular biology , for example, life is regarded as a manifestation of chemical and energy transformations that occur among the many chemical constituents that compose an organism. As a result of the development of increasingly powerful and precise laboratory instruments and techniques, it is possible to understand and define with high precision and accuracy not only the ultimate physiochemical organization (ultrastructure) of the molecules in living matter but also the way living matter reproduces at the molecular level. Especially crucial to those advances was the rise of genomics in the late 20th and early 21st centuries.",
  "Cell biology is the study of cells—the fundamental units of structure and function in living organisms. Cells were first observed in the 17th century, when the compound microscope was invented. Before that time, the individual organism was studied as a whole in a field known as organismic biology; that area of research remains an important component of the biological sciences. Population biology deals with groups or populations of organisms that inhabit a given area or region. Included at that level are studies of the roles that specific kinds of plants and animals play in the complex and self-perpetuating interrelationships that exist between the living and the nonliving world, as well as studies of the built-in controls that maintain those relationships naturally. Those broadly based levels— molecules , cells, whole organisms, and populations—may be further subdivided for study, giving rise to specializations such as morphology , taxonomy , biophysics, biochemistry, genetics , epigenetics , and ecology . A field of biology may be especially concerned with the investigation of one kind of living thing—for example, the study of birds in ornithology , the study of fishes in ichthyology , or the study of microorganisms in microbiology .",
  "The concept of homeostasis —that living things maintain a constant internal environment—was first suggested in the 19th century by French physiologist Claude Bernard , who stated that “all the vital mechanisms, varied as they are, have only one object: that of preserving constant the conditions of life.”",
  "As originally conceived by Bernard, homeostasis applied to the struggle of a single organism to survive. The concept was later extended to include any biological system from the cell to the entire biosphere , all the areas of Earth inhabited by living things.",
  "  All living organisms, regardless of their uniqueness, have certain biological, chemical, and physical characteristics in common. All, for example, are composed of basic units known as cells and of the same chemical substances, which, when analyzed, exhibit noteworthy similarities, even in such disparate organisms as bacteria and humans . Furthermore, since the action of any organism is determined by the manner in which its cells interact and since all cells interact in much the same way, the basic functioning of all organisms is also similar.",
  "There is not only unity of basic living substance and functioning but also unity of origin of all living things. According to a theory proposed in 1855 by German pathologist Rudolf Virchow , “all living cells arise from pre-existing living cells.” That theory appears to be true for all living things at the present time under existing environmental conditions. If, however, life originated on Earth more than once in the past, the fact that all organisms have a sameness of basic structure, composition, and function would seem to indicate that only one original type succeeded.",
  "A common origin of life would explain why in humans or bacteria—and in all forms of life in between—the same chemical substance, deoxyribonucleic acid ( DNA ), in the form of genes accounts for the ability of all living matter to replicate itself exactly and to transmit genetic information from parent to offspring. Furthermore, the mechanisms for that transmittal follow a pattern that is the same in all organisms.",
  "Whenever a change in a gene (a mutation ) occurs, there is a change of some kind in the organism that contains the gene. It is this universal phenomenon that gives rise to the differences (variations) in populations of organisms from which nature selects for survival those that are best able to cope with changing conditions in the environment.",
  "  In his theory of natural selection , which is discussed in greater detail later, Charles Darwin suggested that “survival of the fittest” was the basis for organic evolution (the change of living things with time). Evolution itself is a biological phenomenon common to all living things, even though it has led to their differences. Evidence to support the theory of evolution has come primarily from the fossil record , from comparative studies of structure and function, from studies of embryological development, and from studies of DNA and RNA (ribonucleic acid).",
  "Despite the basic biological, chemical, and physical similarities found in all living things, a diversity of life exists not only among and between species but also within every natural population. The phenomenon of diversity has had a long history of study because so many of the variations that exist in nature are visible to the eye. The fact that organisms changed during prehistoric times and that new variations are constantly evolving can be verified by paleontological records as well as by breeding experiments in the laboratory. Long after Darwin assumed that variations existed, biologists discovered that they are caused by a change in the genetic material (DNA). That change can be a slight alteration in the sequence of the constituents of DNA ( nucleotides ), a larger change such as a structural alteration of a chromosome , or a complete change in the number of chromosomes. In any case, a change in the genetic material in the reproductive cells manifests itself as some kind of structural or chemical change in the offspring. The consequence of such a mutation depends upon the interaction of the mutant offspring with its environment.",
  "It has been suggested that sexual reproduction became the dominant type of reproduction among organisms because of its inherent advantage of variability, which is the mechanism that enables a species to adjust to changing conditions. New variations are potentially present in genetic differences, but how preponderant a variation becomes in a gene pool depends upon the number of offspring the mutants or variants produce (differential reproduction). It is possible for a genetic novelty (new variation) to spread in time to all members of a population, especially if the novelty enhances the population’s chances for survival in the environment in which it exists. Thus, when a species is introduced into a new habitat, it either adapts to the change by natural selection or by some other evolutionary mechanism or eventually dies off. Because each new habitat means new adaptations , habitat changes have been responsible for the millions of different kinds of species and for the heterogeneity within each species.",
  "The total number of extant animal and plant species is estimated at between roughly 5 million and 10 million; about 1.5 million of those species have been described by scientists. The use of classification as a means of producing some kind of order out of the staggering number of different types of organisms appeared as early as the book of Genesis—with references to cattle, beasts, fowl, creeping things, trees, and so on. The first scientific attempt at classification, however, is attributed to the Greek philosopher Aristotle , who tried to establish a system that would indicate the relationship of all things to each other. He arranged everything along a scale, or “ladder of nature,” with nonliving things at the bottom; plants were placed below animals, and humankind was at the top. Other schemes that have been used for grouping species include large anatomical similarities, such as wings or fins, which indicate a natural relationship, and also similarities in reproductive structures.",
  "Taxonomy has been based on two major assumptions: one is that similar body construction can be used as a criterion for a classification grouping; the other is that, in addition to structural similarities, evolutionary and molecular relationships between organisms can be used as a means for determining classification.",
  "The study of the relationships of living things to each other and to their environment is known as ecology . Because these interrelationships are so important to the welfare of Earth and because they can be seriously disrupted by human activities, ecology has become an important branch of biology.",
  "Whether an organism is a human or a bacterium, its ability to reproduce is one of the most important characteristics of life. Because life comes only from preexisting life, it is only through reproduction that successive generations can carry on the properties of a species.",
  "Living things are defined in terms of the activities or functions that are missing in nonliving things. The life processes of every organism are carried out by specific materials assembled in definite structures. Thus, a living thing can be defined as a system, or structure, that reproduces, changes with its environment over a period of time, and maintains its individuality by constant and continuous metabolism .",
  "Biologists once depended on the light microscope to study the morphology of cells found in higher plants and animals. The functioning of cells in unicellular and in multicellular organisms was then postulated from observation of the structure; the discovery of the chloroplastids in the cell, for example, led to the investigation of the process of photosynthesis . With the invention of the electron microscope , the fine organization of the plastids could be used for further quantitative studies of the different parts of that process.",
  " Yersinia enterocolitica Yersinia enterocolitica  Qualitative and quantitative analyses in biology make use of a variety of techniques and approaches to identify and estimate levels of nucleic acids, proteins , carbohydrates , and other chemical constituents of cells and tissues. Many such techniques make use of antibodies or probes that bind to specific molecules within cells and that are tagged with a chemical, commonly a fluorescent dye, a radioactive isotope , or a biological stain, thereby enabling or enhancing microscopic visualization or detection of the molecules of interest.",
  "Chemical labels are powerful means by which biologists can identify, locate, or trace substances in living matter. Some examples of widely used assays that incorporate labels include the Gram stain , which is used for the identification and characterization of bacteria; fluorescence in situ hybridization , which is used for the detection of specific genetic sequences in chromosomes ; and luciferase assays, which measure bioluminescence produced from luciferin -luciferase reactions, allowing for the quantification of a wide array of molecules.",
  "Early biologists viewed their work as a study of the organism. The organism, then considered the fundamental unit of life, is still the prime concern of some modern biologists, and understanding how organisms maintain their internal environment remains an important part of biological research. To better understand the physiology of organisms, researchers study the tissues and organs of which organisms are composed. Key to that work is the ability to maintain and grow cells in vitro (“in glass”), otherwise known as tissue culture .",
  "Some of the first attempts at tissue culture were made in the late 19th century. In 1885, German zoologist Wilhelm Roux maintained tissue from a chick embryo in a salt solution. The first major breakthrough in tissue culture, however, came in 1907 with the growth of frog nerve cell processes by American zoologist Ross G. Harrison . Several years later, French researchers Alexis Carrel and Montrose Burrows had refined Harrison’s methods and introduced the term tissue culture . Using stringent laboratory techniques, workers have been able to keep cells and tissues alive under culture conditions for long periods of time. Techniques for keeping organs alive in preparation for transplants stem from such experiments.",
  "Advances in tissue culture have enabled countless discoveries in biology. For example, many experiments have been directed toward achieving a deeper understanding of biological differentiation, particularly of the factors that control differentiation. Crucial to those studies was the development in the late 20th century of tissue culture methods that allowed for the growth of mammalian embryonic stem cells —and ultimately human embryonic stem cells—on culture plates.",
  "There are moments in the history of all sciences when remarkable progress is made in relatively short periods of time. Such leaps in knowledge result in great part from two factors: one is the presence of a creative mind—a mind sufficiently perceptive and original to discard hitherto accepted ideas and formulate new hypotheses; the second is the technological ability to test the hypotheses by appropriate experiments. The most original and inquiring mind is severely limited without the proper tools to conduct an investigation; conversely, the most-sophisticated technological equipment cannot of itself yield insights into any scientific process.",
  "  An example of the relationship between those two factors was the discovery of the cell. For hundreds of years there had been speculation concerning the basic structure of both plants and animals. Not until optical instruments were sufficiently developed to reveal cells, however, was it possible to formulate a general hypothesis, the cell theory, that satisfactorily explained how plants and animals are organized. Similarly, the significance of Gregor Mendel ’s studies on the mode of inheritance in the garden pea remained neglected for many years until technological advances made possible the discovery of the chromosomes and the part they play in cell division and heredity . Moreover, as a result of the relatively recent development of extremely sophisticated instruments, such as the electron microscope, the ultracentrifuge, and automated DNA sequencing machines, biology has moved from being a largely descriptive science—one concerned with entire cells and organisms—to a discipline that increasingly emphasizes the subcellular and molecular aspects of organisms and attempts to equate structure with function at all levels of biological organization.",
  "Although it is not known when the study of biology originated, early humans must have had some knowledge of the animals and plants around them. Human survival depended upon the accurate recognition of nonpoisonous food plants and upon an understanding of the habits of dangerous predators. Archaeological records indicate that even before the development of civilization, humans had domesticated virtually all the amenable animals available to them and had developed an agricultural system sufficiently stable and efficient to satisfy the needs of large numbers of people living together in communities. It is clear, therefore, that much of the history of biology predates the time at which humankind began to write and to keep records.",
  " Phoenix dactylifera c. bce  Much of the earliest recorded history of biology is derived from Assyrian and Babylonian bas-reliefs showing cultivated plants and from carvings depicting veterinary medicine . Illustrations on certain seals reveal that the Babylonians had learned that the date palm reproduces sexually and that pollen could be taken from the male plant and used to fertilize female plants. Although a precise dating of those early records is lacking, a Babylonian business contract of the Hammurabi period ( c. 1800 bce ) mentions the male flower of the date palm as an article of commerce, and descriptions of date harvesting extend back to about 3500 bce .",
  "Another source of information concerning the extent of biological knowledge of these early peoples was the discovery of several papyri that pertain to medical subjects; one, believed to date to 1600 bce , contains anatomical descriptions; another ( c. 1500 bce ) indicates that the importance of the heart had been recognized. Because those ancient documents, which contained mixtures of fact and superstition, probably summarized then-current knowledge, it may be assumed that some of their contents had been known by earlier generations.",
  "  Papyri and artifacts found in tombs and pyramids indicate that the Egyptians also possessed considerable medical knowledge. Their well-preserved mummies demonstrate that they had a thorough understanding of the preservative properties of herbs required for embalming; plant necklaces and bas-reliefs from various sources also reveal that the ancient Egyptians were well aware of the medicinal value of certain plants. An Egyptian compilation known as the Ebers papyrus ( c. 1550 bce ) is one of the oldest known medical texts.",
  "In ancient China, three mythical emperors— Fu Xi , Shennong , and Huangdi —whose supposed ruling periods extended from the 29th to the 27th century bce , were said to possess medical knowledge. According to legend, Shennong described the therapeutic powers of numerous medicinal plants and included descriptions of many important food plants, such as the soybean. The earliest known written record of medicine in China, however, is the Huangdi neijing ( The Yellow Emperor’s Classic of Internal Medicine ), which dates to the 3rd century bce . In addition to medicine, the ancient Chinese possessed knowledge of other areas of biology. For example, they not only used the silkworm Bombyx mori to produce silk for commerce but also understood the principle of biological control, employing one type of insect, an entomophagous (insect-eating) ant, to destroy insects that bored into trees.",
  "As early as 2500 bce the people of northwestern India had a well-developed science of agriculture. The ruins at Mohenjo-daro have yielded seeds of wheat and barley that were cultivated at that time. Millet, dates, melons, and other fruits and vegetables, as well as cotton, were known to the civilization. Plants were not only a source of food, however. A document, believed to date to the 6th century bce , described the use of about 960 medicinal plants and included information on topics such as anatomy , physiology , pathology , and obstetrics .",
  "Although the Babylonians, Assyrians, Egyptians, Chinese, and Indians amassed much biological information, they lived in a world believed to be dominated by unpredictable demons and spirits. Hence, learned individuals in those early cultures directed their studies toward an understanding of the supernatural, rather than the natural, world. Anatomists, for example, dissected animals not to gain an understanding of their structure but to study their organs in order to predict the future. With the emergence of the Greek civilization, however, those mystical attitudes began to change. Around 600 bce there arose a school of Greek philosophers who believed that every event has a cause and that a particular cause produces a particular effect. That concept, known as causality, had a profound effect on subsequent scientific investigation. Furthermore, those philosophers assumed the existence of a “natural law” that governs the universe and can be comprehended by humans through the use of their powers of observation and deduction. Although they established the science of biology, the greatest contribution the Greeks made to science was the idea of rational thought.",
  "One of the earliest Greek philosophers, Thales of Miletus ( c. 7th century bce ), maintained that the universe contained a creative force that he called physis, an early progenitor of the term physics ; he also postulated that the world and all living things in it were made from water. Anaximander , a student of Thales, did not accept water as the only substance from which living things were derived; he believed that in addition to water, living things consisted of earth and a gaslike substance called apeiron , which could be divided into hot and cold. Various mixtures of those materials gave rise to the four elements: earth, air, fire, and water. Although he was one of the first to describe Earth as a sphere rather than as a flat plane, Anaximander proposed that life arose spontaneously in mud and that the first animals to emerge had been fishes covered with a spiny skin. The descendants of those fishes eventually left water and moved to dry land, where they gave rise to other animals by transmutation (the conversion of one form into another). Thus, an early evolutionary theory was formulated.",
  "At Crotone in southern Italy, where an important school of natural philosophy was established by Pythagoras about 500 bce , one of his students, Alcmaeon , investigated animal structure and described the difference between arteries and veins, discovered the optic nerve , and recognized the brain as the seat of the intellect. As a result of his studies of the development of the embryo, Alcmaeon may be considered the founder of embryology .",
  "  Although the Greek physician Hippocrates , who established a school of medicine on the Aegean island of Cos around 400 bce , was not an investigator in the sense of Alcmaeon, he did recognize through observations of patients the complex interrelationships involved in the human body. He also contemplated the influence of environment on human nature and believed that sharply contrasting climates tended to produce a powerful type of inhabitant, whereas even, temperate climates were more conducive to indolence.",
  "Hippocrates and his predecessors were concerned with the central philosophical question of how the cosmos and its inhabitants were created. Although they accepted the physis as the creative force, they differed with regard to the importance of the roles played by earth, air, fire, water, and other elements. Although Anaximenes , for example, who may have been a student of Anaximander, adhered to the then-popular precept that life originated in a mass of mud, he postulated that the actual creative force was to be found in the air and that it was influenced by the heat of the Sun. Members of the Hippocratic school also believed that all living bodies were made up of four humours—blood, black bile, phlegm, and yellow bile—which supposedly originated in the heart, the spleen, the brain, and the liver, respectively. An imbalance of the humours was thought to cause an individual to be sanguine, melancholy, phlegmatic, or choleric. These words persisted in the medical literature for centuries, a testament to the lengthy popularity of the idea of humoral influences. For centuries it was also believed that an imbalance in the humours was the cause of disease, a belief that resulted in the common practice of bloodletting to rid the body of excessive humours.",
  "Around the middle of the 4th century bce , ancient Greek science reached a climax with Aristotle , who was interested in all branches of knowledge, including biology. Using his observations and theories, Aristotle was the first to attempt a system of animal classification, in which he contrasted animals containing blood with those that were bloodless. The animals with blood included those now grouped as mammals (except the whales, which he placed in a separate group), birds, amphibians, reptiles, and fishes. The bloodless animals were divided into the cephalopods, the higher crustaceans, the insects, and the testaceans, the last group being a collection of all the lower animals. His careful examination of animals led to the understanding that mammals have lungs, breathe air, are warm-blooded, and suckle their young. Aristotle was the first to show an understanding of an overall systematic taxonomy and to recognize units of different degrees within the system.",
  "The most-important part of Aristotle’s work was that devoted to reproduction and the related subjects of heredity and descent. He identified four means of reproduction, including the abiogenetic origin of life from nonliving mud, a belief held by Greeks of that time. Other modes of reproduction recognized by him included budding (asexual reproduction), sexual reproduction without copulation, and sexual reproduction with copulation. Aristotle described sperm and ova and believed that the menstrual blood of viviparous organisms (those that give birth to living young) was the actual generative substance.",
  "Although Aristotle recognized that species are not stable and unalterable and although he attempted to classify the animals he observed, he was far from developing any pre-Darwinian ideas concerning evolution. In fact, he rejected any suggestion of natural selection and sought teleological explanations (i.e., all phenomena in nature are shaped by a purpose) for any given observation. Nevertheless, many important scientific principles, some of which are often thought of as 20th-century concepts, can be ascribed to Aristotle. The following are a few such: (1) Using birds as an example, he formulated the principle that all organisms are structurally and functionally adapted to their habits and habitats. (2) Nature is parsimonious; it does not expend unnecessary energy. (3) In classifying animals, Aristotle rejected the idea of dividing them solely by their external structures (e.g., animals with wings and those without wings). He recognized instead a basic unity of plan among diverse organisms, a principle that is still conceptually and scientifically sound. Further, Aristotle also believed that the entire living world could be described as a unified organization rather than as a collection of diverse groups. (4) By his observations, Aristotle realized the importance of structural homology, basically similar organs in different animals, and functional analogy, different structures that serve somewhat the same function—e.g., the hand, the claw, and the hoof are analogous structures. Those principles constitute the basis for the biological field of study known as comparative anatomy . (5) Aristotle’s observations also led to the formulation of the principle that general structures appear before specialized ones and that tissues differentiate before organs.",
  "Of all the works of Aristotle that have survived, none deals with what was later differentiated as botany , although it is believed that he wrote at least two treatises on plants. Fortunately, however, the work of Theophrastus , one of Aristotle’s students, has been preserved to represent plant science of the Greek period. Like Aristotle, Theophrastus was a keen observer, although his works do not express the depth of original thought exemplified by his teacher. In his great work, De historia et causis plantarum ( The Calendar of Flora , 1761), in which the morphology, natural history, and therapeutic use of plants are described, Theophrastus distinguished between the external parts, which he called organs, and the internal parts, which he called tissues. This was an important achievement because Greek scientists of that period had no established scientific terminology for specific structures. For that reason, both Aristotle and Theophrastus were obliged to write very long descriptions of structures that can be described rapidly and simply today. Because of that difficulty, Theophrastus sought to develop a scientific nomenclature by giving special meaning to words that were then in more or less current use; for example, karpos for fruit and perikarpion for seed vessel.",
  "Although he did not propose an overall classification system for plants, more than 500 of which are mentioned in his writings, Theophrastus did unite many species into what are now considered genera . In addition to writing the earliest detailed description of how to pollinate the date palm by hand and the first unambiguous account of sexual reproduction in flowering plants, he also recorded observations on seed germination and development.",
  "With Aristotle and Theophrastus, the great Greek period of scientific investigation came to an end. The most famous of the new centres of learning were the library and museum in Alexandria. From 300 bce until around the time of Christ, all significant biological advances were made by physicians at Alexandria. One of the most outstanding of those individuals was Herophilus , who dissected human bodies and compared their structures with those of other large mammals. He recognized the brain, which he described in detail, as the centre of the nervous system and the seat of intelligence. On the basis of his knowledge, he wrote a general anatomical treatise, a special one on the eyes, and a handbook for midwives.",
  " Erasistratus , a younger contemporary and reputed rival of Herophilus who also worked at the museum in Alexandria, studied the valves of the heart and the circulation of blood. Although he was wrong in supposing that blood flows from the veins into the arteries, he was correct in assuming that small interconnecting vessels exist. He thus suspected (but did not see) the presence of capillaries ; he thought, however, that the blood changed into air, or pneuma , when it reached the arteries, to be pumped throughout the body.",
  "Perhaps the last of the ancient biological scientists of note was Galen of Pergamum , a Greek physician who practiced in Rome during the middle of the 2nd century ce . His early years were spent as a surgeon at the gladiatorial arena, which gave him the opportunity to observe details of human anatomy. At that time in Rome, however, it was considered improper to dissect human bodies, and, as a result, a detailed study of human anatomy was not possible. Thus, though Galen’s research on animals was thorough, his knowledge of human anatomy was faulty. Because his work was extensive and clearly written, Galen’s writings, nevertheless, dominated medicine for centuries.",
  "After Galen there were no significant biological investigations for many centuries. It is sometimes claimed that the rise of Christianity was the cause of the decline in science. However, while it is true that Christianity did not favour the questioning attitude of the Greeks, science had already receded significantly by the end of the 2nd century ce , a time when Christianity was still an obscure sect.",
  "During the almost 1,000 years that science was dormant in Europe, the Arabs, who by the 9th century had extended their sphere of influence as far as Spain, became the custodians of science and dominated biology, as they did other disciplines. At the same time, as the result of a revival of learning in China, new technical inventions flowed from there to the West. The Chinese had discovered how to make paper and how to print from movable type, two achievements that were to have an inestimable effect upon learning. Another important advance that also occurred during that time was the introduction of the so-called Arabic numerals into Europe from India.",
  "From the 3rd until the 11th century, biology was essentially an Arab science. Although the Arabic scholars themselves were not great innovators, they discovered the works of such men as Aristotle and Galen, translated those works into Arabic, studied them, and wrote commentaries about them. Of the Arab biologists, al-Jāḥiẓ, who died about 868, is particularly noteworthy. Among his biological writings is Kitāb al-ḥayawān (“Book of Animals”), which, although revealing some Greek influence, is primarily an Arabic work. In it the author emphasized the unity of nature and recognized relationships between different groups of organisms. Because al-Jāḥiẓ believed that earth contained both male and female elements, he found the Greek doctrine of spontaneous generation (life emerging from mud) to be quite reasonable.",
  "Muslim physician Avicenna was an outstanding scientist who lived during the late 10th and early 11th centuries; he was the true successor to Aristotle. His writings on medicine and drugs , which were particularly authoritative and remained so until the Renaissance , did much to take the works of Aristotle back to Europe, where they were translated into Latin from Arabic.",
  "  During the 12th century the growth of biology was sporadic. Nevertheless, it was during that time that botany was developed from the study of plants with healing properties; similarly, from veterinary medicine and the pleasures of the hunt came zoology. Because of the interest in medicinal plants, herbs in general began to be described and illustrated in a realistic manner. Although Arabic science was well developed during the period and was far in advance of Latin, Byzantine, and Chinese cultures, it began to show signs of decline. Latin learning, on the other hand, rapidly increasing, was best exemplified perhaps by the mid-13th-century German scholar Albertus Magnus (Saint Albert the Great), who was probably the greatest naturalist of the Middle Ages . His biological writings ( De vegetabilibus , seven books, and De animalibus , 26 books) were based on the classical Greek authorities, predominantly Aristotle. But in spite of that classical basis, a significant amount of his work contained new observations and facts; for example, he described with great accuracy the leaf anatomy and venation of the plants he studied.",
  "Albertus was particularly interested in plant propagation and reproduction and discussed in some detail the sexuality of plants and animals. Like his Greek predecessors, he believed in spontaneous generation; he also believed that animals were more perfect than plants, because they required two individuals for the sexual act. Perhaps one of Albertus’s greatest contributions to medieval biology was the denial of many superstitions believed by his contemporaries, a skepticism that, together with the reintroduction of Aristotelian biology, was to have profound effects on subsequent European science.",
  "One of Albertus’s pupils was Thomas Aquinas , who, like his mentor, endeavoured to reconcile Aristotelian philosophy and the teachings of the church. Because Aquinas was a rationalist, he declared that God created the reasoning mind; hence, by true intellectual processes of reasoning, man could not arrive at a conclusion that was in opposition to Christian thought. Acceptance of this philosophy made possible a revival of rational learning that was consistent with Christian belief.",
  "Italy, during the Middle Ages, became the most-active scientific centre, although its major interests were concentrated on agriculture and medicine. A development of particular significance at that time was the introduction of dissection into medical schools, a step that revitalized the study of anatomy. Because of what it reveals about medieval anatomy in general, the work of Mondino de’ Luzzi , the most famous of the Italian anatomists at the beginning of the 14th century, is particularly important. It is thought that early in his career, contrary to the trend at the time, in which the teacher left the actual dissection to an underling, Mondino performed many dissections himself. Later, however, it is likely that he increasingly left the work to his assistants. Mondino adhered closely to the works of the Greeks and Arabs, and he thus repeated their errors.",
  "Beginning in Italy during the 14th century, there was a general ferment within the culture itself, which, together with the rebirth of learning (partly as a result of the rediscovery of Greek work), is referred to as the Renaissance . Interestingly, it was the artists, rather than the professional anatomists, who were intent upon a true rendering of the bodies of animals, including humans, and thus were motivated to gain their knowledge firsthand by dissection. No individual better exemplifies the Renaissance than Leonardo da Vinci , whose anatomical studies of the human form during the late 1400s and early 1500s were so far in advance of the age that they included details not recognized until a century later. Furthermore, while dissecting animals and examining their structure, Leonardo compared them with the structure of humans. In doing so he was the first to indicate the homology between the arrangements of bones and joints in the leg of the human and that of the horse, despite the superficial differences. Homology was to become an important concept in uniting outwardly diverse groups of animals into distinct units, a factor that is of great significance in the study of evolution .",
  "Other factors had a profound effect upon the course of biology in the 1500s, particularly the introduction of printing around the middle of the century, the increasing availability of paper , and the perfected art of the wood engraver, all of which meant that illustrations as well as letters could be transferred to paper. In addition, after the Turks conquered Byzantium in 1453, many Greek scholars took refuge in the West; the scholars of the West thus had direct access to the scientific works of antiquity rather than indirect access through Arabic translations.",
  "Over the period 1530–40, German theologian and botanist Otto Brunfels published the two volumes of his Herbarum vivae eicones , a book about plants, which, with its fresh and vigorous illustrations, contrasted sharply with earlier texts, whose authors had been content merely to copy from old manuscripts. In addition to books on the same subject, Hieronymus Bock (Latinized to Tragus) and Leonhard Fuchs also published about the mid-1500s descriptive well-illustrated texts about common wild flowers. The books published by the three men, who are often referred to as the German fathers of botany, may be considered the forerunners of modern botanical floras (treatises on or lists of the plants of an area or period).",
  "Throughout the 16th century, interest in botanical study also existed in other countries, including the Netherlands, Switzerland, Italy, and France. During that time there was a great improvement in the classification of plants, which had been described in ancient herbals merely as trees, shrubs, or plants and, in later books, were either listed alphabetically or arranged in some arbitrary grouping. The necessity for a systematic method to designate the increasing number of plants being described became obvious. Accordingly, using a binomial system very similar to modern biological nomenclature, the Swiss botanist Gaspard Bauhin designated plants by a generic and a specific name. Although affinities between plants were indicated by the use of common generic names, Bauhin did not speculate on their common kinship.",
  " Pierre Belon , a French naturalist who traveled extensively in the Middle East, where he studied the flora, illustrates the wide interest of the 16th-century biologists. Although his botanical work was limited to two volumes, one on trees and one on horticulture, his books on travel included numerous biological entries. His two books on fishes reveal much about the state of systematics at the time, including that of not only fishes but also other aquatic creatures such as mammals, crustaceans, mollusks, and worms. In his L’Histoire de la nature des oyseaux (1555; “Natural History of Birds”), however, in which Belon’s taxonomy was remarkably similar to that used in the modern era, he showed a clear grasp of comparative anatomy, particularly of the skeleton, publishing the first picture of a bird skeleton beside a human skeleton to point out the homologies. Numerous other European naturalists who traveled extensively also brought back accounts of exotic animals and plants, and most of them wrote voluminous records of their excursions. Two other factors contributed significantly to the development of botany at the time: first was the establishment of botanical gardens by the universities, as distinct from the earlier gardens that had been established for medicinal plants; second was the collection of dried botanical specimens, or herbaria .",
  "It is perhaps surprising that the great developments in botany during the 16th century had no parallel in zoology . Instead, there arose a group of biologists known as the Encyclopedists, best represented by Conrad Gesner , a 16th-century Swiss naturalist, who compiled books on animals that were illustrated by some of the finest artists of the day ( Albrecht Dürer , for example). But because the descriptions of many of the animals were grossly inaccurate, in many cases continuing the legends of the Greeks, apart from their aesthetic value the books did little to advance zoological knowledge.",
  " De humani corporis fabrica libri septem  Like that of botany, the beginning of the modern scientific study of anatomy can be traced to a combination of humanistic learning, Renaissance art, and the craft of printing. Although Leonardo da Vinci initiated anatomical studies of human cadavers, his work was not known to his contemporaries. Rather, the appellation father of modern human anatomy generally is accorded to the Belgian anatomist Andreas Vesalius , who studied initially at the rather conservative schools in Leuven (Louvain) and Paris, where he became a successful teacher very familiar with Galen’s work. In 1537 he went to Padua, where he became noted for far-reaching teaching reforms. Most important, Vesalius abolished the practice of having someone else do the actual dissection; instead, he dissected his own cadavers and lectured to students from his findings. His text, De humani corporis fabrica libri septem (1543; “The Seven Books on the Structure of the Human Body”), was the most extensive and accurate work on the subject of anatomy at the time and, as such, constituted a foundation of great importance for biology. Perhaps Vesalius’s greatest contribution, however, was that he inspired a group of younger scientists to be critical and to accept a description only after they had verified it. Thus, as anatomists became more questioning and critical of the works of others, the errors of Galen were exposed. Of Vesalius’s successors, Michael Servetus , a Spanish theologian and physician, discovered the pulmonary circulation of the blood from the right chamber of the heart to the lungs and stated that the blood did not pass through the central septum (wall) of the heart, as had previously been believed.",
  "Seventeenth-century advances in biology included the establishment of scientific societies for the dissemination of ideas and progress in the development of the microscope, through which scientists discovered a hitherto invisible world that had far-reaching effects on biology. Systematizing and classifying, however, dominated biology throughout much of the 17th and 18th centuries, and it was during that time that the importance of the comparative study of living organisms, including humans, was realized. During the 18th century the long-held idea that living organisms could originate from nonliving matter ( spontaneous generation ) began to crumble, but it was not until after the mid-19th century that it was finally disproved by the French chemist and microbiologist Louis Pasteur , who demonstrated the self-replicating ability of microorganisms.",
  "Biological expeditions added to the growing body of knowledge of plant and animal forms and led to the 19th-century development of the theory of evolution. The 19th century was one of great progress in biology: in addition to the formulation of the theory of evolution, the cell theory was established, the foundations for modern embryology were laid, and the laws of heredity were discovered.",
  "In the early 17th century, the English physician William Harvey , who studied at Padua with one of Vesalius’s students, became the first to describe the full circulation of the blood through the human body. Prior to Harvey, blood was supposed to be consumed by the body and produced anew rather than continually circulated. It had also been suggested that the blood flowed through pores between the two halves of the heart and that the heart produced a vital heat, which was tempered by the air from the lungs. In his own work, however, Harvey demonstrated that the heart expands passively and contracts actively. By measuring the amount of blood flowing from the heart, he concluded that the body could not continuously produce that amount. He also was able to show that blood is returned to the heart through the veins , postulating a connection (the capillaries ) between the arteries and veins that was not to be discovered until later in the 17th century. Harvey was also interested in embryology, to which he made a significant contribution by suggesting that there is a stage (the egg) in the development of all animals during which they are undifferentiated living masses. A biological dictum, ex ovo omnia (“everything comes from the egg”), is a summation of that concept.",
  "A development of great importance to science was the establishment in Europe of academies or societies; they consisted of small groups of men who met to discuss subjects of mutual interest. Although some of the groups enjoyed the financial patronage of princes and other wealthy members of society, the members’ interest in science was the sole sustaining force. The academies also provided freedom of expression, which, together with the stimulus of exchanging ideas, contributed greatly to the development of scientific thought. One of the earliest of these organizations was the Italian Accademia dei Lincei (Academy of the Lynx-eyed), founded in Rome around 1603. Galileo Galilei made a microscope for the society; another of its members, Johannes Faber, an entomologist, gave the instrument its name. Other academies in Europe included the French Academy of Sciences (founded in 1666), a German Academy in Leipzig, and a number of small academies in England that in 1662 became incorporated under royal charter as the Royal Society of London, an organization that was to have considerable influence on scientific developments in England.",
  "In addition to providing a forum for the discussion of scientific matters, another important aspect of those societies was their publications. Before the advent of printing there were no convenient means for the wide dissemination of scientific knowledge and ideas; hence, scientists were not well informed about the works of others. To correct that deficiency in communications, the early academies initiated several publications, the first of which, Journal des Savants (originally Journal des Sçavans ), was published in 1665 in France. Three months later, the Royal Society of London originated its Philosophical Transactions . At first the publication was devoted to reviews of work completed and in progress; later, however, the emphasis gradually changed to accounts of original investigations that maintained a high level of scientific quality. Gradually, specialized journals of science made their appearance, though not until at least another century had passed.",
  "The magnifying power of segments of glass spheres was known to the Assyrians before the time of Christ; during the 2nd century ce , Claudius Ptolemy , an astronomer, mathematician, and geographer at Alexandria, wrote a treatise on optics in which he discussed the phenomena of magnification and refraction as related to such lenses and to glass spheres filled with water. Despite that knowledge, however, glass lenses were not used extensively until around 1300 (an anonymous person invented spectacles for the improvement of vision probably in the late 1200s). That invention aroused curiosity concerning the property of lenses to magnify, and in the 16th century several papers were written about such devices. Then, in the late 16th century, the Dutch optician Hans Jansen and his son Zacharias invented the compound microscope. The utility of that instrument in the biological sciences, however, was not realized until the following century. Following subsequent technological improvements in the instrument and the development of a more-liberal attitude toward scientific research, five microscopists emerged who were to have a profound affect on biology: Marcello Malpighi , Antonie van Leeuwenhoek , Jan Swammerdam , Nehemiah Grew , and Robert Hooke .",
  "The Italian biologist and physician Marcello Malpighi conducted extensive studies in animal anatomy and histology (the microscopic study of the structure, composition, and function of tissues). He was the first to describe the inner (malpighian) layer of the skin, the papillae of the tongue , the outer part (cortex) of the cerebral area of the brain , and the red blood cells . He wrote a detailed monograph on the silkworm; a further major contribution was a description of the development of the chick, beginning with the 24-hour stage. In addition to those and other animal studies, Malpighi made detailed investigations in plant anatomy. He systematically described the various parts of plants, such as bark, stem, roots, and seeds, and discussed processes such as germination and gall formation. Many of Malpighi’s drawings of plant anatomy remained unintelligible to botanists until the structures were rediscovered in the 19th century. Although Malpighi was not a technical innovator, he does exemplify the functioning of the educated 17th-century mind, which, together with curiosity and patience, resulted in many advances in biology.",
  "  Antonie van Leeuwenhoek, a Dutchman who spent most of his life in Delft, sold cloth for a living. As a young man, however, he became interested in grinding lenses, which he mounted in gold, silver, or copper plates. Indeed, he became so obsessed with the idea of making perfect lenses that he neglected his business and was ridiculed by his family and neighbours. Using single lenses rather than compound ones (a system of two or more), Leeuwenhoek achieved magnifications from 40 to 270 diameters, a remarkable feat for hand-ground lenses. Among his most-conspicuous observations was the discovery in 1675 of the existence in stagnant water and prepared infusions of many protozoans , which he called animalcules. He observed the connections between the arteries and veins; gave particularly fine accounts of the microscopic structure of muscle , the lens of the eye , the teeth , and other structures; and recognized bacteria of different shapes, postulating that they must be on the order of 25 times as small as the red blood cell. Because that is the approximate size of bacteria, it indicates that his observations were accurate.",
  "Leeuwenhoek’s fame was consolidated when he confirmed the observations of a student that male seminal fluid contains spermatozoa. Furthermore, he discovered spermatozoa in other animals as well as in the female tract following copulation; the latter destroyed the idea held by others that the entire future development of an animal is centred in the egg, and that sperm merely induce a “vapour,” which penetrates the womb and effects fertilization . Although that theory of preformation, as it is called, continued to survive for some time longer, Leeuwenhoek initiated its eventual demise.",
  "Leeuwenhoek’s animalcules raised some disquieting thoughts in the minds of his contemporaries. The theory of spontaneous generation, held by the ancient world and passed down unquestioned, was now being criticized. Christiaan Huygens , a scientific friend of Leeuwenhoek, hypothesized that the little animals might be small enough to float in the air and, on reaching water, reproduce themselves. At the time, however, criticism of spontaneous generation went no farther.",
  "In contrast to Leeuwenhoek, who was virtually unschooled, his contemporary fellow countryman Jan Swammerdam was highly educated in medicine. However, similar to Leeuwenhoek, Swammerdam confined his attention to microscopical studies. He employed highly innovative techniques; for example, he injected wax into the circulatory system to hold the blood vessels firm, he dissected fragile structures under water to avoid destroying them, and he used micropipettes to inject and inflate organisms under the microscope. In 1669 Swammerdam published Algemeene Verhandeling van bloedeloose diertjens ( The Natural History of Insects , 1792), in which he described the structure of a large number of insects as well as spiders, snails, scorpions, fishes, and worms. He regarded all of those animals as insects, distinguishing between them according to their mode of development. Although that classification was erroneous, Swammerdam discovered a great deal of information concerning insect development.",
  "Swammerdam was subject to fits of mental instability, which, combined with financial difficulties, led to periods of depression. It was while in a state of mental disturbance that he produced his classic Ephemeri vita (“Life of the Ephemera”) in 1675, a book about the life of the mayfly noteworthy for its extremely detailed illustrations. Sometime after his death at age 43, Swammerdam’s works were published collectively as the Bijbel der Natuure (1737; “Bible of Nature”), which is considered by many authorities to be the finest collection of microscopic observations ever produced by one person.",
  "Nehemiah Grew was educated at Cambridge and is regarded by some as one of the founders of plant anatomy. In 1672 he published the first of his great works, The Anatomy of Vegetables Begun , followed in 1682 by The Anatomy of Plants . Although Grew clearly recognized cells in plants, referring to them as vesicles, or bladders, their biological significance evaded him. He is best known for his recognition of flowers as the sexual organs of plants and for his description of their parts. He also described the individual pollen grains and observed that they are transported by bees , but he did not realize the significance of that observation. Twelve years after the publication of The Anatomy of Plants , a German physician utilized Grew’s anatomical studies in experiments to verify sexual reproduction in plants.",
  " Micrographia Micrographia  Of the five microscopists, Robert Hooke was perhaps the most intellectually preeminent. As curator of instruments at the Royal Society of London, he was in touch with all new scientific developments and exhibited interest in such disparate subjects as flying and the construction of clocks. In 1665 Hooke published his Micrographia , which was primarily a review of a series of observations that he had made while following the development and improvement of the microscope. Hooke described in detail the structure of feathers , the stinger of a bee, the radula, or “tongue,” of mollusks, and the foot of the fly. It is Hooke who coined the word cell ; in a drawing of the microscopic structure of cork, he showed walls surrounding empty spaces and referred to the structures as cells . He described similar structures in the tissue of other trees and plants and discerned that in some tissues the cells were filled with a liquid while in others they were empty. He therefore supposed that the function of the cells was to transport substances through the plant.",
  "Although the work of any of the classical microscopists seems to lack a definite objective, it should be remembered that these men embodied the concept that observation and experiment were of prime importance, that mere hypothetical, philosophical speculations were not sufficient. It is remarkable that so few men, working as individuals totally isolated from each other, should have recorded so many observations of such fundamental importance. The great significance of their work was that it revealed, for the first time, a world in which living organisms display an almost incredible complexity.",
  "Work with the compound microscope languished for nearly 200 years, mainly because the early lenses tended to break up white light into its constituent parts. That technical problem was not solved until the invention of achromatic lenses, which were introduced about 1830. In 1878 a modern achromatic compound microscope was produced from the design of the German physicist Ernst Abbe . Abbe subsequently designed a substage illumination system, which, together with the introduction of a new substage condenser, paved the way for the biological discoveries of that era.",
  "In 1687 the English mathematician, physicist, and astronomer Isaac Newton published his great work Principia , in which he described the universe as fixed, with Earth and other heavenly bodies moving harmoniously in accordance with mathematical laws. That approach of systematizing and classifying was to dominate biology in the 17th and 18th centuries. One reason was that the 16th-century “fathers of botany” had been content merely to describe and draw plants, assembling an enormous and diverse number that continued to increase as explorations of foreign countries made it evident that every country had its own native plants and animals.",
  "Aristotle began the process of classification when he used mode of reproduction and habitat to distinguish groups of animals. Indeed, the words  genus  and  species  are translations of the Greek genos and eidos used by Aristotle. The Swiss botanist Bauhin had introduced a binomial system of classification, using a generic name and a specific name. Most classification schemes proposed before the 17th century were confused and unsatisfactory, however.",
  "Two systematists of the 17th and 18th centuries were the English naturalist John Ray and the Swedish naturalist and explorer Carolus Linnaeus . Ray, who studied at Cambridge, was particularly interested in the work of the ancient compilers of herbals, especially those who had attempted to formulate some means of classification. Recognizing the need for a classification system that would apply to both plants and animals, Ray employed in his classification schemes extremely precise descriptions for genera and species. By basing his system on structures, such as the arrangement of toes and teeth in animals, rather than colour or habitat, Ray introduced a new and very important concept to taxonomic biology.",
  "Prior to Linnaeus, most taxonomists started their classification systems by dividing all the known organisms into large groups and then subdividing them into progressively smaller groups. Unlike his predecessors, Linnaeus began with the species, organizing them into larger groups or genera, and then arranging analogous genera to form families and related families to form orders and classes. Probably utilizing the earlier work of Grew and others, Linnaeus chose the structure of the reproductive organs of the flower as a basis for grouping the higher plants. Thus, he distinguished between plants with real flowers and seeds (phanerogams) and those lacking real flowers and seeds (cryptogams), subdividing the former into hermaphroditic (bisexual) and unisexual forms. For animals, following Ray’s work, Linnaeus relied upon teeth and toes as the basic characteristics of mammals; he used the shape of the beak as the basis for bird classification. Having demonstrated that a binomial classification system based on concise and accurate descriptions could be used for the grouping of organisms, Linnaeus established taxonomic biology as a discipline.",
  "Later developments in classification were initiated by the French biologists Comte de Buffon , Jean-Baptiste Lamarck , and Georges Cuvier , all of whom made lasting contributions to biological science, particularly in comparative studies. Subsequent systematists have been chiefly interested in the relationships between animals and have endeavoured to explain not only their similarities but also their differences in broad terms that encompass, in addition to structure, composition, function, genetics , evolution, and ecology .",
  "Once the opprobrium attached to the dissection of human bodies had been dispelled in the 16th century, anatomists directed their efforts toward a better understanding of human structure. In doing so they generally ignored other animals, at least until the latter part of the 17th century, when biologists began to realize that important insights could be gained by comparative studies of all animals, including humans. One of the first of such anatomists was the English physician Edward Tyson , who studied the anatomy of an immature chimpanzee in detail and compared it with that of a human. In making further comparisons between the chimpanzee and other primates , Tyson clearly recognized points of similarity between those animals and humans. Not only was this a major contribution to physical anthropology , but it was also an indication—nearly two centuries before Darwin—of the existence of relationships between humans and other primates.",
  "Among those who gave comparative studies their greatest impetus was Georges Cuvier, who utilized large collections of biological specimens sent to him from all over the world to work out a systematic organization of the animal kingdom. In addition to establishing a connection between systematic and comparative anatomy, he believed that there was a “correlation of parts” according to which a given type of structure (e.g., feathers) is related to a certain anatomical formation (e.g., a wing), which in turn is related to other specific formations (e.g., the clavicle ), and so on. In other words, he felt that a great deal of anatomical information could be deduced about an organism even if the whole specimen was not available. That insight was to be of great practical importance in the study of fossils , in which Cuvier played a leading role. Indeed, the 1812 publication of Cuvier’s Recherches sur les ossemens fossiles de quadrupèdes (translated as Research on Fossil Bones in 1835) laid the foundation for the science of paleontology . But in order to reconcile his scientific findings with his personal religious beliefs, Cuvier postulated a series of catastrophic events that could account for both the presence of fossils and the immutability of existing species.",
  "  If a species can develop only from a preexisting species, then how did life originate? Among the many philosophical and religious ideas advanced to answer that question, one of the most popular was the theory of spontaneous generation, according to which, as already mentioned, living organisms could originate from nonliving matter. With the increasing tempo of discovery during the 17th and 18th centuries, however, investigators began to examine more critically the Greek belief that flies and other small animals arose from the mud at the bottom of streams and ponds by spontaneous generation. Then, when Harvey announced his biological dictum ex ovo omnia (“everything comes from the egg”), it appeared that he had solved the problem, at least insofar as it pertained to flowering plants and the higher animals, all of which develop from an egg. But Leeuwenhoek’s subsequent disquieting discovery of animalcules demonstrated the existence of a densely populated but previously invisible world of organisms that had to be explained.",
  "The Italian physician and poet Francesco Redi was one of the first to question the spontaneous origin of living things. Having observed the development of maggots and flies on decaying meat, Redi in 1668 devised a number of experiments, all pointing to the same conclusion: if flies are excluded from rotten meat, maggots do not develop. On meat exposed to air, however, eggs laid by flies develop into maggots. Nonetheless, in 1745 support for spontaneous generation was renewed with the publication of An Account of Some New Microscopical Discoveries by the English naturalist and Roman Catholic divine John Turberville Needham . Needham found that large numbers of organisms subsequently developed in prepared infusions of many different substances that had been exposed to intense heat in sealed tubes for 30 minutes. Assuming that such heat treatment must have killed any previous organisms, Needham explained the presence of the new population on the grounds of spontaneous generation. The experiments appeared irrefutable until the Italian physiologist Lazzaro Spallanzani repeated them and obtained conflicting results. He published his findings around 1775, claiming that Needham had not heated his tubes long enough, nor had he sealed them in a satisfactory manner. Although Spallanzani’s results should have been convincing, Needham had the support of the influential French naturalist Buffon; hence, the matter of spontaneous generation remained unresolved.",
  "After a number of further investigations had failed to solve the problem, the French Academy of Sciences offered a prize for research that would “throw new light on the question of spontaneous generation.” In response to that challenge, Louis Pasteur, who at that time was a chemist, subjected flasks containing a sugared yeast solution to a variety of conditions. Pasteur was able to demonstrate conclusively that any microorganisms that developed in suitable media came from microorganisms in the air, not from the air itself, as Needham had suggested. Support for Pasteur’s findings came in 1876 from the English physicist John Tyndall , who devised an apparatus to demonstrate that air had the ability to carry particulate matter. Because such matter in air reflects light when the air is illuminated under special conditions, Tyndall’s apparatus could be used to indicate when air was pure. Tyndall found that no organisms were produced when pure air was introduced into media capable of supporting the growth of microorganisms. It was those results, together with Pasteur’s findings, that put an end to the doctrine of spontaneous generation.",
  "When Pasteur later showed that parent microorganisms generate only their own kind, he thereby established the study of microbiology . Moreover, he not only succeeded in convincing the scientific world that microbes are living creatures, which come from preexisting forms, but also showed them to be an immense and varied component of the organic world, a concept that was to have important implications for the science of ecology. Further, by isolating various species of bacteria and yeasts in different chemical media, Pasteur was able to demonstrate that they brought about chemical change in a characteristic and predictable way, thus making a unique contribution to the study of fermentation and to biochemistry .",
  "In the 1920s the Russian biochemist Aleksandr Oparin and other scientists suggested that life may have come from nonliving matter under conditions that existed on primitive Earth, when the atmosphere consisted of the gases methane , ammonia , water vapour, and hydrogen . According to that concept, energy supplied by electrical storms and ultraviolet light may have broken down the atmospheric gases into their constituent elements, and organic molecules may have been formed when the elements recombined.",
  "Some of those ideas have been verified by advances in geochemistry and molecular genetics; experimental efforts have succeeded in producing amino acids and proteinoids (primitive protein compounds) from gases that may have been present on Earth at its inception, and amino acids have been detected in rocks that are more than three billion years old. With improved techniques it may be possible to produce precursors of or actual self-replicating living matter from nonliving substances. But whether it is possible to create the actual living heterotrophic forms from which autotrophs supposedly developed remains to be seen.",
  "Although a number of 16th- and 17th-century travelers provided much valuable information about the plants and animals in Asia, America, and Africa, most of that information was collected by curious individuals rather than trained observers. In the 18th and 19th centuries, however, such information was collected increasingly in the course of organized scientific expeditions, usually under the auspices of a particular government. The most notable of those efforts were the voyages of the ships known as the HMS Endeavour , the HMS Investigator , the HMS  Beagle  , and the HMS Challenger , all sponsored by the English government.",
  "Capt. James Cook sailed the Endeavour to the South Pacific islands, New Zealand, New Guinea, and Australia in 1768; the voyage provided the British naturalist and explorer Joseph Banks with the opportunity to make a very extensive collection of plants and notes, which helped establish him as a leading biologist. Another expedition to the same area in the Investigator in 1801 included the Scottish botanist Robert Brown , whose work on the plants of Australia and New Zealand became a classic; especially important were his descriptions of how certain plants adapt to different environmental conditions. Brown is also credited with discovering the cell nucleus and analyzing sexual processes in higher plants.",
  "One of the most-famous biological expeditions of all time was that of the Beagle (1831–36), on which Charles Darwin served as naturalist. Although Darwin’s primary interest at the time was geology , his visit to the Galápagos Islands aroused his interest in biology and caused him to speculate about their curious insular animal life and the significance of isolation in space and time for the formation of species. During the Beagle voyage, Darwin collected specimens of and accumulated copious notes on the plants and animals of South America and Australia, for which he received great acclaim on his return to England.",
  "The voyage of the Challenger ( see  Challenger Expedition ) from 1872 to 1876 was organized by the British Admiralty to study oceanography , meteorology , and natural history . Under the leadership of the Scottish naturalist Charles Wyville Thomson , vast collections of plants and animals were made, the importance of plankton (minute free-floating aquatic organisms) as a source of food for larger marine organisms was recognized, and many new planktonic species were discovered. A particularly significant aspect of the Challenger voyage was the interest it stimulated in the new science of marine biology .",
  "In spite of those expeditions, the contributions made by individuals were still very important. The British naturalist Alfred Russel Wallace , for example, undertook explorations of the Malay Archipelago from 1854 to 1862. In 1876 he published his book The Geographical Distribution of Animals , in which he divided the landmasses into six zoogeographical regions and described their characteristic fauna. Wallace also contributed to the theory of evolution, publishing in 1870 a book expressing his views, Contributions to the Theory of Natural Selection .",
  "Although the microscopists of the 17th century had made detailed descriptions of plant and animal structure and though Hooke had coined the term cell to describe the compartments he had observed in cork tissue, their observations lacked an underlying theoretical unity. It was not until 1838 that the German botanist Matthias Jacob Schleiden , interested in plant anatomy, stated that “the lower plants all consist of one cell, while the higher ones are composed of (many) individual cells.” When the German physiologist Theodor Schwann , Schleiden’s friend, extended the cellular theory to include animals, he thereby brought about a rapprochement between botany and zoology. The formation of the cell theory—all plants and animals are made up of cells—marked a great conceptual advance in biology, and it resulted in renewed attention to the living processes that go on in cells.",
  "In 1846, after several investigators had described the streaming movement of the cytoplasm in plant cells, the German botanist Hugo von Mohl coined the word protoplasm to designate the living substance of the cell. The concept of protoplasm as the physical basis of life led to the development of cell physiology.",
  "A further extension of the cell theory was the development of cellular pathology by the German scientist Rudolf Virchow , who established the relationship between abnormal events in the body and unusual cellular activities. Virchow’s work gave a new direction to the study of pathology and resulted in advances in medicine.",
  "The detailed description of cell division was contributed by the German plant cytologist Eduard Strasburger , who observed the mitotic process in plant cells and further demonstrated that nuclei arise only from preexisting nuclei. Parallel work in mammals was carried out by the German anatomist Walther Flemming , who published his most important findings in Zellsubstanz, Kern und Zelltheilung (“Cell Substance, Nucleus and Cell Division”) in 1882.",
  "As knowledge of plant and animal forms accumulated during the 16th, 17th, and 18th centuries, a few biologists began to speculate about the ancestry of those organisms, though the prevailing view was that promulgated by Linnaeus—namely, the immutability of the species. Among the early speculations voiced during the 18th century, the British physician Erasmus Darwin (grandfather of Charles Darwin), concluded that species descend from common ancestors and that there is a struggle for existence among animals. The French biologist Jean-Baptiste Lamarck , among the most important of the 18th-century evolutionists, recognized the role of isolation in species formation; he also saw the unity in nature and conceived the idea of the evolutionary tree.",
  "A complete theory of evolution was not announced, however, until the publication in 1859 of Charles Darwin’s On the Origin of Species by Means of Natural Selection or the Preservation of Favoured Races in the Struggle for Life . In his book Darwin stated that all living creatures multiply so rapidly that if left unchecked they would soon overpopulate the world. According to Darwin, the checks on population size are maintained by competition for the means of life. Hence, if any member of a species differs in some way that makes it better fitted to survive, then it will have an advantage that its offspring would be likely to perpetuate. Darwin’s work reflects the influence of the British economist Thomas Robert Malthus , who in 1838 published an essay on population in which he warned that if humans multiply more rapidly than their food supply, competition for existence will result. Darwin was also influenced by the British geologist Charles Lyell , who realized from his studies of geological formations that the relative ages of deposits could be estimated by means of the proportion of living and extinct mollusks. But it was not until after his travels aboard the Beagle (1831–36), during which he observed a great richness and diversity of island fauna, that Darwin began to develop his theory of evolution. Alfred Russel Wallace had reached conclusions similar to those of Darwin following his studies of plants and animals in the Malay Archipelago. A short paper dealing with this subject sent by Wallace to Darwin finally resulted in the publication of Darwin’s own theories.",
  "Conceptually, the theory was of the utmost significance, accounting as it did for the formation of new species. Following the subsequent discovery of the chromosomal basis of inheritance and the laws of heredity, it could be seen that natural selection does not involve the sharp alternatives of life or death but results from the differential survival of variants. Today the universal principle of natural selection, which is the central concept of Darwin’s theory, is firmly established.",
  "A question posed by Aristotle was whether the embryo is preformed and therefore only enlarges during development or whether it differentiates from an amorphous beginning. Two conflicting schools of thought had been based on that question: the preformation school maintained that the egg contains a miniature individual that develops into the adult stage in the proper environment; the epigenesis school believed that the egg is initially undifferentiated and that development occurs as a series of steps. Prominent supporters of the preformation doctrine, which was widely held until the 18th century, included Malpighi, Swammerdam, and Leeuwenhoek. In the 19th century, as criticism of preformation mounted, the Prussian Estonian embryologist Karl Ernst von Baer provided the final evidence against the theory. His discovery of the mammalian egg and his recognition of the formation of the germ layers out of which the embryonic organs develop laid the foundations of modern embryology.",
  "Despite the many early descriptions of spermatozoa, their essential role in fertilization was not proved until 1879, when the Swiss physician and zoologist Hermann Fol observed the penetration of a spermatozoon into an ovum. Prior to that discovery, during the period from 1823 to 1830, the existence of the sexual process in flowering plants had been demonstrated by the Italian astronomer and optician Giovanni Battista Amici and confirmed by others. The discovery of fertilization in plants was of great importance to the development of plant hybrids, which are produced by cross-pollination between different species; it was also of great significance to the studies of genetics and evolution.",
  "The universal occurrence and remarkable similarity of the fertilization process, regardless of the organism in which it occurs, provoked many of the leading investigators of the time to search for the underlying mechanism. It was realized that there must be some way by which the number of chromosomes is reduced before fertilization; otherwise, the chromosome number would double every time a sperm fused with an egg. In 1883 the Belgian embryologist and cytologist Edouard van Beneden showed that the eggs and the sperm in the worm Ascaris contain half the number of chromosomes found in the body cells. To account for the halving of the chromosomes in the sex cells, a process known as meiosis , in 1887 the German biologist August Weismann suggested that there must be two different types of cell division, and by 1900 the details of meiosis had been elucidated.",
  "The fundamental laws of heredity were discovered in 1865 by the Austrian botanist, teacher, and Augustinian prelate Gregor Mendel , though his work was ignored until its rediscovery in 1900. There were, however, a number of views on the subject that had been expressed long before Mendel. The Greek philosophers, for example, believed that the traits of individuals were acquired from contact with the environment and that such acquired characteristics could be inherited by offspring. Because Lamarck was the most famous proponent of the inheritance of acquired characteristics, the theory is called Lamarckism. This concept, which emphasized the use and disuse of organs as the significant factor in determining the characteristics of an individual, postulated that any alterations in the individual could be transmitted to the offspring through the gametes .",
  "In 1885 Weismann suggested that hereditary characteristics were transmitted by what he called germ plasm—as distinguished from the somatoplasm (body cells)—which linked the generations by a continuous stream of dividing germ cells. In stating definitely seven years later that the material of heredity was in the chromosomes, Weismann anticipated the chromosomal basis of inheritance.",
  "The English explorer, anthropologist, and eugenicist Francis Galton made a number of important contributions to genetics in the 19th century, one of which was a study of the hereditary nature of ability, from which he developed the concept that judicious breeding could improve the human race ( eugenics ). Galton’s most-significant work was the demonstration that each generation of ancestors makes a proportionate contribution to the total makeup of the individual. Thus, he suggested, if a tall man marries a short woman, each should contribute half of the total heritage, and the resultant offspring should be intermediate between the two parents.",
  "The fame of Gregor Mendel, the father of genetics, rests on experiments he did with garden peas, which possess sharply contrasting characteristics—for example, tall versus short; round seed versus wrinkled seed. When Mendel fertilized short plants with pollen from tall plants, he found the offspring (first filial generation) to be uniformly tall. But if he allowed the plants of that generation to self-pollinate (fertilize themselves), their offspring (the second filial generation) exhibited the characters of the grandparents in a rather consistent ratio of three tall to one short. Furthermore, if allowed to self-pollinate, the short plants always bred true—they never produced anything but short plants. From those results Mendel developed the concept of dominance , based on the supposition that each plant carried two trait units, one of which dominated the other. Nothing was known at that time about chromosomes or meiosis, yet Mendel deduced from his results that the trait units, later called genes , could be a kind of physical particle that was transmitted from one generation to another through the reproductive mechanism.",
  "Mendel’s most-important concept was the idea that the paired genes present in the parent separate or segregate during the formation of the gametes. Moreover, in later experiments in which he studied the inheritance of two pairs of traits, Mendel showed that one pair of genes is independent of another. Thus, the principles of segregation and of independent assortment were established.",
  "Mendel’s findings were ignored for 35 years, probably for two reasons. Because the distinguished Swiss botanist Karl Wilhelm von Nägeli failed to recognize the significance of the work after Mendel sent him the results, he did nothing to encourage Mendel. Nägeli’s great prestige and the lack of his endorsement indirectly weighed against widespread recognition of Mendel’s work. Moreover, when the work was published, little was known about the cell, and the processes of mitosis and meiosis were completely unknown. Mendel’s work was finally rediscovered in 1900, when three botanists independently recognized the worth of his studies from their own research and cited his publication in their work.",
  "By 1901 it was understood how the hereditary units postulated by Mendel are distributed; it was also known that the somatic (body) cells have a double, or diploid, complement of chromosomes, while the reproductive cells have a single, or haploid, chromosome number. The experimental demonstration of the chromosomal basis for heredity had been firmly established by the German cytologist Theodor Boveri soon after the turn of the century and subsequently confirmed by others. To account for the large number of observed hereditary characters, Boveri suggested that each chromosome in a pair can exchange the hereditary factors it carries with those of the other chromosome. At first, the American geneticist Thomas Hunt Morgan dismissed that concept. Later, however, when he found that it agreed with his own laboratory findings, Morgan and his collaborators assigned the hereditary units (genes) specific positions, or loci, within the chromosomes. With the genes established as the carriers of hereditary traits, the English biologist William Bateson coined the term genetics for the experimental study of heredity and evolution.",
  "Just as the 19th century can be considered the age of cellular biology, the 20th and 21st centuries were characterized primarily by developments in molecular biology .",
  "By utilizing modern methods of investigation, such as X-ray diffraction and electron microscopy , to explore levels of cellular organization beyond that visible with a light microscope—the ultrastructure of the cell—new concepts of cellular function were produced. As a result, the study of the molecular organization of the cell had tremendous impact on biology during the 20th and 21st centuries. It also led directly to the convergence of many different scientific disciplines in order to acquire a better understanding of life processes.",
  "  Technologies such as DNA sequencing and the polymerase chain reaction also were developed, allowing biologists to peer into the genetic blueprints that give rise to organisms. First-generation sequencing technologies emerged in the 1970s and were followed several decades later by so-called next-generation sequencing technologies, which were superior in speed and cost-efficiency. Next-generation sequencing provided researchers with massive amounts of genetic data, typically gigabases in size (1 gigabase = 1,000,000,000 base pairs of DNA). Bioinformatics , which linked biological data with tools and techniques for data analysis, storage, and distribution, became an increasingly important part of biological studies, particularly those involving very large sets of genetic data.",
  "  In the 1970s the development of recombinant DNA technology opened the way to genetic engineering , which enabled researchers to recombine nucleic acids and thereby modify organisms’ genetic codes, giving the organisms new abilities or eliminating undesirable traits. Those developments were followed by advances in cloning technologies, which led to the generation in 1996 of Dolly the sheep, the first clone of an adult mammal. Together, recombinant DNA technology and reproductive cloning (the method used to produce a living animal clone) facilitated great progress in the development of genetically modified organisms (GMOs). Such organisms became crucial components of biomedical research, where genetically modified (GM) mice and other animals were developed to model certain human diseases, thereby facilitating the investigation of new therapies and the factors that cause disease. Recombinant DNA technology played a crucial role in the generation of GM crops, including pest-resistant forms of cotton and herbicide-resistant forms of maize (corn) and soybeans.",
  "In the 1990s and early 2000s, researchers worldwide increasingly came together in consortiums and other collaborative groups to accomplish major feats in biology. The first major success of those efforts was the sequencing of the human genome , which was accomplished through the Human Genome Project (HGP). The HGP began in 1990, supported by the U.S. Department of Energy and the National Institutes of Health (NIH). NIH researchers later joined forces with Celera Genomics, a private-sector enterprise, and the project was completed in 2003. Other collaborative projects soon followed, including the International HapMap Project , an outgrowth of the HGP, and the 1000 Genomes Project , which built on data from the HapMap effort.",
  "The 20th and 21st centuries also saw major advances in areas of biology dealing with ecosystems , the environment, and conservation . In the 20th century, scientists realized that humans are as dependent upon Earth’s natural resources as are other animals. However, humans were contributing to the progressive destruction of the environment, in part because of an increase in population pressure and certain technological advances. Lifesaving advances in medicine, for example, had allowed people to live longer and resulted in a dramatic drop in death rates (primarily in developed countries), contributing to an explosive increase in the human population. Chemical contaminants introduced into the environment by manufacturing processes, pesticides , automobile emissions, and other means seriously endangered all forms of life. Hence, biologists began to pay much greater attention to the relationships of living things to each other as well as to their biotic and abiotic environments.",
  "The growing significance of climate change and its impact on ecosystems fueled advances in ecology, as well as the development of fields such as conservation biology and conservation genetics. As in almost every other area of biology, molecular biology came to fulfill an important role in those fields, with techniques such as whole genome sequencing being used to gather information on the genetic diversity of populations of endangered species and techniques such as cloning and genome editing raising the possibility of someday resurrecting extinct species (a process known as de-extinction ). Information on the DNA sequences of a wide range of species also aided progress in scientists’ understanding of evolution and systematics (the study of evolutionary relationships and the diversification of life).",
  "  By the 21st century, there were many important categories in the biological sciences and hence numerous specialties within fields. Botany, zoology, and microbiology dealt with types of organisms and their relationships with each other. Such disciplines had long been subdivided into more-specialized categories—for example, ichthyology , the study of fishes , and algology, the study of algae . Disciplines such as embryology and physiology, which dealt with the development and function of an organism, were divided further according to the kind of organism studied—for example, invertebrate embryology and mammalian physiology. Many developments in physiology and embryology had resulted from studies in cell biology, biophysics, and biochemistry . Likewise, research in cell physiology and cytochemistry, along with ultrastructural studies, helped scientists correlate cell structure with function. Ecology, which focused on relationships between organisms and their environment, included both the physical features of the environment and other organisms that may compete for food and shelter. Emphasis on different environments and certain features of organisms resulted in the subdivision of the field into a range of specialties, such as freshwater ecology, marine ecology, and population ecology .",
  "Many areas of study in the biological sciences cross the boundaries that traditionally separated the various branches of the sciences. In biophysics, for example, researchers apply the principles and methods of physics to investigate and find solutions to problems in biology. Evolutionary biologists and paleontologists are familiar with the principles of geology and may even work closely with geologists while attempting to determine the age of biological remains. Likewise, anthropologists and archaeologists apply knowledge of human culture and society to biological findings in order to more fully understand humankind. Astrobiology arose through the activities of the scientists and engineers concerned with the exploration of space . As a result, the field of biology has received contributions from and made contributions to many other disciplines, in the humanities as well as in the sciences.",
  "Through the 20th and 21st centuries, as biology became increasingly interconnected with other areas of science, it also came to encompass a number of disciplines itself. In some of those disciplines, multiple levels of organization were recognized—for example, population biology (the study of populations of living things) and organismic biology (the study of the whole organism) and cell biology and molecular biology. In the latter part of the 20th century, molecular biology spawned still more disciplines, and the advent of genomics led to the emergence of sophisticated subdisciplines, such as developmental genomics and functional genomics. Genetics continued to expand, giving rise to new areas such as conservation genetics. Despite their diverse scope, however, in the 21st century many areas of the biological sciences continued to draw on common unifying principles and ideas, particularly those that were central to taxonomy, genetics, and evolution.",
  "In the 20th and 21st centuries, biologists’ role in society as well as their moral and ethical responsibility in the discovery and development of new ideas led to a reassessment of individual social and scientific value systems. Scientists cannot afford to ignore the consequences of their discoveries; they are as concerned with the possible misuses of their findings as they are with the basic research in which they are involved. In the 20th century, the emerging social and political role of the biologist and all other scientists required a weighing of values that could not be done with the accuracy or objectivity of a laboratory balance. As members of society, it became necessary for biologists to redefine their social obligations and functions, particularly in the realm of making judgments about ethical problems, such as human control of the environment or the manipulation of genes to direct further evolutionary development.",
  "Of particular consequence in the biological sciences was the development of genetic engineering. In cases of genetic deficiencies and disease, genetic engineering opened up the possibility of correcting gene defects to restore physiological function, potentially improving patients’ quality of life. Gene therapy , in which a normal gene would be introduced into an individual’s genome in order to repair a disease-causing mutation , was one means by which researchers could potentially achieve that goal. However, the possibilities for misuse of genetic engineering were vast. There was significant concern, for example, about genetically modified organisms, particularly modified crops, and their impacts on human and environmental health. The emergence of cloning technologies, including somatic cell nuclear transfer , also raised concerns. The Declaration on Human Cloning passed in 2005 by the United Nations called upon member states to prohibit the cloning of humans, though it left open the pursuit of therapeutic cloning.",
  "Similarly, in 2015, researchers who had developed technologies for gene editing, which enabled scientists to customize an organism’s genetic makeup by altering specific bases in its DNA sequence, called for a moratorium on the application of the technologies in humans. The impacts of gene editing on human genetics were unknown, and there were no regulations in place to guide its use. Indeed, in the absence of strict regulation, a Chinese scientist moved forward with gene editing in humans, in late 2018 claiming the birth of the world’s first babies carrying edited genomes. The scientist claimed to have edited human embryos to disable a gene that normally facilitates the entry of HIV into cells; the embryos were then implanted into a woman and carried to term. Meanwhile, researchers in the United States attempted to use gene editing to alter genes in human sperm , which would enable the edited genes to be passed on to subsequent generations. In particular, the researchers sought to alter genes that increase the risk of certain types of cancer , with the aim of reducing cancer risk in offspring. The debate over gene editing renewed earlier discussions about the ethical and social impacts of genetic engineering in humans, especially its potential to be used to alter traits such as intelligence and appearance.",
  "Other challenges confronting biologists included the search for ways to curb environmental pollution without interfering with efforts to improve the quality of life for humankind. Contributing to the problem of pollution was the problem of surplus human population. A rise in global human population had placed greater demands on the land, especially in the area of food production, and had necessitated increases in the operations of modern industry, the waste products of which contributed to the pollution of air, water, and soil. To find solutions to global warming, pollution, and other environmental problems, biologists worked with social scientists and other members of society in order to determine the requirements necessary for maintaining a healthy and productive planet. For although many of humankind’s present and future problems may seem to be essentially social, political, or economic in nature, they have biological ramifications that could affect the very existence of life itself.",
  "The basic concepts of biology are addressed in David E. Sadava et al., Life: The Science of Biology , 10th ed. (2014); Neil A. Campbell et al., Biology , 9th ed. (2011); and Kenneth A. Mason et al., Biology , 10th ed. (2014). Areas of scientific investigation grounded in biological concepts are explored in Bruce Alberts et al., Molecular Biology of the Cell , 6th ed. (2015); Fred C. Boogerd et al. (eds.), Systems Biology: Philosophical Foundations (2007); Roland Glaser , Biophysics: An Introduction , 2nd ed. (2012); and John D. Enderle and Joseph D. Bronzino (eds.), Introduction to Biomedical Engineering , 3rd ed. (2011). Peter Godfrey-Smith , Philosophy of Biology (2014), examines the fundamental laws and concepts of biology.",
  " Jacques Monod , Chance and Necessity: An Essay on the Natural Philosophy of Modern Biology (1971; originally published in French, 1970); François Jacob , The Possible and the Actual (1982, reissued 1994); and André Lwoff , Biological Order (1962), combine the authors’ perspectives of living systems, with special reference to those systems’ genetic foundations, and their quasi-philosophical thoughts about the nature of living organisms. Lewis Thomas , The Lives of a Cell: Notes of a Biology Watcher (1974, reissued 1986), contains many noteworthy biological insights. Edward D. Garber (ed.), Genetic Perspectives in Biology and Medicine (1985), details some of the ways in which knowledge of the molecular genetics of cells and the new technologies thereby inspired made major contributions to medicine. Stephen Jay Gould , The Panda’s Thumb: More Reflections in Natural History (1980, reissued 1992), is an interesting collection of essays on natural history.",
  "Publications concerned with the history and philosophy of biology include Charles Singer , A History of Biology , rev. ed. (1950), a highly readable classic that surveys the historical development of biological problems; Mordecai L. Gabriel and Seymour Fogel (eds.), Great Experiments in Biology (1955), a presentation of scientific writings from Robert Hooke to the 20th century; Bentley Glass , Progress or Catastrophe: The Nature of Biological Science and Its Impact on Human Society (1985), a philosophical text for the intellectual reader; Alexander Rosenberg , The Structure of Biological Science (1985), an advanced, complex philosophical discourse on the discipline of biology and its intellectual status among the more physical sciences such as physics and chemistry; Arthur M. Silverstein , A History of Immunology 2nd ed., (2009), a scholarly history of immunological concepts and topics up to the early 1960s; and Anthony Serafini , The Epic History of Biology (1993). William Coleman , Biology in the Nineteenth Century (1971, reprinted 1990), gives special attention to morphology and physiology. Garland E. Allen , Life Science in the Twentieth Century (1975), emphasizes the growth of molecular biology. Peter J. Bowler , Evolution: The History of an Idea , 3rd ed. (2003), surveys evolutionary ideas through Darwin."
]