[
  " Zenaida macroura Zenaida macroura  ecology , also called bioecology  , bionomics , or environmental biology , study of the relationships between organisms and their environment. Some of the most pressing problems in human affairs—expanding populations, food scarcities, environmental pollution including global warming, extinctions of plant and animal species, and all the attendant sociological and political problems—are to a great degree ecological.",
  " c.  The word ecology was coined by the German zoologist Ernst Haeckel , who applied the term oekologie to the “relation of the animal both to its organic as well as its inorganic environment.” The word comes from the Greek oikos , meaning “household,” “home,” or “place to live.” Thus, ecology deals with the organism and its environment. The concept of environment includes both other organisms and physical surroundings. It involves relationships between individuals within a population and between individuals of different populations. These interactions between individuals, between populations, and between organisms and their environment form ecological systems, or ecosystem s. Ecology has been defined variously as “the study of the interrelationships of organisms with their environment and each other,” as “the economy of nature,” and as “the biology of ecosystems.”",
  "Ecology had no firm beginnings. It evolved from the natural history of the ancient Greeks, particularly Theophrastus , a friend and associate of Aristotle. Theophrastus first described the interrelationships between organisms and between organisms and their nonliving environment. Later foundations for modern ecology were laid in the early work of plant and animal physiologists.",
  "In the early and mid-1900s two groups of botanists, one in Europe and the other in the United States, studied plant communities from two different points of view. The European botanists concerned themselves with the study of the composition, structure, and distribution of plant communities. The American botanists studied the development of plant communities, or succession ( see  community ecology: Ecological succession ). Both plant and animal ecology developed separately until American biologists emphasized the interrelation of both plant and animal communities as a biotic whole.",
  "  During the same period, interest in population dynamics developed. The study of population dynamics received special impetus in the early 19th century, after the English economist Thomas Malthus called attention to the conflict between expanding populations and the capability of Earth to supply food. In the 1920s the American zoologist Raymond Pearl, the American chemist and statistician Alfred J. Lotka, and the Italian mathematician Vito Volterra developed mathematical foundations for the study of populations, and these studies led to experiments on the interaction of predators and prey, competitive relationships between species, and the regulation of populations. Investigations of the influence of behaviour on populations were stimulated by the recognition in 1920 of territoriality in nesting birds. Concepts of instinctive and aggressive behaviour were developed by the Austrian zoologist Konrad Lorenz and the Dutch-born British zoologist Nikolaas Tinbergen , and the role of social behaviour in the regulation of populations was explored by the British zoologist Vero Wynne-Edwards. ( See  population ecology .)",
  "While some ecologists were studying the dynamics of communities and populations, others were concerned with energy budgets. In 1920 August Thienemann, a German freshwater biologist, introduced the concept of trophic, or feeding, levels ( see  trophic level ), by which the energy of food is transferred through a series of organisms, from green plants (the producers) up to several levels of animals (the consumers). An English animal ecologist, Charles Elton (1927), further developed this approach with the concept of ecological niche s and pyramids of numbers. In the 1930s, American freshwater biologists Edward Birge and Chancey Juday, in measuring the energy budgets of lakes, developed the idea of primary productivity, the rate at which food energy is generated, or fixed, by photosynthesis . In 1942 Raymond L. Lindeman of the United States developed the trophic-dynamic concept of ecology, which details the flow of energy through the ecosystem. Quantified field studies of energy flow through ecosystems were further developed by the brothers Eugene Odum and Howard Odum of the United States; similar early work on the cycling of nutrients was done by J.D. Ovington of England and Australia. ( See  community ecology: Trophic pyramids and the flow of energy ; biosphere: The flow of energy and nutrient cycling .)",
  "The study of both energy flow and nutrient cycling was stimulated by the development of new materials and techniques—radioisotope tracers, microcalorimetry, computer science, and applied mathematics—that enabled ecologists to label, track, and measure the movement of particular nutrients and energy through ecosystems. These modern methods ( see below  Methods in ecology ) encouraged a new stage in the development of ecology—systems ecology, which is concerned with the structure and function of ecosystems.",
  "Ecology is necessarily the union of many areas of study because its definition is so all-encompassing. There are many kinds of relationships between organisms and their environment. By organisms one might mean single individuals, groups of individuals, all the members of one species, the sum of many species, or the total mass of species ( biomass ) in an ecosystem. And the term environment includes not only physical and chemical features but also the biological environment, which involves yet more organisms.",
  "In practice, ecology is composed of broadly overlapping approaches and further divided by the groups of species to be studied. There are many, for example, who specialize in the field of “bird behavioral ecology.” The main approaches fall into the following classes.",
  " Biston betularia Biston betularia  Biston betularia Biston betularia   Evolutionary ecology examines the environmental factors that drive species adaptation. Studies of the evolution of species might seek to answer the question of how populations have changed genetically over several generations but might not necessarily attempt to learn what the underlying mechanisms might be. Evolutionary ecology seeks those mechanisms. Thus, in the well-known example of the peppered moth , the populations in the industrialized English Midlands changed over generations from having wings coloured largely grayish white, peppered with black spots, to wings that were mostly blackish. The ecological mechanism involved predation—birds readily detected the light-coloured moths against the background of the tree trunks that industrial pollution had darkened, whereas the dark-coloured moths remained generally undetected.",
  "Evolutionary ecology also examines broader issues, such as the observations that plants in arid environments often have no leaves or else very small ones or that some species of birds have helpers at the nest—individuals that raise young other than their own. A critical question for the subject is whether a set of adaptations arose once and has simply been retained by all species descended from a common ancestor having those adaptations or whether the adaptations evolved repeatedly because of the same environmental factors. In the case of plants that live in arid environments, cacti from the New World and euphorbia ( see  spurge ) from the Old World can look strikingly similar even though they are in unrelated plant families.",
  "Physiological ecology asks how organisms survive in their environments. There is often an emphasis on extreme conditions, such as very cold or very hot environments or aquatic environments with unusually high salt concentrations. Examples of the questions it may explore are: How do some animals flourish in the driest deserts, where temperatures are often high and freestanding water is never available? How do bacteria survive in hot springs, such as those in Yellowstone National Park in the western United States, that would cook most species? How do nematode s live in the soils of dry valleys in Antarctica? Physiological ecology looks at the special mechanisms that the individuals of a species use to function and at the limits on species imposed by the environment.",
  "Behavioral ecology examines the ecological factors that drive behavioral adaptations. The subject considers how individuals find their food and avoid their enemies. For example, why do some birds migrate ( see  migration ) while others are resident? Why do some animals, such as lion s, live in groups while others, such as tiger s, are largely solitary?",
  " Population ecology , or autecology, examines single species. One immediate question that the subject addresses is why some species are rare while others are abundant. Interactions with other species may supply some of the answers. For example, enemies of a species can restrict its numbers, and those enemies include predators, disease organisms, and competitors—i.e., other species. Consequently, population ecology shares an indefinite boundary with community ecology , a subject that examines the interactions between several to many species. Species abundances vary both from year to year and across the species’ geographic range. Population ecology asks what causes abundances to fluctuate. Why, for example, do numbers of some species, typically birds and mammals, change perhaps threefold or fourfold over a decade or so, while numbers of other species, typically insects, vary tenfold to a hundredfold from one year to the next? Another key question is what limits abundance, for, without limits, species numbers would grow exponentially.",
  " Biogeography is the study of the geographical distribution of organisms, and it asks questions that parallel those of population ecology. Some species have tiny geographical ranges, being restricted to perhaps only a few square kilometres, while other species have ranges that cover a continent. Some species have more-or-less fixed geographical ranges, while others fluctuate, and still others are on the increase. If a species that is spreading is an agricultural pest, a disease organism, or a species that carries a disease, understanding the reasons for the increasing range may be a matter of considerable economic importance. Biogeography also considers the ranges of many species, asking why, for example, species with small geographic ranges are often found in special places that house many such species rather than scattered randomly about the planet.",
  "Community ecology, or synecology, considers the ecology of communities , the set of species found in a particular place. Because the complete set of species for a particular place is usually not known, community ecology often focuses on subsets of organisms, asking questions, for example, about plant communities or insect communities. A fundamental question deals with the size of the “set of species”—that is, what ecological factors determine how many species are present in an area. There are many large-scale patterns; for example, more species are present in larger areas than smaller ones, more on continents than on islands (especially remote ones), and more in the tropics than in the Arctic. There are many hypotheses for each pattern. Ecological factors also cause the diversity of species to vary over smaller scales. For example, though predators may be harmful to individual species, the presence of a predator may actually increase the number of species present in a community by limiting the numbers of a particularly successful competitor that otherwise might monopolize all the available space or resources.",
  "The questions above are generally applied to species at the same trophic level—say, the plants in a community, or the insects that feed on the plants there, or the birds that feed on the insects there. Yet a different set of questions in community ecology involves how many trophic levels there are in a particular place and what factors limit that number.",
  " Conservation biology seeks to understand what factors predispose species to extinction and what humans can do about preventing extinction. Species in danger of extinction are often those with the smallest geographic ranges or the smallest population sizes, but other ecological factors are also involved.",
  "Ecosystem ecology examines large-scale ecological issues, ones that often are framed in terms not of species but rather of measures such as biomass, energy flow, and nutrient cycling. Questions include how much carbon is absorbed from the atmosphere by terrestrial plants and marine phytoplankton during photosynthesis and how much of that is consumed by herbivore s, the herbivores’ predators, and so on up the food chain . Carbon is the basis of life ( see  carbon cycle ), so these questions may be framed in terms of energy. How much food one has to eat each day, for instance, can be measured in terms of its dry weight or its calorie content. The same applies to measures of production for all the plants in an ecosystem or for different trophic levels of an ecosystem. A basic question in ecosystem ecology is how much production there is and what the factors are that affect it. Not surprisingly, warm, wet places such as rainforest s produce more than extremely cold or dry places, but other factors are important. Nutrients are essential and may be in limited supply. The availability of phosphorus and nitrogen often determines productivity—it is the reason these substances are added to lawns and crops—and their availability is particularly important in aquatic systems. On the other hand, nutrients can represent too much of a good thing. Human activity has modified global ecosystems in ways that are increasing atmospheric carbon dioxide , a carbon source but also a greenhouse gas ( see  greenhouse effect ), and causing excessive runoff of fertilizers into rivers and then into the ocean, where it kills the species that live there.",
  "Because ecologists work with living systems possessing numerous variables, the scientific techniques used by physicists, chemists, mathematicians, and engineers require modification for use in ecology. Moreover, the techniques are not as easily applied in ecology, nor are the results as precise as those obtained in other sciences. It is relatively simple, for example, for a physicist to measure gain and loss of heat from metals or other inanimate objects, which possess certain constants of conductivity, expansion, surface features, and the like. To determine the heat exchange between an animal and its environment, however, a physiological ecologist is confronted with an array of almost unquantifiable variables and with the formidable task of gathering the numerous data and analyzing them. Ecological measurements may never be as precise or subject to the same ease of analysis as measurements in physics, chemistry, or certain quantifiable areas of biology.",
  "In spite of these problems, various aspects of the environment can be determined by physical and chemical means, ranging from simple chemical identifications and physical measurements to the use of sophisticated mechanical apparatus. The development of biostatistics (statistics applied to the analysis of biological data), the elaboration of proper experimental design, and improved sampling methods now permit a quantified statistical approach to the study of ecology. Because of the extreme difficulties of controlling environmental variables in the field, studies involving the use of experimental design are largely confined to the laboratory and to controlled field experiments designed to test the effects of only one variable or several variables. The use of statistical procedures and computer models based on data obtained from the field provide insights into population interactions and ecosystem functions. Mathematical programming models are becoming increasingly important in applied ecology, especially in the management of natural resources and agricultural problems having an ecological basis.",
  "Controlled environmental chambers enable experimenters to maintain plants and animals under known conditions of light, temperature, humidity, and day length so that the effects of each variable (or combination of variables) on the organism can be studied. Biotelemetry and other electronic tracking equipment, which allow the movements and behaviour of free-ranging organisms to be followed remotely, can provide rapid sampling of populations. Radioisotopes are used for tracing the pathways of nutrients through ecosystems, for determining the time and extent of transfer of energy and nutrients through the different components of the ecosystem, and for the determination of food chains. The use of laboratory microcosms—aquatic and soil micro-ecosystems, consisting of biotic and nonbiotic material from natural ecosystems, held under conditions similar to those found in the field—are useful in determining rates of nutrient cycling, ecosystem development, and other functional aspects of ecosystems. Microcosms enable the ecologist to duplicate experiments and to perform experimental manipulation on them.",
  "Overviews are provided in Michael Begon , Colin R. Townsend , and John L. Harper , Ecology: From Individuals to Ecosystems , 4th ed. (2006); Robert E. Ricklefs and Gary L. Miller , Ecology , 4th ed. (1999); Robert E. Ricklefs , The Economy of Nature , 5th ed. (2001); Charles J. Krebs , Ecology: The Experimental Analysis of Distribution and Abundance , 5th ed. (2001); and David T. Krohne , General Ecology , 2nd ed. (2001). W.C. Allee et al., Principles of Animal Ecology (1949), is a dated but still important sourcebook that includes an excellent early history of ecology.",
  " Robert Leo Smith and Thomas M. Smith , Ecology & Field Biology , 6th ed. (2001), offers a comprehensive survey of all aspects of ecology. Norman Myers and Jennifer Kent (eds.), The New Atlas of Planet Management (2005), thoroughly surveys the state of the environment. Peter J. Bowler , The Fontana History of the Environmental Sciences (1992, reissued as The Earth Encompassed , 2000; also published as The Norton History of the Environmental Sciences , 1993), is a comprehensive survey from the Greeks to the present. Donald Worster , Nature’s Economy: A History of Ecological Ideas , 2nd ed. (1994), explores changing ideas about ecology from the 18th century to the present."
]