[
  " genetics , study of heredity in general and of genes in particular. Genetics forms one of the central pillars of biology and overlaps with many other areas, such as agriculture, medicine , and biotechnology .",
  "Since the dawn of civilization, humankind has recognized the influence of heredity and applied its principles to the improvement of cultivated crops and domestic animals. A Babylonian tablet more than 6,000 years old, for example, shows pedigree s of horses and indicates possible inherited characteristics. Other old carvings show cross- pollination of date palm trees. Most of the mechanisms of heredity, however, remained a mystery until the 19th century, when genetics as a systematic science began.",
  "Genetics arose out of the identification of genes, the fundamental units responsible for heredity. Genetics may be defined as the study of gene s at all levels, including the ways in which they act in the cell and the ways in which they are transmitted from parents to offspring. Modern genetics focuses on the chemical substance that genes are made of, called deoxyribonucleic acid, or DNA , and the ways in which it affects the chemical reactions that constitute the living processes within the cell. Gene action depends on interaction with the environment. Green plant s, for example, have genes containing the information necessary to synthesize the photosynthetic pigment chlorophyll that gives them their green colour. Chlorophyll is synthesized in an environment containing light because the gene for chlorophyll is expressed only when it interacts with light. If a plant is placed in a dark environment, chlorophyll synthesis stops because the gene is no longer expressed.",
  "Genetics as a scientific discipline stemmed from the work of Gregor Mendel in the middle of the 19th century. Mendel suspected that traits were inherited as discrete units, and, although he knew nothing of the physical or chemical nature of genes at the time, his units became the basis for the development of the present understanding of heredity. All present research in genetics can be traced back to Mendel’s discovery of the laws governing the inheritance of traits. The word genetics was introduced in 1905 by English biologist William Bateson , who was one of the discoverers of Mendel’s work and who became a champion of Mendel’s principles of inheritance.",
  "Although scientific evidence for patterns of genetic inheritance did not appear until Mendel’s work, history shows that humankind must have been interested in heredity long before the dawn of civilization. Curiosity must first have been based on human family resemblances, such as similarity in body structure, voice, gait, and gestures. Such notions were instrumental in the establishment of family and royal dynasties. Early nomadic tribes were interested in the qualities of the animals that they herded and domesticated and, undoubtedly, bred selectively. The first human settlements that practiced farming appear to have selected crop plants with favourable qualities. Ancient tomb paintings show racehorse breeding pedigrees containing clear depictions of the inheritance of several distinct physical traits in the horses. Despite this interest, the first recorded speculations on heredity did not exist until the time of the ancient Greeks; some aspects of their ideas are still considered relevant today.",
  " Hippocrates ( c. 460– c. 375 bce ), known as the father of medicine, believed in the inheritance of acquired characteristics, and, to account for this, he devised the hypothesis known as pangenesis. He postulated that all organs of the body of a parent gave off invisible “seeds,” which were like miniaturized building components and were transmitted during sexual intercourse, reassembling themselves in the mother’s womb to form a baby.",
  " Aristotle (384–322 bce ) emphasized the importance of blood in heredity. He thought that the blood supplied generative material for building all parts of the adult body, and he reasoned that blood was the basis for passing on this generative power to the next generation. In fact, he believed that the male’s semen was purified blood and that a woman’s menstrual blood was her equivalent of semen. These male and female contributions united in the womb to produce a baby. The blood contained some type of hereditary essences, but he believed that the baby would develop under the influence of these essences, rather than being built from the essences themselves.",
  "Aristotle’s ideas about the role of blood in procreation were probably the origin of the still prevalent notion that somehow the blood is involved in heredity. Today people still speak of certain traits as being “in the blood” and of “blood lines” and “blood ties.” The Greek model of inheritance, in which a teeming multitude of substances was invoked, differed from that of the Mendelian model. Mendel’s idea was that distinct differences between individuals are determined by differences in single yet powerful hereditary factors. These single hereditary factors were identified as genes. Copies of genes are transmitted through sperm and egg and guide the development of the offspring. Genes are also responsible for reproducing the distinct features of both parents that are visible in their children.",
  "In the two millennia between the lives of Aristotle and Mendel , few new ideas were recorded on the nature of heredity . In the 17th and 18th centuries the idea of preformation was introduced. Scientists using the newly developed microscope s imagined that they could see miniature replicas of human beings inside sperm heads. French biologist Jean-Baptiste Lamarck invoked the idea of “the inheritance of acquired characters,” not as an explanation for heredity but as a model for evolution . He lived at a time when the fixity of species was taken for granted, yet he maintained that this fixity was only found in a constant environment. He enunciated the law of use and disuse, which states that when certain organs become specially developed as a result of some environmental need, then that state of development is hereditary and can be passed on to progeny. He believed that in this way, over many generations, giraffe s could arise from deerlike animals that had to keep stretching their necks to reach high leaves on trees.",
  "British naturalist Alfred Russel Wallace originally postulated the theory of evolution by natural selection . However, Charles Darwin ’s observations during his circumnavigation of the globe aboard the HMS  Beagle  (1831–36) provided evidence for natural selection and his suggestion that humans and animals shared a common ancestry. Many scientists at the time believed in a hereditary mechanism that was a version of the ancient Greek idea of pangenesis, and Darwin’s ideas did not appear to fit with the theory of heredity that sprang from the experiments of Mendel.",
  "Before Gregor Mendel , theories for a hereditary mechanism were based largely on logic and speculation, not on experimentation. In his monastery garden, Mendel carried out a large number of cross-pollination experiments between variants of the garden pea, which he obtained as pure-breeding lines. He crossed peas with yellow seeds to those with green seeds and observed that the progeny seeds (the first generation, F 1 ) were all yellow. When the F 1 individuals were self-pollinated or crossed among themselves, their progeny (F 2 ) showed a ratio of 3:1 (3/4 yellow and 1/4 green). He deduced that, since the F 2 generation contained some green individuals, the determinants of greenness must have been present in the F 1 generation, although they were not expressed because yellow is dominant over green. From the precise mathematical 3:1 ratio (of which he found several other examples), he deduced not only the existence of discrete hereditary units (genes) but also that the units were present in pairs in the pea plant and that the pairs separated during gamete formation. Hence, the two original lines of pea plants were proposed to be Y  Y (yellow) and y  y (green). The gametes from these were Y and y , thereby producing an F 1 generation of Y  y that were yellow in colour because of the dominance of Y . In the F 1 generation, half the gametes were Y and the other half were y , making the F 2 generation produced from random mating 1/4 Y  y , 1/2 Y  Y , and 1/4 y  y , thus explaining the 3:1 ratio. The forms of the pea colour genes, Y and y , are called alleles .",
  "Mendel also analyzed pure lines that differed in pairs of characters, such as seed colour (yellow versus green) and seed shape (round versus wrinkled). The cross of yellow round seeds with green wrinkled seeds resulted in an F 1 generation that were all yellow and round, revealing the dominance of the yellow and round traits. However, the F 2 generation produced by self-pollination of F 1 plants showed a ratio of 9:3:3:1 (9/16 yellow round, 3/16 yellow wrinkled, 3/16 green round, and 1/16 green wrinkled; note that a 9:3:3:1 ratio is simply two 3:1 ratios combined). From this result and others like it, he deduced the independent assortment of separate gene pairs at gamete formation.",
  "Mendel’s success can be attributed in part to his classic experimental approach. He chose his experimental organism well and performed many controlled experiments to collect data. From his results, he developed brilliant explanatory hypotheses and went on to test these hypotheses experimentally. Mendel’s methodology established a prototype for genetics that is still used today for gene discovery and understanding the genetic properties of inheritance.",
  "  Mendel’s genes were only hypothetical entities, factors that could be inferred to exist in order to explain his results. The 20th century saw tremendous strides in the development of the understanding of the nature of gene s and how they function. Mendel’s publications lay unmentioned in the research literature until 1900, when the same conclusions were reached by several other investigators. Then there followed hundreds of papers showing Mendelian inheritance in a wide array of plants and animals, including humans. It seemed that Mendel’s ideas were of general validity. Many biologists noted that the inheritance of genes closely paralleled the inheritance of chromosome s during nuclear divisions, called meiosis , that occur in the cell divisions just prior to gamete formation.",
  " Drosophila  It seemed that genes were parts of chromosomes. In 1910 this idea was strengthened through the demonstration of parallel inheritance of certain  Drosophila  (a type of fruit fly) genes on sex-determining chromosomes by American zoologist and geneticist Thomas Hunt Morgan . Morgan and one of his students, Alfred Henry Sturtevant , showed not only that certain genes seemed to be linked on the same chromosome but that the distance between genes on the same chromosome could be calculated by measuring the frequency at which new chromosomal combinations arose (these were proposed to be caused by chromosomal breakage and reunion, also known as crossing over). In 1916 another student of Morgan’s, Calvin Bridges , used fruit flies with an extra chromosome to prove beyond reasonable doubt that the only way to explain the abnormal inheritance of certain genes was if they were part of the extra chromosome. American geneticist Hermann Joseph Müller showed that new alleles (called mutation s) could be produced at high frequencies by treating cells with X-rays , the first demonstration of an environmental mutagenic agent (mutations can also arise spontaneously). In 1931 American botanist Harriet Creighton and American scientist Barbara McClintock demonstrated that new allelic combinations of linked genes were correlated with physically exchanged chromosome parts.",
  "In 1908 British physician Archibald Garrod proposed the important idea that the human disease alkaptonuria , and certain other hereditary diseases, were caused by inborn errors of metabolism , suggesting for the first time that linked genes had molecular action at the cell level. Molecular genetics did not begin in earnest until 1941 when American geneticist George Beadle and American biochemist Edward Tatum showed that the genes they were studying in the fungus Neurospora crassa acted by coding for catalytic proteins called enzymes . Subsequent studies in other organisms extended this idea to show that genes generally code for protein s. Soon afterward, American bacteriologist Oswald Avery , Canadian American geneticist Colin M. MacLeod, and American biologist Maclyn McCarty showed that bacterial genes are made of DNA, a finding that was later extended to all organisms.",
  "  A major landmark was attained in 1953 when American geneticist and biophysicist James D. Watson and British biophysicists Francis Crick and Maurice Wilkins devised a double helix model for DNA structure. Their breakthrough was made possible by the work of British scientist Rosalind Franklin , whose X-ray diffraction studies of the DNA molecule shed light on its helical structure. The double helix model showed that DNA was capable of self-replication by separating its complementary strands and using them as templates for the synthesis of new DNA molecules. Each of the intertwined strands of DNA was proposed to be a chain of chemical groups called nucleotide s, of which there were known to be four types. Because proteins are strings of amino acid s, it was proposed that a specific nucleotide sequence of DNA could contain a code for an amino acid sequence and hence protein structure. In 1955 American molecular biologist Seymour Benzer , extending earlier studies in  Drosophila  , showed that the mutant sites within a gene could be mapped in relation to each other. His linear map indicated that the gene itself is a linear structure.",
  "In 1958 the strand-separation method for DNA replication (called the semiconservative method) was demonstrated experimentally for the first time by American molecular biologist Matthew Meselson and American geneticist Franklin W. Stahl . In 1961 Crick and South African biologist Sydney Brenner showed that the genetic code must be read in triplets of nucleotides, called codons. American geneticist Charles Yanofsky showed that the positions of mutant sites within a gene matched perfectly the positions of altered amino acids in the amino acid sequence of the corresponding protein. In 1966 the complete genetic code of all 64 possible triplet coding units (codons), and the specific amino acids they code for, was deduced by American biochemists Marshall Nirenberg and Har Gobind Khorana . Subsequent studies in many organisms showed that the double helical structure of DNA, the mode of its replication, and the genetic code are the same in virtually all organisms, including plant s, animal s, fungi , bacteria , and virus es. In 1961 French biologist François Jacob and French biochemist Jacques Monod established the prototypical model for gene regulation by showing that bacterial genes can be turned on (initiating transcription into RNA and protein synthesis) and off through the binding action of regulatory proteins to a region just upstream of the coding region of the gene.",
  "Technical advances have played an important role in the advance of genetic understanding. In 1970 American microbiologists Daniel Nathans and Hamilton Othanel Smith discovered a specialized class of enzymes (called restriction enzymes ) that cut DNA at specific nucleotide target sequences. That discovery allowed American biochemist Paul Berg in the early 1970s to make the first artificial recombinant DNA molecule by isolating DNA molecules from different sources, cutting them, and joining them together in a test tube. Shortly thereafter, American biochemists Herbert W. Boyer and Stanley N. Cohen came up with methods to produce recombinant plasmids (extragenomic circular DNA elements), which replicated naturally when inserted into bacterial cells. These advances allowed individual genes to be cloned (amplified to a high copy number) by splicing them into self-replicating DNA molecules, such as plasmids or viruses, and inserting these into living bacterial cells. From these methodologies arose the field of recombinant DNA technology that came to dominate molecular genetics. In 1977 two different methods were invented for determining the nucleotide sequence of DNA: one by American molecular biologists Allan Maxam and Walter Gilbert and the other by English biochemist Fred Sanger . Such technologies made it possible to examine the structure of genes directly by nucleotide sequencing, resulting in the confirmation of many of the inferences about genes originally made indirectly.",
  "  In the 1970s Canadian biochemist Michael Smith revolutionized the art of redesigning genes by devising a method for inducing specifically tailored mutations at defined sites within a gene, creating a technique known as site-directed mutagenesis. In 1983 American biochemist Kary B. Mullis invented the polymerase chain reaction , a method for rapidly detecting and amplifying a specific DNA sequence without cloning it. In the last decade of the 20th century, progress in recombinant DNA technology and in the development of automated sequencing machines led to the elucidation of complete DNA sequences of several viruses, bacteria, plants, and animals. In 2001 the complete sequence of human DNA, approximately three billion nucleotide pairs, was made public.",
  "A time line of important milestones in the history of genetics is provided in the table.",
  "    Classical genetics, which remains the foundation for all other areas in genetics, is concerned primarily with the method by which genetic traits—classified as dominant (always expressed), recessive (subordinate to a dominant trait), intermediate (partially expressed), or polygenic (due to multiple genes)—are transmitted in plants and animals. These traits may be sex-linked (resulting from the action of a gene on the sex, or X, chromosome) or autosomal (resulting from the action of a gene on a chromosome other than a sex chromosome). Classical genetics began with Mendel’s study of inheritance in garden peas and continues with studies of inheritance in many different plants and animals. Today a prime reason for performing classical genetics is for gene discovery—the finding and assembling of a set of genes that affects a biological property of interest.",
  "Cytogenetics, the microscopic study of chromosomes, blends the skills of cytologists , who study the structure and activities of cell s, with those of geneticists, who study genes. Cytologists discovered chromosome s and the way in which they duplicate and separate during cell division at about the same time that geneticists began to understand the behaviour of genes at the cellular level. The close correlation between the two disciplines led to their combination.",
  "Plant cytogenetics early became an important subdivision of cytogenetics because, as a general rule, plant chromosomes are larger than those of animals. Animal cytogenetics became important after the development of the so-called squash technique, in which entire cells are pressed flat on a piece of glass and observed through a microscope ; the human chromosomes were numbered using this technique.",
  "Today there are multiple ways to attach molecular labels to specific genes and chromosomes, as well as to specific RNAs and proteins, that make these molecules easily discernible from other components of cells, thereby greatly facilitating cytogenetics research.",
  "Microorganisms were generally ignored by the early geneticists because they are small in size and were thought to lack variable traits and the sexual reproduction necessary for a mixing of genes from different organisms. After it was discovered that microorganisms have many different physical and physiological characteristics that are amenable to study, they became objects of great interest to geneticists because of their small size and the fact that they reproduce much more rapidly than larger organisms. Bacteria became important model organisms in genetic analysis, and many discoveries of general interest in genetics arose from their study. Bacterial genetics is the centre of cloning technology.",
  "Viral genetics is another key part of microbial genetics. The genetics of virus es that attack bacteria were the first to be elucidated. Since then, studies and findings of viral genetics have been applied to viruses pathogenic on plants and animals, including humans. Viruses are also used as vectors (agents that carry and introduce modified genetic material into an organism) in DNA technology.",
  "Molecular genetics is the study of the molecular structure of DNA , its cellular activities (including its replication), and its influence in determining the overall makeup of an organism. Molecular genetics relies heavily on genetic engineering ( recombinant DNA technology ), which can be used to modify organisms by adding foreign DNA, thereby forming transgenic organisms. Since the early 1980s, these techniques have been used extensively in basic biological research and are also fundamental to the biotechnology industry, which is devoted to the manufacture of agricultural and medical products. Transgenesis forms the basis of gene therapy, the attempt to cure genetic disease by addition of normally functioning genes from exogenous sources.",
  "The development of the technology to sequence the DNA of whole genomes on a routine basis has given rise to the discipline of genomics, which dominates genetics research today. Genomics is the study of the structure, function, and evolutionary comparison of whole genomes. Genomics has made it possible to study gene function at a broader level, revealing sets of genes that interact to impinge on some biological property of interest to the researcher. Bioinformatics is the computer-based discipline that deals with the analysis of such large sets of biological information, especially as it applies to genomic information.",
  "The study of genes in populations of animals, plants, and microbes provides information on past migration s, evolutionary relationships and extents of mixing among different varieties and species, and methods of adaptation to the environment. Statistical methods are used to analyze gene distributions and chromosomal variations in populations.",
  "Population genetics is based on the mathematics of the frequencies of alleles and of genetic types in populations. For example, the Hardy-Weinberg formula, p  2 + 2 p  q + q  2 = 1, predicts the frequency of individuals with the respective homozygous dominant ( A  A ), heterozygous ( A  a ), and homozygous recessive ( a  a ) genotypes in a randomly mating population. Selection, mutation, and random changes can be incorporated into such mathematical models to explain and predict the course of evolutionary change at the population level. These methods can be used on alleles of known phenotypic effect, such as the recessive allele for albinism , or on DNA segments of any type of known or unknown function.",
  " Human population geneticists have traced the origins and migration and invasion routes of modern humans,  Homo sapiens  . DNA comparisons between the present peoples on the planet have pointed to an African origin of Homo sapiens . Tracing specific forms of genes has allowed geneticists to deduce probable migration routes out of Africa to the areas colonized today. Similar studies show to what degree present populations have been mixed by recent patterns of travel.",
  "Another aspect of genetics is the study of the influence of heredity on behaviour. Many aspects of animal behaviour are genetically determined and can therefore be treated as similar to other biological properties. This is the subject material of behaviour genetics , whose goal is to determine which genes control various aspects of behaviour in animals. Human behaviour is difficult to analyze because of the powerful effects of environmental factors, such as culture. Few cases of genetic determination of complex human behaviour are known. Genomics studies provide a useful way to explore the genetic factors involved in complex human traits such as behaviour.",
  "Some geneticists specialize in the hereditary processes of human genetics . Most of the emphasis is on understanding and treating genetic disease and genetically influenced ill health, areas collectively known as medical genetics. One broad area of activity is laboratory research dealing with the mechanisms of human gene function and malfunction and investigating pharmaceutical and other types of treatments. Since there is a high degree of evolutionary conservation between organisms, research on model organisms—such as bacteria, fungi, and fruit flies (  Drosophila  )—which are easier to study, often provides important insights into human gene function.",
  "Many single-gene diseases, caused by mutant alleles of a single gene, have been discovered. Two well-characterized single-gene diseases include phenylketonuria (PKU) and Tay-Sachs disease . Other diseases, such as heart disease, schizophrenia, and depression, are thought to have more complex heredity components that involve a number of different genes. These diseases are the focus of a great deal of research that is being carried out today.",
  "Another broad area of activity is clinical genetics, which centres on advising parents of the likelihood of their children being affected by genetic disease caused by mutant genes and abnormal chromosome structure and number. Such genetic counseling is based on examining individual and family medical records and on diagnostic procedures that can detect unexpressed, abnormal forms of genes. Counseling is carried out by physicians with a particular interest in this area or by specially trained nonphysicians.",
  "Genetically diverse lines of organisms can be crossed in such a way to produce different combinations of alleles in one line. For example, parental lines are crossed, producing an F 1 generation, which is then allowed to undergo random mating to produce offspring that have purebreeding genotypes (i.e., A  A , b  b , c  c , or D  D ). This type of experimental breeding is the origin of new plant and animal lines, which are an important part of making laboratory stocks for basic research. When applied to commerce, transgenic commercial lines produced experimentally are called genetically modified organisms (GMOs). Many of the plants and animals used by humans today (e.g., cows, pigs, chickens, sheep, wheat, corn (maize), potatoes, and rice) have been bred in this way.",
  "Cytogenetics focuses on the microscopic examination of genetic components of the cell, including chromosomes, genes, and gene products. Older cytogenetic techniques involve placing cells in paraffin wax, slicing thin sections, and preparing them for microscopic study. The newer and faster squash technique involves squashing entire cells and studying their contents. Dyes that selectively stain various parts of the cell are used; the genes, for example, may be located by selectively staining the DNA of which they are composed. Radioactive and fluorescent tags are valuable in determining the location of various genes and gene products in the cell. Tissue-culture techniques may be used to grow cells before squashing; white blood cells can be grown from samples of human blood and studied with the squash technique. One major application of cytogenetics in humans is in diagnosing abnormal chromosomal complements such as Down syndrome (caused by an extra copy of chromosome 21) and Klinefelter syndrome (occurring in males with an extra X chromosome). Some diagnosis is prenatal, performed on cell samples from amniotic fluid or the placenta.",
  "Biochemistry is carried out at the cellular or subcellular level, generally on cell extracts. Biochemical methods are applied to the main chemical compounds of genetics—notably DNA, RNA , and protein . Biochemical techniques are used to determine the activities of genes within cells and to analyze substrates and products of gene-controlled reactions. In one approach, cells are ground up and the substituent chemicals are fractionated for further analysis. Special techniques (e.g., chromatography and electrophoresis ) are used to separate the components of proteins so that inherited differences in their structures can be revealed. For example, more than 100 different kinds of human hemoglobin molecules have been identified. Radioactively tagged compounds are valuable in studying the biochemistry of whole cells. For example, thymine is a compound found only in DNA; if radioactive thymine is placed in a tissue-culture medium in which cells are growing, genes use it to duplicate themselves. When cells containing radioactive thymine are analyzed, the results show that, during duplication, the DNA molecule splits in half, and each half synthesizes its missing components.",
  "Chemical tests are used to distinguish certain inherited conditions of humans; e.g., urinalysis and blood analysis reveal the presence of certain inherited abnormalities— phenylketonuria (PKU), cystinuria , alkaptonuria , gout , and galactosemia . Genomics has provided a battery of diagnostic tests that can be carried out on an individual’s DNA. Some of these tests can be applied to fetuses in utero.",
  "Physiological techniques, directed at exploring functional properties or organisms, are also used in genetic investigations. In microorganisms, most genetic variations involve some important cell function. Some strains of one bacterium (  Escherichia coli  ), for example, are able to synthesize the vitamin thiamin from simple compounds; others, which lack an enzyme necessary for this synthesis, cannot survive unless thiamin is already present. The two strains can be distinguished by placing them on a thiamin-free mixture: those that grow have the gene for the enzyme, those that fail to grow do not. The technique also is applied to human cells, since many inherited human abnormalities are caused by a faulty gene that fails to produce a vital enzyme; albinism , which results from an inability to produce the pigment melanin in the skin, hair, or iris of the eyes, is an example of an enzyme deficiency in man.",
  "  Although overlapping with biochemical techniques, molecular genetics techniques are deeply involved with the direct study of DNA. This field has been revolutionized by the invention of recombinant DNA technology . The DNA of any gene of interest from a donor organism (such as a human) can be cut out of a chromosome and inserted into a vector to make recombinant DNA, which can then be amplified and manipulated, studied, or used to modify the genomes of other organisms by transgenesis. A fundamental step in recombinant DNA technology is amplification. This is carried out by inserting the recombinant DNA molecule into a bacterial cell, which replicates and produces many copies of the bacterial genome and the recombinant DNA molecule (constituting a DNA clone ). A collection of large numbers of clones of recombinant donor DNA molecules is called a genomic library. Such libraries are the starting point for sequencing entire genomes such as the human genome. Today genomes can be scanned for small molecular variants called single nucleotide polymorphisms , or SNPs (“snips”), which act as chromosomal tags to associated specific regions of DNA that have a property of interest and may be involved in a human disease or disorder.",
  "Many substances (e.g., proteins) are antigenic ; i.e., when introduced into a vertebrate body, they stimulate the production of specific proteins called antibodies . Various antigens exist in red blood cells, including those that make up the major blood group s of man (A, B, AB, O). These and other antigens are genetically determined; their study constitutes immunogenetics. Blood antigens of man include inherited variations, and the particular combination of antigens in an individual is almost as unique as fingerprints and has been used in such areas as paternity testing (although this approach has been largely supplanted by DNA-based techniques).",
  "Immunological techniques are used in blood group determinations in blood transfusion s, in organ transplants, and in determining Rhesus incompatibility in childbirth. Specific antigens of the human leukocyte antigen (HLA) genes are correlated with human diseases and disease predispositions. Antibodies also have a genetic basis, and their seemingly endless ability to match any antigen presented is based on special types of DNA shuffling processes between antibody genes. Immunology is also useful in identifying specific recombinant DNA clones that synthesize a specific protein of interest.",
  "Because much of genetics is based on quantitative data, mathematical techniques are used extensively in genetics. The laws of probability are applicable to crossbreeding and are used to predict frequencies of specific genetic constitutions in offspring. Geneticists also use statistical methods to determine the significance of deviations from expected results in experimental analyses. In addition, population genetics is based largely on mathematical logic—for example, the Hardy-Weinberg equilibrium and its derivatives ( see  above ).",
  "Bioinformatics uses computer-centred statistical techniques to handle and analyze the vast amounts of information accumulating from genome sequencing projects. The computer program scans the DNA looking for genes, determining their probable function based on other similar genes, and comparing different DNA molecules for evolutionary analysis. Bioinformatics has made possible the discipline of systems biology, treating and analyzing the genes and gene products of cells as a complete and integrated system.",
  "Genetic techniques are used in medicine to diagnose and treat inherited human disorders. Knowledge of a family history of conditions such as cancer or various disorders may indicate a hereditary tendency to develop these afflictions. Cells from embryonic tissues reveal certain genetic abnormalities, including enzyme deficiencies, that may be present in newborn babies, thus permitting early treatment. Many countries require a blood test of newborn babies to determine the presence of an enzyme necessary to convert an amino acid , phenylalanine , into simpler products. Phenylketonuria (PKU), which results from lack of the enzyme, causes permanent brain damage if not treated soon after birth. Many different types of human genetic diseases can be detected in embryos as young as 12 weeks; the procedure involves removal and testing of a small amount of fluid from around the embryo (called amniocentesis ) or of tissue from the placenta (called chorionic villus sampling).",
  "Gene therapy is based on modification of defective genotypes by adding functional genes made through recombinant DNA technology . Bioinformatics is being used to “mine” the human genome for gene products that might be candidates for designer pharmaceutical drugs.",
  "  Agriculture and animal husbandry apply genetic techniques to improve plant s and animal s. Breeding analysis and transgenic modification using recombinant DNA techniques are routinely used. Animal breeders use artificial insemination to propagate the genes of prize bulls. Prize cows can transmit their genes to hundreds of offspring by hormone treatment, which stimulates the release of many eggs that are collected, fertilized, and transplanted to foster mothers. Several types of mammals can be cloned, meaning that multiple identical copies can be produced of certain desirable types.",
  "Plant geneticists use special techniques to produce new species, such as hybrid grains (i.e., produced by crossing wheat and rye ), and plants resistant to destruction by insect and fungal pests.",
  "Plant breeders use the techniques of budding and grafting to maintain desirable gene combinations originally obtained from crossbreeding. Transgenic plant cells can be made into plants by growing the cells on special hormones. The use of the chemical compound colchicine , which causes chromosomes to double in number, has resulted in many new varieties of fruit s, vegetable s, and flower s. Many transgenic lines of crop plants are commercially advantageous and are being introduced into the market.",
  "Various industries employ geneticists; the brewing industry, for example, may use geneticists to improve the strains of yeast that produce alcohol . The pharmaceutical industry has developed strains of mold s, bacteria , and other microorganisms high in antibiotic yield. Penicillin and cyclosporin from fungi , and streptomycin and ampicillin from bacteria, are some examples.",
  " Biotechnology , based on recombinant DNA technology, is now extensively used in industry. “Designer” lines of transgenic bacteria, animals, or plants capable of manufacturing some commercial product are made and used routinely. Such products include pharmaceutical drugs and industrial chemicals such as citric acid .",
  " Nina Fedoroff and David Botstein (eds.), The Dynamic Genome: Barbara McClintock’s Ideas in the Century of Genetics (1992), treats this scientist’s work and the history of modern genetics. James D. Watson , The Double Helix: A Personal Account of the Discovery of the Structure of DNA (1968, reissued 2001), available also in a critical edition edited by Gunther S. Stent (1980, reissued 1998), is written by one of DNA’s discoverers. Paul Rabinow , Making PCR: A Story of Biotechnology (1996), is an ethnographic account of the discovery of one of the most important tools in contemporary genetics and molecular biology. Matthew Cobb , Life’s Greatest Secret: The Race to Crack the Genetic Code (2015), recounts the experiments, insights, and breakthroughs that ultimately led to the elucidation of the genetic code.",
  " Benjamin Lewin , Genes IX , 9th ed. (2008), emphasizes the molecular aspects of genetics. Sandy Primrose , Richard Twyman , and Bob Old , Principles of Gene Manipulation , 6th ed. (2001), is one of the best texts dealing exclusively with genetic engineering. James D. Watson et al., Recombinant DNA: Genes and Genomes: A Short Course , 3rd ed. (2007), discusses the methods and applications of recombinant DNA technology and other current methods in molecular genetics.",
  "The rise of contemporary molecular genetics had its inception in studies on bacterial genetics and on viruses that infect bacteria. Molecular genetics related to bacterial structure and function are presented in Frederick C. Neidhardt , John L. Ingraham , and Moselio Schaechter , Physiology of the Bacterial Cell: A Molecular Approach (1990). Arnold J. Levine , Viruses (1991), is an excellent treatment."
]