[
  "  galaxy , any of the systems of stars and interstellar matter that make up the universe. Many such assemblages are so enormous that they contain hundreds of billions of stars.",
  "Nature has provided an immensely varied array of galaxies, ranging from faint, diffuse dwarf objects to brilliant spiral-shaped giants. Virtually all galaxies appear to have been formed soon after the universe began, and they pervade space, even into the depths of the farthest reaches penetrated by powerful modern telescopes . Galaxies usually exist in clusters, some of which in turn are grouped into larger clusters that measure hundreds of millions of light-years across. (A light-year is the distance traversed by light in one year, traveling at a velocity of 300,000 km per second [km/sec], or 650,000,000 miles per hour.) These so-called superclusters are separated by nearly empty voids, and this causes the gross structure of the universe to look somewhat like a network of sheets and chains of galaxies.",
  "Galaxies differ from one another in shape, with variations resulting from the way in which the systems were formed and subsequently evolved. Galaxies are extremely varied not only in structure but also in the amount of activity observed. Some are the sites of vigorous star formation, with its attendant glowing gas and clouds of dust and molecular complexes. Others, by contrast, are quiescent, having long ago ceased to form new stars. Perhaps the most conspicuous activity in galaxies occurs in their nuclei, where evidence suggests that in many cases supermassive objects—probably black holes —lurk. These central black holes apparently formed several billion years ago; they are now observed forming in galaxies at large distances (and, therefore, because of the time it takes light to travel to Earth, at times in the far distant past) as brilliant objects called quasars .",
  "The existence of galaxies was not recognized until the early 20th century. Since then, however, galaxies have become one of the focal points of astronomical investigation. The notable developments and achievements in the study of galaxies are surveyed here. Included in the discussion are the external galaxies (i.e., those lying outside the Milky Way Galaxy, the local galaxy to which the Sun and Earth belong), their distribution in clusters and superclusters, and the evolution of galaxies and quasars. For further details on the Milky Way Galaxy, see  Milky Way Galaxy . For specifics about the components of galaxies, see  star and nebula .",
  "The dispute over the nature of what were once termed spiral nebulae stands as one of the most significant in the development of astronomy . On this dispute hinged the question of the magnitude of the universe : were we confined to a single, limited stellar system that lay embedded alone in empty space, or was our Milky Way Galaxy just one of millions of galaxies that pervaded space, stretching beyond the vast distances probed by our most powerful telescopes ? How this question arose, and how it was resolved, is an important element in the development of our prevailing view of the universe.",
  "Up until 1925, spiral nebulae and their related forms had uncertain status. Some scientists, notably Heber D. Curtis of the United States and Knut Lundmark of Sweden, argued that they might be remote aggregates of stars similar in size to the Milky Way Galaxy. Centuries earlier the German philosopher Immanuel Kant , among others, had suggested much the same idea, but that was long before the tools were available to actually measure distances and thus prove it. During the early 1920s astronomers were divided. Although some deduced that spiral nebulae were actually extragalactic star systems, there was evidence that convinced many that such nebulae were local clouds of material, possibly new solar systems in the process of forming.",
  "  It is now known that the nearest external galaxies are the Magellanic Clouds , two patchy irregular objects visible in the skies of the Southern Hemisphere. For years, most experts who regarded the Magellanic Clouds as portions of the Milky Way Galaxy system separated from the main stream could not study them because of their position. (Both Magellanic Clouds are too far south to be seen from most northern latitudes.) Moreover, the irregular shapes of the objects and their numerous hot blue stars, star clusters, and gas clouds did indeed make them resemble the southern Milky Way Galaxy.",
  "  The American astronomer Harlow Shapley , noted for his far-reaching work on the size and structure of the Milky Way Galaxy, was one of the first to appreciate the importance of the Magellanic Clouds in terms of the nature of spiral nebulae. To gauge the distance of the Clouds, he made use of the period-luminosity (P-L) relation discovered by Henrietta Leavitt of the Harvard College Observatory. In 1912 Leavitt had found that there was a close correlation between the periods of pulsation (variations in light) and the luminosities (intrinsic, or absolute, brightnesses) of a class of stars called Cepheid variables in the Small Magellanic Cloud. Leavitt’s discovery, however, was of little practical value until Shapley worked out a calibration of the absolute brightnesses of pulsating stars closely analogous to the Cepheids, the so-called RR Lyrae variables. With this quantified form of the P-L relation, he was able to calculate the distances to the Magellanic Clouds, determining that they were about 75,000 light-years from Earth. The significance of the Clouds, however, continued to elude scientists of the time. For them, these objects still seemed to be anomalous, irregular patches of the Milky Way Galaxy, farther away than initially thought but not sufficient to settle the question of the nature of the universe.",
  "An unfortunate misidentification hampered the early recognition of the northern sky’s brightest nearby galaxy, the Andromeda Nebula , also known as M31. In 1885 a bright star, previously invisible, appeared near the centre of M31, becoming almost bright enough to be seen without a telescope. As it slowly faded again, astronomers decided that it must be a nova , a “new star,” similar to the class of temporary stars found relatively frequently in populous parts of the Milky Way Galaxy. If this was the case, it was argued, then its extraordinary brightness must indicate that M31 cannot be very far away, certainly not outside the local system of stars. Designated S Andromeda in conformity with the pattern of terminology applied to stars of variable brightness, this supposed nova was a strong argument in favour of the hypothesis that nebulae are nearby objects in the Milky Way Galaxy.",
  "By 1910, however, there was evidence that S Andromeda might have been wrongly identified. Deep photographs were being taken of M31 with the Mount Wilson Observatory ’s newly completed 152-cm (60-inch) telescope, and the astronomers at the observatory, especially J.C. Duncan and George W. Ritchey, were finding faint objects, just resolved by the longest exposures, that also seemed to behave like novae. These objects, however, were about 10,000 times fainter than S Andromeda. If they were ordinary novae, then M31 must be millions of light-years away, but then the nature of S Andromeda became a difficult question. At this vast distance its total luminosity would have to be immense—an incomprehensible output of energy for a single star.",
  "Completion of the 254-cm (100-inch) telescope on Mount Wilson in 1917 resulted in a new series of photographs that captured even fainter objects. More novae were found in M31, mainly by Milton L. Humason, who was an assistant at the time to Edwin P. Hubble , one of the truly outstanding astronomers of the day. Hubble eventually studied 63 of these stars, and his findings proved to be one of the final solutions to the controversy ( see below  The distance to the Andromeda Nebula ).",
  "At the same time that spiral nebulae were being studied and debated, the Milky Way Galaxy became the subject of contentious discussion. During the early years of the 20th century, most astronomers believed that the Milky Way Galaxy was a disk-shaped system of stars with the Sun near the centre and with the edge along a thick axis only about 15,000 light-years away. This view was based on statistical evidence involving star counts and the spatial distribution of a variety of cosmic objects—open star clusters , variable stars , binary systems, and clouds of interstellar gas. All these objects seemed to thin out at distances of several thousand light-years.",
  "  This conception of the Milky Way Galaxy was challenged by Shapley in 1917, when he released the findings of his study of globular clusters . He had found that these spherically symmetrical groups of densely packed stars, as compared with the much closer open clusters , were unusual in their distribution. While the known open clusters are concentrated heavily in the bright belt of the Milky Way Galaxy, the globular clusters are for the most part absent from those areas except in the general direction of the constellation  Sagittarius , where there is a concentration of faint globular clusters. Shapley’s plot of the spatial distribution of these stellar groupings clarified this peculiar fact: the centre of the globular cluster system—a huge almost spherical cloud of clusters—lies in that direction, some 30,000 light-years from the Sun. Shapley assumed that this centre must also be the centre of the Milky Way Galaxy. The globular clusters, he argued, form a giant skeleton around the disk of the Milky Way Galaxy, and the system is thus immensely larger than was previously thought, its total extent measuring nearly 100,000 light-years.",
  "Shapley succeeded in making the first reliable determination of the size of the Milky Way Galaxy largely by using Cepheids and RR Lyrae stars as distance indicators. His approach was based on the P-L relation discovered by Leavitt and on the assumption that all these variables have the same P-L relation. As he saw it, this assumption was most likely true in the case of the RR Lyrae stars, because all variables of this type in any given globular cluster have the same apparent brightness. If all RR Lyrae variables have the same intrinsic brightness, then it follows that differences in apparent brightness must be due to different distances from Earth. The final step in developing a procedure for determining the distances of variables was to calculate the distances of a handful of such stars by an independent method so as to enable calibration. Shapley could not make use of the trigonometric parallax method, since there are no variables close enough for direct distance measurement. However, he had recourse to a technique devised by the Danish astronomer Ejnar Hertzsprung that could determine distances to certain nearby field variables (i.e., those not associated with any particular cluster) by using measurements of their proper motions and the radial velocity of the Sun. Accurate measurements of the proper motions of the variables based on long-term observations were available, and the Sun’s radial velocity could be readily determined spectroscopically. Thus, by availing himself of this body of data and adopting Hertzsprung’s method, Shapley was able to obtain a distance scale for Cepheids in the solar neighbourhood.",
  "Shapley applied the zero point of the Cepheid distance scale to the globular clusters he had studied with the 152-cm (60-inch) telescope at Mount Wilson. Some of these clusters contained RR Lyrae variables, and for these Shapley could calculate distances in a straightforward manner from the P-L relation. For other globular clusters he made distance determinations, using a relationship that he discovered between the brightnesses of the RR Lyrae stars and the brightness of the brightest red stars. For still others he made use of apparent diameters, which he found to be relatively uniform for clusters of known distance. The final result was a catalog of distances for 69 globular clusters, from which Shapley deduced his revolutionary model of the Milky Way Galaxy—one that not only significantly extended the limits of the galactic system but that also displaced the Sun from its centre to a location nearer its edge.",
  "  Shapley’s work caused astronomers to ask themselves certain questions: How could the existing stellar data be so wrong? Why couldn’t they see something in Sagittarius, the proposed galactic centre, 30,000 light-years away? The reason for the incorrectness of the star count methods was not learned until 1930, when Lick Observatory astronomer Robert J. Trumpler , while studying open clusters, discovered that interstellar dust pervades the plane of the Milky Way Galaxy and obscures objects beyond only a few thousand light-years. This dust thus renders the centre of the system invisible optically and makes it appear that globular clusters and spiral nebulae avoid the band of the Milky Way.",
  "Shapley’s belief in the tremendous size of the local galactic system helped to put him on the wrong side of the argument about other galaxies. He thought that, if the Milky Way Galaxy was so immense, then the spiral nebulae must lie within it. His conviction was reinforced by two lines of evidence. One of these has already been mentioned—the nova S Andromeda was so bright as to suggest that the Andromeda Nebula most certainly was only a few hundred light-years away. The second came about because of a very curious error made by one of Shapley’s colleagues at Mount Wilson Observatory, Adrian van Maanen.",
  "During the early 20th century, one of the most important branches of astronomy was astrometry, the precise measurements of stellar positions and motions. Van Maanen was one of the leading experts in this field. Most of his determinations of stellar positions were accurate and have stood the test of time, but he made one serious and still poorly understood error when he pursued a problem tangential to his main interests. In a series of papers published in the early 1920s, van Maanen reported on his discovery and measurement of the rotation of spiral nebulae. Using early plates taken by others at the 152-cm (60-inch) Mount Wilson telescope as well as more recent ones taken about 10 years later, van Maanen measured the positions of several knotlike, nearly stellar images in the spiral arms of some of the largest-known spiral nebulae (e.g., M33, M101, and M51). Comparing the positions, he found distinct changes indicative of a rotation of the spiral pattern against the background of surrounding field stars. In each case, the rotation occurs in the sense that the spiral arms trail. The periods of rotation were all approximately 100,000 years. Angular motions were about 0.02 second of arc per year.",
  "Shapley seized the van Maanen results as evidence that the spirals had to be nearby; otherwise, their true space velocities of rotation would have to be impossibly large. For example, if M51 is rotating at an apparent rate of 0.02 second of arc per year, its true velocity would be immense if it is a distant galaxy. Assuming that a distance of 10,000,000 light-years would lead to an implausibly large rotation velocity of 12,000 km/sec, Shapley argued that, if a more reasonable velocity was adopted—say, 100 km/sec—then the distances would all be less than 100,000 light-years, which would put all the spirals well within the Milky Way Galaxy.",
  "It is unclear just why such a crucial measurement went wrong. Van Maanen repeated the measures and obtained the same answer even after Hubble demonstrated the truth about the distances to the spirals. However, subsequent workers, using the same plates, failed to find any rotation. Among the various hypotheses that science historians have proposed as an explanation for the error are two particularly reasonable ideas: (1) possibly the fact that spiral nebulae look like they are rotating (i.e., they resemble familiar rotational patterns that are perceivable in nature) may have influenced the observer subconsciously, and this subtle effect manifested itself in prejudicing the delicate measurements, or (2) possibly the first set of plates was the problem. Many of these plates had been taken in an unconventional manner by Ritchey, who swung the plate holder out of the field whenever the quality of the images was temporarily poor because of atmospheric turbulence . The resulting plates appeared excellent, having been exposed only during times of very fine seeing; however, according to some interpretations, the images had a slight asymmetry that led to a very small displacement of star images compared with nonstellar images. Such an error could look like rotation if not recognized for what it really was. In any case, the van Maanen rotation was accepted by many astronomers, including Shapley, and temporarily sidetracked progress toward recognizing the truth about galaxies.",
  "The nature of galaxies and scale of the universe were the subject of the Great Debate, a public program arranged in 1920 by the National Academy of Sciences at the Smithsonian Institution in Washington, D.C. Featured were talks by Shapley and the aforementioned Heber Curtis, who were recognized as spokesmen for opposite views on the nature of spiral nebulae and the Milky Way Galaxy. This so-called debate has often been cited as an illustration of how revolutionary new concepts are assimilated by science. It is sometimes compared to the debate, centuries before, over the motions of the Earth (the Copernican revolution ); however, though as a focal point the debate about Earth’s motion can be used to define the modern controversy, the Shapley-Curtis debate actually was much more complicated.",
  "A careful reading of the documents involved suggests that, on the broader topic of the scale of the universe, both men were making incorrect conclusions but for the same reasons—namely, for being unable to accept and comprehend the incredibly large scale of things. Shapley correctly argued for an enormous Milky Way Galaxy on the basis of the P-L relation and the globular clusters, while Curtis incorrectly rejected these lines of evidence, advocating instead a small galactic system. Given a Milky Way Galaxy system of limited scale, Curtis could argue for and consider plausible the extragalactic nature of the spiral nebulae. Shapley, on the other hand, incorrectly rejected the island universe theory of the spirals (i.e., the hypothesis that there existed comparable galaxies beyond the boundaries of the Milky Way Galaxy) because he felt that such objects would surely be engulfed by the local galactic system. Furthermore, he put aside the apparent faint novae in M31, preferring to interpret S Andromeda as an ordinary nova, for otherwise that object would have been unbelievably luminous. Unfortunately for him, such phenomena—called supernovae —do in fact exist, as was realized a few years later. Curtis was willing to concede that there might be two classes of novae, yet, because he considered the Milky Way Galaxy to be small, he underestimated their differences. The van Maanen rotation also entered into Shapley’s arguments: if spiral nebulae were rotating so fast, they must be within the Milky Way Galaxy as he conceived it. For Curtis, however, the matter provided less of a problem: even if spiral nebulae did rotate as rapidly as claimed, the small scale of Curtis’s universe allowed them to have physically reasonable speeds.",
  "The Shapley-Curtis debate took place near the end of the era of the single-galaxy universe. In just a few years the scientific world became convinced that Shapley’s grand scale of the Milky Way Galaxy was correct and at the same time that Curtis was right about the nature of spiral nebulae. Such objects indeed lie even outside Shapley’s enormous Milky Way Galaxy, and they range far beyond the distances that in 1920 seemed too vast for many astronomers to comprehend.",
  "  During the early 1920s Hubble detected 15 stars in the small, irregular cloudlike object NGC 6822 that varied in luminosity, and he suspected that they might include Cepheids. After considerable effort, he determined that 11 of them were in fact Cepheid variables, with properties indistinguishable from those of normal Cepheids in the Milky Way Galaxy and in the Magellanic Clouds. Their periods ranged from 12 to 64 days, and they were all very faint, much fainter than their Magellanic counterparts. Nevertheless, they fit a P-L relation of the same nature as had been discovered by Leavitt.",
  "Hubble then boldly assumed that the P-L relation was universal and derived an estimate for the distance to NGC 6822, using Shapley’s most recent (1925) version of the calibration of the relation. This calibration was wrong, as is now known, because of the confusion at that time over the nature of Cepheids. Shapley’s calibration included certain Cepheids in globular clusters that subsequent investigators found to have their own fainter P-L relation. (Such Cepheids have been designated Type II Cepheids to distinguish them from the normal variety, which are referred to as Type I.) Thus, Hubble’s distance for NGC 6822 was too small: he calculated a distance of only 700,000 light-years. Today it is recognized that the actual distance is closer to 2,000,000 light-years. In any case, this vast distance—even though underestimated—was large enough to convince Hubble that NGC 6822 must be a remote, separate galaxy, much too far away to be included even in Shapley’s version of the Milky Way Galaxy system. Technically, then, this faint nebula can be considered the first recognized external galaxy. The Magellanic Clouds continued to be regarded simply as appendages to the Milky Way Galaxy, and the other bright nebulae, M31 and M33, were still being studied at the Mount Wilson Observatory. Although Hubble announced his discovery of Cepheids in M31 at a meeting in 1924, he did not complete his research and publish the results for this conspicuous spiral galaxy until five years later.",
  "While the Cepheids made it possible to determine the distance and nature of NGC 6822, some of its other features corroborated the conclusion that it was a separate, distant galaxy. Hubble discovered within it five diffuse nebulae, which are glowing gaseous clouds composed mostly of ionized hydrogen, designated H II regions . (H stands for hydrogen and II indicates that most of it is ionized; H I, by contrast, signifies neutral hydrogen.) He found that these five H II regions had spectra like those of gas clouds in the Milky Way Galaxy system—e.g., the Orion Nebula and Eta Carinae . Calculating their diameters, Hubble ascertained that the sizes of the diffuse nebulae were normal, similar to those of local examples of giant H II regions.",
  "Five other diffuse objects discerned by Hubble were definitely not gaseous nebulae. He compared them with globular clusters (both in the Milky Way Galaxy and in the Magellanic Clouds) and concluded that they were too small and faint to be normal globular clusters. Convinced that they were most likely distant galaxies seen through NGC 6822, he dismissed them from further consideration. Modern studies suggest that Hubble was too hasty. Though probably not true giant globular clusters, these objects are in all likelihood star clusters in the system, fainter, smaller in population, and probably somewhat younger than normal globular clusters.",
  "The Dutch astronomer Jacobus Cornelius Kapteyn showed in the early 20th century that statistical techniques could be used to determine the stellar luminosity function for the solar neighbourhood. (The luminosity function is a curve that shows how many stars there are in a given volume for each different stellar luminosity.) Eager to test the nature of NGC 6822, Hubble counted stars in the galaxy to various brightness limits and found a luminosity function for its brightest stars. When he compared it with Kapteyn’s, the agreement was excellent—another indication that the Cepheids had given about the right distance and that the basic properties of galaxies were fairly uniform. Step by step, Hubble and his contemporaries piled up evidence for the fundamental assumption that has since guided the astronomy of the extragalactic universe, the uniformity of nature. By its bold application, astronomers have moved from a limiting one-galaxy universe to an immense vastness of space populated by billions of galaxies, all grander in size and design than the Milky Way Galaxy system was once thought to be.",
  "  In 1929 Hubble published his epochal paper on M31, the great Andromeda Nebula. Based on 350 photographic plates taken at Mount Wilson, his study provided evidence that M31 is a giant stellar system like the Milky Way Galaxy.",
  "Because M31 is much larger than the field of view of the 152- and 254-cm (60- and 100-inch) telescopes at Mount Wilson, Hubble concentrated on four regions, centred on the nucleus and at various distances along the major axis. The total area studied amounted to less than half the galaxy’s size, and the other unexplored regions remained largely unknown for 50 years. (Modern comprehensive optical studies of M31 have been conducted only since about 1980.)",
  "Hubble pointed out an important and puzzling feature of the resolvability of M31. Its central regions, including the nucleus and diffuse nuclear bulge, were not well resolved into stars, one reason that the true nature of M31 had previously been elusive. However, the outer parts along the spiral arms in particular were resolved into swarms of faint stars, seen superimposed over a structured background of light. Current understanding of this fact is that spiral galaxies typically have central bulges made up exclusively of very old stars, the brightest of which are too faint to be visible on Hubble’s plates. Not until 1944 did the German-born astronomer Walter Baade finally resolve the bulge of M31. Using red-sensitive plates and very long exposures, he managed to detect the brightest red giants of this old population. Out in the arms there exist many young, bright, hot blue stars, and these are easily resolved. The brightest are so luminous that they can be seen even with moderate-sized telescopes.",
  "The most important of Hubble’s discoveries was that of M31’s population of Cepheid variables. Forty of the 50 variables detected turned out to be ordinary Cepheids with periods ranging from 10 to 48 days. A clear relation was found between their periods and luminosities, and the slope of the relation agreed with those for the Magellanic Clouds and NGC 6822. Hubble’s comparison indicated that M31 must be 8.5 times more distant than the Small Magellanic Cloud (SMC), which would imply a distance of two million light-years if the modern SMC distance was used (the 1929 value employed by Hubble was about two times too small). Clearly, M31 must be a distant, large galaxy.",
  "Other features announced in Hubble’s paper were M31’s population of bright, irregular, slowly varying variables. One of the irregulars was exceedingly bright; it is among the most luminous stars in the galaxy and is a prototype of a class of high-luminosity stars now called Hubble-Sandage variables, which are found in many giant galaxies. Eighty-five novae, all behaving very much like those in the Milky Way Galaxy, were also analyzed. Hubble estimated that the true occurrence rate of novae in M31 must be about 30 per year, a figure that was later confirmed by the American astronomer Halton C. Arp in a systematic search.",
  "Hubble found numerous star clusters in M31, especially globular clusters, 140 of which he eventually cataloged. He clinched the argument that M31 was a galaxy similar to the Milky Way Galaxy by calculating its mass and mass density. Using the velocities that had been measured for the inner parts of M31 by spectrographic work, he calculated (on the basis of the distance derived from the Cepheids) that M31’s mass must be about 3.5 billion times that of the Sun. Today astronomers have much better data, which indicate that the galaxy’s true total mass must be at least 100 times greater than Hubble’s value, but even that value clearly showed that M31 is an immense system of stars. Furthermore, Hubble’s estimates of star densities demonstrated that the stars in the outer arm areas of M31 are spread out with about the same density as in the Milky Way Galaxy system in the vicinity of the Sun.",
  "  Until about 1950, scientific knowledge of galaxies advanced slowly. Only a very small number of astronomers took up galaxy studies, and only a very few telescopes were suitable for significant research. It was an exclusive field, rather jealously guarded by its practitioners, and so progress was orderly but limited.",
  "During the decade of the 1950s, the field began to change. Ever-larger optical telescopes became available, and the space program resulted in a sizable increase in the number of astronomers emerging from universities. New instrumentation enabled investigators to explore galaxies in entirely new ways, making it possible to detect their radio, infrared , and ultraviolet emissions and eventually even radiation at X-ray and gamma-ray wavelengths. Whereas in the 1950s there was only one telescope larger than 254 cm (100 inches)—and only about 10 astronomers conducting research on galaxies worldwide—by the year 2000 the number of large telescopes had grown immensely, with 12 telescopes larger than 800 cm (300 inches), and the number of scientists devoted to galaxy study was in the thousands. By then, galaxies were being extensively studied with giant arrays of ground-based radio telescopes , Earth-orbiting optical, X-ray, ultraviolet, and infrared telescopes, and high-speed computers—studies that have given rise to remarkable advances in knowledge and understanding. The tremendous progress in both theoretical and observational work has led many to say that the turn of the 21st century happened during the “golden age” of extragalactic astronomy.",
  "  Almost all current systems of galaxy classification are outgrowths of the initial scheme proposed by the American astronomer Edwin Hubble in 1926. In Hubble’s scheme, which is based on the optical appearance of galaxy images on photographic plates, galaxies are divided into three general classes: ellipticals, spirals, and irregulars. Hubble subdivided these three classes into finer groups.",
  "In The Hubble Atlas of Galaxies (1961), the American astronomer Allan R. Sandage drew on Hubble’s notes and his own research on galaxy morphology to revise the Hubble classification scheme. Some of the features of this revised scheme are subject to argument because of the findings of very recent research, but its general features, especially the coding of types, remain viable. A description of the classes as defined by Sandage is given here, along with observations concerning needed refinements of some of the details.",
  "  These systems exhibit certain characteristic properties. They have complete rotational symmetry; i.e., they are figures of revolution with two equal principal axes. They have a third smaller axis that is the presumed axis of rotation. The surface brightness of ellipticals at optical wavelengths decreases monotonically outward from a maximum value at the centre, following a common mathematical law of the form:  I = I  0 ( r / a +1 ) −2 , where I is the intensity of the light, I  0 is the central intensity, r is the radius, and a is a scale factor. The isophotal contours exhibited by an elliptical system are similar ellipses with a common orientation, each centred on its nucleus. No galaxy of this type is flatter than b / a = 0.3, with b and a the minor and major axes of the elliptical image, respectively. Ellipticals contain neither interstellar dust nor bright stars of spectral types O and B. Many, however, contain evidence of the presence of low-density gas in their nuclear regions. Ellipticals are red in colour, and their spectra indicate that their light comes mostly from old stars, especially evolved red giants.",
  "Subclasses of elliptical galaxies are defined by their apparent shape, which is of course not necessarily their three-dimensional shape. The designation is E n , where n is an integer defined by  n = 10( a − b )/ a . A perfectly circular image will be an E0 galaxy, while a flatter object might be an E7 galaxy. (As explained above, elliptical galaxies are never flatter than this, so there are no E8, E9, or E10 galaxies.)",
  "Although the above-cited criteria are generally accepted, current high-quality measurements have shown that some significant deviations exist. Most elliptical galaxies do not, for instance, exactly fit the intensity law formulated by Hubble; deviations are evident in their innermost parts and in their faint outer parts. Furthermore, many elliptical galaxies have slowly varying ellipticity, with the images being more circular in the central regions than in the outer parts. The major axes sometimes do not line up either; their position angles vary in the outer parts. Finally, astronomers have found that a few ellipticals do in fact have small numbers of luminous O and B stars as well as dust lanes.",
  "  Spirals are characterized by circular symmetry, a bright nucleus surrounded by a thin outer disk, and a superimposed spiral structure. They are divided into two parallel classes: normal spirals and barred spirals. The normal spirals have arms that emanate from the nucleus, while barred spirals have a bright linear feature called a bar that straddles the nucleus, with the arms unwinding from the ends of the bar. The nucleus of a spiral galaxy is a sharp-peaked area of smooth texture, which can be quite small or, in some cases, can make up the bulk of the galaxy. Both the arms and the disk of a spiral system are blue in colour, whereas its central areas are red like an elliptical galaxy. The normal spirals are designated S and the barred varieties SB. Each of these classes is subclassified into three types according to the size of the nucleus and the degree to which the spiral arms are coiled. The three types are denoted with the lowercase letters a , b , and c . There also exist galaxies that are intermediate between ellipticals and spirals. Such systems have the disk shape characteristic of the latter but no spiral arms. These intermediate forms bear the designation S0.",
  "These systems exhibit some of the properties of both the ellipticals and the spirals and seem to be a bridge between these two more common galaxy types. Hubble introduced the S0 class long after his original classification scheme had been universally adopted, largely because he noticed the dearth of highly flattened objects that otherwise had the properties of elliptical galaxies. Sandage’s elaboration of the S0 class yielded the characteristics described here.",
  "S0 galaxies have a bright nucleus that is surrounded by a smooth, featureless bulge and a faint outer envelope. They are thin; statistical studies of the ratio of the apparent axes (seen projected onto the sky) indicate that they have intrinsic ratios of minor to major axes in the range 0.1 to 0.3. Their structure does not generally follow the luminosity law of elliptical galaxies but has a form more like that for spiral galaxies. Some S0 systems have a hint of structure in the envelope, either faintly discernible armlike discontinuities or narrow absorption lanes produced by interstellar dust. Several S0 galaxies are otherwise peculiar, and it is difficult to classify them with certainty. They can be thought of as peculiar irregular galaxies (i.e., Irr II galaxies) or simply as some of the 1 or 2 percent of galaxies that do not fit easily into the Hubble scheme. Among these are such galaxies as NGC 4753, which has irregular dust lanes across its image, and NGC 128, which has a double, almost rectangular bulge around a central nucleus. Another type of peculiar S0 is found in NGC 2685. This nebula in the constellation  Ursa Major has an apparently edge-on disk galaxy at its centre, with surrounding hoops of gas, dust, and stars arranged in a plane that is at right angles to the apparent plane of the central object.",
  "  These normal spirals have narrow, tightly wound arms, which usually are visible because of the presence of interstellar dust and, in many cases, bright stars. Most of them have a large amorphous bulge in the centre, but there are some that violate this criterion, having a small nucleus around which is arranged an amorphous disk with superimposed faint arms. NGC 1302 is an example of the normal type of Sa galaxy, while NGC 4866 is representative of one with a small nucleus and arms consisting of thin dust lanes on a smooth disk.",
  "  This intermediate type of spiral typically has a medium-sized nucleus. Its arms are more widely spread than those of the Sa variety and appear less smooth. They contain stars, star clouds, and interstellar gas and dust. Sb galaxies show wide dispersions in details in terms of their shape. Hubble and Sandage observed, for example, that in certain Sb galaxies the arms emerge at the nucleus, which is often quite small. Other members of this subclass have arms that begin tangent to a bright, nearly circular ring, while still others reveal a small, bright spiral pattern inset into the nuclear bulge. In any of these cases, the spiral arms may be set at different pitch angles. (A pitch angle is defined as the angle between an arm and a circle centred on the nucleus and intersecting the arm.)",
  "Hubble and Sandage noted further deviations from the standard shape established for Sb galaxies. A few systems exhibit a chaotic dust pattern superimposed upon the tightly wound spiral arms. Some have smooth, thick arms of low surface brightness, frequently bounded on their inner edges with dust lanes. Finally, there are those with a large, smooth nuclear bulge from which the arms emanate, flowing outward tangent to the bulge and forming short arm segments. This is the most familiar type of Sb galaxy and is best exemplified by the giant Andromeda Galaxy .",
  "Many of these variations in shape remain unexplained. Theoretical models of spiral galaxies based on a number of different premises can reproduce the basic Sb galaxy shape, but many of the deviations noted above are somewhat mysterious in origin and must await more detailed and realistic modeling of galactic dynamics.",
  " These galaxies characteristically have a very small nucleus and multiple spiral arms that are open, with relatively large pitch angles. The arms, moreover, are lumpy, containing as they do numerous irregularly distributed star clouds, stellar associations, star clusters , and gas clouds known as emission nebulae .",
  "As in the case of Sb galaxies, there are several recognizable subtypes among the Sc systems. Sandage has cited six subdivisions: (1) galaxies, such as the Whirlpool Galaxy (M51), that have thin branched arms that wind outward from a tiny nucleus, usually extending out about 180° before branching into multiple segments, (2) systems with multiple arms that start tangent to a bright ring centred on the nucleus, (3) those with arms that are poorly defined and that span the entire image of the galaxy, (4) those with a spiral pattern that cannot easily be traced and that are multiple and punctuated with chaotic dust lanes, (5) those with thick, loose arms that are not well defined—e.g., the nearby galaxy M33 (the Triangulum Nebula)—and (6) transition types, which are almost so lacking in order that they could be considered irregular galaxies.",
  "Some classification schemes, such as that of the French-born American astronomer Gerard de Vaucouleurs, give the last of the above-cited subtypes a class of its own, type Sd. It also has been found that some of the variations noted here for Sc galaxies are related to total luminosity. Galaxies of the fifth subtype, in particular, tend to be intrinsically faint, while those of the first subtype are among the most luminous spirals known. This correlation is part of the justification for the luminosity classification discussed below ( see  Other classification schemes ).",
  "  The luminosities, dimensions, spectra, and distributions of the barred spirals tend to be indistinguishable from those of normal spirals. The subclasses of SB systems exist in parallel sequence to those of the latter.",
  "There are SB0 galaxies that feature a large nuclear bulge surrounded by a disklike envelope across which runs a luminous featureless bar. Some SB0 systems have short bars, while others have bars that extend across the entire visible image. Occasionally there is a ringlike feature external to the bar. SBa galaxies have bright, fairly large nuclear bulges and tightly wound, smooth spiral arms that emerge from the ends of the bar or from a circular ring external to the bar. SBb systems have a smooth bar as well as relatively smooth and continuous arms. In some galaxies of this type, the arms start at or near the ends of the bar, with conspicuous dust lanes along the inside of the bar that can be traced right up to the nucleus. Others have arms that start tangent to a ring external to the bar. In SBc galaxies, both the arms and the bar are highly resolved into star clouds and stellar associations. The arms are open in form and can start either at the ends of the bar or tangent to a ring.",
  "  Most representatives of this class consist of grainy, highly irregular assemblages of luminous areas. They have neither noticeable symmetry nor an obvious central nucleus, and they are generally bluer in colour than are the arms and disks of spiral galaxies. An extremely small number of them, however, are red and have a smooth, though nonsymmetrical, shape.",
  "  Hubble recognized these two types of irregular galaxies, Irr I and Irr II. The Irr I type is the most common of the irregular systems, and it seems to fall naturally on an extension of the spiral classes, beyond Sc, into galaxies with no discernible spiral structure. They are blue, are highly resolved, and have little or no nucleus. The Irr II systems are red, rare objects. They include various kinds of chaotic galaxies for which there apparently are many different explanations, including most commonly the results of galaxy-galaxy interactions, both tidal distortions and cannibalism; therefore, this category is no longer seen as a useful way to classify galaxies.",
  "Some irregular galaxies, like spirals, are barred. They have a nearly central bar structure dominating an otherwise chaotic arrangement of material. The Large Magellanic Cloud is a well-known example.",
  "Other classification schemes similar to Hubble’s follow his pattern but subdivide the galaxies differently. A notable example of one such system is that of de Vaucouleurs. This scheme, which has evolved considerably since its inception in 1959, includes a large number of codes for indicating different kinds of morphological characteristics visible in the images of galaxies ( see ). The major Hubble galaxy classes form the framework of de Vaucouleurs’s scheme, and its subdivision includes different families, varieties, and stages. The de Vaucouleurs system is so detailed that it is more of a descriptive code for galaxies than a commonly used classification scheme.",
  "Galaxies with unusual properties often have shorthand names that refer to their characteristic properties. Common examples are",
  "There are also different schemes used for extremely distant galaxies, which we see in their youth. When a very distant galaxy is examined with a very large telescope , we see its structure as it was when the light was emitted billions of years ago. In such cases, the distinctive Hubble types are not so obvious. Apparently, galaxies are much less well organized in their early years, and these very distant objects tend to be highly irregular and asymmetrical. Although special classification schemes are sometimes used for special purposes, the general scheme of Hubble in its updated form is the one most commonly used.",
  "Before astronomers could establish the existence of galaxies, they had to develop a way to measure their distances. In an earlier section, it was explained how astronomers first accomplished this exceedingly difficult task for the nearby galaxies during the 1920s. Until the late decades of the 20th century, progress was discouragingly slow. Even though increased attention was being paid to the problem around the world, a consensus was not reached. In fact, the results of most workers fell into two separate camps, in which the distances found by one were about twice the size of the other’s. For this reason, shortly after its launch into Earth orbit in 1990, the Hubble Space Telescope (HST) was assigned the special task of reliably determining the extragalactic distance scale. Led by the Canadian-born astronomer Wendy Freedman and the American astronomer Robert Kennicutt, the team used a considerable amount of the HST’s time to measure the properties of the Cepheid variable stars in a carefully selected set of galaxies. Their results were intermediate between the two earlier distance scales. With subsequent refinements, the scale of distances between the galaxies is now on fairly secure footing.",
  "The HST distance scale project established the scale of distances for the nearby universe. Establishing the distances to galaxies over the entire range of present observations (several billion light-years ) is an even more difficult task. The process involved is one of many successive steps that are all closely tied to one another. Before even the nearby galaxy distances measured by the HST can be established, distances must first be determined for a number of galaxies even closer to the Milky Way Galaxy , specifically those in the Local Group . For this step, criteria are used that have been calibrated within the Milky Way Galaxy, where checks can be made between different methods and where the ultimate criterion is a geometric one, basically involving trigonometric parallaxes , especially those determined by the Hipparcos satellite. These distance criteria, acting as \"standard candles,\" are then compared with the HST observations of galaxies beyond the Local Group, where other methods are calibrated that allow even larger distances to be gauged. This general stepwise process continues to the edge of the observable universe.",
  "The Local Group of galaxies is a concentration of approximately 50 galaxies dominated by two large spirals, the Milky Way Galaxy and the Andromeda Galaxy ( see ). For many of these galaxies, distances can be measured by using the Cepheid P-L law, which has been refined and made more precise since it was first used by American astronomer Edwin Hubble . For instance, the nearest external galaxy, the Large Magellanic Cloud, contains thousands of Cepheid variables, which can be compared with Cepheids of known distance in the Milky Way Galaxy to yield a distance determination of 160,000 light-years. This method has been employed for almost all galaxies of the Local Group that contain massive-enough stars to include Cepheids. Most of the rest of the members are elliptical galaxies, which do not have Cepheid variables; their distances are measured by using Population II stars, such as RR Lyrae variables or luminous red giants.",
  "Beyond the Local Group are two nearby groups for which the P-L relation has been used: the Sculptor Group and the M81 Group. Both of these are small clusters of galaxies that are similar in size to the Local Group. They lie at a distance of 10 to 15 million light-years.",
  "One example of an alternate method to the Cepheid P-L relationship makes use of planetary nebulae , the ringlike shells that surround some stars in their late stages of evolution. Planetary nebulae have a variety of luminosities, depending on their age and other physical circumstances; however, it has been determined that the brightest planetary nebulae have an upper limit to their intrinsic brightnesses. This means that astronomers can measure the brightnesses of such nebulae in any given galaxy, find the upper limit to the apparent brightnesses, and then immediately calculate the distance of the galaxy. This technique is effective for measuring distances to galaxies in the Local Group, in nearby groups, and even as far away as the Virgo Cluster, which lies at a distance of about 50 million light-years.",
  "Once distances have been established for these nearby galaxies and groups, new criteria are calibrated for extension to fainter galaxies. Examples of the many different criteria that have been tried are the luminosities of the brightest stars in the galaxy, the diameters of the largest H II regions , supernova luminosities, the spread in the rotational velocities of stars and interstellar gas (the Tully-Fisher relation), and the luminosities of globular clusters . All of these criteria have difficulties in their application because of dependencies on galaxy type, composition, luminosity, and other characteristics, so the results of several methods must be compared and cross-checked. Such distance criteria allow astronomers to measure the distances to galaxies out to a few hundred million light-years.",
  "Beyond 100 million light-years another method becomes possible. The expansion of the universe, at least for the immediate neighbourhood of the Local Group (within one billion light-years or so), is almost linear, so the radial velocity of a galaxy is a reliable distance indicator. The velocity is directly proportional to the distance in this interval, so once a galaxy’s radial velocity has been measured, all that must be known is the constant of proportionality, which is called Hubble’s constant . Although there still remains some uncertainty in the correct value of Hubble’s constant, the value obtained by the HST is generally considered the best current value, which is very near 25 km/sec per one million light-years. This value does not apply in or near the Local Group, because radial velocities measured for nearby galaxies and groups are affected by the Local Group’s motion with respect to the general background of galaxies, which is toward a concentration of galaxies and groups of galaxies centred on the Virgo Cluster (the Local Supercluster). Radial velocities cannot give reliable distances beyond a few billion light-years, because, in the case of such galaxies, the observed velocities depend on what the expansion rate of the universe was then rather than what it is now. The light that is observed today was emitted several billion years ago when the universe was much younger and smaller than it is at present, when it might have been expanding either more rapidly or more slowly than now.",
  "To find the distances of very distant galaxies, astronomers have to avail themselves of methods that make use of extremely bright objects. In the past, astronomers were forced to assume that the brightest galaxies in clusters all have the same true luminosity and that measuring the apparent brightness of the brightest galaxy in a distant cluster will therefore give its distance. This method is no longer used, however, as there is too much scatter in the brightness of the brightest galaxies and because there are reasons to believe that both galaxies and galaxy clusters in the early universe were quite different from those of the present.",
  "The only effective way found so far for measuring distances to the most-distant detectable galaxies is to use the brightness of a certain type of supernova, called Type Ia. In the nearby universe these supernovae—massive stars that have collapsed and ejected much of their material explosively out into interstellar space—show uniformity in their maximum brightnesses; thus, it can be assumed that any supernovae of that type observed in a very distant galaxy should also have the same luminosity. Recent results have strongly suggested that the universe’s expansion rate is greater here and now than it was in the distant past. This change of the expansion rate has important implications for cosmology .",
  "The range in intrinsic size for the external galaxies extends from the smallest systems, such as the extreme dwarf galaxies found near the Milky Way that are only 100 light years across, to giant radio galaxies, the extent of which (including their radio-bright lobes) is more than 3,000,000 light-years. Normal large spiral galaxies, such as the Andromeda Galaxy, have diameters of 100,000 to 500,000 light-years.",
  "The total masses of galaxies are not well known, largely because of the uncertain nature of the hypothesized invisible dark halos that surround many, or possibly all, galaxies. The total mass of material within the radius out to which the stars or gas of a galaxy can be detected is known for many hundreds of systems. The range is from about 100,000 to roughly 1,000,000,000,000 times the Sun’s mass. The mass of a typical large spiral is about 500,000,000,000 Suns.",
  "In the late 20th century it became clear that most of the mass in galaxies is not in the form of stars or other visible matter. By measuring the speed with which stars in spiral and elliptical galaxies orbit the centre of the galaxy, one can measure the mass inside that orbit. Most galaxies have more mass than can be accounted for by their stars. Therefore, there is some unidentified “ dark matter ” that dominates the dynamics of most galaxies. The dark matter seems to be distributed more broadly than the stars in galaxies. Extensive efforts to identify this dark matter have not yet been satisfactory, though the detection of large numbers of very faint stars, including brown dwarfs , was in some sense a by-product of these searches, as was the discovery of the mass of neutrinos . It is somewhat frustrating for astronomers to know that the majority of the mass in galaxies (and in the universe) is of an unknown nature.",
  "The external galaxies show an extremely large range in their total luminosities. The intrinsically faintest are the extreme dwarf elliptical galaxies, such as the Ursa Minor dwarf, which has a luminosity of approximately 100,000 Suns. The most luminous galaxies are those that contain quasars at their centres. These remarkably bright superactive nuclei can be as luminous as 2,000,000,000,000 Suns. The underlying galaxies are often as much as 100 times fainter than their nuclei. Normal large spiral galaxies have a luminosity of a few hundred billion Suns.",
  "Even though different galaxies have had quite different histories, measurements tend to suggest that most, if not all, galaxies have very nearly the same age. The age of the Milky Way Galaxy, which is measured by determining the ages of the oldest stars found within it, is approximately 13 billion years. Nearby galaxies, even those such as the Large and Small Magellanic Clouds that contain a multitude of very young stars, also have at least a few very old stars of approximately that same age. When more distant galaxies are examined, their spectra and colours closely resemble those of the nearby galaxies, and it is inferred that they too must contain a population of similarly very old stars. Extremely distant galaxies, on the other hand, look younger, but that is because the “look-back” time for them is a significant fraction of their age; the light received from such galaxies was emitted when they were appreciably younger.",
  "It seems likely that all the galaxies began to form about the same time, when the universe had cooled down enough for matter to condense, and they all thus started forming stars during nearly the same epoch. Their large differences are a matter not of age but rather of how they proceeded to regulate the processing of their materials (gas and dust) into stars. Some ellipticals formed almost all their stars during the first few billion years, while others may have had a more complicated history, including various periods of active star formation related to the merging together of smaller galaxies. In a merging event the gas can be compressed, which enhances the conditions necessary for new bursts of star formation. The spirals and the irregulars, on the other hand, have been using up their materials more gradually.",
  "The abundances of the chemical elements in stars and galaxies are remarkably uniform. The ratios of the amounts of the different elements that astronomers observe for the Sun are a reasonably good approximation for those of other stars in the Milky Way Galaxy and also for stars in other galaxies. The main difference found is in the relative amount of the primordial gases, hydrogen and helium . The heavier elements are formed by stellar evolutionary processes, and they are relatively more abundant in areas where extensive star formation has been taking place. Thus, in such small elliptical galaxies as the Draco system, where almost all the stars were formed at the beginning of its lifetime, the component stars are nearly pure hydrogen and helium, while in such large galaxies as the Andromeda Galaxy there are areas where star formation has been active for a long time (right up to the present, in fact), and there investigators find that the heavier elements are more abundant. In some external galaxies as well as in some parts of the Milky Way Galaxy system, heavy elements are even more abundant than in the Sun but rarely by more than a factor of two or so. Even in such cases, hydrogen and helium make up most of the constituent materials, accounting for at least 90 percent of the mass.",
  "Most and perhaps all galaxies have a spheroidal component of old stars. In the ellipticals this component constitutes all or most of any given system. In the spirals it represents about half the constituent stars (this fraction varies greatly according to galaxy type). In the irregulars the spheroidal component is very inconspicuous or, possibly in some cases, entirely absent. The structure of the spheroidal component of all galaxies is similar, as if the spirals and irregulars possess a skeleton of old stars arranged in a structure that resembles an elliptical. The radial distribution of stars follows a law of the form  I = I   e  10 (−3.33{[ r / r   e  ] 1/4 − 1}) , where I is the surface brightness (or the stellar density) at position r , r is the radial distance from the centre, and I   e  and r   e  are constants. This expression, introduced by the French-born American astronomer Gerard de Vaucouleurs, is an empirical formula that works remarkably well in describing the spheroidal components of almost all galaxies. An alternative formula, put forth by Edwin Hubble , is of the form  I = I  0 ( r / a + 1) −2 , where I is the surface brightness, I  0 is the central brightness, r is the distance from the centre, and a is a scaling constant. Either of these formulas describes the structure well, but neither explains it.",
  "A somewhat more complicated set of equations can be derived on the basis of the mutual gravitational attraction of stars for one another and the long-term effects of close encounters between stars. These models of the spheroidal component (appropriately modified in the presence of other galactic components) fit the observed structures well. Rotation is not an important factor, since most elliptical galaxies and the spheroidal component of spiral systems (e.g., the Milky Way Galaxy) rotate slowly. One of the open questions about the structure of these objects is why they have as much flattening as some of them do. In most cases, the measured rotation rate is inadequate to explain the flattening on the basis of a model of an oblate spheroid that rotates around its short axis. Some elliptical galaxies are instead prolate spheroids that rotate around their long axis.",
  "Except for such early-type galaxies as S0, SB0, Sa, and SBa systems, spirals and irregulars have a flat component of stars that emits most of their brightness. The disk component has a thickness that is approximately one-fifth its diameter (this varies, depending on the type of stars being considered; see  Milky Way Galaxy ). The stars show a radial distribution that obeys an exponential decrease outward; i.e., the brightness obeys a formula of the form log I = − k  r , where I is the surface brightness, r is the distance from the centre, and k is a scaling constant. This constant is dependent both on the type of the galaxy and on its intrinsic luminosity. The steepness of the outward slope is greatest for the early Hubble types (Sa and SBa) and for the least-luminous galaxies.",
  "The structure of the arms of spiral galaxies depends on the galaxy type, and there is also a great deal of variability within each type. Generally, the early Hubble types have smooth, indistinct spiral arms with small pitch angles. The later types have more-open arms (larger pitch angles). Within a given type there can be found galaxies that have extensive arms (extending around the centre for two or more complete rotations) and those that have a chaotic arm structure made up of many short fragments that extend only 20° or 30° around the centre. All spiral arms fit reasonably well to a logarithmic spiral of the form described in the article Milky Way Galaxy .",
  "If one were to look at galaxies at wavelengths that show only neutral hydrogen gas, they would look rather different from their optical appearance. Normally the gas, as detected at radio wavelengths for neutral hydrogen atoms, is more widely spread out, with the size of the gas component often extending to twice the size of the optically visible image. Also, in some galaxies a hole exists in the centre of the system where almost no neutral hydrogen occurs. There is, however, enough molecular hydrogen to make up for the lack of atomic hydrogen. Molecular hydrogen is difficult to detect, but it is accompanied by other molecules, such as carbon monoxide , which can be observed at radio wavelengths.",
  "  Galaxies tend to cluster together, sometimes in small groups and sometimes in enormous complexes. Most galaxies have companions, either a few nearby objects or a large-scale cluster; isolated galaxies, in other words, are quite rare.",
  "There are several different classification schemes for galaxy clusters, but the simplest is the most useful. This scheme divides clusters into three classes: groups, irregulars, and sphericals.",
  "  The groups class is composed of small compact groups of 10 to 50 galaxies of mixed types, spanning roughly five million light-years. An example of such an entity is the Local Group, which includes the Milky Way Galaxy, the Magellanic Clouds, the Andromeda Galaxy, and about 50 other systems, mostly of the dwarf variety.",
  "Irregular clusters are large loosely structured assemblages of mixed galaxy types (mostly spirals and ellipticals), totaling perhaps 1,000 or more systems and extending out 10,000,000 to 50,000,000 light-years. The Virgo and Hercules clusters are representative of this class.",
  "Spherical clusters are dense and consist almost exclusively of elliptical and S0 galaxies. They are enormous, having a linear diameter of up to 50,000,000 light-years. Spherical clusters may contain as many as 10,000 galaxies, which are concentrated toward the cluster centre.",
  "Clusters of galaxies are found all over the sky. They are difficult to detect along the Milky Way, where high concentrations of the Galaxy’s dust and gas obscure virtually everything at optical wavelengths. However, even there clusters can be found in a few galactic “windows,” random holes in the dust that permit optical observations.",
  "  The clusters are not evenly spaced in the sky; instead, they are arranged in a way that suggests a certain amount of organization. Clusters are frequently associated with other clusters, forming giant superclusters . These superclusters typically consist of 3 to 10 clusters and span as many as 200 million light-years. There also are immense areas between clusters that are fairly empty, forming voids. Large-scale surveys made in the 1980s of the radial velocities of galaxies revealed an even-larger kind of structure. It was discovered that galaxies and galaxy clusters tend to fall in position along large planes and curves, almost like giant walls, with relatively empty spaces between them. A related large-scale structure was found to exist where there occur departures from the velocity-distance relation in certain directions, indicating that the otherwise uniform expansion is being perturbed by large concentrations of mass. One of these, discovered in 1988, has been dubbed “the Great Attractor.”",
  "  Galaxies in clusters exist in a part of the universe that is much denser than average, and the result is that they have several unusual features. In the inner parts of dense clusters there are very few, if any, normal spiral galaxies. This condition is probably the result of fairly frequent collisions between the closely packed galaxies, as such violent interactions tend to sweep out the interstellar gas, leaving behind only the spherical component and a gasless disk. What remains is in effect an S0 galaxy.",
  "A second and related effect of galaxy interactions is the presence of gas-poor spiral systems at the centres of large irregular clusters. A significant number of the members of such clusters have anomalously small amounts of neutral hydrogen, and their gas components are smaller on average than those for more isolated galaxies. This is thought to be the result of frequent distant encounters between such galaxies involving the disruption of their outer parts.",
  "A third effect of the dense cluster environment is the presence in some clusters—usually rather small dense clusters—of an unusual type of galaxy called a cD galaxy. These objects are somewhat similar in structure to S0 galaxies ( see above  S0 galaxies ), but they are considerably larger, having envelopes that extend out to radii as large as one million light-years. Many of them have multiple nuclei, and most are strong sources of radio waves. The most likely explanation for cD galaxies is that they are massive central galactic systems that have captured smaller cluster members because of their dominating gravitational fields and have absorbed the other galaxies into their own structures. Astronomers sometimes refer to this process as galactic cannibalism. In this sense, the outer extended disks of cD systems, as well as their multiple nuclei, represent the remains of past partly digested “meals.”",
  "One more effect that can be traced to the cluster environment is the presence of strong radio and X-ray sources, which tend to occur in or near the centres of clusters of galaxies. These will be discussed in detail in the next section.",
  "  Some of the strongest radio sources in the sky are galaxies. Most of them have a peculiar morphology that is related to the cause of their radio radiation. Some are relatively isolated galaxies, but most galaxies that emit unusually large amounts of radio energy are found in large clusters.",
  "  The basic characteristics of radio galaxies and the variations that exist among them can be made clear with two examples. The first is Centaurus A, a giant radio structure surrounding a bright, peculiar galaxy of remarkable morphology designated NGC 5128. It exemplifies a type of radio galaxy that consists of an optical galaxy located at the centre of an immensely larger two-lobed radio source. In the particular case of Centaurus A, the extent of the radio structure is so great that it is almost 100 times the size of the central galaxy, which is itself a giant galaxy. This radio structure includes, besides the pair of far-flung radio lobes, two other sets of radio sources: one that is approximately the size of the optical galaxy and that resembles the outer structure in shape, and a second that is an intense small source at the galaxy’s nucleus. Optically, NGC 5128 appears as a giant elliptical galaxy with two notable characteristics: an unusual disk of dust and gas surrounding it and thin jets of interstellar gas and young stars radiating outward. The most plausible explanation for this whole array is that a series of energetic events in the nucleus of the galaxy expelled hot ionized gas from the centre at relativistic velocities (i.e., those at nearly the speed of light) in two opposite directions. These clouds of relativistic particles generate synchrotron radiation , which is detected at radio (and X-ray) wavelengths. In this model the very large structure is associated with an old event, while the inner lobes are the result of more-recent ejections. The centre is still active, as evidenced by the presence of the nuclear radio source.",
  "  The other notable example of a radio galaxy is Virgo A , a powerful radio source that corresponds to a bright elliptical galaxy in the Virgo Cluster, designated as M87. In this type of radio galaxy, most of the radio radiation is emitted from an appreciably smaller area than in the case of Centaurus A. This area coincides in size with the optically visible object. Virgo A is not particularly unusual except for one peculiarity: it has a bright jet of gaseous material that appears to emanate from the nucleus of the galaxy, extending out approximately halfway to its faint outer parts. This gaseous jet can be detected at optical, radio, and other (e.g., X-ray) wavelengths; its spectrum suggests strongly that it shines by means of the synchrotron mechanism.",
  "  The only condition that can account for the immense amounts of energy emitted by radio galaxies is the capture of material (interstellar gas and stars) by a supermassive object at their centre. Such an object would resemble the one thought to be in the nucleus of the Milky Way Galaxy but would be far more massive. In short, the most probable type of supermassive object for explaining the details of strong radio sources would be a black hole . For example, M87 has such a black hole, with a mass 6.5 billion times that of the Sun. Large amounts of energy can be released when material is captured by a black hole. An extremely hot high-density accretion disk is first formed around the supermassive object from the material, and then some of the material seems to be ejected explosively from the area, giving rise to the various radio jets and lobes observed.",
  "Another kind of event that can result in an explosive eruption around a nuclear black hole involves cases of merging galaxies in which the nuclei of the galaxies “collide.” Because many, if not most, galaxy nuclei contain a black hole, such a collision can generate an immense amount of energy as the black holes merge.",
  " Synchrotron radiation is characteristically emitted at virtually all wavelengths at almost the same intensity. A synchrotron source therefore ought to be detectable at optical and radio wavelengths, as well as at others (e.g., infrared, ultraviolet, X-ray, and gamma-ray wavelengths). For radio galaxies this does seem to be the case, at least in circumstances where the radiation is not screened by absorbing material in the source or in intervening space.",
  " X-rays are absorbed by Earth’s atmosphere. Consequently, X-ray galaxies could not be detected until it became possible to place telescopes above the atmosphere, first with balloons and sounding rockets and later with orbiting observatories specially designed for X-ray studies. For example, the Einstein Observatory, which was in operation during the early 1980s, made a fairly complete search for X-ray sources across the sky and studied several of them in detail. Beginning in 1999, the Chandra X-ray Observatory and other orbiting X-ray observatories detected huge numbers of emitters. Many of the sources turned out to be distant galaxies and quasars, while others were relatively nearby objects, including neutron stars (extremely dense stars composed almost exclusively of neutrons ) in the Milky Way Galaxy.",
  "A substantial number of the X-ray galaxies so far detected are also well-known radio galaxies. Some X-ray sources, such as certain radio sources, are much too large to be individual galaxies but rather consist of a whole cluster of galaxies.",
  "Some clusters of galaxies contain a widespread intergalactic cloud of hot gas that can be detected as a diffuse radio source or as a large-scale source of X-rays. The gaseous cloud has a low density but a very high temperature, having been heated by the motion of the cluster’s galaxies through it and by the emission of high-energy particles from active galaxies within it.",
  "The form of certain radio galaxies in clusters points rather strongly to the presence of intergalactic gas. These are the “head-tail” galaxies, systems that have a bright source accompanied by a tail or tails that appear swept back by their interaction with the cooler more stationary intergalactic gas. These tails are radio lobes of ejected gas whose shape has been distorted by collisions with the cluster medium.",
  "  An apparently new kind of radio source was discovered in the early 1960s when radio astronomers identified a very small but powerful radio object designated 3C 48 with a stellar optical image. When they obtained the spectrum of the optical object, they found unexpected and at first unexplainable emission lines superimposed on a flat continuum. This object remained a mystery until another similar but optically brighter object, 3C 273, was examined in 1963. Investigators noticed that 3C 273 had a normal spectrum with the same emission lines as observed in radio galaxies, though greatly redshifted (i.e., the spectral lines are displaced to longer wavelengths), as by the Doppler effect . If the redshift were to be ascribed to velocity, however, it would imply an immense velocity of recession. In the case of 3C 48, the redshift had been so large as to shift familiar lines so far that they were not recognized. Many more such objects were found, and they came to be known as quasi-stellar radio sources, abbreviated as quasars.",
  "Although the first 20 years of quasar studies were noted more for controversy and mystery than for progress in understanding, subsequent years finally saw a solution to the questions raised by these strange objects. It is now clear that quasars are extreme examples of energetic galaxy nuclei. The amount of radiation emitted by such a nucleus overwhelms the light from the rest of the galaxy, so only very special observational techniques can reveal the galaxy’s existence.",
  "A quasar has many remarkable properties. Although it is extremely small (only the size of the solar system), it emits up to 100 times as much radiation as an entire galaxy. It is a complex mixture of very hot gas, cooler gas and dust, and particles that emit synchrotron radiation. Its brightness often varies over short periods—days or even hours. The galaxy underlying the brilliant image of a quasar may be fairly normal in some of its properties except for the superficial large-scale effects of the quasar at its centre. Quasars apparently are powered by the same mechanism attributed to radio galaxies. They demonstrate in an extreme way what a supermassive object at the centre of a galaxy can do.",
  "  With the gradual recognition of the causes of the quasar phenomenon has come an equally gradual realization that they are simply extreme examples of a process that can be observed in more familiar objects. The black holes that are thought to inhabit the cores of the quasar galaxies are similar to, though more explosive than, those that appear to occur in certain unusual nearer galaxies known as Seyfert galaxies . The radio galaxies fall in between. The reason for the differences in the level of activity is apparently related to the source of the gas and stars that are falling into the centres of such objects, providing the black holes with fuel. In the case of quasars, evidence suggests that an encounter with another galaxy, which causes the latter to be tidally destroyed and its matter to fall into the centre of the more massive quasar galaxy, may be the cause of its activity. As the material approaches the black hole, it is greatly accelerated, and some of it is expelled by the prevailing high temperatures and drastically rapid motions. This process probably also explains the impressive but lower-level activity in the nuclei of radio and Seyfert galaxies. The captured mass may be of lesser amount—i.e., either a smaller galaxy or a portion of the host galaxy itself. Quasars are more common in that part of the universe observed to have redshifts of about 2, meaning that they were more common about 10 or so billion years ago than they are now, which is at least partly a result of the higher density of galaxies at that time.",
  "In the 1970s a new type of object was identified as using orbiting gamma-ray detectors. These “ gamma-ray bursts ” are identified by extremely energetic flashes of gamma radiation that last only seconds. In some cases the bursts are clearly identified with very distant galaxies, implying immense energies in the bursts. Possibly these are the explosions of \"hypernovae,\" posited to be far more energetic than supernovae and which require some extreme kind of event, such as the merging of two neutron stars.",
  "  The study of the origin and evolution of galaxies and the quasar phenomenon has only just begun. Many models of galaxy formation and evolution have been constructed on the basis of what we know about conditions in the early universe, which is in turn based on models of the expansion of the universe after the big bang (the primordial explosion from which the universe is thought to have originated) and on the characteristics of the cosmic microwave background (the observed photons that show us the light-filled universe as it was when it was a few hundred thousand years old).",
  "When the universe had expanded to be cool enough for matter to remain in neutral atoms without being instantly ionized by radiation, structure apparently had already been established in the form of density fluctuations. At a crucial point in time, there condensed from the expanding matter small clouds (protogalaxies) that could collapse under their own gravitational field eventually to form galaxies.",
  "For the latter half of the 20th century, there were two competing models of galaxy formation: “top-down” and “bottom-up.” In the top-down model, galaxies formed out of the collapse of much larger gas clouds. In the bottom-up model, galaxies formed from the merger of smaller entities that were the size of globular clusters . In both models the angular momentum of the original clouds determined the form of the galaxy that eventually evolved. It is thought that a protogalaxy with a large amount of angular momentum tended to form a flat, rapidly rotating system (a spiral galaxy), whereas one with very little angular momentum developed into a more nearly spherical system (an elliptical galaxy).",
  "The transition from the 20th to the 21st century coincided with a dramatic transition in our understanding of the evolution of galaxies. It is no longer believed that galaxies have evolved smoothly and alone. Indeed, it has become clear that collisions between galaxies have occurred all during their evolution—and these collisions, far from being rare events, were the mechanism by which galaxies developed in the distant past and are the means by which they are changing their structure and appearance even now. Evidence for this new understanding of galactic evolution comes primarily from two sources: more detailed studies of nearby galaxies with new, more sensitive instruments and deep surveys of extremely distant galaxies, seen when the universe was young.",
  "Recent surveys of nearby galaxies, including the Milky Way Galaxy , have shown evidence of past collisions and capture of galaxies. For the Milky Way the most conspicuous example is the Sagittarius Galaxy, which has been absorbed by our Galaxy. Now its stars lie spread out across the sky, its seven globular clusters intermingling with the globular clusters of the Milky Way Galaxy. Long tails of stars around the Milky Way were formed by the encounter and act as clues to the geometry of the event. A second remnant galaxy, known as the Canis Major Dwarf Galaxy , can also be traced by the detection of star streams in the outer parts of our Galaxy. These galaxies support the idea that the Milky Way Galaxy is a mix of pieces, formed by the amalgamation of many smaller galaxies.",
  "The Andromeda Galaxy (M31) also has a past involving collisions and accretion. Its peculiar close companion, M32, shows a structure that indicates that it was formerly a normal, more massive galaxy that lost much of its outer parts and possibly all of its globular clusters to M31 in a past encounter. Deep surveys of the outer parts of the Andromeda Galaxy have revealed huge coherent structures of star streams and clouds, with properties indicating that these include the outer remnants of smaller galaxies “eaten” by the giant central galaxy, as well as clouds of M31 stars ejected by the strong tidal forces of the collision.",
  "More spectacular are galaxies presently in the process of collision and accretion in the more distant, but still nearby, universe. The symptoms of the collision are the distortion of the galaxies’ shape (especially that of the spiral arms), the formation of giant arcs of stars by tidal action, and the enhanced rate of star and star cluster formation. Some of the most massive and luminous young star clusters observed anywhere lie in the regions where two galaxies have come together, with their gas and dust clouds colliding and merging in a spectacular cosmic fireworks display.",
  "  A second type of evidence for the fact that galaxies grow by merging comes from very deep surveys of the very distant universe, especially those carried out with the Hubble Space Telescope (HST). These surveys, especially the Hubble Deep Field and the Hubble Ultra Deep Field, found galaxies so far away that the light observed by the HST left them when they were very young, only a few hundred million years old. This enables the direct detection and measurement of young galaxies as they were when the universe was young. The result is a view of a very different universe of galaxies. Instead of giant elliptical galaxies and grand spirals, the universe in its early years was populated with small, irregular objects that looked like mere fragments. These were the building blocks that eventually formed bigger galaxies such as the Milky Way. Many show active formation of stars that are deficient in heavy elements because many of the heavy elements had not yet been created when these stars were formed.",
  "The rate of star formation in these early times was significant, but it did not reach a peak until about one billion years later. Galaxies from this time show a maximum in the amount of excited hydrogen , which indicates a high rate of star formation, as young, very hot stars are necessary for exciting interstellar hydrogen so that it can be detected. Since that time, so much matter has been locked up in stars (especially white dwarfs ) that not enough interstellar dust and gas are available to achieve such high rates of star formation.",
  "An important development that has helped our understanding of the way galaxies form is the great success of computer simulations. High-speed calculations of the gravitational history of assemblages of stars, interstellar matter, and dark matter suggest that after the big bang the universe developed as a networklike arrangement of material, with gradual condensation of masses where the strands of the network intersected. In simulations of this process, massive galaxies form, but each is surrounded by a hundred or so smaller objects. The small objects may correspond to the dwarf galaxies, such as those that surround the Milky Way Galaxy but of which only a dozen or so remain, the rest having presumably been accreted by the main galaxy. Such computer models, called “n-body simulations,” are especially successful in mimicking galaxy collisions and in helping to explain the presence of various tidal arms and jets observed by astronomers.",
  "In summary, the current view of galactic history is that present-day galaxies are a mix of giant objects that accreted lesser galaxies in their vicinities, especially early in the formation of the universe, together with some remnant lesser, or dwarf, galaxies that have not yet come close enough to a more massive galaxy to be captured. The expansion of the universe gradually decreases the likelihood of such captures, so some of the dwarfs may survive to old age—eventually dying, like their giant cousins, when all of their stars become dim white dwarfs or black holes and slowly disappear.",
  " William H. Waller and Paul W. Hodge , Galaxies and the Cosmic Frontier (2003), gives a thorough review of both the properties of galaxies and their relation to the wider questions of cosmology. Mark H. Jones and Robert J. Lambourne , An Introduction to Galaxies and Cosmology (2004), is a textbook intended for college students but that can be read to advantage by informed nonstudents. Linda S. Sparke and John S. Gallagher , Galaxies in the Universe (2000), is a very useful textbook designed for advanced undergraduate students and others with a knowledge of the basics of astronomy. Debra M. Elmegreen , Galaxies and Galactic Structure (1998), is a basic introduction with excellent nonmathematical treatment of almost all aspects of galactic and extragalactic subjects.",
  " Sidney van den Bergh , Galaxy Morphology and Classification (1998), is a comprehensive treatment of the subject, and The Galaxies of the Local Group (2000), is a complete treatment of the properties of the nearest galaxies.",
  " Edwin Hubble , The Realm of the Nebulae (1936, reprinted 1982), is a classic account of the early history of extragalactic research written by one of the pioneer investigators. Allan Sandage , The Hubble Atlas of Galaxies (1961), discusses galaxy classification and includes marvelous full-page illustrations of different types of galaxies."
]