[
  " nitrogen group element , any of the chemical elements that constitute Group 15 (Va) of the periodic table. The group consists of nitrogen (N), phosphorus (P), arsenic (As), antimony (Sb), bismuth (Bi), and moscovium (Mc). The elements share certain general similarities in chemical behaviour, though they are clearly differentiated from one another chemically, and these similarities reflect common features of the electronic structures of their atoms.",
  "Probably no other group of the elements is more familiar to the layperson than this group. Although the six elements together make up less than 0.2 percent by weight of Earth’s crust, they assume an importance far out of proportion to their abundance. This is especially true of the elements nitrogen and phosphorus, which constitute 2.4 and 0.9 percent, respectively, of the total weight of the human body.",
  "The nitrogen elements have, perhaps, the widest range in physical state of any group in the periodic table. Nitrogen, for example, is a gas that liquefies at about −200° C and freezes around −210° C, whereas bismuth is a solid melting at 271° C and boiling at about 1,560° C. Chemically, too, the range in properties is wide, nitrogen and phosphorus being typical nonmetals; arsenic and antimony, metalloids; and bismuth, a metal. Even in appearance these elements exhibit great variety. Nitrogen is colourless both as a gas and as a liquid. Phosphorus exists in a variety of physical modifications, or allotropic forms, including the familiar white, highly reactive form that must be stored under water to prevent it from igniting in the air; a much less reactive red or violet form; and a black modification that, although least known, appears to be the most stable of all. Arsenic exists mainly as a dull gray metallic solid, but a more reactive yellow, solid form is also known, and there are indications that other forms exist under certain conditions. Antimony is a silver, metallic appearing, but somewhat brittle solid; and bismuth is a silver-white metal with a trace of pink in its lustre.",
  "Together with carbon, hydrogen, oxygen, and sulfur, the first two members of this group, nitrogen and phosphorus, are the principal chemical elements incorporated into living systems. Nitrogen and phosphorus are readily removed from the soil by plant growth and therefore are immensely important components of plant foods. Such designations as “5–10–5” on commercial fertilizers represent the respective weight percentage composition of the material in terms of nitrogen, phosphoric oxide, and potassium oxide (potassium being the third principal element needed for healthy plant growth). Nitrogen in fertilizers may be in the form of sodium or potassium nitrates, ammonia, ammonium salts, or various organic combinations. Phosphorus is supplied chiefly as inorganic phosphate.",
  "These same elements, nitrogen and phosphorus, can also be used in ways less helpful to man. The explosives in conventional warfare are heavily dependent on their content of nitrogen compounds, and the deadly nerve gases are composed of organic compounds of phosphorus.",
  "On the other hand, arsenic, which is notorious for its toxicity, is most useful in agriculture, where its compounds are an aid in controlling harmful insect pests. Antimony and bismuth are used chiefly in metal alloys, because they impart unique and desirable properties to these alloys.",
  "In the periodic table, each of the nitrogen group elements occupies the fifth position among the main group elements of its period, a position designated 15. In terms of the electronic configuration of its atoms, each nitrogen group element possesses an outermost shell of five electrons. In each case, these occupy an outer s orbital completely (with two electrons) and contribute one electron to each of the three outer p orbitals (the orbitals being electron regions within the atom and the letter designations, s, p, d , and f , being used to designate different classes of orbital). The arrangement of outer electrons in the atoms of the nitrogen elements thus provides three half-filled outer orbitals that, by interaction with half-filled orbitals of the atoms of other elements, can form three covalent bonds. The other atoms may attract the shared electrons either more or less strongly than do the nitrogen group atoms; therefore the latter may acquire either positive or negative charges and exist in oxidation states of +3 or −3 in their compounds. In this respect, the nitrogen elements are alike.",
  "Another similarity among the nitrogen elements is the existence of an unshared, or lone, pair of electrons, which remains after the three covalent bonds, or their equivalent, have been formed. This lone pair permits the molecule to act as an electron pair donor in the formation of molecular addition compounds and complexes. The availability of the lone pair depends upon various factors, such as the relative size of the atom, its partial charge in the molecule, the spatial characteristics of other groups in the molecule, and the as-yet poorly understood phenomenon called the “inert pair effect.” This effect consists of a tendency for the paired s electrons in the outermost shell of the heavier atoms of a major group to remain chemically unreactive. Because of it, the electron pair-donating ability of the nitrogen group elements is not uniform throughout the group; it is probably greatest with nitrogen, less with the intermediate elements, and nonexistent with bismuth.",
  "Significant differences in electronic configurations also occur among the elements of the nitrogen group with respect both to the underlying shell and to the outer d orbitals. Since the latter first appear with the third period of the table, they are present in all elements of the group but nitrogen. The possibility of utilizing these outer d orbitals for bonding thus exists for phosphorus, arsenic, antimony, and bismuth, but not for nitrogen.",
  "There are three principal ways in which the outer d orbitals can be used to increase the number of bonds or expand the valence octet. One is by providing a space to which one of the s electrons can be promoted. This creates two additional half-filled orbitals (one d and one s orbital), and it therefore generates the capacity to form two additional covalent bonds. This is exemplified by the production of phosphorus pentafluoride, PF 5 , by further fluorination of the trifluoride, PF 3 . Such promotion appears to be greatly assisted by the increase in outer d -orbital stability that results from the withdrawal of part of the screening electron and the attendant increase of the effective nuclear charge of the central atom. In PF 5 , for example, the fluorine atoms, being much more electronegative than the phosphorus atom, draw away a portion of the phosphorus electrons, leaving the outer d orbitals more exposed to the phosphorus nucleus and therefore more stable.",
  "A second way in which the outer d orbitals can become involved in the bonding is by their becoming sufficiently stable to attract a lone pair of electrons from a donor. For example, PF 5 can serve as an electron pair acceptor through an outer d orbital to coordinate a fluoride ion donor and form the complex ion PF 6  − .",
  "A third way of involving d orbitals in bonding is for them to become partially occupied in accommodating lone-pair electrons from another atom, which is already attached by a single bond, thereby strengthening the bond. The phosphorus oxyhalides, of general formula POX 3 , appear to be examples of this; their phosphorus–oxygen bonds are observed to be shorter and stronger than expected for ordinary single bonds.",
  "It thus is possible for an atom of phosphorus, arsenic, antimony, or bismuth to expand its valence octet to form five covalent bonds and one additional coordinate covalent bond. This is not possible for nitrogen, which exhibits a maximum coordination number of four: three single covalent bonds and a coordinate covalent bond with nitrogen acting as donor (through its lone pair). Nevertheless, the +5 oxidation state is formally applicable to nitrogen, so that nitrogen, phosphorus, arsenic, antimony, and bismuth can all be found in this state. When compounds in the +5 oxidation state are studied, however, it is observed that their properties do not exhibit a uniform trend within the group. Rather, a certain degree of alternation is observed, the +5 states of nitrogen, arsenic, and bismuth appearing less stable and more strongly oxidizing than the corresponding states of phosphorus and antimony. In part this alternation may find explanation in the electronic differences among the atoms with respect to their underlying shells. The number of electrons in the shell just below the outermost level, is two for nitrogen, eight for phosphorus, and 18 for arsenic, antimony, and bismuth.",
  "Increasing the nuclear charge by 18 from phosphorus to arsenic may be accompanied by incomplete shielding of this extra charge by the ten 3 d electrons also added. This would imply smaller size and a greater electronegativity for arsenic than for phosphorus and thus a greater similarity between the phosphorus and antimony atoms. This subject, however, is still controversial, and the widely used scale of electronegativities devised by Linus Pauling fails to make this distinction.",
  "An interesting anomaly is presented by the fact that nitrogen as a free element is in the form of gaseous diatomic molecules, while the elements immediately preceding it in its period of the table are solids, as are the other elements in its group. In surveying the elements of the second period, the most obvious difference in atomic structure found on reaching nitrogen is the appearance for the first time in compounds of the element of a lone pair of electrons not used in bonding with other atoms. Calculations suggest that the presence of this lone pair of electrons is associated with a considerable weakening of nitrogen to nitrogen single bonds in compounds where these bonds occur. In the diatomic nitrogen molecule, however, the bonding is of a different variety—triple bonds being found between the atoms. It is thought that the triple bond is unaffected (unweakened) by the lone pairs of electrons on the nitrogen atoms, and this is assumed to be the reason why nitrogen “prefers” to exist as triply bonded gaseous diatomic molecules rather than as a condensed singly bonded solid polymer.",
  "The same effect might be expected to be operable with the other elements of the nitrogen group, all of which also contain lone electron pairs in their outermost shells. Further calculations disclose, however, that the bond-weakening effect of the lone pair is far less pronounced with these elements than it is with nitrogen. As a result, with these elements, single bonds are favoured over multiple bonds, and the diatomic state of the molecules is not the preferred form.",
  "It might also be expected that the weakening effect of the lone pair would be observed in compounds of the nitrogen group elements. The picture is more complicated here because the bonds under discussion are formed between different types of atoms. Since different elements differ in electronegativity, bonds between the atoms of different elements are inevitably polar. For purposes of discussion it can be assumed that polar bonds consist of blends of nonpolar covalent bonds and completely polar, ionic bonds. It can then be shown that a relatively small amount of ionic character will contribute a disproportionate share to the overall bond strength. Since the weakening effect of the lone pair is felt only on the covalent portion of the polar bond, rather than on the ionic portion, the less polar bonds will exhibit the greater lone-pair weakening effects.",
  "These considerations become important in comparing the chemical behaviour of the nitrogen group elements. The electronegativity of nitrogen itself, although lower than that of oxygen, is substantially higher than that of any of the other elements of this group. Bonds between nitrogen and oxygen, therefore, will be considerably less polar than those between oxygen and phosphorus, or oxygen and arsenic, antimony, or bismuth. Consequently, for this reason alone, the covalent contribution to the nitrogen–oxygen bond energy will be relatively more important than is the case with the bonds between oxygen and the heavier elements of the group. Thus, single-bond weakening by the lone pair—and a corresponding tendency toward bond multiplicity—is likely to be much greater with oxides of nitrogen than with oxides of the heavier nitrogen group elements.",
  "For a list of some of the chief properties of the nitrogen group elements, see .",
  "A concise summary of nitrogen chemistry is contained in William L. Jolly , The Inorganic Chemistry of Nitrogen (1964). More detailed is the comprehensive compendium by C.A. Streuli and P.R. Averell (eds.), The Analytical Chemistry of Nitrogen and Its Compounds , 2 vol. (1970), which includes especially useful tables. A popularized, readable, introductory account is Isaac Asimov , The World of Nitrogen , rev. ed. (1962). Information about nitrogen and its compounds and about the other elements of the nitrogen group and their compounds is found in such standard works on inorganic chemistry as M. Cannon Sneed , J. Lewis Maynard , and Robert C. Brasted (eds.), Comprehensive Inorganic Chemistry , 8 vol. (1953–61); John C. Bailar, Jr. , et al. (eds.), Comprehensive Inorganic Chemistry , 5 vol. (1973); and F. Albert Cotton and Geoffrey Wilkinson , Advanced Inorganic Chemistry , 5th ed. (1988); in R.T. Sanderson , Chemical Bonds and Bond Energy, 2nd ed. (1976), a brief book giving new insights into the nature of chemical bonds; and in Eugene G. Rochow , The Metalloids (1966), a concise, readable survey of the elements that border between metallic and nonmetallic. Detailed discussions on fixation are provided in W.J. Broughton (ed.), Nitrogen Fixation (1981– ). More detailed information on phosphorus may be found in D.E.C. Corbridge , The Structural Chemistry of Phosphorus (1974), and Phosphorus: An Outline of Its Chemistry, Biochemistry, and Technology , 4th ed. (1990); and Harold Goldwhite , Introduction to Phosphorus Chemistry (1981)."
]