[
  "  periodic table , in full periodic table of the elements , in chemistry, the organized array of all the chemical elements in order of increasing atomic number—i.e., the total number of protons in the atomic nucleus. When the chemical elements are thus arranged, there is a recurring pattern called the “periodic law” in their properties, in which elements in the same column (group) have similar properties. The initial discovery, which was made by Dmitry I. Mendeleyev in the mid-19th century, has been of inestimable value in the development of chemistry .",
  "    It was not actually recognized until the second decade of the 20th century that the order of elements in the periodic system is that of their atomic numbers, the integers of which are equal to the positive electrical charges of the atomic nuclei expressed in electronic units. In subsequent years great progress was made in explaining the periodic law in terms of the electronic structure of atoms and molecules. This clarification has increased the value of the law, which is used as much today as it was at the beginning of the 20th century, when it expressed the only known relationship among the elements.",
  "The early years of the 19th century witnessed a rapid development in analytical chemistry—the art of distinguishing different chemical substances—and the consequent building up of a vast body of knowledge of the chemical and physical properties of both elements and compounds. This rapid expansion of chemical knowledge soon necessitated classification, for on the classification of chemical knowledge are based not only the systematized literature of chemistry but also the laboratory arts by which chemistry is passed on as a living science from one generation of chemists to another. Relationships were discerned more readily among the compounds than among the elements; it thus occurred that the classification of elements lagged many years behind that of compounds. In fact, no general agreement had been reached among chemists as to the classification of elements for nearly half a century after the systems of classification of compounds had become established in general use.",
  "J.W. Döbereiner in 1817 showed that the combining weight, meaning atomic weight, of strontium lies midway between those of calcium and barium, and some years later he showed that other such “triads” exist (chlorine, bromine, and iodine [halogens] and lithium, sodium, and potassium [alkali metals]). J.-B.-A. Dumas, L. Gmelin, E. Lenssen, Max von Pettenkofer, and J.P. Cooke expanded Döbereiner’s suggestions between 1827 and 1858 by showing that similar relationships extended further than the triads of elements, fluorine being added to the halogens and magnesium to the alkaline-earth metals, while oxygen, sulfur, selenium, and tellurium were classed as one family and nitrogen, phosphorus, arsenic, antimony, and bismuth as another family of elements.",
  "Attempts were later made to show that the atomic weights of the elements could be expressed by an arithmetic function, and in 1862 A.-E.-B. de Chancourtois proposed a classification of the elements based on the new values of atomic weights given by Stanislao Cannizzaro’s system of 1858. De Chancourtois plotted the atomic weights on the surface of a cylinder with a circumference of 16 units, corresponding to the approximate atomic weight of oxygen. The resulting helical curve brought closely related elements onto corresponding points above or below one another on the cylinder, and he suggested in consequence that “the properties of the elements are the properties of numbers,” a remarkable prediction in the light of modern knowledge.",
  "In 1864, J.A.R. Newlands proposed classifying the elements in the order of increasing atomic weights, the elements being assigned ordinal numbers from unity upward and divided into seven groups having properties closely related to the first seven of the elements then known: hydrogen, lithium, beryllium, boron, carbon, nitrogen, and oxygen. This relationship was termed the law of octaves, by analogy with the seven intervals of the musical scale.",
  "Then in 1869, as a result of an extensive correlation of the properties and the atomic weights of the elements, with special attention to valency (that is, the number of single bonds the element can form), Mendeleyev proposed the periodic law, by which “the elements arranged according to the magnitude of atomic weights show a periodic change of properties.” Lothar Meyer had independently reached a similar conclusion, published after the appearance of Mendeleyev’s paper.",
  "    Mendeleyev’s periodic table of 1869 contained 17 columns, with two nearly complete periods (sequences) of elements, from potassium to bromine and rubidium to iodine, preceded by two partial periods of seven elements each (lithium to fluorine and sodium to chlorine), and followed by three incomplete periods. In an 1871 paper Mendeleyev presented a revision of the 17-group table, the principal improvement being the correct repositioning of 17 elements. He, as well as Lothar Meyer, also proposed a table with eight columns obtained by splitting each of the long periods into a period of seven, an eighth group containing the three central elements (such as iron, cobalt, nickel; Mendeleyev also included copper, instead of placing it in Group I), and a second period of seven. The first and second periods of seven were later distinguished by use of the letters “a” and “b” attached to the group symbols, which were the Roman numerals.",
  "  With the discovery of the noble gases helium, neon, argon, krypton, radon, and xenon by Lord Rayleigh (John William Strutt) and Sir William Ramsay in 1894 and the following years, Mendeleyev and others proposed that a new “zero” group to accommodate them be added to the periodic table. The “short-period” form of the periodic table, with Groups 0, I, II,…VIII, became popular and remained in general use until about 1930.",
  "Based on an earlier (1882) model of T. Bayley, J. Thomsen in 1895 devised a new table. This was interpreted in terms of the electronic structure of atoms by Niels Bohr in 1922. In this table there are periods of increasing length between the noble gases; the table thus contains a period of 2 elements, two of 8 elements, two of 18 elements, one of 32 elements, and an incomplete period. The elements in each period may be connected by tie lines with one or more elements in the following period. The principal disadvantage of this table is the large space required by the period of 32 elements and the difficulty of tracing a sequence of closely similar elements. A useful compromise is to compress the period of 32 elements into 18 spaces by listing the 14 lanthanoids (also called lanthanides) and the 14 actinoids (also called actinides) in a special double row below the other periods.",
  "Alternate long forms of the periodic table have been proposed. One of the earliest, described by A. Werner in 1905, divides each of the shorter periods into two parts, one at either end of the table over the elements in the longer periods that they most resemble. The multiple tie lines connecting the periods in the Bayley-type table are thus dispensed with. This class of table, too, can be greatly simplified by removing the lanthanoid and actinoid elements to a separate area. By the mid-20th century this version of the table had become the most commonly used.",
  "The great value of the periodic law was made evident by Mendeleyev’s success in 1871 in finding that the properties of 17 elements could be correlated with those of other elements by moving the 17 to new positions from those indicated by their atomic weights. This change indicated that there were small errors in the previously accepted atomic weights of several of the elements and large errors for several others, for which wrong multiples of the combining weights had been used as atomic weights (the combining weight being that weight of an element that combines with a given weight of a standard). Mendeleyev was also able to predict the existence, and many of the properties, of the then undiscovered elements eka-boron, eka-aluminum, and eka-silicon, now identified with the elements scandium, gallium, and germanium, respectively. Similarly, after the discovery of helium and argon, the periodic law permitted the prediction of the existence of neon, krypton, xenon, and radon. Moreover, Bohr pointed out that the missing element 72 would be expected, from its position in the periodic system, to be similar to zirconium in its properties rather than to the rare earths; this observation led G. de Hevesy and D. Coster in 1922 to examine zirconium ores and to discover the unknown element, which they named hafnium.",
  "In spite of the corrections made by the redetermination of atomic weights, some of the elements in the Mendeleyev and Lothar Meyer periodic tables of 1871 were still required by their properties to be put in positions somewhat out of the order of atomic weights. In the pairs argon and potassium, cobalt and nickel, and tellurium and iodine, for example, the first element had the greater atomic weight but the earlier position in the periodic system. The solution to this difficulty was found only when the structure of the atom was better understood.",
  "About 1910 Sir Ernest Rutherford’s experiments on the scattering of alpha particles by the nuclei of heavy atoms led to the determination of the nuclear electrical charge. The ratio of the nuclear charge to that of the electron was noted to be roughly one-half the atomic weight. In 1911 A. van den Broek suggested that this quantity, the atomic number, might be identified with the ordinal number of the element in the periodic system (following the lead of Newlands, it had become customary to number the elements according to their position in the table). This suggestion was brilliantly confirmed in 1913 by H.G.J. Moseley’s measurements of the wavelengths of the characteristic X-ray spectral lines of many elements, which showed that the wavelengths did indeed depend in a regular way on the atomic numbers—identical with the ordinal numbers of the elements in the table. There is no longer any uncertainty about the position of any element in the ordered series of the periodic system.",
  "That the exact atomic weight of an element is of small significance for its position in the periodic system is shown by the existence of isotopes of every element—atoms with the same atomic number but different atomic weights. The chemical properties of the isotopes of an element are essentially the same, and all the isotopes of an element occupy the same place in the periodic system in spite of their differences in atomic weight.",
  "Detailed understanding of the periodic system has developed along with the quantum theory of spectra and the electronic structure of atoms, beginning with the work of Bohr in 1913. Important forward steps were the formulation of the general rules of the old quantum theory by William Wilson and Arnold Sommerfeld in 1916, the discovery of the exclusion principle by Wolfgang Pauli in 1925, the discovery of the spin of the electron by George E. Uhlenbeck and Samuel Goudsmit in 1925, and the development of quantum mechanics by Werner Heisenberg and Erwin Schrödinger during the same year. The development of the electronic theory of valence and molecular structure, beginning with the postulate of the shared electron pair by Gilbert N. Lewis in 1916, also played a very important part in explaining the periodic law ( see  chemical bonding ).",
  "  The periodic table of the elements contains all of the chemical elements that have been discovered or made; they are arranged, in the order of their atomic numbers, in seven horizontal periods, with the lanthanoids (lanthanum, 57, to lutetium, 71) and the actinoids (actinium, 89, to lawrencium, 103) indicated separately below. The periods are of varying lengths. First there is the hydrogen period, consisting of the two elements hydrogen, 1, and helium, 2. Then there are two periods of eight elements each: the first short period, from lithium, 3, to neon, 10; and the second short period, from sodium, 11, to argon, 18. There follow two periods of 18 elements each: the first long period, from potassium 19, to krypton, 36; and the second long period, from rubidium, 37, to xenon, 54. The first very long period of 32 elements, from cesium, 55, to radon, 86, is condensed into 18 columns by the omission of the lanthanoids (which are indicated separately below), permitting the remaining 18 elements, which are closely similar in their properties to corresponding elements of the first and second long periods, to be placed directly below these elements. The second very long period, from francium, 87, to oganesson, 118, is likewise condensed into 18 columns by the omission of the actinoids.",
  "The six noble gases—helium, neon, argon, krypton, xenon, and radon—occur at the ends of the six completed periods and constitute the Group 18 (0) group of the periodic system. It is customary to refer to horizontal series of elements in the table as periods and vertical series as groups. The seven elements lithium to fluorine and the seven corresponding elements sodium to chlorine are placed in the seven groups, 1 (Ia), 2 (IIa), 13 (IIIa), 14 (IVa), 15 (Va), 16 (VIa), and 17 (VIIa), respectively. The 17 elements of the fourth period, from potassium, 19, to bromine, 35, are distinct in their properties and are considered to constitute Groups 1–17 (Ia–VIIa) of the periodic system.",
  "The first group, the alkali metals, thereby includes, in addition to lithium and sodium, the metals from potassium down the table to francium but not the much less similar metals of Group 11 (Ib; copper, etc.). Also the second group, the alkaline-earth metals, is considered to include beryllium, magnesium, calcium, strontium, barium, and radium but not the elements of Group 12 (IIb). The boron group includes those elements in Group 13 (IIIa). The other four groups are as follows: the carbon group, 14 (IVa), consists of carbon, silicon, germanium, tin, lead, and flerovium; the nitrogen group, 15 (Va), includes nitrogen, phosphorus, arsenic, antimony, bismuth, and moscovium; the oxygen group, 16 (VIa), includes oxygen, sulfur, selenium, tellurium, polonium, and livermorium; and the halogen group, 17 (VIIa), includes fluorine, chlorine, bromine, iodine, astatine, and tennessine.",
  "Although hydrogen is included in Group 1 (Ia), it is not closely similar to either the alkali metals or the halogens in its chemical properties. It is, however, assigned the oxidation number +1 in compounds such as hydrogen fluoride, HF, and −1 in compounds such as lithium hydride, LiH; and it may hence be considered as being similar to a Group 1 (Ia) element and to a Group 17 (VIIa) element, respectively, in compounds of these two types, taking the place first of Li and then of F in lithium fluoride, LiF. Hydrogen is, in fact, the most individualistic of the elements: no other element resembles it in the way that sodium resembles lithium, chlorine resembles fluorine, and neon resembles helium. It is a unique element, the only element that cannot conveniently be considered a member of a group.",
  "A number of the elements of each long period are called the transition metals. These are usually taken to be scandium, 21, to zinc, 30 (the iron-group transition metals); yttrium, 39, to cadmium, 48 (the palladium-group transition metals); and hafnium, 72, to mercury, 80 (the platinum-group transition metals). By this definition, the transition metals include Groups 3 to 12 (IIIb to VIIIb, and Ib and IIb).",
  "The periodicity in properties of the elements arranged in order of atomic number is strikingly shown by the consideration of the physical state of the elementary substances and such related properties as the melting point, density, and hardness. The elements of Group 18 (0) are gases that are difficult to condense. The alkali metals, in Group 1 (Ia), are soft metallic solids with low melting points. The alkaline-earth metals, in Group 2 (IIa), are harder and have higher melting points than the adjacent alkali metals. The hardness and melting point continue to increase through Groups 13 (IIIa) and 14 (IVa) and then decrease through Groups 15 (Va), 16 (VIa), and 17 (VIIa). The elements of the long periods show a gradual increase in hardness and melting point from the beginning alkali metals to near the centre of the period and then at Group 16 (VIa) an irregular decrease to the halogens and noble gases.",
  "The valence of the elements (that is, the number of bonds formed with a standard element) is closely correlated with position in the periodic table, the elements in the main groups having maximum positive valence, or oxidation number, equal to the group number and maximum negative valence equal to the difference between eight and the group number.",
  "The general chemical properties described as metallic or base forming, metalloid or amphoteric, and nonmetallic or acid forming are correlated with the periodic table in a simple way: the most metallic elements are to the left and to the bottom of the periodic table and the most nonmetallic elements are to the right and to the top (ignoring the noble gases). The metalloids are adjacent to a diagonal line from boron to polonium. A closely related property is electronegativity, the tendency of atoms to retain their electrons and to attract additional electrons. The degree of electronegativity of an element is shown by ionization potential, electron affinity, oxidation-reduction potential, the energy of formation of chemical bonds, and other properties. It is shown to depend upon the element’s position in the periodic table in the same way that nonmetallic character does, fluorine being the most electronegative element and cesium (or francium) the least electronegative (most electropositive) element.",
  "The sizes of atoms of elements vary regularly throughout the periodic system. Thus, the effective bonding radius (or one-half the distance between adjacent atoms) in the elementary substances in their crystalline or molecular forms decreases through the first short period from 1.52 Å for lithium to 0.73 Å for fluorine; at the beginning of the second period, the bonding radius rises abruptly to 1.86 Å for sodium and gradually decreases to 0.99 Å for chlorine. The behaviour through the long periods is more complex: the bonding radius decreases gradually from 2.31 Å for potassium to a minimum of 1.25 Å for cobalt and nickel, then rises slightly, and finally falls to 1.14 Å for bromine. The sizes of atoms are of importance in the determination of coordination number (that is, the number of groups attached to the central atom in a compound) and hence in the composition of compounds. The increase in atomic size from the upper right corner of the periodic table to the lower left corner is reflected in the formulas of the oxygen acids of the elements in their highest states of oxidation. The smallest atoms group only three oxygen atoms about themselves; the next larger atoms, which coordinate a tetrahedron of four oxygen atoms, are in a diagonal belt; and the still larger atoms, which form octahedral oxygen complexes (stannic acid, antimonic acid, telluric acid, paraperiodic acid), lie below and to the left of this belt. Only the chemical and physical properties of the elements are determined by the extranuclear electronic structure; these properties show the periodicity described in the periodic law. The properties of the atomic nuclei themselves, such as the magnitude of the packing fraction and the power of entering into nuclear reactions, are, although dependent upon the atomic number, not dependent in the same periodic way.",
  "The noble gases—helium, neon, argon, krypton, xenon, radon, and oganesson—have the striking chemical property of forming few chemical compounds. This property would depend upon their possessing especially stable electronic structures (that is, structures so firmly knit that they would not yield to accommodate ordinary chemical bonds). During the development of modern atomic physics and the theory of quantum mechanics, a precise and detailed understanding was obtained of the electronic structure of the noble gases and other atoms that explains the periodic law in a thoroughly satisfactory manner.",
  "  The Pauli exclusion principle states that no more than two electrons can occupy the same orbit—or, in quantum-mechanical language, orbital—in an atom and that two electrons in the same orbital must be paired (that is, must have their spins opposed). The orbitals in an atom may be described by a principal quantum number, n , which may assume the values 1, 2, 3,…, and by an azimuthal quantum number, l , which may assume the values 0, 1, 2,…, n − 1. There are 2 l + 1 distinct orbitals for each set of values of n and l . The most stable orbitals, which bring the electron closest to the nucleus, are those with the smallest values of n and l . The electrons that occupy the orbital with n = 1 (and l = 0) are said to be in the K shell of electrons; the L, M, N ,… shells correspond respectively to n = 2, 3, 4,…. Each shell except the K shell is divided into subshells corresponding to the values 0, 1, 2, 3,… of the orbital quantum number l ; these subshells are called the s, p, d, f ,… subshells, and they can accommodate a maximum of 2, 6, 10, 14,… electrons. (There is no special significance to the letter designations of the quantum numbers or of the shells and subshells.)",
  "The approximate order of stability of the successive subshells in an atom is indicated in the chart below. The number of electrons in the atoms of the elements increases with increasing atomic number, and the added electrons go, of necessity, into successively less stable shells. The most stable shell, the K shell, is completed with helium, which has two electrons. The L shell is then completely filled at neon, with atomic number 10. The atoms of the heavier noble gases do not, however, have a completed outer shell but instead have s and p subshells only. The outer shell of eight electrons is called traditionally an octet. The d subshells and f subshells subsequently are also filled with electrons after the initially less stable orbitals are occupied, an inversion of stability having occurred with increasing atomic number.",
  "The electron occupancy of the shells in the noble gas atoms is as follows:   ",
  "The numbers 2, 8, 18, and 32 correspond to filling the s; s and p; s, p , and d ; and s, p, d , and f subshells, respectively.",
  "The first period of the periodic table is complete at helium, when the K shell is filled with two electrons. The first and second short periods represent the filling of the 2 s and 2 p subshells (completing the L shell at neon) and the 3 s and 3 p subshells (at argon), leaving the M shell incomplete. The first long period begins with the introduction of electrons into the 4 s orbital. Then, at scandium, the five 3 d orbitals of the inner M shell begin to be occupied. It is the successive occupancy of these five 3 d orbitals by their complement of ten electrons that characterizes the ten elements of the iron-group transition series. At krypton the M shell is complete and there is an octet in the N shell. The second long period, of 18 elements, similarly represents the completion of an outer octet and the next inner subshell of ten 4 d electrons.",
  "The very long period of 32 elements results from the completion of the 4 f subshell of 14 electrons, the 5 d subshell of 10 electrons, and the 6 s , 6 p octet. The filling of the 4 f orbitals corresponds to the sequence of 14 lanthanoids and that of the 5 d orbitals to the 10 platinum-group transition metals.",
  "The next period involves the 5 f subshell of 14 electrons, the 6 d subshell of 10 electrons, and the 7 s , 7 p octet. The filling of the 5 f orbitals corresponds to the actinoids, the elements beginning with thorium, atomic number 90.",
  "The successive periods of the system hence correspond to the introduction of electrons into the following orbitals:   ",
  "There are advantages to replacing the K, L, M ,… shells by a different grouping of the subshells, in which those with nearly the same energy are grouped together, in close correlation with the periodic system. The new set of shells is the following:   ",
  "The periodicity of properties of the elements is caused by the periodicity in electronic structure. The noble gases are chemically unreactive, or nearly so, because their electronic structures are stable—their atoms hold their quota of electrons strongly, have no affinity for more electrons, and have little tendency to share electrons with other atoms. An element close to a noble gas in the periodic system, on the other hand, is reactive chemically because of the possibility of assuming the stable electronic configuration of the noble gas, by losing one or more electrons to another atom, by gaining one or more electrons from another atom, or by sharing electrons. The alkali metals, in Group 1 (Ia), can assume the noble-gas configuration by losing one electron, which is loosely held in the outermost (valence) shell, to another element with greater electron affinity, thus producing the stable singly charged positive ions. Similarly the alkaline-earth metals can form doubly charged positive ions with the noble-gas electronic configuration by losing the two loosely held electrons of the valence shell; the positive ionic valences of the elements of the first groups are hence equal to the group numbers. The elements just preceding the noble gases can form negative ions with the noble-gas configuration by gaining electrons; the negative ionic valences of these elements are equal to the difference between eight and their group numbers. The covalence (or number of shared electron pairs) of an atom is determined by its electron number and the stable orbitals available to it. An atom such as fluorine, with seven electrons in its outer shell, can combine with a similar atom by sharing a pair of electrons with it; each atom thus achieves the noble-gas configuration by having three unshared pairs and one shared electron pair in its valence shell.",
  "The properties of elements in the same group of the periodic system are, although similar, not identical. The trend in properties from the lighter to the heavier elements may be attributed to changes in the strength of binding of the outer electrons and especially to the increasing size of the atoms.",
  "Certain methods of classifying elements on the basis of chemical properties are not strictly related to the groups in which the elements appear. Such classification schemes illustrate the fact that useful horizontal as well as vertical relationships exist in the periodic table. Thus, the transition elements, either as a whole or as three horizontal series, are often considered together when chemical properties are discussed. The transition elements in each horizontal series exhibit much less variation in atomic size than do the elements in other parts of the same periods, leading to a similarity in chemical and physical properties. The lanthanoid and actinoid elements exhibit an even greater similarity for the same reason. The metallic elements in Groups Ia and IIa are often classed together because they are markedly more reactive than the other metallic elements. At the other extreme, elements of the platinum group—including ruthenium, rhodium, palladium, osmium, iridium, and platinum—are chemically inert, as are silver and gold; these elements are collectively designated the noble metals because they do not readily enter into combination with other elements.",
  "  Of all the 118 known elements, 11 are gaseous, 3 are liquid, and the remainder are solids under ordinary conditions. With the exception of hydrogen and mercury, the gaseous and liquid elements occur in the right-hand part of the periodic table, the region associated with the nonmetallic elements.",
  "The physical characteristics of the elements provide convenient means of identification. The melting points of the various elements range from −272 °C (for helium) to greater than 3,500 °C (for carbon in the form of diamond). Properties such as boiling points, electrical conductivity, and thermal conductivity also can be used for identification because they are unique for each element. Perhaps the single most useful characteristic for identifying an element is its pattern of light absorption or emission, which is called a spectrum. An element exhibits its own characteristic spectrum whether it exists in the free state, in a mixture, or in chemical combination with other elements. Since the intensity of the spectrum is dependent on the amount of the element contained in the sample, the spectrum also can be used as a means for quantitative analysis of the elements. There are several chemical methods for estimating the percentage of an element present in a sample; these, however, require a detailed knowledge of the chemistry of the element in question ( see  analysis ).",
  "All naturally occurring elements with atomic numbers of 84 or greater are radioactive. In addition, several naturally occurring isotopes of the lighter elements are radioactive. The atomic nuclei of all radioactive elements are unstable and emit highly energetic particles. In the process, the number of protons in the nucleus changes, and the atom is transformed into one of a different element. The half-life of a radioactive isotope is the time required for half of any amount of the isotope to disintegrate by radioactive decay. The common modes of decay of radioactive isotopes are loss of beta or alpha particles or the capture of an electron. The loss of a beta particle, or electron, from the nucleus increases the atomic number by one unit; the loss of an alpha particle, or helium nucleus (two protons and two neutrons), decreases the atomic number by two units; and the process of electron capture, in which an electron from an inner shell is drawn into the nucleus, corresponds to a decrease of atomic number by one unit. Elements with atomic numbers greater than 92, the so-called transuranium elements , have been synthetically prepared and are all radioactive. Two radioactive nontransuranium elements—promethium and technetium—were also first produced artificially and, like the transuranium elements, exist in nature (if at all) only in trace amounts. Although the remaining elements generally are not considered to be radioactive, some do have radioactive isotopes that exist naturally in very small concentrations, and more than 1,000 radioactive isotopes of these elements have been prepared in the laboratory.",
  " J.W. van Spronsen , The Periodic System of Chemical Elements (1969), is a thorough treatment of the history of the periodic system and the periodic table. Linus Pauling , The Nature of the Chemical Bond and the Structure of Molecules and Crystals , 3rd ed. (1960, reissued 1989), provides a general discussion of atomic and molecular structure and of valence in relation to the periodic system and the elements. Other works include Edward G. Mazurs , Graphic Representations of the Periodic System During One Hundred Years , rev. 2nd ed. (1974); D.J. Clouthier et al., Relationships and Mechanisms in the Periodic Table (1989); and Richard J. Puddephatt and P.K. Monaghan , The Periodic Table of the Elements , 2nd ed. (1986)."
]