[
  " Doctor Zhivago Doctor Zhivago  film , also called motion picture or movie , series of still photographs on film, projected in rapid succession onto a screen by means of light. Because of the optical phenomenon known as persistence of vision, this gives the illusion of actual, smooth, and continuous movement.",
  "  (Read Martin Scorsese’s Britannica essay on film preservation.)  ",
  "Film is a remarkably effective medium in conveying drama and especially in the evocation of emotion. The art of motion pictures is exceedingly complex, requiring contributions from nearly all the other arts as well as countless technical skills (for example, in sound recording , photography , and optics ). Emerging at the end of the 19th century, this new art form became one of the most popular and influential media of the 20th century and beyond.",
  "  (Read Lillian Gish’s 1929 Britannica essay on silent film.)  ",
  "As a commercial venture, offering fictional narratives to large audiences in theatres, film was quickly recognized as perhaps the first truly mass form of entertainment. Without losing its broad appeal, the medium also developed as a means of artistic expression in such areas as acting , directing , screenwriting, cinematography , costume and set design, and music.",
  "  (Read Alfred Hitchcock’s 1965 Britannica essay on film production.)  ",
  "In its short history, the art of motion pictures has frequently undergone changes that seemed fundamental, such as those resulting from the introduction of sound. It exists today in styles that differ significantly from country to country and in forms as diverse as the documentary created by one person with a handheld camera and the multimillion-dollar epic involving hundreds of performers and technicians.",
  "A number of factors immediately come to mind in connection with the film experience. For one thing, there is something mildly hypnotic about the illusion of movement that holds the attention and may even lower critical resistance. The accuracy of the film image is compelling because it is made by a nonhuman, scientific process. In addition, the motion picture gives what has been called a strong sense of being present; the film image always appears to be in the present tense. There is also the concrete nature of film; it appears to show actual people and things.",
  "No less important than any of the above are the conditions under which the motion picture ideally is seen, where everything helps to dominate the spectators. They are taken from their everyday environment, partially isolated from others, and comfortably seated in a dark auditorium. The darkness concentrates their attention and prevents comparison of the image on the screen with surrounding objects or people. For a while, spectators live in the world the motion picture unfolds before them.",
  "Still, the escape into the world of the film is not complete. Only rarely does the audience react as if the events on the screen are real—for instance, by ducking before an onrushing locomotive in a special three-dimensional effect. Moreover, such effects are considered to be a relatively low form of the art of motion pictures. Much more often, viewers expect a film to be truer to certain unwritten conventions than to the real world. Although spectators may sometimes expect exact realism in details of dress or locale, just as often they expect the film to escape from the real world and make them exercise their imagination, a demand made by great works of art in all forms.",
  " The Godfather The Godfather  The sense of reality most films strive for results from a set of codes, or rules, that are implicitly accepted by viewers and confirmed through habitual filmgoing. The use of brownish lighting, filters, and props, for example, has come to signify the past in films about American life in the early 20th century (as in  The Godfather  [1972] and Days of Heaven [1978]). The brownish tinge that is associated with such films is a visual code intended to evoke a viewer’s perceptions of an earlier era, when photographs were printed in sepia , or brown, tones. Storytelling codes are even more conspicuous in their manipulation of actual reality to achieve an effect of reality. Audiences are prepared to skip over huge expanses of time in order to reach the dramatic moments of a story. La battaglia di Algeri (1966; The Battle of Algiers ), for example, begins in a torture chamber where a captured Algerian rebel has just given away the location of his cohorts. In a matter of seconds that location is attacked, and the drive of the search-and-destroy mission pushes the audience to believe in the fantastic speed and precision of the operation. Furthermore, the audience readily accepts shots from impossible points of view if other aspects of the film signal the shot as real. For example, the rebels in The Battle of Algiers are shown inside a walled-up hiding place, yet this unrealistic view seems authentic because the film’s grainy photography plays on the spectator’s unconscious association of poor black-and-white images with newsreels.",
  "Fidelity in the reproduction of details is much less important than the appeal made by the story to an emotional response, an appeal based on innate characteristics of the motion-picture medium. These essential characteristics can be divided into those that pertain primarily to the motion-picture image, those that pertain to motion pictures as a unique medium for works of art, and those that derive from the experience of viewing motion pictures.",
  "The primary unit of expression in film is the image, or the single shot. The attribution of magical properties to images has a long history. This association is well documented among many primitive peoples, and it is even reflected in the term magic lantern as a synonym for the film projector. Any image taken out of the everyday world and projected onto a screen to some extent appears to become magically transmuted. This magical quality helps to explain the enthusiastic reception accorded such early films as La Sortie des usines Lumière (1895; “Workers Leaving the Lumière Factory”), which were merely photographic records of commonplace scenes in France in the 1890s by the French film pioneers the Lumière brothers .",
  "The qualities of intensity, intimacy, and ubiquity have been singled out as the salient characteristics of the motion-picture image. Its intensity derives from its power to hold the complete attention of the spectator on whatever bit of reality is being shown. Outside the theatre, a person’s attention is usually dispersed in the endless surrounding reality, except for sporadic moments of concentration on what is selected for closer scrutiny. In the cinema one is compelled to look at something that not the viewer but the filmmaker has selected, for reasons that are not always immediately apparent. This quality of intensity becomes most noticeable when the camera remains fixed on something for a longer time than seems warranted, and spectators gradually become acutely conscious of their loss of volition over their own attention. This technique is not often used but is very effective when used well.",
  "The intimacy of the film image is related to the camera’s ability to see things in greater detail than the eye can. This ability is demonstrated in long-distance shots through a telephoto lens as well as in close-ups. At the beginning of the Japanese film Suna no onna (1964; Woman in the Dunes ), for example, a pervading theme of the film is indicated by shots of grains of sand many times enlarged.",
  "The impression of ubiquity—being everywhere at once—is achieved in part by the camera’s apparent freedom to move from place to place or to approach or withdraw instantaneously. No less important to this illusion of ubiquity is the effect achieved by editing, which allows countless images representing a long, elaborate action to be presented in a comparatively short film or sequence, such as that exemplified by the opening of The Battle of Algiers . The geographic and temporal authority of the image even permits credibility to be given to sequences representing the past, the future, and dreams.",
  "Other equally important characteristics of the film image may be singled out. One of these is its particularity. The language of words lends itself to generalization and abstraction. In themselves, words such as man or house do not suggest a particular man or a particular house but men and houses in general, and more abstract terms such as love or dishonesty have even less-precise associations with specific things. Motion pictures, on the other hand, show only particular things—a particular man or a particular house. In this way a film image may be less ambiguous than the language of words but also less evocative, less likely to be enriched by imagination, association, or recollection. Despite its particularity, however, the motion-picture image may also be ambiguous in that it shows but does not explain. It does not in itself tell what it means, and people instinctively search for meanings in images. This is why commentary is thought to be essential in tying down precise meaning in educational films. On the other hand, many evocative documentaries, from Robert Flaherty ’s Nanook of the North (1922) to Errol Morris ’s Fast, Cheap & Out of Control (1997), abjure commentary, thus forcing the spectator to take in the remarkable and untranslatable specific sights and sounds they collect. The particular insistence of given photographed objects also explains why the juxtapositions of montage are so effective—the spectator compulsively searches for the reason behind a particular sequence of images.",
  "Another characteristic of the film image is its neutrality. The world people see around them is strongly influenced by their emotions and their interests. A plumber fixing pipes in a museum may not see the masterpieces around him or her, while an angry person may hear an insult where none was intended. The camera and the microphone, however, are thought to reproduce images and sounds without feeling. Although focus, directionality, and other technological factors limit what can be seen and heard, audiences are prepared to believe that the motion picture itself is nonhuman or even superhuman in its passive reception of information. Courts of law, for example, are more likely to accept film as evidence of an occurrence such as a bank robbery than they are to accept an artist’s sketch or a journalist’s report of the same incident. When a film appears to be charged with emotion, it is usually because the director has carefully manipulated the images to give this illusion. In everyday life, the eyes follow the mind; in the cinema, the mind follows the eyes.",
  "Four characteristics may be stressed as factors that differentiate the motion-picture medium, either in degree or in kind, from other mediums for works of art: luminosity, movement, realism, and montage.",
  "The intense brightness of the picture projected by powerful light onto a coated screen in itself transforms the most mundane element of reality. The appeal of a luminous picture is attested by efforts of advertisers to achieve luminous effects in posters and displays. The luminosity of the motion-picture image also results in a considerable range of tone, between the brightest highlight and the deepest black. In both black-and-white and colour films, the most delicate gradations in the image are therefore possible.",
  "As a feature of the motion picture, movement is so obvious that its central importance is sometimes forgotten. The motion picture has much in common with the graphic arts, but the added dimension of movement transforms it, allowing a narrative or a drama to unfold in time in a way no other graphic art can. Both in filmmaking and in film appreciation, movement must constantly be borne in mind: composition in the motion picture is kinetic rather than static. It is not a single colour but the cumulative effect that matters, not a single situation but a developing plot. The composition within any frame, or exposure, of a motion picture is as important as the relationship of that frame to those that precede and follow it.",
  "Another essential element of the motion-picture image is that it gives an impression of reality. Whether in a drama enacted expressly for the camera or in a documentary film of an event at which the camera just happened to be present, this feeling of realism deriving from motion-picture photography accounts for much of the force of motion pictures. Animated films, which lack this element of photographic realism, tend to be taken as fantasies.",
  "The attempt of the motion picture to reproduce three-dimensional reality on a flat screen presents the same problems and opportunities that are encountered in still photography and in painting. The standard camera lens, in fact, is constructed to produce visual effects precisely similar to those achieved by painters using the principles of perspective that were developed during the Renaissance .",
  "Cinematic realism is most fully heightened when the images are accompanied by synchronous sound, whereby a second sense, hearing, ratifies what the eyes see. Although reproduced sound can be manipulated with regard to distance, timbre, clarity, and duration, in combination with photographed moving images, it forcefully brings alive its subject as present in a way unavailable to the other arts of representation.",
  "Perhaps the most essential characteristic of the motion picture is montage, from the French monter , “to assemble.” Montage refers to the editing of the film, the cutting and piecing together of exposed film in a manner that best conveys the intent of the work. Montage is what distinguishes motion pictures from the performing arts, which exist only within a performance. The motion picture, by contrast, uses the performances as the raw material, which is built up as a novel or an essay or a painting, studiously put together piece by piece, with an allowance for trial and error, second thoughts, and, if necessary, reshooting. The order in which the segments of film are presented can have drastically different dramatic effects.",
  "Several major contributions to the theory of montage were made by Soviet directors. After the Russian Revolution of 1917, Soviet films were encouraged for their propaganda value, but film stocks were scarce. Soviet directors carefully studied the films of D.W. Griffith and other masters to make the most effective use of their own meagre resources. One of those early Russian directors, Lev Kuleshov , conducted an experiment involving identical shots of an actor’s expressionless face. He inserted it in a film before a shot of a bowl of soup, again before a shot of a child playing, and still again before one of a dead old woman. An unsuspecting audience, asked to evaluate the actor’s performance, praised his ability to express, respectively, hunger, tenderness, and grief.",
  " Sergei Eisenstein , who excelled both as a director and as a teacher, based much of his theory of film on montage, which he compared to the compounding of characters in Japanese writing. The character for “dog” added to the character for “mouth,” he noted, results not merely in “dog’s mouth” but in the new concept of “bark”; similarly, film montage results in more than the sum of its parts. Still another great Russian director, Vsevolod Pudovkin , also stressed the importance of the carryover in the spectator’s mind. Only if an object is presented as part of a synthesis, he said, is it endowed with filmic life.",
  "Three types of montage may be distinguished—narrative, graphic, and ideational. In narrative montage the multifarious images and scenes involve a single subject followed from point to point. In a fiction film, a character or location is explored from multiple angles while the audience builds a comprehensive image of the situation being explored or explained. Graphic montage occurs when shots are juxtaposed not on the basis of their subject matter but because of their physical appearance. Some avant-garde works depend on the spectator’s ability to match the graphic relations of assorted images, such as the people, the objects, and the shapes of numerical and alphabetical figures in Fernand Léger ’s Le Ballet mécanique (1924) or the torpedoes, swimming seals, and blimps in Bruce Conner’s A Movie (1958). In graphic montage, cutting usually occurs during shots of movement rather than ones of static action. This cutting on motion facilitates the smooth replacement of one image by the next. In ideational montage, two separate images are related to a third thing, an idea that they help to produce and by which they are governed. In Stachka (1924; Strike ), for example, the director Eisenstein, to whom the theory of ideational montage is credited, effectively conveys the idea of slaughter by intercutting a shot of cattle being butchered with shots of workers being cut down by cavalry.",
  "These three types of montage seldom appear in their pure form. Most ideational montage proceeds on the basis of the graphic similarity of its components, as does narrative montage when relying on graphic cutting to cover its movement. Similarly, the graphic matches between torpedoes, seals, and blimps in A Movie ultimately construct an idea of movement toward explosion and destruction. Besides the complications brought about by the intermixing of these types, the addition of the sound track multiplies the possibilities and effects of montage. Eisenstein and Pudovkin referred to such possibilities as “vertical” montage, opposing it to the “horizontal” unrolling of shot after shot. Because sound permits the establishment of relations between what is seen and heard at each moment, the film image can no longer be said to be a self-contained unit; it interacts with the sound that accompanies it. Sound relations (including dialogue, music, and ambient noise or effects) may be built in constant rapport with the image track or may create a parallel organization and design that subtends what is seen. In all, montage appears to be the most extraordinary factor differentiating the motion picture from the other arts, and it is the one often singled out as the basis of the medium. Nevertheless, many films, including those of Mizoguchi Kenji of Japan, Roberto Rossellini of Italy, and Jancsó Miklós of Hungary, rely not on montage but on the medium’s unique qualities of luminosity, movement, and realism to convey their power and beauty.",
  "The viewing of motion pictures began as an experience limited to a one-person audience. Soon after, the advent of motion-picture projection transformed the medium predominantly into a form of theatrical entertainment viewed by large numbers of people simultaneously. By the end of the 20th century, new technologies had made possible a wide variety of viewing options, ranging from the solitary spectator sitting at home to audiences of thousands in a single space or of millions over many venues.",
  "  The Kinetoscope , the first motion-picture viewing device, was invented by Thomas Edison and William Dickson in 1891. It allowed only a single spectator at a time to look through a peephole at the tiny moving images inside the machine. Within several years, projectors capable of enlarging the image on a screen in a theatrical space had been developed. Projected motion pictures soon rendered the peephole viewers obsolete, although the latter could still be found for decades as novelties in penny arcades and amusement parks.",
  "  The motion picture thrived in the first half of the 20th century as a mass medium centred on theatrical exhibition. Attending motion pictures became a social experience shared among friends or in an audience of strangers. Although the physical setting was similar to live events such as stage or concert performances, fundamental differences arose in the viewing of mechanically reproduced images rather than living persons. Motion-picture audiences were more informal in dress and demeanour. Eating and drinking during screenings became common; indeed, the sale of items such as popcorn and soft drinks proved more lucrative to many exhibitors than box-office admissions. Consecutive repeat showings permitted patrons to enter and leave in the middle of programs, giving rise to the expression “This is where I came in,” which became obsolete and largely unknown by the end of the 20th century, when theatres were cleared after each screening.",
  "When television emerged as a competing home-entertainment medium after World War II , theatrical film attendance suffered a severe decline. However, older movies became a staple of television programming, and television in turn began to serve as a significant advertising medium for promoting new films. While the television presentation of motion pictures varied in different countries, in the United States it was common on commercial broadcast channels to divide up the screening with frequent commercial breaks. After the introduction in the mid-1950s of CinemaScope and other widescreen formats for motion pictures in theatrical release—a technological innovation intended to highlight the value of the large-screen theatre experience in contrast to the then small-screen home medium—these works were later altered for television release. In a technique called “panning and scanning,” the original versions of widescreen films were rephotographed, sometimes with new camera movements added, to record significant screen events for the narrower television frame.",
  "In the later decades of the 20th century, as theatrical movie attendance stabilized at much lower numbers than before World War II, the television became the predominant exhibition venue for films. In the 1980s the home-viewing experience dramatically expanded with the emergence of cable television , with channels playing up-to-date motion pictures without commercial breaks, and especially with the development of the videocassette recorder (VCR), a device that could record television signals on cassettes of magnetic tape as well as play prerecorded cassettes. Movie companies released recent and older films in videocassette format, and neighbourhood video stores sprang up to rent or sell cassettes. Home viewers could choose what they wanted to see and take home motion pictures on video in much the same way as they might select a book to read or recorded music to listen to.",
  "Newer technologies introduced at the end of the 20th and the beginning of the 21st centuries broadened the home viewing of motion pictures still further. Systems delivering television signals via satellite or digital cable offered hundreds of channels, many of them playing films continuously. The 1990s witnessed the introduction of the DVD (digital video disc, or digital versatile disc), which converts analog audio and video signals into binary data that can then be read by a low-power laser. The DVD was a medium for recording, storing, and playing movies that provided significantly more space for data than the videotape cassette—so much more, in fact, that even early DVDs contained motion pictures in both their original widescreen theatrical-release format (i.e., in “letterboxed” form, a term referring to the black bands that appear above and below the image on a television with a roughly square aspect ratio of 4 to 3) and in the “panned and scanned” version. Sound tracks were made available in original or dubbed languages, and a variety of supplemental materials included voice-over commentaries from directors and other creative personnel, documentaries on the making of the film, preview trailers, screen tests, and more. The Blu-ray format, adopted as an industry standard in 2008, promised optical discs with even greater data capacity. The first decade of the 21st century also brought the widespread adoption of video-on-demand (VOD), in which home viewers could request instant delivery of motion pictures of their choice directly to their television or computer screens. Internet-based VOD played an increasing role in the distribution and circulation of motion pictures, especially with the rise of such streaming services as Netflix . Also significant was P2P (peer-to-peer) file sharing, which was seen as a threat by film studios. While theatrical exhibition continued to play a significant role and theatres retained their value as social gathering places that could present large-scale images, the dominant trend in the experience of motion pictures gave home viewers increasing control over what films to see, when to see them, and how to see them. Viewers were able to stop the image, enlarge it, reverse it, fast forward, skip to desired scenes, and take charge as never before over the process of screening itself.",
  "Many observers have seen in films a means of expression comparable to language. The French poet and filmmaker Jean Cocteau , for example, called the cinema “picture writing.” The language of film, however, is not the language of words, even though spoken dialogue has been an integral part of motion pictures since the late 1920s, and written captions were usually required to explain the action before that. It is primarily in the qualities of its images and sounds that the expressivity of the cinema must be sought. Certain basic traits of motion pictures may operate with the logic of natural language, but few theorists have held that cinematic expression follows rules like those of natural language. As Christian Metz, one of the foremost film theorists of the 20th century, argued, it is not linguistics so much as poetics that should serve as a model for those interested in understanding or explaining how a film works.",
  "Various codes of expression have, nevertheless, been shown to operate naturally or to have been inculcated, and their effects can be calculated. Such codes and effects occur in all aspects of moviemaking and can most readily be categorized into those affecting cinematography, editing, sound, the script, acting, and design.",
  "The filmmaker has a number of ways of modifying the camera’s neutrality and thereby the “reality” that is conveyed to the audience. It is largely by means of these devices that the motion picture becomes such an expressive medium. Several of these expressive techniques should be emphasized. First, there is framing—that is, carefully selecting what will be included within each frame of the film and what will be excluded. Second, there is scale, the size and placement of a particular object or a part of a scene in relation to the rest, a relationship that is determined by the placement of the camera. Third is camera movement, or the lack of it, during shooting. Fourth, there are the peculiar advantages of either colour or black-and-white photography that can be exploited. Finally, through the cinematographer’s skill and knowledge of laboratory processes, other highly expressive techniques can be achieved. Each of these means of expression will be discussed below.",
  "The process of framing is intended to eliminate what is unessential in the motion picture, to direct the spectator’s attention to what is important, and to give it special meaning and force. Each frame of film, which corresponds in shape to the image projected on the screen, forms the basis for a graphic composition in the same way that the frame of a painting encloses the area in which the painting must be organized.",
  "Several different ratios of frame width to frame height, called aspect ratios, have been used in motion pictures. The most common, known as the Academy ratio, is 1.33 to 1, or 4 to 3, a ratio corresponding to the dimensions of the frame of 35-mm film. By using 70-mm film or a special CinemaScope lens, an image with wider horizontal and shorter vertical dimensions is achieved—a proportion of about 5 to 2, or between 2.2 to 1 and 2.65 to 1. A similar effect, called wide screen, was sometimes achieved without the expensive equipment required for CinemaScope by using 35-mm film and masking the top or bottom or both, giving a ratio of 1.75 to 1, or 7 to 4. Although some theatres in the 1970s were enlarged and widened to accommodate 70-mm images, a trend toward smaller theatres fixed the image ratio close to 1.85 to 1 in the United States and 1.66 to 1 in Europe.",
  " Seven Samurai Seven Samurai  The moderate elongation provided by the Academy ratio has proved most versatile for achieving standard compositional effects. For example, an expansive feeling is easily rendered when small-scale figures in the foreground are shot against a towering sky, as in Days of Heaven . In the wide CinemaScope dimension, the tension established between the outward movement of the composition and the rectangle of the screen can readily be lost; nevertheless, early fears about wide screen’s insensitivity to intimate love scenes proved to be unfounded, at least in the hands of careful cinematographers. A number of foreign directors, notably Kurosawa Akira (Japan), François Truffaut (France), and Miklós Jancsó (Hungary), achieved stunning effects in CinemaScope by overcoming the fear of moving the camera, as seen in, respectively, the battle scenes of Shichinin no samurai (1954; Seven Samurai ), the bicycle ride in  Jules et Jim  (1961), and the nonstop camera dance of Még kér a nép (1972; Red Psalm ). Wide screen calls for an altered aesthetic, because the spectator’s eye is invited to roam the visual field, making connections that in the standard ratio are more tightly determined.",
  "Regardless of its ratio, the frame may be divided to show two or more scenes at the same time. This technique is traditionally used for credit sequences, musical interludes, or moments when the presentation on a single screen of two or more simultaneous occurrences results in comic interrelationships, although frame division can be used to dramatic or purely aesthetic effect, as in John Frankenheimer ’s Grand Prix (1966).",
  "An effective use of framing consists of temporarily or permanently excluding a vital part of the action. Offscreen space may be said to function more actively in cinema than in painting or the theatre. For example, the camera may remain fixed on the hero while the villain is perceived only as a voice saying “Hands up!” or, in a science-fiction film, the camera may linger on the horror expressed by the victim before revealing the monster that is causing it.",
  "Very strong dramatic effects may be obtained by oblique framing—that is, by turning the camera sideways so that the image on the screen appears askew. This was done in the early Russian film The Ghost That Never Returns (1929), in which a prison riot shown by oblique framing gives the impression that the building is being pushed over. Some directors, such as Britain’s Carol Reed , made this a trademark ( The Third Man , 1949).",
  " King Kong King Kong  Since scale in the cinema constantly changes from shot to shot, the spectator can easily be deceived about the size of objects. When appearing next to enormous tables and chairs, for instance, actors can be made to look like midgets or children, as in the Stan Laurel and Oliver Hardy comedy Brats (1930). By contrast, in King Kong (1933) a small-scale model of New York City was used to give the illusion of the actual city under attack by a giant gorilla. Scale may have a marked effect on the emotional tone of a scene. In the distance an actor may seem lonely, remote, helpless, pathetic; close up the performer may appear powerful, threatening, bestial. The scale of shots for artistic purposes ranges from an extreme long shot (the widest view on the smallest scale), with houses or ships appearing as tiny dots on the horizon; through medium shots, two shots (i.e., a shot of convenient size to include two actors), and others; to the extreme close-up, with part of a face, an eye, or a fist filling the screen (the most restricted view on the largest scale). Telescopic or microscopic shots beyond these extremes are often of scientific rather than artistic interest.",
  " Citizen Kane  Different scales are occasionally juxtaposed in a single shot to produce an unmistakable dramatic or rhetorical effect. In Orson Welles ’s Citizen Kane (1941), significant characters are repeatedly framed in the right or left foreground while in the background an action takes place that disturbs that character or that that character somehow controls. The gigantic political poster of Kane that rises behind the podium on which he, in the foreground, makes a speech promising to ruin his rival, Gettys, becomes suddenly the size of a postage stamp when the shot changes to one in which Gettys is in the foreground looking down on the insignificant speaker from a balcony. Through this use of different scales, Gettys is shown to have power over the action.",
  "As has been noted, the camera exaggerates perspective, and this exaggeration adds to the dramatic effect. It is most striking in an ordinary still photograph of an enormous hand or a sunbather’s giant feet that were close to the camera lens. In cinematography, the director ordinarily minimizes the effect of this distortion but occasionally uses it in an extreme form. In Easy Rider (1969), for instance, it was used to give an atmosphere of hallucination and nightmare to a drug-taking session, and in Brazil (1985) it was used continuously to promote an atmosphere of paranoia and nightmare.",
  "Scale is affected by what precedes and follows. The close-up has its most dramatic impact coming after long or medium shots, and after many close-ups it is a relief to escape to the middle or far distance.",
  "Another element in motion-picture language is the shooting angle. In common language, the phrases “to look up to” and “to look down on” have connotations of admiration and condescension in addition to their obvious reference to physical viewpoint. In one sense or another, children, dogs, and beggars are often looked down upon, while the preacher in a pulpit, the judge on the bench, and the police officer on a horse are looked up to. Even a slight upward or downward angle of a camera is enough to express a mood of inferiority or superiority.",
  "Upward or downward shooting angles lead to questions of objectivity and subjectivity. In most motion pictures, both for variety and for breadth of treatment, the camera’s viewpoint switches from one character to another and sometimes is associated with none of the characters but merely looks on. The camera may take the viewpoint of the heroine, looking with dismay at the villain as he breaks into her room; in this case, an upward camera angle gives a subjective impression of her fear. Similar subjectivity may be seen in a shot of buildings reeling in the way they might appear to a drunken man, as in the German classic Der letzte Mann (1924; The Last Laugh ), or in a rapid camera movement from a window to the pavement below to express a thought of suicide, as in the Italian Neorealist film Umberto D. (1952).",
  " Lady in the Lake Lady in the Lake  Occasionally an entire motion picture may be shot from one person’s point of view, often with a personal narration accompanying the images. Rarely does this point of view literally take over the optical view of the character for an extended period. (One noted exception is the 1946 film directed by the actor Robert Montgomery , Lady in the Lake , in which the camera actually plays the main character. The entire film is seen from the camera/character’s point of view so that the audience sees only what the camera/character sees. The movie is an interesting experiment in the use of subjective camera, but it is considered an artistic failure.) More often voice-over, music, or other elements are combined with shooting angle to render a particular character’s feelings throughout a film. Alfred Hitchcock is generally considered the master of point of view, controlling (and even misguiding) viewer sympathy.",
  "Extreme upward or downward angles are too far removed from ordinary experience to have many applications in motion pictures, but they may express exceptional situations—a sick man on his back, a baby’s or a dog’s point of view, a woman in a pit or in a coffin, a spy covertly looking down on an enemy meeting. As with scale, the shots that precede and follow alter the effect of the shooting angle. Upward angles are stronger following a level or downward-looking camera, and vice versa.",
  "Framing, scale, and shooting angle are all greatly modified by the use of camera movement. Filmmakers began experimenting with camera movement almost immediately after the motion-picture camera was developed. In 1897 photographers employed by Auguste Lumière and Louis Lumière floated a cinématographe , the combination camera-projector devised by the French brothers, in a gondola through Venice to give viewers all over the world a dynamic view of that much-painted city.",
  "One of the simplest and most common movements is to turn, or pan (from the word panorama ), the camera horizontally so that it sweeps around the scene. It can also be tilted up or down in a vertical panning shot or in a diagonal pan, as when it follows an actor up a stairway. Panning was possible quite early in film history, but methods of physically conveying the camera itself through a scene developed more slowly. Initially the camera was mounted on a dolly, truck, or other hand-propelled wheeled vehicle to facilitate smooth movement. Later, tracks were laid for the dolly or truck to ride on, providing even smoother, more effortless motion. Trucking, dollying, and tracking can even be combined with panning in a complex movement that may require the adjustment of focus or aperture en route. One such camera movement that is often used imitates the gaze of a traveler who turns in a moving automobile or train to focus on a stationary point of interest.",
  "Often commercial vehicles, such as trolleys, automobiles, or airplanes, are used to transport the camera; the relatively jerky ride they supply simulates real movement more accurately than does the steady motion provided by a specially designed apparatus. Nevertheless, the film industry has long sought equipment that would allow the camera (and the viewer) to weave in and out of action in the most ethereal way. The crane, which facilitates aerial movement, was developed in the late 1920s, replacing the jerry-built movable platforms, the slings, and the sleds that ingenious directors, such as Abel Gance (for Napoléon , 1927) and Marcel L’Herbier (for L’Argent , 1929), both in France, had devised to achieve vertical or elevated swinging movements. Numerous special camera supports were developed in the later 20th century, many of which were originally developed for use on medical and scientific films. Equipment developed in the 1970s and ’80s could be operated from a distance with electronic viewfinders, allowing the camera to follow vigorous continuous action with an ease and intimacy that had previously been unknown, as in the precredit sequence of Raiders of the Lost Ark (1981). The look and style of film art is constantly changing as technological advances increase the mobility of the camera and consequently the flexibility of the spectator’s viewpoint.",
  " Stagecoach Stagecoach  Regardless of the level of technical capability, the effect of camera movement depends on the context and the pace of movement. At a deliberate pace the camera can explore a scene and reveal significant details. If it is raised well above the ground, the movement has a dreamlike power, and, when combined with slow motion, it may give a somnolent impression or express recollection or hallucination. The camera movement may end dramatically on a dagger, on a gun half-hidden in an assailant’s hand, or on a suspicious bulge in a pocket. It may link the hero walking in the garden and the heroine watching him with loving eyes from a window. It may bring a dramatic surprise, as in the American western Stagecoach (1939), when director John Ford had the camera, mounted high above a rocky defile, move slowly from the stagecoach below to reveal a band of Indians waiting in ambush. On the other hand, the camera may simply turn away from a scene to leave the remainder to the spectator’s imagination, as when it withdraws from a torture scene or from a love scene. In filming a conversation, the director may turn the camera from one speaker to the other, thus animating the scene with movement and showing the expression of the speaker, or listener, more closely than would be possible with a static two shot. Camera movement can even be used to change the scene to a distant place, to a different period of time, or to an imaginary world.",
  "Very rapid camera movements may express a sudden surge of emotion or a contemplated action, as in the suicide from Umberto D. (1952). In The Rains Came (1939), as the heroine realizes with horror that she has drunk from a glass that may be contaminated with typhus, the camera rushes forward to a close-up on the fatal glass, shining in the darkness. These movements are often effected without physically moving the camera, by means of a zoom lens, a lens of variable focal length that simulates the effect of moving toward or away from a subject by increasing or decreasing the size of the subject as the focal length changes. Although a zoom shot is generally smoother than a tracking shot, it always results in pictorial distortion. To zoom in from a distance to a close-up, the focal length of the lens is changed from, for example, 18 mm to 125 mm. The former length curves the picture anamorphically on the sides, giving great depth to the background, while the latter tends to flatten the background. All objects within view are enlarged at the same rate. Tracking in from a distance to a close-up requires careful adjustment of focus, but depth and dimension appear more realistic.",
  "Camera movement is one of the key indicators of the presence of a narrator. When the camera moves independently of the action, the narrator can be thought of as hovering above the action, poetically reacting to it or commenting on it. When the camera moves instead to keep the action in view, to follow as many elements as possible, the narrator can be thought of as a reporter investigating but not commenting on what is seen. The documentary tradition, particularly since 1959, when lightweight cameras and tape recorders first permitted extended handheld filming, represents this investigative function of cinema and of camera movement.",
  "Directorial styles may be cataloged on the basis of an overall predilection for linking elements in a scene via cuts (montage) or camera movement. Eisenstein has already been cited as a master of montage. One of the directors most acclaimed for the expressive use of camera movement is Japan’s Mizoguchi Kenji . Although Mizoguchi was not beyond making strongly rhetorical points by juxtaposing shots, the overall impression his films convey derives from the use of a seemingly floating camera to join not only elements within a scene but also the scenes themselves. In Ugetsu (1953) the hero, seduced in a hot spring by a beautiful ghost woman, moves screen right to join her, while the camera pans left across the pool and then tracks along the ground. The shot dissolves imperceptibly into one in which the camera pans up to reframe the couple picnicking in an extreme long shot. The magical mixture of spaces and the conflation of time sensuously express the erotic imagination to which both the hero and the audience have fallen prey. Mizoguchi is known as a mise-en-scène director, one who is primarily concerned with the relationships within a shot rather than those between shots. His films rely on long takes, camera movement, and the expressive use of elements within the film frame to convey mood and emotion. The possibility of movement was so important to Mizoguchi that at the end of his career he invariably directed from a crane, even during static scenes.",
  " Raging Bull Raging Bull  A practical, accurate commercial system of colour cinematography was not perfected until Technicolor was introduced in Walt Disney ’s animated short Flowers and Trees (1932) and in the feature film Becky Sharp (1935). The introduction of colour was less revolutionary than the introduction of sound; the silent film soon disappeared, but, even though most feature films made since the 1960s have been in colour, black-and-white films continue to be made. In fact, directors such as Woody Allen ( Manhattan , 1980), Martin Scorsese ( Raging Bull , 1979), Joel Coen ( The Man Who Wasn’t There , 2001), and Alfonso Cuarón ( Roma , 2018) chose to film in black and white to give their movies a calculated tone.",
  "A black-and-white motion picture is not merely a picture that lacks colour but rather an artistic creation with positive qualities of its own. An ample range of effects can be obtained—from precise images, in which every hair, every grain can be clearly seen, to a smudged charcoal effect. In the cinema, black-and-white composition has often been designed to attain a distinctive dramatic impact.",
  "Nevertheless, colour introduced a new world into the cinema and steadily grew more effective. It can be used to produce a powerful dramatic impression. The German director Rainer Werner Fassbinder , for example, used garish colours in films such as Despair (1977) to lend a seductive but finally suffocating tone to his melodramas. A similar use of colour can be found in the American director Todd Haynes ’s film Far from Heaven (2002). Both Fassbinder and Haynes were inspired by the Technicolor movies of Douglas Sirk . The Italian director Michelangelo Antonioni claimed to have studied colour for years before venturing to make his first colour film, Il deserto rosso (1964; The Red Desert ). In that film he used disturbing yellows, pinks, grays, and greens, even going so far as to paint dump heaps and fruit gray for one scene, to express a neurotic woman’s sensibility and the oppressiveness of her industrial environment. He changed film stock for a sequence in which the woman tells her child a story about a girl on the beach. The bright postcard colours seen in that sequence contrast dramatically with the sickly grays and greens of the rest of the film. Colour can be employed even more symbolically than this; in Eisenstein’s Ivan Grozny II: Boyarsky zagovor (completed 1946, released 1958; Ivan the Terrible, Part II ; “Ivan the Terrible, Part II: The Boyar Conspiracy”), red turning to a bluish shade represents the fear of a pretender about to be assassinated.",
  "Cinematographers remain largely unknown outside the motion-picture industry even though their contribution sometimes matches that of the director in importance. Although the director has ultimate control over the visual image, the cinematographer actually records that image on film, translating the director’s ideas and creating the atmosphere and the look of the film. The association between the cinematographers and the processing laboratory is also of highest importance, because the cinematographer often spends hours there after shooting, checking the negative. On most feature films a camera team (often consisting of a director of photography, a cameraman, and an assistant cameraman) shares the responsibilities.",
  "Cinematographers are responsible for exact framing, sometimes for screens of more than one type. They also must decide upon the use of masking, the choice of lens, the camera angle, and the control of camera movement. They must either keep the focus sharp or put all or part of the picture out of focus if this effect is required. Cinematographers also control slow motion or accelerated motion. With early hand-cranked cameras, the camera operator simply slowed down or cranked faster, but later special controls and cameras were developed. Trick photography was once effected by simple manipulation of the camera: magical transformations were made simply by stopping the camera and changing the scene, and the impression of backward motion was achieved by turning the camera upside down and reversing the film. More-elaborate processes now at the cinematographer’s command involve laboratory technicians as much as the camera crew. Many effects require the actors to perform against a background of previously prepared film. The cinematographer must be in command of all these processes. The best cinematographers give a motion picture a visual style that is uniquely their own.",
  " The Well of the Saints  The process of trimming and piecing together lengths of film in order to make an artistically concise and complete motion picture is certainly the most obvious technique of film language and the one most often discussed. The terms editing , cutting , and montage are often applied interchangeably to the process. In montage the emphasis is on the juxtaposition of ideas resulting from this process; cutting stresses the physical work with the actual strips of film; and editing encompasses both.",
  "A single shot (i.e., the length of film exposed at one time, without interruption, by one camera) makes a visual and aural record of some segment of the physical world; by effective editing, this record can be taken apart, restructured, and shaped into an imaginative world or a discourse about the world. While all viewers presumably notice that a film is made up of a number of scenes, few realize that even relatively sedate fiction films contain on average approximately 600 cuts, one every 10 seconds. Editors strive to hide their work by cutting on action, so that the movement of a character’s arm in one location flows into another such movement elsewhere, masking the change of shot. More important is the principle by which an editor anticipates the spectator’s line of inquiry. By releasing information just as the spectator needs it, the editor constructs a natural drama whose seams are invisible.",
  "Probably the most common convention of this sort is the “accordion” sequence, wherein, for example, a drawing room conversation between two people is introduced in an establishing shot of the setting and the actors. The editor will cut to a full shot of the actors once they begin their dialogue, because their speech gives them prominence over the setting. To help viewers understand the nuances of the dialogue, the editor will move in for a medium shot, showing both characters from the waist up. While many directors and editors stop here, Hollywood has traditionally gone in even closer, using alternating close-ups of each character (generally from over-the-shoulder shots) to convey innuendos and reactions. In the earlier days of cinema, an editor was likely to back out of the sequence in the reverse order, going from close-up to medium shot, to full shot, and finally to long shot, thus making the structure of the sequence resemble the in-and-out movement of an accordion. As audiences have increased in visual sophistication, some of these “logical” steps have fallen away.",
  "Unforgettable moments in films are often made possible through shocking juxtapositions. When an initially smooth progression is disrupted by a quick cut to a close-up, as in the Halloween series of horror films, the effect can be startling and frightening. In such cases the editor insists upon a strange or important connection in a scene.",
  "Beyond rendering scenes in unobtrusive or striking ways, editing connects scenes into sequences and larger units. It serves as a system of punctuation. In the standard Hollywood film a straight cut between two scenes suggests that the scenes are close in space or time, whereas other more visible forms of transition signal more distant relations. The picture may fade out and fade in, the screen being left dark for a moment. Or it may dissolve, or mix, to a new scene, one image showing on top of the other for a moment. The filmmakers may use other devices, such as a wipe (i.e., a line moving across the screen that wipes out the preceding image while introducing the next), irising (gradually reducing the old image from the edges to a pinpoint size and then expanding the new one in the reverse way), or a turnover (in which the entire screen seems to turn over, with the new image seeming to appear on what was the reverse side).",
  "The director may introduce creative touches in cutting. The German-born director Max Ophüls , for example, connected the separate episodes of La Ronde (1950) by means of the musical leitmotif of a hurdy-gurdy tune. In Vivre sa vie (1962; My Life to Live ), Jean-Luc Godard , one of the outstanding French New Wave directors of the late 1950s, introduced chapter headings marking the heroine’s step-by-step involvement in prostitution and, ultimately, her murder, as if it were a didactic 19th-century novel. In his British film The Thirty-nine Steps (1935), Alfred Hitchcock , probably the greatest director of suspense films, cut from a woman’s scream to the similar sound of a train whistle, an effect so dramatic that it was frequently imitated thereafter.",
  "Editing permits highly dramatic effects that could never be staged in a single shot. In the American western  Butch Cassidy and the Sundance Kid  (1969), for example, the title characters are seen cornered by lawmen on a high cliff overlooking a river, into which they make an almost suicidal leap to their escape. Actually, the shots involving the two leading actors on the cliff and those of the dives were filmed weeks apart, and they involved different crews and even different rivers, yet the audience readily accepts the illusion created by the editing. The Stunt Man (1980) takes such editing as its very theme. The main character is engaged in the rigged dangers and tricks involved in making a movie, while the audience is fooled by the greater tricks of the film that it is watching. Editing opens up a bagful of ingenious tricks of substitution, tricks that allow a marvelous or tragic experience to appear as a natural occurrence in the filmed world.",
  "The common illusionistic experience of motion pictures depends on editing for its force and excitement, but editing can play an even more important role in films that bypass or refuse the illusion of realism. The use of graphic and ideational montage demonstrates that some filmmakers purposely flaunt the fabrication involved in motion pictures. Many films incorporate extraneous material within their fictions in order to set the illusion of the story they tell against the hard reality of other types of images. In Warren Beatty ’s Reds (1981), for example, interviews with “witnesses” to the events portrayed in the film open, and occasionally interrupt, the story in order to validate the fiction being re-created as history. Conversely, in films such as Zelig (1983) and Forrest Gump (1994), editing techniques are used to interject fictional characters into historical footage in order to emphasize the narrative’s sense of time and place. Editing permits the juxtaposition of very different kinds of material for a variety of rhetorical effects.",
  "Like camera work, editing is a function that is ordinarily hidden from the audience, but it is vital to the finished picture. It is the editor’s job to judge the length of each shot, choosing the exact moment to end a segment on the basis of the amount of detail it contains, its scale, its dramatic impact, and its context in relation to the shots that precede and follow it. The impact of the finished film depends on how well edits are made.",
  "The director generally views the day’s rushes (i.e., advance prints of the film shot that day) and, in consultation, selects what is to be used. Some directors spend a good deal of time in the cutting room; others spend none at all. Often the editor is influential in rearranging shots, discarding them, or even ordering reshooting or additional shooting. An important factor in the work of the editor is the cutting ratio—the proportion of film shot to that used in the final film. Some directors shoot as little as 3 times as much as is required, while others may shoot 10 times as much or even more. In its widest sense, editing includes mixing the sound and correlating it with the visual film.",
  "Film has been defined as a series of images of space that are arranged in time. The time of film language is quite different from that of reality and that conveyed by the other arts, such as drama and literature. Movement on the screen is produced by showing the spectator 24 frames, or still photographs, with dark intervals between them, every second. The movement seems to be at the same rate as that of ordinary life only if the pictures are taken and shown at the same speed.",
  "Slow motion may be achieved either by speeding up the camera or by slowing down the projector, and accelerated motion is obtained in the opposite way. In common practice, the speed of the projector is constant, and the speed of the camera is varied to achieve these effects. Like extremes of scale, extremes of speed—such as in accelerated-motion films of plant growth or slow-motion films of bullets, explosions, or materials being broken—are often of less interest to the art of motion pictures than to science. Moderate slow motion has been used, however, to give a mythic or legendary quality to scenes of destruction and violence, as in Arthur Penn ’s  Bonnie and Clyde  (1967), the films of Sam Peckinpah , and Christopher Nolan ’s Inception (2010). It can also be used to express dreams or ecstasy, while accelerated motion is often very effective in comedy. The cinema can give the illusion of reversing time, by showing events happening backward, or of holding time still, by showing the same image again and again.",
  "Despite the possibilities for manipulating it, the time presented in a single shot of film is ordinarily the time of the real world. From shot to shot, however, the time is presented according to certain conventions. In most motion pictures, the story may be assumed to be presented in chronological order and in real time except when certain conventions are invoked, such as ellipsis, repetition for emphasis, flashbacks, or dream sequences.",
  "The narrative may be advanced with immense speed and economy simply by the omission, or ellipsis, of what is not essential. A straight cut may be used between a shot of a girl dressing for a ball and a shot of her at the ball itself. To show a lapse of years, however, it may be necessary to fade one shot slowly from the screen and fade the next in or to use a dissolve, or mix, which shows both shots superimposed as one supersedes the other.",
  "To emphasize important scenes of short duration, repetition is an effective device. Such a scene may be shown from different angles or from a distance and then close up, and it may occupy much more time on the screen than would the actual event. By emphasizing what is important and eliminating the rest, a motion picture can give the illusion of covering a lifetime in only 90 minutes.",
  "A flashback is an interruption of the actual chronology of a story to relate a significant event of an earlier time. The flash-forward, a device used much less, interjects future events in the same way. These devices require special optical effects, such as fades, dissolves, or irising, to stress the break in continuity. The break can also be stressed by the use of a melody associated with the past or by an unusual camera movement, as well as by the more obvious devices of using noticeably different period styles in the settings or having the actors made up to look much older or younger.",
  "A thought or dream sequence requires similar emphasis on the departure from chronology of real time. Nearly all of La Rivière du Hibou (1962), a prizewinning French short film adapted from Ambrose Bierce ’s 1891 short story “An Occurrence at Owl Creek Bridge,” consists of the fleeting last thoughts of a man about to be hanged. By not indicating a break between the actual events of the hanging and the fantasy of the condemned man, the film deceives the audience, until the very end, into thinking he is making an escape.",
  "The tempo or pace that an audience senses in a film may be influenced in three ways: by the actual speed and rhythm of movement and cuts within the film, by the accompanying music, and by the content of the story. For most people, time seems to pass quickly during moments of happiness, excitement, or exhilaration and slowly during sadness or boredom. In films, it is possible to reverse this apparent cause-and-effect relationship and to induce a feeling of happiness, excitement, or exhilaration by making the picture seem to move quickly. Means of accomplishing this include lively music, quick cutting, and fast action. Conversely, a sense of sadness or boredom can be induced by solemn music or immobility of the images.",
  "A feeling of suspense is unusual in combining excitement with a sense that time is passing slowly. Much of the suspense depends upon the audience’s awareness of a danger unknown to the characters in the film. Conversely, the sense of serenity and wisdom achieved by directors such as India’s Satyajit Ray or Japan’s Ozu Yasujirō emanates from the deliberateness with which they pace even the most dramatic of actions.",
  " Intolerance Intolerance  Tempo is not necessarily related to the actual length of a motion picture. A poorly made short film may seem interminable, for example, whereas a three-and-a-half-hour masterpiece, such as D.W. Griffith ’s Intolerance (1916), can command and sustain a viewer’s full attention.",
  "  Mechanical reproduction of sound was developed as early as the first motion pictures, but the problems of amplifying sound sufficiently for an audience and synchronizing it with the film image were not solved until the late 1920s. Although sound attracted crowds to the cinema to hear the new miracle, the gains were not immediately apparent. The new “talkies,” mostly poor imitations of theatrical plays, fell short of the artistic levels of the best silent films. Sound equipment was cumbersome and imperfect. The once-mobile camera of the silent film lost its freedom, and the editing of film tied to a sound track became stodgy and slow.",
  "Sound also resulted in great advantages, however. The cumbersome captions of the silent film could be dropped; certain strained methods of showing sound in pictures, such as shots of factory whistles, guns firing, or rows of clapping hands, became unnecessary. Music could be composed for a film and enjoyed in the humblest as well as the grandest cinema. Just as the visual image in the frame of a motion picture was elevated from the profusion of nature and could be seen fresh, so could sound be isolated for artistic purposes—the screech of automobile tires, the ticking of a watch, the baying of hounds, the whinny of a horse. The dramatic effect of sound could be tremendous. The rushing, crackling sound of a great fire in the last scene of Robert Bresson’s  Le Procès de Jeanne d’Arc (1962; Trial of Joan of Arc ) is as terrifying as any visual effect could be. In Hitchcock’s Torn Curtain (1966) there is a desperate struggle in the kitchen of a lonely farmhouse; as the doomed man’s head is held in an oven and his hands (the only thing in the picture) convulsively twitch, the sound of hissing gas dominates the scene. The introduction of sound also made it possible to use silence with a dramatic effect that can be more telling than either words or music.",
  "Like images, sounds can be used to represent subjective thoughts, indicating not what the character is saying but what that character is thinking. For example, in Hitchcock’s Blackmail (1929), the first English sound film, the word knife is repeated in the thoughts of a frightened girl who thinks that she has committed a murder.",
  "In terms of montage, sound, dialogue, and music are used in combination not only with one another but also with the visual image. They can overlap and vary in intensity in a flexible and complex pattern. The finished sound track may involve mixing together tracks of dialogue, background noises, and music recorded at different times; the tracks must be matched to one another and to the visual film. Though the audience may hear it simply as an accompaniment to what they see, the sound is sometimes the most expensive and difficult part of a motion picture.",
  "The live music that accompanied silent films varied from a full orchestra to a honky-tonk piano, according to the size of the theatre. Music was effectively used on the film set to improve an actor’s performance. With the advent of sound, music became an integral part of the film experience. Early mood music was so expressive that now it often seems overblown. Conscientious filmmakers soon learned the virtue of restraint, using music less frequently but to greater effect. From the 1960s onward, electronic music, as in Close Encounters of the Third Kind (1977), was commonplace.",
  "Music often has an important function in emotional climaxes of motion pictures. It can be used effectively to relieve or sublimate intolerable intensity—of grief, pain, or ecstasy—as in the use of the pop song “Stuck in the Middle with You” during a torture scene in Reservoir Dogs (1992). Il Vangelo secondo Matteo (1964; The Gospel According to St. Matthew ), by the Italian director Pier Paolo Pasolini , reveals how expressive periods of silence can be and how great music can ennoble scenes like those of Christ’s persecution and agony on the cross. Music may also be used symbolically. In Léon Morin, prêtre (1961; Leon Morin, Priest ), for example, a sequence of harsh chords represents the German occupation forces, and a dancing bugle motif represents the Italian troops. Organ music is used in scenes showing the heroine with the priest in church, piano music when they are in his flat. Hurdy-gurdy music represents two gossiping spinsters, and in a climactic scene louder and louder electronic music represents the heroine’s obsessive sexual feeling for the priest before she reaches out to take his hand.",
  "It is the function of the sound engineer to select and modify sound as the cameraman selects visual images. Since the noise of crockery, cutlery, or paper or the chirping of crickets would be intolerable transferred in full volume to the screen, the sound engineer must tone them down. Treble and bass must be balanced. In other cases, in order to get the effect needed, sound has to be built up and orchestrated as if it were music. Creative use of sound in motion pictures can lend remarkable delicacy, richness, and variety by using such devices as asynchronism—that is, contrasting the sound with the visual image. Sound libraries put most conceivable sounds readily at the disposal of filmmakers. Instruments and voices can be modified, overlapped, echoed, or given a resonance and volume that transform them. Dialogue can be crystal-clear, bringing the audience far closer to an actor than in the theatre, or it may be nearly inaudible by design.",
  "Although conventions vary from one country to another, the script usually develops over a number of distinct stages, from a synopsis of the original idea, through a “treatment” that contains an outline and considerably more detail, to a shooting script. Although the terms are used ambiguously, script and screenplay usually refer to the dialogue and the annotations necessary to understand the action; a script reads much like other printed forms of dramatic literature, while a “shooting script” or “scenario” more often includes not only all of the dialogue but also extensive technical details regarding the setting, the camera work, and other factors. Moreover, a shooting script may have the scenes arranged in the order in which they will be shot, a radically different arrangement from that of the film itself, since, for economy, all the scenes involving the same actors and sets are ordinarily shot at the same time.",
  "Generally, more elaborate productions require more elaborate shooting scripts, while more personal films may be made without any form of written script. The script’s importance can also vary greatly depending on the director. Griffith and other early directors, for example, often worked virtually without a script, while directors such as Hitchcock planned the script thoroughly and designed pictorial outlines, or storyboards, depicting specific scenes or shots before shooting any film.",
  "Some scripts are subsequently modified into novels and distributed in book form, such as The Dark Knight (2008) by Dennis O’Neil. In the instance of Dylan Thomas ’s The Doctor and the Devils (1953), a script became a literary work without ever having been made into a motion picture.",
  "Adaptation from other art forms to motion pictures must take into account differences of complexity and scale in film. A film often must omit characters and incidents in the novel from which it is adapted, for example, and the pace usually must be accelerated. Ordinarily, only a fraction of a novel’s dialogue can be included. In an adaptation of a play, the curtailment is less severe, but much dialogue still must be cut or expressed visually.",
  "Well over half of all fiction films made during the 20th century after 1920 were adapted from plays or novels, and it is understandable that certain formulas came to be tacitly accepted to facilitate the remaking of literature into moving pictures. Adaptation has been thought of as an aesthetically inferior exercise, because most such films merely illustrate the classics or reshape a literary text until it conforms to standard cinematic practice. The particular qualities that made the original interesting are often lost in such a process. Certain films and filmmakers, however, have achieved an aesthetic premium by accepting the literariness of the original and then confronting this with the technology and methods of the cinema ( The French Lieutenant’s Woman , 1981; Adaptation , 2002; Carol , 2015). Numerous directors have explored literature in an almost documentary manner. The artifice of the French director Eric Rohmer ’s Die Marquise von O. (1976), for example, aptly expresses the literary sensibility of Heinrich von Kleist ’s romantic, ironic work. On the other hand, less-adventurous big-budget adaptations reshape the literary works on which they are based into conventional “Hollywood” movies, as some critics complained about Sydney Pollack ’s Out of Africa (1985). The delicate and changing sensibility of the main character, evident in the prose of the original, was not reflected in the film’s traditional, albeit grand, presentation.",
  "Although many eminent literary authors, including F. Scott Fitzgerald and William Faulkner , have worked on film scripts, the ability to write a good original script, especially under strict studio conditions, frequently belongs to lesser-known scenarists with a strong visual sense. Some writers, particularly in France, have tried to narrow the gap between the written and cinematic modes of expression. Marguerite Duras and Alain Robbe-Grillet became representative of a new kind of author able and willing to “write” directly on film. Both directed their own films, which they considered as equivalent to their novels and plays.",
  "Of all the artists involved in movies, the actors and actresses are closest to the audience. The public more often goes to see a motion picture for its stars than for any other single reason. The divergent techniques of stage and film acting are well understood, and there are many leading players who excel in both. But the greatest film stars typically have a talent peculiar to the screen alone. This talent often seems to be related not to how well they act but to the sort of person they appear to be.",
  "Film acting requires restraint. “Don’t act, think” was the advice of the eminent German director F.W. Murnau . While stage actors may be praised for a performance that is highly wrought, film stars usually must appear to be themselves. Close-ups accentuate the more intimate relationship the actor can establish with a film audience, an audience that has often followed the actual life of certain actors whom the industry promotes as “stars.” The German theorist Walter Benjamin argued that the image of the star compensated the film audience for the loss of direct access to live performance. For this reason film actors from movie to movie are likely to be cast in similar roles, as the case of John Wayne makes clear.",
  " The Deer Hunter The Deer Hunter  Diamonds Are Forever Diamonds Are Forever   Some actors, however, deliberately try to avoid being typecast. Robert De Niro , for example, was well known for the violent, obsessive characters he played in such films as Taxi Driver (1976) and Raging Bull , but he was equally effective in quieter, more controlled roles, such as the charismatic hero in The Deer Hunter (1977) or the sneaky political consultant in Wag the Dog (1997). In his films, De Niro downplayed his own personality to “become” the characters he portrayed, even transforming himself physically by gaining excessive weight for his role in Raging Bull . Actors who have been strongly identified with one role have found it harder to change their image. Sean Connery , for example, appeared in more than 40 films, playing such diverse characters as an eccentric poet in A Fine Madness (1966), an Arab chieftain in The Wind and the Lion (1975), a medieval monk in The Name of the Rose (1986), and a Prohibition -era Chicago policeman in The Untouchables (1987), but he was most identified with the sophisticated British secret agent James Bond , whom he played in seven films.",
  "A film performance can be synthesized bit by bit, by the joint efforts of the actor, the director, the cameraman, and others. The conditions of film production, however, are such that some actors find them trying. They may have to put up with long hours on the set and endless repetition; they must adapt to shooting scenes out of sequence; and in close-ups they often have to respond to the camera rather than to another actor. They require a talent different from, but equal to, that of theatrical performers.",
  " On the Waterfront On the Waterfront  Throughout the history of the art, acting styles have frequently led to major revolutions in film style. Most of the shifts in acting have been toward what is deemed a more “realistic” approach. Often this realism is the result of the studied application of acting precepts, as when Marlon Brando brought to  On the Waterfront  (1954) the lessons he had digested at the Actors Studio (the professional workshop in New York City). In the 1960s several successful Czechoslovak films featured effective performances by what appeared to be average citizens, but in truth the players’ long silences, their bumbling, and the foibles that seemed so natural were the result of lifelong practice and endless rehearsals. Some films, however, have exploited the documentary power of the medium to reveal the behaviour of untrained but expressive individuals. Many of the masterpieces of the postwar Italian Neorealist movement relied on absolute amateurs, who were frequently picked up off the streets by the casting director",
  "Side by side with the never-ending quest for naturalness in acting, an opposite impulse has brought to the screen both stylized and histrionic performances of great power. Cinematic Expressionism (largely identified with German films from the 1920s but also evident in Eisenstein’s Ivan the Terrible ) depends on contorted bodily and facial gestures, which are amplified by decor and camera angle. Eminent actors, including Laurence Olivier and Orson Welles , have shown that some types of films thrive on expansive theatrical voicing and gesture.",
  " Go West Go West  The General The General   Comedy requires other considerations. The impassive visages of the silent star Buster Keaton and the French comic Jacques Tati helped transform their bodies into expressive machines that interacted with the greater machine of the films they starred in. The Marx Brothers , on the other hand, depended on loose cinematic construction and dialogue and on zany spontaneous action. In short, there can be no single theory of film acting.",
  "Under the heading of design, all the elements of a picture’s setting may be included—art direction, scenic composition, set design, costume, and makeup. At its simplest and most naturalistic, the camera can choose and frame ordinary people in a real location. At its most elaborate, motion-picture production may involve the expenditure of vast sums to put up gigantic sets that require building houses, ships, churches, and monuments or re-creating lost cities, bygone landscapes, or ancient battles and dressing thousands of extras in period costumes. Thunderstorms, tornadoes, snowstorms, earthquakes, volcanic eruptions, and tidal waves may be simulated, or monsters, spaceships, and cities of the future created.",
  " Le Voyage dans la Lune Le Voyage dans la Lune A Trip to the Moon  Le Voyage dans la Lune Le Voyage dans la Lune A Trip to the Moon   Film sets are constructed more solidly than stage scenery but of the lightest, cheapest materials that will both look authentic and photograph well. Whether for black and white or for colour, their shades, proportions, and shapes are chosen for the camera rather than the eye. The camera can deceive the viewer about scale, however, and the model makers and special effects technicians can reproduce virtually anything in miniature, from the aurora borealis shining on an igloo to a tempest destroying the Spanish Armada. A whole series of film monsters have attracted goggle-eyed audiences since the French pioneer Georges Méliès ’s Le Voyage dans da Lune (1902; A Trip to the Moon ), in which humans land on the Moon and encounter alien creatures. Miracles can be achieved in film, either in the colossal form of the crossing of the Red Sea by the children of Israel in Cecil B. DeMille ’s epic The Ten Commandments (1956) or in the comparatively simple treatment of angels and miracles in Frank Capra ’s It’s a Wonderful Life (1946) or Warren Beatty ’s Heaven Can Wait (1978). Film publicity makes much of the creation of epics such as  Cleopatra  (1963) or the three-part The Lord of the Rings (2001–03), but, even on a more modest scale, sets can contribute enormously to a motion picture, as in Ken Adam’s sets for  Dr. Strangelove  (1964) or Anton Furst’s for Batman (1989).",
  "  (Read Cecil B. DeMille’s 1929 Britannica essay on acting.)  ",
  " The Cabinet of Dr. Caligari The Cabinet of Dr. Caligari  The strongest single artistic influence in motion-picture set design was the German Expressionist cinema of the 1920s, which combined elements of Max Reinhardt ’s theatre, a Wagnerian philosophy of doom, and Expressionist painting and graphics. Expressionist films such as Das Cabinet des Dr. Caligari (1920; The Cabinet of Dr. Caligari ), Der Golem (1920), Nosferatu (1922), and  Metropolis  (1927) created a world of fantasy and horror peopled with menacing, shadowy figures. In other German Expressionist motion pictures, such as Der Student von Prag (1926; The Student of Prague ) or Die Nibelungen (1924), there was a baroque beauty of architectural, woodland, and floral settings. The influence of Expressionism can be seen in later cinema in the work of directors Orson Welles and Carl Dreyer and in many gangster movies.",
  "Subject matter and how it is treated are reflected in all the elements of design in a motion picture. In the hectic atmosphere of a horror movie or a thriller, a studio set may pass unnoticed, even though it would seem disconcertingly artificial in another film. In a musical everything may look artificial: a chambermaid’s bedroom may be a model of daintiness and taste. Some films, however, depend on realistic sets for dramatic effect. Accordingly, some directors, especially the French master Jean Renoir in his 1930s films, went to great lengths to be authentic, avoiding the use of rear screen projection, or process shots (i.e., those in which new action is filmed in front of a screen on which previously filmed background footage is projected). All the train sequences in Renoir’s La Bête humaine (1938; The Human Beast ), for example, were shot on a moving engine, except the final scene, in which the hero, played by Jean Gabin , leaps to his death. Another French director of the same era, Marcel Pagnol , had his cast and crew construct the farmhouse for his masterpiece, Angèle (1934), not to save production money but to increase the naturalness of their behaviour on the set during shooting.",
  "In historical epics, such as Dunkirk (2017), and science-fiction films, such as Blade Runner (1982) and Inception (2010), settings vie with actors and story for the viewer’s attention. In carefully constructed intimate dramas, such as those by Robert Bresson ( L’Argent , 1983) or Jim Jarmusch ( Stranger than Paradise , 1984), the setting can embody the tone of the film. Numerous stylistic options are attached to decor: its richness or sparseness, its naturalness or artificiality, its contemporaneity or period look, its cleverness or simplicity. Because all these factors are related to the full conception of the film, the set designer is one of the first artistic collaborators called in by the director in the quest for a strong, forceful production.",
  "In a medium consisting of the projection of impressions on a light-sensitive material, lighting is of special importance. Daylight is the readiest, cheapest, and strongest source of lighting. Hollywood was said to owe its preeminence as a motion-picture production centre to its sunny climate. Even in daylight shooting, however, artificial aids may be necessary to reduce the highlights or to lighten the shadows.",
  "Lighting, a facet of camera work, is under the control of the chief cameraman or lighting cameraman. In black-and-white films, lighting is of paramount importance in giving the overall light or dark tone of the scene and in providing for dramatic contrasts or emphasis within the scene. In colour, the lighting works indirectly to bring out or modify the colour. Lighting in the cinema is a method of composition, used to complement and reinforce the dramatic situation. Generally, dark lighting is associated with tragedy and bright lighting with romance or comedy, but overlighting gives ghastly or unearthly effects, as in the memory sequence at the beginning of the Swedish director Ingmar Bergman ’s Gycklarnas afton (1953; Sawdust and Tinsel , also called The Naked Night ). Lighting an actor from above gives the face a spiritual effect; from below, an uncanny or evil appearance. Front lighting blurs faults but takes away character; side lighting gives relief and solidity but may show wrinkles and defects. Lighting from behind tends to idealize a subject and give it an ethereal quality.",
  "Fashions in film lighting have fluctuated through the years. Early films tended to be flat and uniform. Later, especially in German Expressionist films of the 1920s and film noir of the 1940s and ’50s, strong contrasts of light and shade were favoured for their highly dramatic effect. Still later, this tendency was modified toward more balanced lighting. Even in dramatic scenes, the centre of interest now tends to be more discreetly emphasized.",
  " Henry V  Occasionally, different types of lighting are used for dramatic effect in a single film. For his Shakespearean adaptation Henry V (1944), Laurence Olivier employed uniform bright light for the sequences modeled on medieval book illustrations, but in the contemplative sequences (Falstaff’s death and Henry’s solitude the night before the battle) he used single-source lighting from the side, which allows extensive gradation of light and shadows, making the images look like paintings by Rembrandt . The elegiac humanity of the latter scenes contrasts with the brittle, eternal quality of the former. More often, directors choose a single look. Stanley Kubrick ’s decision to film Barry Lyndon (1975) in candlelight is a notable example.",
  "Related to lighting is the development of the print in the laboratory, where sections of film shot under different conditions can be modified to avoid a violent contrast where none is desired. Finally, the lighting of the projector that shows the picture and the brilliance of the screen are important. As light sources for the projector, both the traditional carbon arc and the modern xenon lamp have advocates; what matters most is that the light be powerful, brilliant, and unvarying throughout the projection of the picture.",
  " Alphaville Alphaville  A salient feature of the cinema is its ability to reproduce natural scenery. Since the earliest years filmmakers have mixed outdoor footage with scenes shot inside the studio to give audiences the impression that the carefully calculated dramas they are witnessing are faithful records of events that occurred spontaneously in the real world. Just after World War I the Swedish directors Mauritz Stiller and Victor Sjöström stunned audiences with their films featuring simple folktales set in the mountains. The seasons of the year, the weather, and the Swedish streams, lakes, and waterfalls were active participants in these tales. After the success of documentary features such as those by Robert Flaherty ( Nanook of the North ), even Hollywood made room for films in which the natural setting was clearly the main protagonist, with the fictional drama used as a way to convey the audience around the landscape. More often the landscape provides an alternative attraction, allowing viewers to see favourite stars in exotic and beautiful locations, as in Under the Tuscan Sun (2003). Familiar surroundings are sometimes used as the sets for futuristic dramas. Jean-Luc Godard’s Alphaville (1965) turned Paris into an oppressive metropolis on another planet, and Blade Runner (1982) created a compelling portrait of Los Angeles in the year 2019.",
  "With the invention of lighter, more portable equipment, filming on location—that is, in an actual setting like the one in which the story takes place rather than in a studio set—became less difficult and less expensive and is today used more often. As a result, many earlier motion pictures now look artificial, since no studio set can equal the authenticity of a real location. Nonetheless, films may be shot in a studio when natural settings are unavailable, as in historical films, or are too remote. On the other hand, the effect of certain films can be utterly lost when inauthentic locations are substituted for genuine ones. The 1948 British Technicolor epic Scott of the Antarctic , for example, was shot in the Swiss Alps, which facilitated filming but ruined the documentary aspect of the film.",
  "Actors in motion pictures have been dressed in noticeable and often significant ways since the beginning of film history. The Italian epics made before World War I displayed Roman and Egyptian styles that the public had come to expect from popular paintings and stage plays dealing with these ancient subjects. After World War I, Ernst Lubitsch gained fame directing historical dramas, such as Madame Du Barry (1919), that were termed “costume dramas” even in their own day. From the 1920s to the 1950s various national cinemas, but particularly those in France and the United States, vied with one another in using the cinema to promote fashion. Christian Dior ’s rise in the world of haute couture was accelerated by his experiments with, and his advertising of, costumes in motion pictures. In Hollywood a motion picture was often an opportunity for an actress to wear one gorgeous costume after another, and many screen designs initiated popular offscreen fashion trends. After World War II the Italian Neorealist movement proved that audiences could also be drawn by authenticity of dress. Since then, many films attempting to convey a realistic effect have been outfitted not from the costume shop but from secondhand-clothing stores.",
  " Klondike Annie  Costume also once played a more important role in an actor’s identity. Charlie Chaplin , Buster Keaton , Mae West , and other stars of the 1920s and ’30s all created characters in which costume was an integral part of the total identity. Audiences were often able to discern the type being portrayed—hero, villain, comic foil, romantic rival—simply by regarding the character’s clothing.",
  "Film makeup differs significantly from that of the stage, where heavy lines are required to convey a characteristic expression to the audience. By means of the camera, the motion-picture audience can study the actor’s face quite closely. The makeup must be flawless to stand up under such scrutiny, but, since it need not be applied nightly for several months running, as in theatre, elaborate preparations are feasible. Many of the greatest filmmakers, such as Carl Dreyer and Robert Bresson, have favoured naturalism in makeup—the unadorned lines of old age or a face caked with dust, running with perspiration. Whatever the style of makeup, its purpose is to make the face a more photogenic object, whether monster or ingenue. The efforts of wig makers, dentists, and plastic surgeons, as well as cosmeticians, are aimed at a heightened reality.",
  "The cosmetics industry grew up in the 1920s alongside motion pictures. Max Factor ’s fame owes much to the work his company did in modifying makeup to adjust to new types of film and lighting, including the shift to colour cinematography. With changing audience perceptions, caused by television and other factors, more natural makeup styles became just as popular as the “idealized” methods applied to the great studio stars. Ironically, the “natural look” is often the result of extensive makeup tests.",
  " Lord of the Rings: The Two Towers Lord of the Rings: The Two Towers  While makeup generally is meant to remain unnoticed or to play servant to the beauty of a face, in science-fiction and horror films it may take centre stage. Although it is an art as old as society itself, makeup, like other aspects of cinema, is subject to technological development. Advances in contact lenses, prosthetics, and chemistry made possible magnificent and startling displays such as those in Planet of the Apes (1968), Time Bandits (1981), and The Lord of the Rings and those creating the never-ending flow of creatures that terrorize horror-film audiences.",
  " The New Tenant  The modern motion-picture director is the person most responsible for the ultimate style, structure, and quality of a film. Cinema is an art of collaboration, and in some instances someone other than the director may come to dominate (for example, a producer with authority over the final cut or an actor whose box-office popularity gives him the power to direct the director), but in general it is assumed that the person assigned to direct the picture must take the credit or blame for its form and content.",
  "  (Read Cecil B. DeMille’s 1929 Britannica essay on film directing.)  ",
  "While the function the director serves has always been filled by someone, the priority of that function has not always been recognized. Georges Méliès, for example, thought of himself as a “producer” of films, and indeed from 1896 to 1912 he took care of all aspects of the making of the films bearing his name, including set design, acting, and camera work. Charles Pathé , in turn-of-the-century France, was one of the first producers to assign an assistant (Ferdinand Zecca) specifically to direct the pictures of his rapidly expanding film empire. At France’s Gaumont Pictures, Louis Feuillade and Alice Guy , the first woman to take on a key position in cinema, shared the task of directing, each specializing in separate genres. In the United States as in Europe, many of the first film directors were cameramen ( Edwin S. Porter ) or actors (D.W. Griffith) until circumstance compelled them to take on various directorial duties. The movie industry was growing rapidly, however, and by 1910 the number of films required to fill the many newly constructed movie theatres was such that production had to be delegated. The director’s role was to work with the actors, designers, technicians, and others involved in the moviemaking process, coordinating and overseeing their efforts in order to rapidly turn out interesting and comprehensible movies within given financial and material strictures.",
  "As early as the 1920s those who wrote seriously about motion pictures had no qualms about attributing successes and failures to the director. Some directors, notably F.W. Murnau and Fritz Lang in Germany and Victor Sjöström in Sweden, were virtually as famous as the stars who acted in their films. In 1926 William Fox paid Murnau $1 million to relocate in Hollywood in the hopes that he would make the greatest movies the world had yet seen. The primary issue of this marriage of art and money, Sunrise (1927), remains an anomaly in the history of the film industry, for Murnau was given unusual control and virtually unlimited resources. The film still astounds critics, but it was not a commercial success, and it stunted for a time the growing stature of the director. Erich von Stroheim ’s more dramatic encounters with producers such as Irving Thalberg further encouraged this businesslike attitude, which led to the practice of quickly typing directors as either workmanlike or difficult.",
  " Mr. Deeds Goes to Town Mr. Deeds Goes to Town  In the great age of the studio system (1927–48), strong directors vied with the factory conditions in which films were made. Those directors with powerful personalities (such as Frank Capra, Howard Hawks , John Ford, and Ernst Lubitsch) were given great freedom, but they still had to work with actors and actresses contracted to the studio, with union personnel following time-honoured routines, with scripts and scriptwriters selected by the studio, and with deadlines that discouraged experimentation.",
  "The “ auteur theory ,” which was propagated by French film theorists in the 1950s, offered a powerful method for studying and evaluating the films of the studio era. The word auteur (literally “author” in French) had been employed in France in the 1930s in legal battles over the rights to artistic property. This legal struggle to determine whether a film “belonged” to its scriptwriter, director, or producer strengthened the belief held by many critics and theorists that it was the director alone who deserved credit for a film, just as an architect could be credited for a building even though it was built and used by other people. While this view made eminent sense when strong directors were concerned, it tended to ignore average filmmakers.",
  "Auteurs are defined as directors with solid technique, a well-defined vision of the world, and a degree of control over their productions. Some directorial situations are easy to evaluate. Griffith and Chaplin had complete financial control over their major efforts. European art directors, such as Ingmar Bergman, enjoyed similar freedom. Indeed, their films were often marketed as the expressions of important artistic personalities. However, the auteur theory was developed to encourage the reevaluation of countless films by directors operating in the middle of suffocating studio situations. Directors such as Leo McCarey , Gregory La Cava , and Anthony Mann stylistically and thematically imbued their films, whatever the genre, with a consistent, personal aesthetic. Their output, even when unsuccessful, is deemed immeasurably more valuable than the undistinguished films of weaker directors who merely translated the words and actions indicated in a script into routine screen images. Scriptwriters in the studio years worked mainly in teams; a single script often passed through the hands of several different writers, so most films are more recognizable as the product of a particular studio than of an individual writer. The tension between director and genre or studio is thought to produce films that appeal to the public while expressing the vision of an individual. Thus, through the auteur, the popular art of cinema is able to achieve the traditional goals of poetry and the fine arts, goals of authentic expression and of genius.",
  " 2001: A Space Odyssey 2001: A Space Odyssey  The auteur theory was especially influential in the 1960s and arguably was instrumental in creating not only the French New Wave but also similar movements in Britain and the United States. Directors such as Lindsay Anderson , Joseph Losey , Stanley Kubrick , John Cassavetes , Francis Ford Coppola , and Arthur Penn thought of themselves as budding auteurs and earned critical and popular acclaim for their distinctive styles and themes. With the fall of the studio system in the 1950s, there was indeed room for a single personality to take control of a film and to market it on the basis of personal vision.",
  "After 1960 first-rank American motion-picture directors began to make films under conditions that had been in practice in Europe throughout the century. The insignificant studio system of France, for example, had enabled and encouraged individual entrepreneurs to put together film projects on a onetime basis. Such projects generally revolved around an équipe , or team of creative personnel, with the director at its head. The director could then truly shape the work of the designer, composer, and (most important) the scenarist so that the film had a consistent and relatively personal style from beginning to end. In this artisanal format, a producer depends on the director to develop a distinctive way of handling scenes. The director may even be required to rewrite the scenario in order to achieve a particular effect. As a result of this personal commitment, the well-publicized arguments that occur during the production of many important films almost always involve the director.",
  " Rebecca Rebecca   Alfred Hitchcock was one director who disdained arguments. He kept the blueprint of his films in his head and provided detailed instructions for each shot, without any discussion. His producers were not given the opportunity to offer alternative suggestions or to recut the film. The scenes fit together in one way only, Hitchcock’s way. While some critics have complained that the acting in a Hitchcock film is often stilted, that the sets are artificial, and that the rear-projection shots are obvious, the Hitchcock style is immediately recognizable. Most people admire the effectiveness of Hitchcock’s direction, some even claiming that in his films can be found profound moral and metaphysical insight.",
  " La Strada La Strada  Major directors throughout the world have often enjoyed such respect. Among others, Mizoguchi Kenji and Kurosawa Akira of Japan, Satyajit Ray of India, Federico Fellini of Italy, Luis Buñuel of Spain, and Carl Dreyer of Denmark were given rare opportunities to make individual artistic statements. Some have been treated as virtual national treasures whose films bring cultural glory to the countries within which they work.",
  "Despite these exceptions, most directors labour under great restrictions, particularly in the age of the television industry. A conventional television series rotates directors episode after episode so that the producers, actors, and production crew, who work continuously on the show, have much greater control over the product. Each scene of a television program is typically filmed from three different camera setups. The director strives to get the best performances possible from the actors, confident that the crew is delivering appropriate images, and an editor later chooses the best shots to use to tell the story. In comparison, powerful film directors have often involved themselves deeply in editing and postproduction. The television industry has accentuated the assembly-line features of the studio system, while independent film production today often distinguishes itself by according the director dictatorial power.",
  "Whether granted complete or restricted control, every director must approve the screenplay and then concentrate on the scene being filmed in its relation to the overall design of the film. The management unit (an assistant director and continuity clerk) concerns itself with the details of organization so that the director can interact with the creative personnel on the set (cinematographers, lighting and sound crews, set decorators, and, of course, actors). As for postproduction, all directors look with the editor at daily rushes from the lab, but only some follow through and become involved with the editing, music, and mixing phases. In all cases, the director is the one person to maintain a complete view of the project, drawing the best from all the personnel, from writer through sound mixer, and shaping their efforts so that the film attains a consistent look and meaning.",
  " The Last Emperor The Last Emperor  Successful directing has much to do with intangible social relations, such as keeping harmony (or productive competition) alive on the set, drawing the best performances possible from actors, shaping a script into a form that takes advantage of the talents of the director of photography or of the main actor, or beseeching the producer for the money needed for a special shot. Beyond such routine expectations, the great director is identified for a unique or ingenious approach to the medium. Directors have earned praise for their audacious handling of stories. Refusing to be hemmed in by the standard requirements of a two-hour drama dealing with a few central characters, Francis Ford Coppola , for example, pieced together a truly epic fresco in his two-part masterpiece The Godfather , as did Robert Altman in such collage narratives as Nashville (1975) and Short Cuts (1993) and Paul Thomas Anderson in Magnolia (1999). Italian directors have experimented with the epic form, as in Ermanno Olmi ’s L’albero degli zoccoli (1979; The Tree of Wooden Clogs ) and Bernardo Bertolucci ’s Novecento (1976; 1900 ) and  The Last Emperor  (1987), and with narrative structure, as in Roberto Rossellini’s Paisà (1946; Paisan ) and Ettore Scola’s Le Bal (1983; The Ball ), which abandon traditional plot construction and a single story line in favour of separate short episodes that are thematically or historically linked.",
  "Some directors gain more fame for their visual style than for their narrative acuity. Bertolucci’s films, for example, are not always well received, but his fluid, saturated images and their “psychoanalytic” effect have made their mark in films such as Il conformista (1970; The Conformist ) and Luna (1979). The same might be said for Fellini, Andrey Tarkovsky , and Werner Herzog . Some critics feel that Coppola’s One from the Heart (1982) projects an intense, personal vision, which is much more interesting from the directorial point of view than his more commercially successful efforts, including The Godfather . Although many directors credit their cinematographers for achieving such notable visions, most cinematographers claim merely to solve technical problems at the behest of the director.",
  " Apocalypse Now Apocalypse Now  The same can be said of effects achieved in postproduction. The incredibly dense aural ambience surrounding Coppola’s Apocalypse Now (1979), for example, resulted from the concatenation of scores of individual sound tracks mixed by a team of talented experts, but Coppola himself had already evinced a powerful understanding of the possibilities of sound in his much smaller film The Conversation (1974). Similarly, a good share of Altman’s fame must go to the engineers who coordinated the radio miking of as many as a dozen characters in a single scene in Nashville . It was, however, Altman who recognized the total effect that two hours of overlapping conversations would have on the spectator. Martin Scorsese ’s rugged editing in Taxi Driver and Raging Bull was a function not only of an editor’s ingenuity but also of a total conception of script, acting style, camera work (including harsh black-and-white tones for the latter film), and music.",
  "A director might best be thought of as a problem solver. Seldom concerned with technology, the director takes the resources at hand (the technological capabilities and the conventions of filmmaking operating at the moment) and searches for effective solutions to dramatic or visual problems. A style emerges when these solutions, or “techniques,” are applied consistently across a series of films. For example, Bresson’s penchant for employing off-camera sound to signal important events (a car wreck in Au Hasard Balthasar [1966]; a bank robbery in L’Argent ) defies standard filmmaking conventions and reaches toward a peculiarly valuable way of understanding an interior or spiritual drama. Bresson’s sound techniques became part of his austere and evocative style.",
  "Directors may be characterized by the solutions they regularly arrive at when a story or scene is presented to them. Murnau and Mizoguchi preferred the languorous tracking shot to editing a dramatic situation so that the drama could be seen to arise in the midst of the shot. Antonioni let the camera continue to shoot well after the characters were out of range so that the spectator could observe the way a dramatic scene disappeared or sense its smallness in the landscape that remained. After 1970 most American directors employed hard-hitting, swift techniques to give power to the gritty stories that came to dominate world cinema. These techniques—close-up sound, pounding music, and abrupt editing—were used to keep the spectator interested and excited. Within this general American style, however, individual directors found different methods to achieve similar effects, and they discovered that using similar techniques did not guarantee similar results.",
  " Carrie Carrie  It is generally acknowledged that the best directors are those who consistently contribute not only ingenious techniques but also an effective, coherent, personal style or theme to their films. Brian De Palma ’s use of point-of-view strategies, for example, gives a particular horror to such films as Carrie (1976) and Body Double (1984), and his technique has been compared to that of Hitchcock. Most critics agree, however, that Hitchcock is the more significant director, because the rigorous point-of-view strategy that Hitchcock employed in such films as  Rear Window  (1954) was far more than a tour de force of moviemaking technique; it was an expression of the director’s thoughts on vision and knowledge.",
  "Most connoisseurs of the art of motion pictures feel that the greatest films are the artistic and personal expression of strong directors. The cinema exists, however, for many social functions, and its “art” has served many types of film that do not set out to be artistic. In practical terms these functions divide films into what are usually termed “modes,” including the documentary, the experimental, and the fictional. The documentary mode incorporates those films relying primarily on cinema’s power to relay events in the world. The experimental includes the variety of approaches that have tested and played with the technological limits and capabilities of the medium, including animated (nonphotographic) and computer-generated images. The fictional is the mode most often thought of as simply “the movies.” It has adopted the forms of storytelling that have always existed in culture, creating various cinematic languages to convey its tales. Each of these three modes can in turn be subdivided into genres (i.e., commonly recognized types of stories or forms).",
  "The turn of the 20th century witnessed not only the invention of the motion picture but also tremendous growth of popular interest in journalism, picture postcards, lectures by travelers (frequently illustrated with slides), and so forth. The motion picture quickly came to serve society’s need to learn about the geography and social conditions of the world at large. Some of the first motion pictures depicted exotic locations, contemporary events (battles, coronations), and unknown cultures. Indeed, as late as 1908 such a major company as Biograph actually produced more nonfiction films than narratives. This would soon change, in part because the production of documentary films is dependent on world events and is therefore more haphazard and more difficult than the fully controlled process of making fiction films in studios. The decline of the nonfiction film has also been attributed to the belief that, after a decade, audiences were saturated with “views” and “actualities,” as such films were called. Moviegoers were no longer drawn to the sheer recording ability of motion pictures; they demanded imaginative entertainment instead.",
  " Nanook of the North Nanook of the North  One sort of film that has had continuous appeal, albeit for a specialized audience, has been the travel film. Much of the attraction of such films—from the crude pictures cranked out by Lumière cameramen in Japan, Africa, and the Arctic, to Robert Flaherty ’s Nanook of the North (1922) and other films, to National Geographic Society presentations on television—results simply from the thrill of seeing a foreign culture or a distant location. Flaherty proved, however, that there could also be tremendous artistry in such films. His unforgettable compositions matched the harmonious rhythm of his editing to render the lives of his subjects in a gloriously romantic tone.",
  "Both anthropologists and Hollywood producers immediately recognized the attraction of Flaherty’s work, initiating several long-lived genres. In Hollywood, King Kong (1933), one of the most famous monster movies ever made, was conceived by producer-director Merian C. Cooper, who was inspired by his experience shooting travel documentaries. The surprising success of The Gods Must Be Crazy (1981), a comedy about life in the Kalahari desert of Botswana, shows that audiences half a century later continued to enjoy a mixture of foreign locations and familiar dramas. The San of the Kalahari are also the subject of an important ethnographic film, John Marshall’s The Hunters (1958). Marshall’s tradition dates to the 1930s and to the films the anthropologists Margaret Mead and Gregory Bateson made in the Pacific.",
  "Most scholars prefer that all artistry be eliminated from ethnographic films so that the visual data recorded by the camera remain as fresh and uninterpreted as possible. The audience for these films typically consists of members of a university or museum community for whom entertainment is less significant than authenticity. When such films are prepared for mass television audiences, however, many concessions may be necessary, including the addition of extensive explanatory narration, musical accompaniment, and scenic photography.",
  "The argument over the role of art and artlessness in travelogues and ethnographic films is also pertinent to newsreels, where the standard principles governing journalism must apply. In the first years of cinema, reconstructions of such events as The Dreyfus Affair (Méliès, 1899) and the assassination of U.S. Pres. William McKinley in L’Assassinat de McKinley (Pathé, 1901) were commonly accepted. Since then, viewers have required that newsreel material be neither prearranged nor fabricated, and they have become aware of the effects of the intrusiveness of the reporter and the limitations of point of view on the objectivity of any documentary film.",
  "News films, more than any other type of motion picture, depend on their timeliness. Hence, for all of its ability to show the actual world, the motion picture failed to provide genuine news until it did so by means of television. Too stale and infrequent for day-to-day coverage, newsreels showed not news but parades, ceremonies, sporting events, bridge building, and similar events. The March of Time , inspired by  Time  magazine and produced by Louis de Rochemont from 1935 to 1951, was a series in which a topic of political or social importance was discussed in depth in a 30-minute film. The series was an immediate and continued success. From the mid-20th century, however, it was television that developed the screen presentation of news, comment, and discussion beyond anything known before.",
  " Drifters Drifters  It is less in the straight presentation of reality than in its creative interpretation that the documentary has produced works of lasting value. Among the pioneers of the documentary besides Flaherty were the Russian theorist Dziga Vertov , whose films include Chelovek s kinoapparatom (1929; The Man with the Movie Camera ), and the British producer-director John Grierson , whose Drifters (1929) inspired a school of fine directors to produce a succession of memorable documentaries through the 1930s. With the outbreak of World War II, Humphrey Jennings’s Fires Were Started (1943) and Harry Watt’s Target for Tonight (1941), two among many outstanding British wartime documentaries, dramatized Britain’s war effort better than fictional films could.",
  "In the United States, Pare Lorentz made dramatic documentaries about soil erosion and the Dust Bowl, such as The Plow That Broke the Plains (1936) and The River (1937), during the era of the Great Depression, and, during World War II, Frank Capra , who had been an outstanding director of Hollywood comedies, made a series of documentaries under the title Why We Fight . The later French movement cinema verité made films that are much closer to journalism than to the careful compositions of the English documentary school. Though often untidy, they are fresh and realistic. Television deeply affected the development of the documentary film in two major ways: by providing a training ground for documentary directors and by building a supply of news film that could be adapted to documentary form. Point of Order (1964), an American documentary film that ran successfully in motion-picture theatres, was made from television films of the U.S. Senate hearings on the charges and countercharges made by Sen. Joseph McCarthy and the U.S. Army.",
  "The Vietnam War gave rise to a plethora of documentary essays, some of them politically committed, some attempting a balanced exploration of the situation. American cinema verité, sometimes called “direct cinema,” matured during the war, though not only in response to it. The first of the rock concert films, D.A. Pennebaker’s portrait of Bob Dylan , Don’t Look Back , first played theatrically in 1967, and that same year Frederick Wiseman ’s Titicut Follies , which exposed the horrendous conditions in a Massachusetts institution for the mentally ill, caused such an uproar that it was banned in that state. Excitement over public events and celebrations permitted this spate of documentaries to compete with fiction films for screens in larger cities. The films, which were often of inflammatory content, were kept off television but nonetheless influenced that medium tremendously. Hearts and Minds (Peter Davis, 1974), for example, a powerful though one-sided attack on U.S. Vietnam policy, had an enormous impact just because it could not be shown on television. Conversely, in the 1980s many documentaries were increasingly seen on television rather than on movie theatre screens. Claude Lanzmann’s Shoah (1985), for example, a nine-and-a-half-hour examination of the Nazi concentration camps, received limited theatrical distribution in many areas because of its length but still managed to reach wide audiences through the distribution markets provided by the growing cable television and videocassette industries. Ken Burns ’s 11-hour film The Civil War (1990) was made specifically for public television in the United States, where it was widely watched.",
  "The early 21st century saw something of a resurgence in documentaries made for theatrical release. They covered a wide-range of topics, and notable entrants included Bowling for Columbine (2002), March of the Penguins (2005), and Free Solo (2018).",
  "In presenting a background, an environment, and characters who behave in a certain way, every motion picture may be said to be propaganda . The term is usually restricted, however, to pictures made deliberately to influence opinion or to argue a point. During the 20th century, the most powerful and most consistent use of the cinema for propaganda was seen in the Soviet Union. After the 1917 revolution, Soviet films exploded on the screen with fervent conviction. Gradually, however, the pictures became lifeless, and in the 1930s and ’40s, during the Stalin regime, great directors such as Eisenstein and Aleksandr Dovzhenko worked under severe restraints. Nazi Germany produced its own brand of propaganda in the 1930s, the most striking being Leni Riefenstahl ’s Triumph des Willens (1936; Triumph of the Will ), a terrifying spectacle of a huge Nazi rally that had in effect been staged for the film made about it.",
  "Few filmmakers would admit to making propaganda, although, in effect, many so-called educational films and all advertising or promotional shorts, whether featuring consumer products, vacation sites, or religious groups, may be seen as examples of propaganda. This form of film bears a stigma because of its undisguised aim: to influence ideas and change behaviour. Cinematic artistry serves merely as a tool in propaganda.",
  "While the motion picture developed rapidly as a medium predominantly based on recording actual events and creating narrative fictional stories, from its early decades there were artists and filmmakers interested in exploring the new technology’s potential outside or beyond the mainstream modes. Although extremely varied in form and subject matter, their endeavours have been grouped together under the terms experimental film or avant-garde film, as well as under the broader rubrics of alternative cinema or art cinema.",
  "Experimental filmmaking took form in the 1920s primarily in France, with significant contributions from elsewhere in Europe and also in the United States, where the photographer Paul Strand and the photographer-painter Charles Sheeler made one of the first such works, Manhatta (1921), a meditation on images of New York skyscrapers.",
  "In France, artists associated with the post-World War I avant-garde movements Dada and Surrealism , among them Fernand Léger , Marcel Duchamp , René Clair , and Man Ray , also made abstract, nonnarrative, and animated films. It was also possible in French film culture of that era for experimental works to be made and exhibited commercially, by such filmmakers as Louis Delluc, Jean Epstein, Marcel L’Herbier, Germaine Dulac, and Abel Gance , who went on to make the three-screen epic Napoléon (1927). The most famous avant-garde film of the era was Un Chien andalou (1929; An Andalusian Dog ), a Surrealist work made in Paris by the Spaniards Luis Buñuel and Salvador Dalí .",
  "A number of experimental films were made in the United States during the 1920s and ’30s, but the movement gained important new impetus with the emergence of Maya Deren , a former dancer who made her first film, Meshes of the Afternoon (1943), with Alexander Hammid. Deren’s films and writings influenced the development of post-World War II American avant-garde filmmaking with an emphasis on inner psychology, dream states, and exploration of the self. Stan Brakhage was another key figure of this movement, often called New American Cinema, the films of which could be made inexpensively through the wider availability of 16-mm and 8-mm cameras and film stock. The New American Cinema expanded during the 1960s to reflect the cultural transformations of the era, more explicitly taking on such themes as feminism, gay and Lesbian sexuality, and multicultural ethnicity. It reached its peak in the decade 1965–75, when the Pop artist Andy Warhol , among others, made experimental films that were exhibited commercially in theatres. In the 1970s one wing of the movement focused on the formal and structural aspects of film, while political concerns led others to shift more toward a hybrid style combining narrative fiction and documentary elements.",
  " Animation has always played a significant role in experimental filmmaking. In the past, the process involved filming a series of still drawings or objects so that, when projected, an illusion of movement was created. With the development of computer technology, many animated films have been made from computer-generated images (CGI, also known simply as computer animation ). Through the popularity of animated cartoons, the techniques of animation have typically played a larger part in commercial cinema than other aspects of avant-garde filmmaking.",
  " Gertie on Tour  Animation in fact developed in early cinema in a commercial context through the works of such animators as Émile Cohl in France, Winsor McCay in the United States, and Wladyslaw Aleksandrowicz Starewicz in Russia, the latter animating insect figures in narrative fiction tales. In Germany after World War I the artists Hans Richter and Viking Eggeling utilized the animation tables at the big UFA studio to make several of the first abstract animation films. While animation continued to interest experimental filmmakers over the following decades, the animated cartoon short became a fixture of exhibition programming, and cartoon characters Mickey Mouse , Bugs Bunny , Popeye the Sailor, Woody Woodpecker, and many more became legendary figures in popular culture. In the 1930s the Hollywood animation studios began to produce feature-length films, with Walt Disney leading the way with such classics as Snow White and the Seven Dwarfs (1937).",
  "Commercial motion-picture animation slumped in the 1960s as cartoons for children migrated to television, Hollywood studios cut back, and theatres no longer included cartoon shorts as part of their exhibition program. In the 1980s, however, the Walt Disney Company and other producers began to revive the animated feature. An early success, Who Framed Roger Rabbit (1988), combined animation and live action and drew on nostalgia for Hollywood’s classic cartoons. Disney’s Beauty and the Beast (1991) became the first animated feature to be nominated for a best-picture Oscar by the Academy of Motion Picture Arts and Sciences. The Lion King (1994), also from Disney, became one of the most popular films in motion-picture history in terms of all-time box-office receipts.",
  " Toy Story Toy Story  Shrek   In the 1990s CGI began to supplant traditional methods in commercial feature animation. Pixar Animation Studios produced the first feature-length completely computer-animated work, Toy Story (1995), distributed by Disney. According to the company, some 110,064 separate frames of computer animation were made, and 800,000 machine hours were needed overall, creating at a maximum rate of 3.5 minutes of screen time per week. The huge success of Toy Story resulted in several sequels and encouraged other studios to produce computer-animated films. Such later notable examples included the Shrek series, Frozen (2013), and Finding Dory (2016).",
  "Japanese animation films, known as anime , which developed a worldwide audience in the 1990s on television, via the Internet, and through video and DVD releases, began to gain further attention through international theatrical distribution. More than his Hollywood counterparts, who utilized a realist style even in their animation fantasies, Japanese animator Miyazaki Hayao fused experimental and mainstream approaches with his dreamscape imagery in animated features Mononoke-hime (1997; Princess Mononoke ), Sen to Chihiro no kamikakushi (2001; Spirited Away ), and Hauru no ugoku shiro (2004; Howl’s Moving Castle ).",
  "Motion pictures were the most important narrative art form of the 20th century, having taken on the functions served earlier by dime novels, serial novels, staged melodramas, wax museum displays, epic paintings, and professional storytelling. These earlier forms continued into the century and were supplemented by comic books, radio, and television, but it is the motion picture that came to dominate them all. Still, most films can be seen as descendants and variants of types of stories and storytelling that predated the invention of the cinema.",
  "Always plagued by the need for a constant flow of new products to satisfy patrons returning to the movies week after week, film companies quickly began to rely on genres to help regularize production and to help presell their motion pictures. A studio that decided to make half a dozen police thrillers in one year could organize its production schedule efficiently, saving time and money by reusing sets, costumes, and other items. More important, the studio could assign the same personnel to certain genres, allowing writers, directors, technical crews, and actors to establish a routine that often resulted in quicker and improved filmmaking from work to work. In addition, it was found that the initial success of a new film was frequently enhanced by the popularity of previous films in the same genre. Viewers knew, to a great extent, what to expect from a genre film; they recognized the stars, or at least the characters, in it, and they were sensitive to music, lighting, and plot devices because of long familiarity with the type of story being portrayed.",
  "Although the movies have created their own genres, most have been derived from prototypes in the other arts, especially literature. The western , for example, has important precursors in popular painting, Wild West shows, and pulp fiction. It does not matter, however, if audiences are unfamiliar with these other forms; viewers quickly learn the rules of the genre, acquiring the ability to recognize the hero from costuming, to anticipate the final shoot-out, and so forth. Genres epitomize the dilemma of the fiction film in that they promise to deliver to a waiting audience something that is similar to what that audience has enjoyed in the past and yet something that is also quite new and different. Often the most highly acclaimed films are those that invoke the conventions of a genre only to break them down in the pursuit of ideas and visions never attained in that form before. Examples include John Ford’s western The Searchers (1956), the comedies of Preston Sturges , Baz Luhrmann ’s musical Moulin Rouge! (2001), Arthur Penn’s gangster film Bonnie and Clyde (1967), Robert Altman’s comedy M*A*S*H (1970), and Quentin Tarantino ’s western The Hateful Eight (2015).",
  "Well-formed genres typically characterize the production of highly centralized studio systems such as those of Hollywood, Japan, or India. They play a lesser role in countries where individual producers dominate. In France, for example, most films are treated as single-effort productions, a practice that can permit far more revolutionary films to develop, as was seen during the French New Wave of the late 1950s and early ’60s. François Truffaut , Jean-Luc Godard , Claude Chabrol , Éric Rohmer , and other New Wave directors utterly overturned standards of storytelling and visualization to the delight of an international audience tired of old formulas. These directors were not oblivious to genres; rather, they played with conventions, mixing comedy and pathos, suspense and spectacle. Their highly personal films confirmed the importance of genre to the fictional mode.",
  " Rancho Notorious Rancho Notorious  Most genres can be defined by their subject matter or setting—e.g., the western, the gangster film, the police thriller, the science-fiction film, or the social problem film. Others are classified according to the type of narrative form they exhibit. The musical, for example, often has a show business setting or theme, but it is not so narrowly restricted; it can be about almost any subject. The melodrama also encompasses many subjects and styles; it has even been combined with other genres—for example, with the western in Rancho Notorious (1952) and with the problem film in Ordinary People (1980).",
  "The evolution of genres can be used to trace the history of Hollywood cinema and American popular culture. Different genres have achieved popular success in different periods. Some, termed “cycles,” are short-lived (e.g., the disaster cycle of the 1970s, which included Earthquake [1974] and The Towering Inferno [1974]), but even lasting genres go through phases of popularity. The western, for example, was well established as a genre by the 1920s. It was particularly strong in the late 1940s and early ’50s but not during the ’30s. It resurged in the 1960s but subsided later in the ’70s. Musicals came into prominence with the introduction of sound. They remained important until the late 1960s, when a number of expensive, overblown productions flooded theatres and met financial failure. Most film historians were ready to proclaim the genre dead, but several astounding successes in the late 1970s and early ’80s caused them to revise their views.",
  " La La Land La La Land  All That Jazz All That Jazz   The internal mutation of a genre reflects the changing tastes and mores of the public. The modern musical ( Cabaret [1972]; All That Jazz [1979]; Fame [1980]; Chicago [2002]; La La Land [2016]) is typically more socially conscious and more serious than the colourful, vividly stylized, self-conscious musicals of the 1940s and ’50s (  Singin’ in the Rain  [1952]; The Band Wagon [1953]), which in turn are derived from, but upend, such early escapist masterpieces as  42nd Street  (1933) and  Top Hat  (1935). Each phase can be seen as a response to the prevailing political, social, and economic conditions of its time.",
  " High Noon High Noon  The western is the genre most scrutinized for this evolution. Its classical phase ( Stagecoach [1939]) mutated after World War II into a variant capable of dealing with social problems ( High Noon [1952]) or with tortured heroes ( Winchester 73 [1950]). In the 1960s the Italian “spaghetti western” announced a decadent phase. The Good, the Bad, and the Ugly (1966) inverted character roles and culminated in a three-man gunfight. The western diminished in popularity during the last decades of the 20th century. However, significant contributions to the genre were made during that time, most notably by actor-director Clint Eastwood ( Outlaw Josey Wales [1976]; Unforgiven [1992]). Audiences applauded both the attenuated spectacle of these films and their ironic perversion of the codes operating in the standard genre. Some scholars, citing the original Star Wars trilogy (1977, 1980, 1983) as an example, have argued that in the 1970s the mutation went so far as to leap across the boundary of subject matter toward science fiction. Although some science-fiction films may share properties with the western, it is unlikely that the production or reception of such films was consciously affected by westerns. Genres with strong, well-defined iconographies rarely consciously influence or combine with one another, even when they are clearly related. When Hollywood remade Kurosawa’s  Seven Samurai  (1954) into the western  The Magnificent Seven  (1960), production personnel and audiences were far more conscious of the new film’s relationship to previous westerns than of its similarities to Japanese samurai pictures.",
  "While genres implicitly rely on an audience’s interest in and familiarity with earlier movies of a certain kind, the serial is a type of movie that explicitly requires an audience to return episode after episode. Also called the chapter-play or cliff-hanger, the serial flourished in the days of silent films, when moviegoing was a weekly habit. Perhaps the most famous were Louis Feuillade ’s Fantômas (1913–14) and Judex (1916) in France and the American series of the same period with Pearl White , such as The Perils of Pauline . Old serials were revived from the 1960s onward as period pieces of popular art, with their improbable plots, exaggerated acting, and old-fashioned decor appealing to modern, sophisticated audiences. The French director Georges Franju made a modern pastiche Judex in 1963. In the late 1970s and ’80s new serials appeared in the form of multiepisode sagas shown on television. Roots (1977) in the United States had its counterpart in Rainer Werner Fassbinder’s 16-hour Berlin Alexanderplatz (1980), which aired in installments on German television and then played as a serial in art houses around the world.",
  "For want of a better term, interpretation may be used to describe the type of motion picture in which a play, a ballet, an opera, or some other work of another art form is kept virtually intact and recorded by the camera and microphone. Adaptations of novels or plays re-create the work in motion-picture form, but interpretations merely give the performance a wider audience. The English director Tony Richardson ’s version of Hamlet (1970) is an example of such a filmed record of a theatrical performance. Most motion pictures of operas and ballets may be classified as interpretations. Public and cable television became sponsors and disseminators of this type of film in the last quarter of the 20th century, although some interpretations, including Joseph Losey ’s Don Giovanni (1979), and numerous films of rock concerts thrived in theatrical distribution.",
  "At one time the recording of an already established work of art was deemed “uncinematic” and thought to be a doubtful use of the medium. Such arguments were made as early as 1911 in response to the French Film d’Art company, which photographed high-class stage plays. During the second half of the 20th century, however, imaginative and innovative cinematic techniques were employed to record operas, ballets, and stage plays. The complexity of the resulting hybrid works, such as Arnold Schoenberg ’s Moses and Aaron as filmed by Jean-Marie Straub and Danièle Huillet (1975), made the validity of the early generalizations questionable. Important filmmakers, including Robert Altman in the United States, Eric Rohmer in France, and Carlos Saura in Spain, turned in the last decades of the 20th century to the filming of works of other art forms as a means to open up the motion picture to new types of experiences.",
  " The Disorderly Orderly The Disorderly Orderly  The motion-picture recording of the acknowledged artistic successes of other media raises the important issue of the artistic stature of the cinema. As early as 1920 an audience of film connoisseurs could be identified in Europe. Ever since that time it has been possible to divide the cinema audience of any nation into a mass audience that seeks entertainment and a smaller group that is consciously concerned with artistic values in the motion picture. The films that appeal to these two groups, however, vary from one nation to another and from one period to another. The Hollywood comedies of the 1920s by Charlie Chaplin , Buster Keaton , and others, for example, were originally popular entertainment, but they were later taken up by the art-film audience. The comedies of Jerry Lewis received little serious critical attention in their native United States but a great deal in France. The low-budget thrillers of directors who were adopted by auteur critics met a similar experience. The distinction between popular entertainment and high art seems indisputable in most instances, but confusions of fashion and conflicts in artistic standards resulting from experiment and change make it difficult to generalize about them.",
  "Although there may be disagreements over what constitutes cinematic art, certain institutions have developed that foster the art of film. In the United States after World War II, “art houses” catered to sophisticated audiences in large cities, screening primarily European films, such as those directed by Fellini, Bergman, Buñuel, and Antonioni. The distribution of 16-mm films to museums and college campuses sparked interest in avant-garde films as well. In one sense, art films represent a genre; the audience that seeks them out has precise expectations that producers have been known to exploit. In 1951 Daiei films of Japan, for example, expressly aimed to conquer the export market by winning awards at international festivals. The company, which generally produced cheap domestic genre motion pictures, reserved a portion of its budget to make lavish historical spectacles, such as Mizoguchi’s Ugetsu (1953), that would appeal to the art audience outside Japan. The art film usually cannot be characterized in advance, however; it does not follow prescribed conventions but prides and sells itself on its uniqueness or distinctiveness.",
  "Within the first two decades of motion pictures, a wide range of discussion about the medium had developed, at many levels of appreciation and analysis—newspaper reviews, professional trade periodicals, books on production technique, fan magazines, and gossip columns, among others. By the World War I era there were even scholarly monographs and the first university courses. In the 1930s archives were founded on the model of, and sometimes associated with, art museums, to collect films for posterity and make important works available for public appreciation. As new media have emerged, sometimes rivaling motion pictures in popularity, they have nevertheless offered additional venues for commentary on many aspects of film.",
  "At the beginning of the 21st century, for example, the Internet provided uncounted thousands of Web sites for information and opinions on motion pictures, stars, directors, the industry, film history, and much more. Both broadcast and cable television channels offered regular programming and frequent specials with news on the lives of actors and the making of new films. Some magazines were devoted entirely to covering the entertainment media, while nearly every popular periodical and newspaper gave coverage to motion-picture personalities, new films, and industry developments. Interest in major Hollywood blockbusters extended to the reporting of how these mega-releases fared each weekend at the box office, with films ranked by income as if they were competing in a sporting event. (Some of this coverage could be explained as a promotional effort by media conglomerates that operate movie studios along with newspapers, television stations, and Internet sites.)",
  "Film studies in universities and colleges greatly expanded beginning in the 1970s, an expansion based in part on a growing recognition that the medium’s artistic achievements were worthy of study and also on the view that its cultural influence in conveying political and social attitudes to wide audiences required analysis and critique. Teaching and scholarship—assisted by the growing availability of older works through archives, television and cable programming, and video and DVD release—explored social issues such as how race, class, and gender were represented in films. Motion-picture genres, directors and stars, industrial practices, and national cinemas became subjects for courses of study and research. University presses annually published dozens of scholarly books on film history, theory, and aesthetics, as well as sponsoring or distributing academic journals.",
  "The permanence of the motion-picture medium—the fact that film can be stored and reproduced indefinitely—makes it not only an enduring theatrical art but also a vivid record of past life. Despite the fact that motion pictures can theoretically last forever, relatively few have been preserved, and many of these are in poor condition. One reason is that inflammable nitrate film stock, which was generally used until the 1940s, when it was replaced by acetate, is chemically unstable. Also, as film runs through a projector, it is eventually worn, scratched, or damaged. Still another factor is that commercial conditions of filmmaking discouraged preservation; the stress was on the present and the future, not on preservation of the past. Early motion pictures were best preserved when filmmakers such as Charlie Chaplin and Walt Disney had control over their own work and a personal interest in preserving and representing it. During the 1960s and ’70s, however, there developed a tremendous interest in old movies. Revival houses sprang up in most major American cities, and distribution companies were established solely for the reissue of old films.",
  "Film preservation that allows access to old motion pictures is costly, requiring careful scientific control of storage conditions. The earliest film archive was the Swedish Film History Collection begun in 1933. Archives in Paris, London, and New York City followed shortly afterward. An international federation (FIAF; Fédération Internationale des Archives du Film), with headquarters in Paris, was founded in 1938.",
  "Archivists of film face many problems: first, selecting the motion pictures to be preserved; second, acquiring copies (a negative or a fine-grain positive if possible) in good condition; third, storing them under the best-possible conditions of temperature and humidity; fourth, cataloging them and keeping some record of their contents; and fifth, allowing them to be viewed or letting stills or extracts be taken without damaging the copies. The ideal solution to the problem of choice would be to preserve everything, but the cost would be prohibitive. Even with a limited selection, acquisition and storage are expensive and difficult, and nitrate film requires regular testing to determine whether it has deteriorated enough to require copying.",
  "The preservation of colour films has presented perhaps the most serious difficulties. While Technicolor films (mostly made before 1953) can be reproduced faithfully and endlessly, virtually all colour films made since 1953 are subject to fading that can be arrested only by storing prints at very low temperatures. Video technology has been used to help preserve some colour motion pictures; computer-driven viewers are able to read the original tints of films and reproduce them on videotape. Nevertheless, until the development of a suitable and inexpensive base onto which colour films can be transferred, the majority of colour motion pictures made after 1953 will continue to deteriorate.",
  "Predating and indispensable to the academic study of motion pictures are the linked phenomena of film societies and film festivals . These social institutions provided readership for film journals and serious film books, which eventually led to the acceptance of film study in universities. The first and most lasting function of film societies has been to foster the appreciation of the art of film. The second function has been to emphasize the social dimension of film in culture, sometimes using the film as a prop for the examination and propagation of moral and political ideas.",
  "These two directions were evident by the 1920s. Louis Delluc and Ricciotto Canudo are credited with forming the first important  ciné-club  (as such societies were called, especially when devoted to film art). The list of adherents to these clubs contains many luminaries from the film world (Epstein, Gance, L’Herbier, Germaine Dulac) and the other arts ( Colette , André Gide ). The Film Society of London, for example, was founded in 1925 by H.G. Wells , George Bernard Shaw , Augustus John , John Maynard Keynes , and others who wanted to see French, German, and Soviet pictures that commercial exhibitors did not handle. The movement spread rapidly, and cinema was included in several international art forums, beginning with the 1925 Paris Exposition des Arts Décoratifs et Industriels Modernes that launched Art Deco . There, for several months, a history of cinema played in the Grand Palais and was accompanied by lectures on technique and appreciation of motion pictures.",
  "Specialized theatres in major cities began to cater to ciné-club audiences. One of Jean Renoir’s first films, La Petite Marchande d’allumettes (1928; The Little Match Girl ), was actually commissioned by a theatre and shot on its premises. Ciné-club s sponsored films made by their own members, too, until the invention of sound made such amateur productions too expensive and technically intricate.",
  "The political power of film societies was first recognized by Léon Moussinac, an official in Delluc’s club who traveled to the Soviet Union in the 1920s and recognized immediately the importance of motion pictures in the education of the masses. Through his writing and organization, he was responsible for thousands of “average citizens” joining film clubs that featured controversial and sometimes revolutionary films. In 1928 Les Amis de Spartacus purportedly enrolled more than 75,000 subscribers. The mayor of Paris found it necessary to prohibit some of their meetings, the most important being a scheduled appearance by Eisenstein, whose Bronenosets Potyomkin (1925; Battleship Potemkin ) was officially banned in some countries.",
  "In the 1930s enthusiasm for film societies waned, perhaps because of the Great Depression, although it was in this decade that the Roman Catholic Church developed networks of societies for the projection and discussion of exemplary films, particularly in parishes in Italy and France. After World War II a resurgence of film societies occurred internationally. The French film theorist André Bazin was associated with both an artistic club headed by Jean Cocteau and a trade union club, indicating that the old split between “film art” and “film and social issues” remained. In the United States, clubs were devoted primarily to film art, fostering the American underground film movement. This postwar flourishing must be credited in part to the marketing of convenient 16-mm equipment.",
  "The importance of such societies inevitably declined after universities and museums regularly began to include motion pictures as part of their collections, and in most countries film societies eventually attached themselves to universities. The videocassette, introduced in the 1980s, and the DVD, introduced in the ’90s, dissolved the strength of the ciné-club model by putting control of the selection and viewing time in the hands of individual viewers.",
  "Film festivals provide a forum for promotion and recognition of artistic achievements of national film industries. The first festival was founded at Venice in 1932. It remained unique until the festival at Cannes, France, was founded in 1939 (or, effectively, 1946, because the festival was interrupted by World War II). At this point film festivals began to assume economic significance. Struggling nations, rebuilding their shattered film industries after World War II, saw in festivals a chance for world recognition. The growing interest everywhere in film imports made the festivals an international marketplace for distributors. Festivals were initiated at Berlin, Moscow, Karlovy Vary (Czechoslovakia), London, Toronto, San Francisco, Chicago, and New York City. Through the early 1960s the American film industry remained wary of festivals; films that won festival awards did not necessarily do well at the box office, though a poor reaction at a festival might reduce the audience for a serious film. After 1965, however, distributor attitudes changed as investments increased in films for specialized audiences, particularly in “foreign” films backed by American companies, and favourable critical acclaim became a vital promotional aid. The Telluride Film Festival (Telluride, Colorado) and the Sundance Film Festival (Park City, Utah) took a pivotal role in the success of independent films since the 1970s. Interest in the festivals persisted, and they continued to increase in number and size. By the early 21st century, more than 700 were scheduled annually across the globe.",
  "Film festivals serve several functions. Most important, they provide an international marketplace where producers and distributors can exchange ideas, view films, and sign contracts. For example, the phenomenon of the international coproduction, so important to European cinema, arose at the Cannes festivals of the late 1940s. Festivals also provide an opportunity for fans to see popular stars and other celebrities. A further function of film festivals has been to provide a cultural rendezvous for those interested in the art and influence of the movies. Festivals often showcase new films or movements, such as when the Venice festivals of the early 1950s introduced the stunning accomplishments of the Japanese film industry, which had been previously unknown in the West. At other times festivals are sites of artistic and political contention. At the Cannes festivals of 1958 and 1959, for example, advocates and opponents of the French New Wave heatedly exchanged diatribes and manifestos. A decade later several key New Wave directors, most notably Truffaut and Godard, helped close the festival during the events of May 1968 to protest government policies. Most festivals are also associated with a competition, although prizes are in many instances bestowed for the publicity they draw rather than to guide producers and distributors in their dealmaking.",
  "The best-known of all film-industry prizes, the Academy Award , is not associated with a festival at all. The American industry, with its overwhelming control of the world’s screens, long had virtually no interest in film awards except for the awards voted each year since 1929 by the Academy of Motion Picture Arts and Sciences . The academy, which represents various artistic and technical disciplines, originally intended its annual awards as modest peer-group citations within the tightly knit Hollywood industry. After media coverage created widespread interest, however, there was an increase in box-office revenues for winning films, and the Academy Awards, or Oscars, became valuable in merchandising.",
  "There are numerous primers to film study, but the best systematic introductions are David Bordwell and Kristin Thompson , Film Art , 2nd ed. (1986); Louis Giannetti , Understanding Movies , 9th ed. (2002); and Bruce F. Kawin , How Movies Work (1987). The essential and classic books concerned with the nature of film include the following: Sergei Eisenstein , The Film Sense (1947), and Film Form (1949), two essays in film theory, translated from Russian and available in various later editions of the author’s theoretical essays; Béla Balázs , Theory of the Film: Character and Growth of a New Art (1952, reprinted 1972; originally published in Hungarian, 1948); Rudolf Arnheim , Film as Art (1957, reprinted 1971; originally published in German, 1932); Siegfried Kracauer , Nature of Film: The Redemption of Physical Reality (1961, reissued as Theory of Film , 1974); André Bazin , What Is Cinema? , 2 vol., trans. from French (1967–71); Hugo Münsterberg , The Photoplay: A Psychological Study (1916; reissued as The Film, a Psychological Study: The Silent Photoplay in 1916 , 1970); Peter Wollen , Signs and Meaning in the Cinema , new ed. (1972); Christian Metz , Film Language: A Semiotics of the Cinema (1974; originally published in French, 1968), and The Imaginary Signifier: Psychoanalysis and the Cinema (1982; originally published in French, 1977); and Nöel Burch , Theory of Film Practice (1973, reissued 1981; originally published in French, 1969). Of these Bazin and Eisenstein have proved to be the most fertile and lasting. An overview of classic theories can be found in J. Dudley Andrew , The Major Film Theories: An Introduction (1976), while his Concepts in Film Theory (1984) presents more-recent theories.",
  "Several anthologies of essays stemming from the academic era of film study put the reader in touch with issues such as semiotics, psychoanalysis, feminism, ideology, and structuralism as they influence the cinema. See Gerald Mast and Marshall Cohen , Film Theory and Criticism: Introductory Readings , 3rd ed. (1985); Bill Nichols (ed.), Movies and Methods: An Anthology , 2 vol. (1976–85); and Philip Rosen (ed.), Narrative, Apparatus, Ideology: Film Theory Reader (1986). Individual theories have been advanced in David Bordwell , Narration in the Fiction Film (1985); Stephen Heath , Questions of Cinema (1981); Bruce F. Kawin , Mindscreen: Bergman, Godard, and First-Person Film (1978); and Teresa de Lauretis , Alice Doesn’t: Feminism, Semiotics, Cinema (1984). The most thorough study of experimental cinema remains P. Adams Sitney , Visionary Film: The American Avant-Garde , 2nd ed. (1979)."
]