[
  " crime , the intentional commission of an act usually deemed socially harmful or dangerous and specifically defined, prohibited, and punishable under criminal law.",
  "Most countries have enacted a criminal code in which all of the criminal law can be found, though English law—the source of many other criminal-law systems—remains uncodified. The definitions of particular crimes contained in a code must be interpreted in the light of many principles, some of which may not actually be expressed in the code itself. For example, many legal systems take into account the mental state of the accused person at the time the alleged crime was committed. Most legal systems also classify crimes for the purpose of assigning cases to different types of court. Social changes often result in the adoption of new criminal laws and the obsolescence of older ones.",
  "This article focuses on the definition and classification of crime, how it is measured and detected, the characteristics of offenders, and the various stages of criminal proceedings. The material draws principally from common, or Anglo-American, law, with supplementary treatment of civil-law and other systems, including Islamic, African, and Chinese law. For full treatment of particular legal aspects of crime, see  criminal law ; civil law ; common law ; court ; police ; and procedural law . Particular legal systems are treated in Roman law ; Germanic law ; Chinese law ; Indian law ; Sharīʿah (Islamic law); and Soviet law . Aspects related to crime are also addressed in criminal justice ; criminology ; juvenile justice ; parole ; prison ; and punishment .",
  "Criminal behaviour is defined by the laws of particular jurisdictions, and there are sometimes vast differences between and even within countries regarding what types of behaviour are prohibited. Conduct that is lawful in one country or jurisdiction may be criminal in another, and activity that amounts to a trivial infraction in one jurisdiction may constitute a serious crime elsewhere. Changing times and social attitudes may lead to changes in criminal law, so that behaviour that was once criminal may become lawful. For example, abortion , once prohibited except in the most unusual circumstances, is now lawful in many countries, as is homosexual behaviour in private between consenting adults in most Western countries, though it remains a serious offense in some parts of the world. Once criminal, suicide and attempted suicide have been removed from the scope of criminal law in some jurisdictions. Indeed, in the U.S. state of Oregon the Death with Dignity Act (passed in 1997) allows terminally ill individuals to end their lives through the use of lethal medications prescribed by a physician. Nonetheless, the general trend has been toward increasing the scope of criminal law rather than decreasing it, and it has been more common to find that statutes create new criminal offenses rather than abolishing existing ones. New technologies have given rise to new opportunities for their abuse, which has led to the creation of new legal restrictions. Just as the invention of the motor vehicle led to the development of a whole body of criminal laws designed to regulate its use, so the widening use of computers and especially the Internet has created the need to legislate against a variety of new abuses and frauds—or old frauds committed in new ways.",
  "In most countries, the criminal law is contained in a single statute, known as the criminal, or penal, code. Although the criminal codes of most English-speaking countries are derived from English criminal law, England itself has never had a criminal code. English criminal law still consists of a collection of statutes of varying age—the oldest still in force being the Treason Act (1351)—and a set of general principles that are chiefly expressed in the decisions of the courts (case law). England’s lack of a criminal code is not the result of a lack of effort; since the early 19th century, there have been several attempts to create such a code. The first effort (1833–53) was made by two panels of criminal-law commissioners, who systematically surveyed the prevailing state of the criminal law. Confronted by a vast number of often overlapping and inconsistent statutes, the commissioners found that determining precisely what the law provided on any particular topic was enormously difficult. Different statutes covering the same conduct, often with widely varying penalties, allowed for wide judicial discretion and inconsistency in punishments. The commissioners drew up a number of draft codes that were presented to Parliament , but none was enacted. Eventually, owing to the judiciary’s resistance, efforts to codify the criminal law were abandoned, and instead there was a consolidation of most of the criminal law in 1861 into a number of statutes—the Larceny Act, the Malicious Damage Act, and the Offences Against the Person Act being among the most important. Because those statutes were consolidations rather than codifications, many of the inconsistencies of the earlier legislation were preserved. The Offences Against the Person Act is still largely in force, though the others have been replaced by more-modern provisions.",
  "Interest in codification was not limited to England. A similar process ensued in India, then under British rule, and a criminal code was written during the 1830s and eventually enacted in 1861. The code remains substantially in force in India, as well as in Pakistan. Certain parts of Africa that were once British colonies also adopted similar codes.",
  "In England, efforts to establish a criminal code resumed in the late 1870s, and in 1879–80 a draft criminal code bill was again presented to Parliament. Largely the work of the celebrated legal author and judge James Fitzjames Stephen , this code received widespread publicity throughout England and its colonial possessions. Although it was not adopted in England, it was subsequently enacted in Canada (1892) and in several Australian states and British colonies. As interest in codification declined in the 20th century, attempts were made to make specific and particular changes in criminal laws. The permanent Criminal Law Revision Committee, established in 1959, eventually made a variety of specific recommendations, including the elimination of the distinction between felonies and misdemeanours. In addition, the Law Commission, also a permanent body, was established in 1965 with the goal of continually reviewing the entire law, not just the criminal law. In 1981 the commission undertook a new attempt at codification of the criminal law, and a draft code was published in 1989. However, it was severely criticized, and the commission dropped the attempt and instead produced a series of more-specific recommendations.",
  "Criminal-law reform was one of the interests of the U.S. states in the period following the American Revolution. In the early 1820s, a comprehensive draft code was prepared for Louisiana, though it was never enacted. Other states also moved to codify their criminal laws. New York enacted a criminal code in 1881, setting an example that was eventually followed by most of the states. Because American criminal law is primarily a matter for the individual states (in contrast to Canada, for example, where the national Parliament enacts the criminal code for the whole country), there has been considerable variation in the content of the code from one state to another. In the mid-20th century, reform efforts in the United States led to the publication of the Model Penal Code (1962), an attempt to rationalize the criminal law by establishing a logical framework for defining offenses and a consistent body of general principles on such matters as criminal intent and the liability of accomplices. The Model Penal Code had a profound influence on the revision of many individual state codes over the following decades; although never enacted completely, it inspired a long period of criminal-code reform.",
  "Whereas the criminal legal systems of most English-speaking countries are based on English common law, those of most European and Latin American countries, as well as many countries in Africa and Asia, are based on civil law. The civil-law tradition originated in the Law of the Twelve Tables (451–450 bc ), a legal code that was posted in the Roman Forum . In civil law the legislature, as the representative of the public, is viewed as the only valid source of law. It attempts to provide a complete, detailed, and written legal code that is understandable to the common citizen and applies in virtually all situations. Therefore, legal codes in civil-law countries tend to be much lengthier than those in common-law countries, if indeed those countries have them at all. The typical pattern in civil law includes a definition of an offense, various relevant legal principles, and a list of specific applications of the law and specific exceptions. Judges are expected to apply the law as it is written and generally are prohibited from engaging in the type of interpretation that regularly occurs in common-law systems. If more than one law applies to a case, or if the circumstances are such that the law’s application is unclear, then judges refer to the legal principles that are contained in the law. Owing to the central role of the legislature in developing the legal code, civil-law systems also generally lack the type of judicial review that in common-law countries results in what is called case law (i.e., law that derives from judicial interpretations of legislative statutes or the constitution).",
  "Countries with majority Muslim populations have adopted diverse legal systems. Those that were once English colonies (e.g., Pakistan, Bangladesh, Jordan, and some of the Persian Gulf states) largely adopted English criminal law and procedure, and those under French colonial influence (e.g., the countries of the Maghrib and North Africa, including Egypt, as well as Syria and Iraq) generally adopted civil-law systems. A third group comprises those states that retained or later adopted Islamic law—called the Sharīʿah —with few or no reforms (e.g., Saudi Arabia and Iran). (The last shāh of Iran had reformed a large amount of the law, building on previous colonial laws, but it was almost totally replaced following the Islamic revolution in that country in 1979.)",
  "Islamic law is a theocratic legal system that is believed to be derived from God (Allah) through the teachings of Muhammad as recorded in the Qurʾān . In fundamentalist Islam, law is also derived from the teachings of Muhammad that are not explicitly in the Qurʾān. Laws do not originate from secular sources, such as kings or legislatures. The Sharīʿah serves as a criminal code that lists several ḥadd crimes, or offenses for which punishments are fixed and unalterable. For example, apostasy requires a death sentence, extramarital sexual relations require death by stoning, and consuming alcoholic beverages requires 80 lashes. Other lesser crimes ( taʿzīr ) allow judges discretion in sentencing offenders.",
  "Criminal offenses in most modern African countries are defined in criminal or penal codes, a radical departure from the uncodified English criminal law on which many of these codes are based. Because of their origins, these codes generally reflect the penal assumptions of the original colonial power. The main concessions to local African values or problems are the inclusion of legislation against various customary practices, notably witchcraft; the extension of the criminal law in states with planned economies to cover economic crimes against the state; and, as a consequence of the soaring rate of some kinds of crime, special provision for certain offenses (e.g., armed robbery). Special tribunals, not subject to the ordinary rules of procedure, have been established in many African countries to deal with such offenses.",
  "Sierra Leone retained a greater role for traditional, or customary, law than most other African countries. A former British territory that obtained independence in 1961, Sierra Leone adopted a “general law” based on English common law and on the statutes of the national legislature. In the mid-1960s those laws were consolidated in a single statute, but most of the population lived in rural areas and largely were governed by what was called “customary law.” Whereas general law now applies to the entire country, customary law, which originated in the customs and cultures of the indigenous peoples, still varies by area or district. Customary law is enforced in separate courts in which the judges are politically appointed tribal elders.",
  "Nigeria established a tripartite system of criminal law and criminal justice. Its criminal code is based on English common law, but there is also a penal code based on the Sharīʿah and a customary law based on local traditions. In Zambia, local criminal courts handle the more-serious criminal cases, while customary courts handle most civil cases and less-serious criminal cases. Customary courts differ widely throughout the country—there are no lawyers and few formal rules of procedure, and the courts’ decisions often conflict with the formal law. In Uganda, in addition to formal criminal courts, customary courts are authorized to hear civil cases and criminal cases involving children, but in rural areas they often hear the entire range of criminal cases, including murder ( homicide ) and rape . In Zimbabwe, the Customary Law and Local Courts Act of 1990 created a single court system that hears both civil law and customary law cases at all levels of the judiciary, including that of the Supreme Court.",
  "For thousands of years, China tended to avoid formal law, instead basing social control on informal customary codes of behaviour, many of which were derived from the teachings of Confucius (551–479 bc ). Those informal codes emphasized mediation and reconciliation of conflicts, which enabled all parties to “save face.” The codes continued to be followed even after the establishment of the communist People’s Republic of China in 1949, in part because Chairman Mao Zedong was suspicious of formal law, which he regarded as a bourgeois institution. That suspicion culminated in the Cultural Revolution (1966–76), during which formal legal institutions largely disintegrated or were destroyed.",
  "The rise to power of Deng Xiaoping following the end of the Cultural Revolution brought the establishment of formal legality as part of a broad reform of Chinese society. In 1979 the National People’s Congress, China’s legislature, adopted the first codes of criminal law and criminal procedure, and the first civil code was adopted in 1986. The criminal code, which was fairly simple and was revised in the 1990s, addressed the entire range of crimes and punishments.",
  "In practice, criminal-justice officials have had considerable discretion in handling cases. Many offenses are handled administratively by the police themselves without any judicial hearings or defense counsel. Punishments for those offenses include warnings, fines, detention for a brief period, and “reeducation through labour” for up to three years. In addition, at least some criminal offenses are handled by mediation and reconciliation programs that are regulated by the state and continue the long tradition of informal and customary social control. Serious offenses are handled by the courts, which were reformed in 1996 to make them more adversarial and to give the defense counsel more independence. Punishments for serious offenses include imprisonment and the death penalty. About 70 different offenses are punishable by death, though the vast majority of death sentences are imposed for common crimes such as murder, rape, robbery, assault ( see  assault and battery ), and theft . Since the 1990s there have been an increasing number of death sentences for drug crimes. There also have been a relatively small number of high-publicity death sentences for white-collar crimes such as embezzlement.",
  "Determining what conduct constitutes a crime usually requires an examination of the terms of the relevant provisions of the criminal code or statutory provisions (a few offenses in English law have not been defined in statute). Despite differences of form and detail, there are several general principles of criminal law that are widely found across criminal-justice systems.",
  "One widely accepted principle of criminal law is the rule against retroactivity, which prohibits the imposition of ex post facto law s (i.e., laws that would allow an individual to be punished for conduct that was not criminal at the time it was carried out). The rule restricts the authority of judges to declare new offenses (though not necessarily to expand the scope of old ones by interpretation).",
  "This principle has not always been accepted in all countries. Norway and Denmark, for example, both passed laws after World War II that retroactively made cooperation with the Nazis a crime. Thousands of people were tried, convicted, and imprisoned under the laws, and about 40 in each country were executed. In the United States, so-called “ Megan’s laws ,” enacted in the 1990s, required convicted sex offenders to register with law enforcement officials in their communities; the officials in turn would notify other community residents of the sex offenders’ presence. In most states, Megan’s laws were applied to offenders who committed their crimes before the laws were passed. For several years courts were divided on whether registration constituted retroactive punishment in violation of the ex post facto clause of the U.S. Constitution. The question was finally decided in 2003 when the U.S. Supreme Court ruled in Smith et al. v. Doe et al. that Alaska’s Megan’s law was nonpunitive and thus constitutional ( see also  sexual-predator law ).",
  "One of the most-important general principles of criminal law is that an individual normally cannot be convicted of a crime without having intended to commit the act in question. With few exceptions, the individual does not need to know that the act itself is a crime, as ignorance of the law is no excuse for criminal behaviour. Thus, if a person believes that an act is perfectly legal and intentionally performs that act, the legal requirement of criminal intention is met.",
  "In most Western countries, legal codes recognize insanity as a condition in which a person lacks criminal intention. There are several versions of the law of insanity, but in the most common version insanity is defined as a mental disease or defect that causes a person either not to know what he is doing or not to know that what he is doing is wrong. A legal finding of insanity results in an acquittal of criminal charges (“not guilty by reason of insanity”), because the person lacks the required intention, though such a verdict is very rare in those countries that recognize this defense. Another very rare condition that wholly exempts individuals from criminal liability is a form of involuntary conduct known as automatism, a state in which the conscious mind does not control bodily movements—such as during sleepwalking—thus rendering an individual unaccountable for even serious consequences.",
  "In contrast, most types of mental disorder (e.g., schizophrenia, mental retardation, or paranoia) do not affect criminal intention, though mental impairment may be considered at the time of sentencing as a mitigating factor that reduces the punishment associated with the crime. For example, the U.S. Supreme Court ruled in 2002, in Atkins v. Virginia , that a sentence of capital punishment for people with mental retardation was unconstitutional; however, such people can be sentenced to life in prison without parole. The practice of not acquitting those with mental impairments but mitigating their punishments is found in many common-law countries, including Canada, England, and Australia.",
  "The principle of criminal intention is subject to many other exceptions and qualifications. For a very few offenses, known as offenses of strict liability, it is abandoned completely or is allowed only a limited scope. For example, employers may be held liable if employees are injured on the job, regardless of how carefully the employers followed safety precautions, and manufacturers may be held liable for injuries that result from product defectiveness, even if they exhibited no fault or negligence in the manufacturing process whatsoever. For a very few other offenses, the individual must have a “specific intent” either to commit a crime (e.g., a common definition of burglary involves breaking and entering a dwelling “with intent to commit a felony therein”) or to achieve the consequences of an act (e.g., first-degree murder usually requires the specific intent to achieve the death of the victim). The fact that an individual had been drinking or using drugs before committing a crime is not in itself a defense, except possibly for crimes that require such specific intent. Provocation is not generally a defense either, except in cases of murder, where evidence of a high degree of provocation (in English law, sufficient to provoke a reasonable person into acting in the same way as the accused) could result in a verdict of manslaughter , even if the killing was intentional. On the other hand, some “felony murder” statutes attribute criminal intention to any deaths that occur during the commission of certain “dangerous felonies.” This is similar to strict liability. For example, in one case in the United States, a person committing a robbery took a hostage, who then was accidentally killed by the police. The robber was convicted of first-degree murder and sentenced to death.",
  "Criminal responsibility applies not only to those who perform criminal acts but also to those who aid and abet a perpetrator by encouraging or in any way knowingly helping in the commission of such an act (e.g., by providing information, implements, or practical help). Those who actually perform the criminal act (e.g., wielding the weapon that strikes the fatal blow) are often called principals in the first degree; those who assist at the time of the commission of the offense (e.g., holding the victim down while the principal in the first degree strikes the blow) are principals in the second degree; and those who assist before the crime takes place (e.g., by lending the weapon or by providing information) are accessories before the fact. Usually, the law considers all equally responsible and liable to the same punishment.",
  "In many cases, though, the accessory before the fact is considered more culpable (e.g., if he has instigated the offense and arranged for it to be committed by an associate), and in some cases the person who actually performs the criminal act is completely innocent of all intent (e.g., a nurse who unknowingly administers to a patient, on a doctor’s instructions, medicine that turns out to be poison). In the latter situation, the person who carries out the act is an innocent agent and not criminally responsible, and the person who caused the innocent agent to act is considered the principal in the first degree.",
  "An accessory after the fact is one who helps a felon to evade arrest or conviction, possibly by hiding him or by destroying evidence. However, some jurisdictions (e.g., England), having enacted specific statutes to prosecute such behaviour, no longer use the expression accessory after the fact .",
  "Most legal systems divide crimes into categories for various purposes connected with the procedures of the courts, such as assigning different kinds of court to different kinds of offense. Common law originally divided crimes into two categories: felonies—the graver crimes, generally punishable by death and the forfeiture of the perpetrator’s land and goods to the crown—and misdemeanours—generally punishable by fines or imprisonment. The procedures of the courts differed significantly according to the kind of crime the defendant was charged with. Other matters that depended on the distinction included the power of the police to arrest an individual on suspicion that he had committed an offense, which was generally permissible in felony cases but not in misdemeanour ones. ( See  felony and misdemeanour .)",
  "By the early 19th century, it had become clear that the growth of the law had rendered this distinction obsolete, and in many cases it was inconsistent with the gravity of the offenses concerned. For example, whereas theft was always considered a felony, irrespective of the amount stolen, obtaining by fraud was always a misdemeanour. Efforts to abolish the distinction in English law did not succeed until the late 1960s, when it was replaced by the distinction between arrestable offenses and other offenses. An arrestable offense was one punishable with five years’ imprisonment or more, though offenders could be arrested for other crimes subject to certain conditions. Subsequently, further classifications were devised. For example, a subcategory of “serious” arrestable offenses was created, and, in order to determine more easily the court in which a case should be tried, a different classification of offenses into the categories of “indictable,” “either way,” and “summary” was adopted. Nonetheless, the traditional division between felony and misdemeanour has been retained in many U.S. jurisdictions, though there has been a rationalization of the allocation of offenses to one category or the other, and it has been used as the basis for determining the court that will hear the case. In some jurisdictions, minor offenses were classified under a new category called “violations,” which corresponded broadly to the English category of summary offenses.",
  "In systems utilizing civil law, the criminal code generally distinguished between three categories:  crime , délit , and contravention  . Under this classification, a crime represented the most serious offense and thus was subject to the most-severe penalty permissible. Délits were subject to only minor prison sentences, and contraventions were minor offenses. Beginning in the 19th century, some civil-law countries (e.g., Sweden, the Netherlands, Brazil, Portugal, and Colombia) consolidated their codes; délits were reclassified under the broader category of crimes , and contraventions came to denote criminal offenses committed without intent.",
  "All types of criminal codes account for a variety of crimes, including those generally committed by individuals or unorganized groups, as well as other modes of criminal activity. For discussions of particular crimes and types of criminal activity, see  arson ; assault and battery ; bribery ; burglary ; child abuse ; counterfeiting ; cybercrime ; drug use ; embezzlement ; extortion ; forgery ; fraud ; hijacking ; homicide ; incest ; kidnapping ; larceny ; organized crime ; perjury ; piracy ; prostitution ; rape ; robbery ; sedition ; smuggling ; terrorism ; theft ; treason ; usury ; and white-collar crime .",
  "Estimating the amount of crime actually committed is quite complicated. Figures for recorded crime do not generally provide an accurate picture, because they are influenced by variable factors, such as the willingness of victims to report crimes. In fact, it is widely believed that official crime statistics represent only a small fraction of crimes committed.",
  "The public’s view of crime is derived largely from the news media, and because the media usually focus on serious or sensational crimes, the public’s perception is often seriously distorted. A more accurate view is generally provided by detailed statistics of crime that are compiled and published by government departments; for example, the Federal Bureau of Investigation (FBI) publishes U.S. crime statistics annually in what is called the Uniform Crime Reports . In the late 1990s, the United Nations (UN) began publishing the Global Report on Crime and Justice , which includes official data from about 90 nations—mostly the more-developed nations, as those are primarily the ones that collect such statistics.",
  "Policy makers often use official crime statistics as the basis for new crime-control measures; for instance, statistics may show an increase in the incidence of a particular type of crime over a period of years and thus suggest that some change in the methods of dealing with that type of crime is necessary. However, official crime statistics are subject to error and may be misleading, particularly if they are used without an understanding of the processes by which they are compiled and the limitations to which they are necessarily subject. The statistics are usually collected on the basis of reports from police forces and other law enforcement agencies and are generally known as statistics of reported crime, or crimes known to the police. Because only incidents observed by the police or reported to them by victims or witnesses are included in the reports, the picture of the amount of crime actually committed may be inaccurate.",
  "One factor accounting for that distortion is the extent to which police resources are directed toward the investigation of one kind of crime rather than another, particularly with regard to what are known as “victimless crimes,” such as the possession of drugs. These crimes are not discovered unless the police endeavour to look for them, and they do not figure in the statistics of reported crime unless the police take the initiative. Thus, a sudden increase in the reported incidence of a crime from one year to the next may indeed reflect an overall increase in such activity, but it may instead merely show that the police have taken more interest in that crime and have devoted more resources to its investigation. Ironically, efforts to discourage or eliminate a particular kind of crime through more-vigorous law enforcement may create the impression that the crime concerned has increased, because more instances are likely to be detected and thus enter the statistics.",
  "A second factor that can have a striking effect on the apparent statistical incidence of a particular kind of crime is a change in the willingness of victims of the crime to report it to the police. Victims often fail to report a crime for a variety of reasons: they may not realize that a crime has been committed against them (e.g., children who have been sexually molested); they may believe that the police will not be able to apprehend the offender; they may fear serving as a witness; or they may be embarrassed by the conduct that led them to become the victim of the crime (e.g., an individual robbed by a prostitute). Some crimes also may not appear sufficiently serious to make it worthwhile to inform the police, or there may be ways in which the matter can be resolved without involving them (e.g., an act of violence by one schoolchild against another may be dealt with by the school authorities). All those factors are difficult to measure with any degree of accuracy, and there is no reason to suppose that they remain constant over time or by jurisdiction. Thus, a change in any one of the factors may produce the appearance of an increase or a decrease in a particular kind of crime when there has been no such change or when the real change has been on a much-smaller scale than the statistics suggest.",
  "A third factor that may affect the portrait painted by official crime statistics is the way in which the police treat particular incidents. Many of the laws defining crimes are imprecise or ambiguous, such as those related to reckless driving, obscenity , and gross negligence . Some conduct that is treated as criminal or is more aggressively pursued in one police jurisdiction may not be treated similarly in another jurisdiction owing to differences in priorities or interpretations of the law. The recording process used by the police also influences crime statistics; for example, the theft of a number of items may be recorded as a single theft or as a series of thefts of the individual items.",
  "Researchers in the field of criminology have endeavoured to obtain a more-accurate picture of the incidence of crimes and the trends and variations from one period and jurisdiction to another. One research method that has been particularly useful is the victim survey, in which the researcher identifies a representative sample of the population and asks individuals to disclose any crime of which they have been victims during a specified period of time. After a large number of people have been questioned, the information obtained from the survey can be compared with the statistics for reported crime for the same period and locality; the comparison can indicate the relationship between the actual incidence of the type of crime in question and the number of cases reported to the police. Although criminologists have developed sophisticated procedures for interviewing victim populations, such projects are subject to several limitations. Results depend entirely on the recollection of incidents by victims, their ability to recognize that a crime has been committed, and their willingness to disclose it. In addition, this method is obviously inapplicable to victimless crimes.",
  "The U.S. Census Bureau began conducting an annual survey of crime victims in 1972. By the beginning of the 21st century, the survey included a random sample of about 60,000 households, in which approximately 100,000 residents aged 12 and over were interviewed twice a year and asked whether they had been the victims of any of a wide variety of offenses in the last six months. The results of the household survey have been at variance with the reports published by the FBI. The most-common explanation for the differences in the trends reported is that the victim survey data reflect the actual trends in the incidence of criminal behaviour and that the data in the FBI’s Uniform Crime Reports primarily reflect increases in the reporting of crimes to the police by victims. Using both types of data, it can be estimated that about half of all violent victimizations and less than half of all property victimizations generally are reported to the police. Many other countries—including Britain, France, Germany, Sweden, Canada, Israel, and New Zealand—also have adopted victim surveys. Since the late 1980s, the UN has sponsored an international crime victim survey as well, with interviews taken in more than 50 countries. Like the UN’s official statistics, for various practical reasons this survey has tended to focus on more-developed nations. In less-developed nations, the survey has focused on more-developed urban areas.",
  "An alternative method of collecting crime statistics that some criminologists favour is the self-report study, in which a representative sample of individuals is asked, under assurances of confidentiality, whether they have committed any offenses of a particular kind. This type of research is subject to some of the same difficulties as the victim survey—the researcher has no means of verifying the information, and the subjects can easily conceal the fact that they have committed an offense at some time. However, such surveys often have confirmed that large numbers of offenses have been committed without being reported and that crime is much more widespread than official statistics suggest.",
  "Knowledge of the types of people who commit crimes is subject to one overriding limitation: it is generally based on studies of those who have been arrested, prosecuted, and convicted, and those populations—which represent only unsuccessful criminals—are not necessarily typical of the whole range of criminals. Despite that limitation, some basic facts emerge that give a reasonably accurate portrayal of those who commit crimes.",
  "Crime is predominantly a male activity. In all criminal populations, whether of offenders passing through the courts or of those sentenced to institutions, men outnumber women by a high proportion, especially in more-serious offenses. For example, at the beginning of the 21st century, in the United States, men accounted for approximately four-fifths of all arrests and nine-tenths of arrests for homicide, and in Britain women constituted only 5 percent of the total prison population. Nevertheless, in most Western societies the incidence of recorded crime by women and the number of women in the criminal-justice system have increased. For instance, from the mid- to late 1990s in the United States, arrests of males for violent offenses declined by more than one-tenth, but corresponding figures for women increased by the same amount. To some analysts, those statistics indicated increasing criminal activity by women and suggested that the changing social role of women had led to greater opportunity and temptation to commit crime. However, other observers argued that the apparent increase in female criminality merely reflected a change in the operation of the criminal-justice system, which routinely had ignored crimes committed by women. Although arrest data suggested that female criminality had increased faster than male criminality, the national crime victim survey showed that violent offending in the United States by both males and females had fallen in the same years. At the beginning of the 21st century, the rate of murders committed by women was about two-fifths below its peak in 1980.",
  "Crime also is predominantly a youthful activity. Although statistics vary between countries, involvement in minor property crime generally peaks between ages 15 and 21. Participation in more-serious crimes peaks at a later age—from the late teenage years through the 20s—and criminality tends to decline steadily after the age of 30. The evidence as to whether this pattern, widely found across time and place, is a natural effect of aging, the consequence of taking on family responsibilities, or the effect of experiencing penal measures imposed by the law for successive convictions is inconclusive. Not all types of crime are subject to decline with aging, however. Fraud, certain kinds of theft, and crimes requiring a high degree of sophistication are more likely to be committed by older men, and sudden crimes of violence, committed for emotional reasons, may occur at any age.",
  "The relationship between social class or economic status and crime has been studied extensively. Research carried out in the United States in the 1920s and ’30s claimed to show that a higher incidence of criminality was concentrated in deprived and deteriorating neighbourhoods of large cities, and studies of penal populations revealed that levels of educational and occupational attainment were generally lower than in the wider population. Early studies of juvenile delinquents also showed a high proportion of lower-class offenders. However, later research called into question the assumption that criminality was closely associated with social origin, particularly because such studies often overlooked white-collar crime and other criminal acts committed by people of higher socioeconomic status. Self-report studies have suggested that offenses are more widespread across the social spectrum than the figures based on identified criminals would suggest.",
  "The relationship between racial or ethnic background and criminality has evoked considerable controversy. Most penal populations do contain a disproportionately high number of persons from some minority racial groups relative to their numbers in the general population. However, some criminologists have pointed out that this may be the result of the high incidence among minority racial groups of characteristics that are commonly associated with identified criminality (e.g., unemployment and low economic status) and the fact that in many cities racial minority groups inhabit areas that have traditionally had high crime rates, perhaps as a result of their shifting populations and general lack of social cohesion. Other explanations have focused on the enforcement practices of the police, which may be influenced by racial discrimination.",
  "Knowledge of the types of people who are victims of crime requires that they report their crimes, either to the police or to researchers who ask them about their experiences as a victim. Some crimes are greatly underreported in official statistics—rape is an example—but may be more accurately reported in victim surveys. Yet just as those who are caught or admit to committing crimes do not necessarily represent all criminals, those who report being victims of crime are not necessarily typical of the whole range of victims. Nevertheless, some basic facts gathered from official reports and victim surveys give a reasonably accurate portrayal of crime victims. Probably the most important basic fact is that patterns of offending and patterns of victimization are quite similar. That is, the groups that are most likely to be crime victims are the same groups that are most likely to commit crimes. In particular, crime victims are more likely to be male, young, part of a lower socioeconomic class, and members of ethnic or racial minority groups. ( See  victimology .)",
  "As discussed above in the section Characteristics of offenders , because criminals who are caught are not necessarily representative of all those who commit crime, reaching robust explanations of the causes of crime is difficult. Nevertheless, criminologists have developed several theories of the phenomenon. Although some criminologists claim that a single theory can provide a universal explanation of criminality, more commonly it is believed that many different theories help to explain particular aspects of criminality and that different types of explanation contribute to the understanding of the problem of crime. A brief discussion of criminological theories follows. For a more detailed analysis, see  criminology .",
  "Throughout the 19th and 20th centuries, there was great interest in biological theories of criminal activity. These theories, which took into account the biological characteristics of offenders (e.g., their skulls, facial features, body type, and chromosomal composition), held sway for a time, but support for them has waned. In the late 20th century, criminologists attempted to link a variety of hereditary and biochemical factors with criminal activity. For example, adoptees were found to be more likely to engage in criminal behaviour if a biological parent was criminal but their adoptive parent was not; other research suggested that hormonal and certain neurotransmitter imbalances were associated with increased criminality.",
  "In psychology , explanations of delinquent and criminal behaviour are sought in the individual’s personality. In particular, psychologists examine the processes by which behaviour and restraints on behaviour are learned. This process often is conceptualized as the result of the interaction of biological predispositions and social experiences. Psychological explanations of crime originated in the 19th century and were linked in part to the work of Austrian neurologist Sigmund Freud (1856–1939). Social learning theory gained many adherents in the 20th century, and there was also a considerable body of research that examined the relationship between mental disorders and criminality.",
  "In sociology a variety of theories have been proposed to explain criminal behaviour as a normal adaptation to the offender’s social environment. Such theories—including the anomie theory of American sociologist Robert K. Merton (1910–2003), which suggests that criminality results from an offender’s inability to attain his goals by socially acceptable means—gained widespread support and were staples of sociological courses on crime and delinquency.",
  "All the preceding theories are primarily Western in origin. Since about 1980, however, such explanations have been adopted in a growing number of non-Western and developing countries, partly by educational and cultural transmission and partly through technical assistance provided by Western countries. There are only a few alternative explanations of crime. In China, for example, the official view is that the causes of crime lie in the class structure of society. Chinese criminologists have maintained that crime is a result of exploitation, which is based on the capitalist institution of private property; they have argued that the lack of private property under pure socialism would result in the absence of crime. Thus, because China for decades prohibited any form of capitalism, it blamed criminal activity on remnants of precommunist society and a lingering bourgeois mentality among some individuals. With economic reform and the introduction of a limited capitalist economy beginning in the 1970s, crime increased, even within the families of Communist Party officials, and the government attempted to curb that trend by imposing stiff penalties on offenders.",
  "In most countries the detection of crime is the responsibility of the police , though special law enforcement agencies may be responsible for the discovery of particular types of crime (e.g., customs departments may be charged with combating smuggling and related offenses). Crime detection falls into three distinguishable phases: the discovery that a crime has been committed, the identification of a suspect, and the collection of sufficient evidence to indict the suspect before a court. Many crimes are discovered and reported by persons other than the police (e.g., victims or witnesses). Certain crimes—in particular those that involve a subject’s assent, such as dealing in illicit drugs or prostitution , or those in which there may be no identifiable victim, such as obscenity —are often not discovered unless the police take active steps to determine whether they have been committed. To detect such crimes, therefore, controversial methods are sometimes required (e.g., electronic eavesdropping , surveillance, interception of communications, and infiltration of gangs ).",
  "  Forensic science plays an important role in the investigation of serious crimes. One of the first significant achievements in the field was the development of techniques for identifying individuals by their fingerprints . In the 19th century, it was discovered that almost any contact between a finger and a fixed surface left a latent mark that could be made visible by a variety of procedures (e.g., the use of a fine powder). In 1894 in England the Troup Committee, a group established by the Home Secretary to determine the best means of personal identification, accepted that no two individuals had the same fingerprints—a proposition that has never been seriously refuted. In 1900 another committee recommended the use of fingerprints for criminal identification. Fingerprint evidence was first accepted in an Argentine court in the 1890s and in an English court in 1902. Many other countries soon adopted systems of fingerprint identification as well.",
  "  Fingerprinting was originally used to establish and to make readily available the criminal records of individual offenders, but it quickly came to be widely used as a means of identifying the perpetrators of particular criminal acts. Most major police forces maintain collections of fingerprints that are taken from known criminals in order to identify them later should they commit other crimes. The FBI, for example, reportedly held millions of prints in its electronic database at the beginning of the 21st century. Fingerprints found at crime scenes thus can be matched with fingerprints in such collections.",
  "Historically, searching fingerprint collections was a time-consuming manual task, relying on various systems of classification. The development in the 1980s of computerized databases for the electronic storage and rapid searching of fingerprint collections has enabled researchers to match prints much more quickly.",
  "Although the science of fingerprinting is popularly perceived as error-free, some critics have charged that it is not an exact science—in part because prints are rarely pristine when gathered at a crime scene—and that some defendants have been convicted on the basis of mistaken fingerprint identification. For example, in 2004 the FBI used a fingerprint to link Brandon Mayfield, an American attorney, to a train bombing in Madrid; however, he was vindicated after a review revealed that the fingerprint, used to obtain a warrant for his arrest, did not belong to him. According to the British standard, if a set of fingerprints found at a crime scene is incomplete, it may be said to match another set (e.g., a set stored in a fingerprint database) if the two sets share at least 16 characteristics. However, no particular number of characteristics is accepted everywhere, and some jurisdictions require as few as 12 characteristics to reach a conclusive identification.",
  "A broad range of other scientific techniques are available to law enforcement agencies attempting to identify suspects or establish beyond doubt the connection between a suspect and a crime. Since becoming reliably available in the late 1980s, DNA fingerprinting of biological evidence (e.g., hair, sperm, and blood) can exclude a suspect absolutely or establish guilt with a very high degree of probability. Many other substances, such as fibres, paper, glass, and paint, can yield considerable information under microscopic or chemical analysis. Fibres discovered on the victim or at the scene of the crime can be tested to determine whether they are similar to those in the clothing of the suspect. Documents can be revealed as forgeries on the evidence that the paper on which they were written was manufactured by a technique not available at the time to which it allegedly dates. The refractive index of even small particles of glass may be measured to show that a given item or fragment of glass was part of a particular batch manufactured at a particular time and place. Computer networks allow investigators to search increasingly large bodies of data on material samples, though the creation of such databases is time-consuming and costly.",
  "The modus operandi , or method, used by a criminal to commit an offense sometimes helps to identify the suspect, as many offenders repeatedly commit offenses in similar ways. A burglar’s method of entry into a house, the type of property stolen, or the kind of deception practiced on the victim of a fraud all may suggest who was responsible for a crime.",
  "Visual identification of a stranger by the victim is often possible as well. The police generally present victims or witnesses who believe that they can recognize the offender with an album containing photographs of a large number of known criminals. A suspect identified in this manner is usually asked to take part in a lineup of people with similar characteristics, from which the witness is asked to pick out the suspect. However, researchers have long known that eyewitnesses often are unreliable and that most wrongful convictions have been the result of erroneous eyewitness identifications. Scholars have suggested that cross-racial identification contributes to mistaken identification, in that members of one race may have difficulty distinguishing members of another race. Likewise, post-event assimilation, the process by which witnesses incorporate new information after the incident, can significantly alter the perception of the criminal. Finally, the stress of a crime in general, and the presence of a weapon in particular, diminish the reliability of eyewitnesses as well.",
  "In addition, such researchers have been concerned that criminal-justice officials could manipulate standard eyewitness identification procedures in order to increase the likelihood that a witness would identify a particular suspect. In the past, criminal-justice officials generally resisted implementing reforms in procedures that would increase the accuracy of the identifications, as the reformed procedures would reduce the probability that an eyewitness would make any identification at all. But the increasing accuracy of DNA evidence in the late 1990s led to considerable publicity about erroneous convictions based on standard eyewitness identification procedures, particularly in cases that resulted in a death sentence. At the beginning of the 21st century, police agencies had begun to implement the more-careful procedures that eyewitness researchers had proposed. These procedures include not encouraging witnesses to make identifications when they are unsure but instead cautioning them about the possibility of errors, making sure nonsuspects in the lineup are reasonable possibilities for identification, and having the lineup conducted by an official who does not know who the actual suspect is.",
  "To gain a conviction in countries where the rule of law is firmly rooted, it is essential that the investigating agency gather sufficient legally admissible evidence to convince the judge or jury that the suspect is guilty. Police departments are often reasonably certain that a particular individual is responsible for a crime but may remain unable to establish guilt by legally admissible evidence. In order to secure the necessary evidence, the police employ a variety of powers and procedures. Because those powers and procedures, if exercised improperly, would enable the police to interfere with the constitutionally protected freedoms of the suspect, they are normally subject to close scrutiny by legislation or by the courts.",
  "  One important procedure is the search of a suspect’s person or property. Most common-law jurisdictions allow a search to be carried out only if there is “probable cause for believing” or “reasonable ground for suspecting” that evidence will be found. In some cases a person may be stopped on the street and searched, provided that the police officers identify themselves and state the reasons for the search. In the United States a person stopped on the street may be patted down for a weapon without the police’s having any evidence whatsoever. A search of private premises usually requires a search warrant issued by a magistrate or judge. The law generally permits a search warrant to be issued only if the authorities are satisfied (after hearing evidence under oath) that there is good reason to suspect that the sought-after evidence, which the warrant usually defines specifically, will be found on the premises. The warrant may be subject to time limits and normally permits only one search. In most countries the judge or magistrate who issues the warrant must be informed of the outcome of the search. Materials seized as a result of a search under the authority of a search warrant are usually held by the police for production as exhibits at any subsequent trial.",
  "In the United States any evidence discovered as a result of a search that does not comply with the procedures and standards laid down by the courts and legislative bodies is not admissible in court, even if it may clearly establish the guilt of the accused person. Because it may prevent the conviction of a person who is guilty, this doctrine, known as the exclusionary rule , has given rise to controversy in the United States and has not generally been adopted in other countries. The exclusionary rule has been particularly important in drug cases, where the materials seized (i.e., the drugs themselves) often are the only evidence against the defendant; according to the U.S. Department of Justice, adherence to the rule has resulted in the dismissal of about 1 percent of drug cases. However, since its decision in United States v. Leon (1984), the U.S. Supreme Court has adopted several “pro-prosecution” modifications of the exclusionary rule, including a somewhat limited “good faith” exception for the police. That is, if the police attempted to uphold constitutional requirements for the search but made an honest mistake, then the evidence may be admissible at trial even if some constitutional requirements were not met.",
  "An important aspect in the investigation of offenses is the interrogation of suspects. The aim of the questioning is usually to obtain an admission of guilt by the suspect, which would eliminate the need for a contested trial. Most countries place restrictions on the scope and methods of interrogation in order to ensure that suspects are not coerced into confessions by unacceptable means, though in practice the effectiveness of those restrictions varies greatly. In the United States, for example, suspects must be informed that they have certain rights, including the right to remain silent, to have a lawyer present during the interrogation, and to be provided with the services of a lawyer at the expense of the state if they cannot afford one. The statement of rights that is read to suspects, known as the Miranda warnings, was established in the case of  Miranda v. Arizona  (1966). Failure to advise a suspect of those and other rights can result in the rejection of a confession as evidence.",
  "In contrast, British law focuses on whether the confession itself was voluntary, rather than on whether proper procedures were followed by the police. With minor exceptions, a person suspected or accused of a criminal offense is not required to answer any question or to give evidence. For many years the English law on confessions consisted of a simple rule prohibiting the introduction at trial of any involuntary statement made by an accused person. That rule was supplemented by more-detailed rules governing the questioning of suspected persons by the police, known as the Judges’ Rules. Principally, the Judges’ Rules obliged the investigating police officer to caution suspects that they were not required to answer any question and that anything they did say might be given in evidence at trial. That caution was required to be stated at the beginning of any period of interrogation and immediately before a suspect began to make a full statement or confession. Failure to provide a caution at the right time or in the right form did not necessarily mean that the statement would be excluded from evidence, but trial judges did have the discretion to exclude the evidence. The operation of the Judges’ Rules was a source of controversy for many years; in the mid-1980s they were reformed by a comprehensive series of provisions. The reforms, which were supplemented by detailed codes of practice, allowed a confession to be admitted into evidence provided that it was not obtained by oppression of the person who made it (e.g., by torture , inhuman or degrading treatment, the use or threat of violence, or excessively prolonged periods of questioning) or as a result of anything said or done that would be likely to render the confession unreliable.",
  "Other countries generally have similar legal requirements, though the actual practices in those countries may be quite different. Russia, for example, has a rule on confessions that is quite similar to the Miranda warnings, while in China a suspect has the legal right to remain silent, there is no legal penalty for the refusal to answer questions, and police are forbidden to obtain confessions through the use of force. However, in practice, police in some countries sometimes use physical force to obtain confessions, and such illegally obtained evidence is not excluded at trial.",
  "For full treatment of trial procedures prior to sentencing, see  criminal law and procedural law .",
  "  This section provides a summary of the court systems of various countries. The criminal procedures of a court system reflect the history and culture of the country in which they developed. There are many variations between different countries—and even between different jurisdictions within the same country—regarding the way in which criminal cases are brought to trial. For more details, see  court and procedural law: Criminal procedure .",
  "In countries where the legal system follows the English common-law tradition, the function of prosecution is usually distinguished from that of investigation and adjudication. In most countries the prosecution is performed by an official who is not part of either the police or the judicial system; a wide variety of terms have been used to designate this official (e.g., district attorney in the state jurisdictions of the United States, procurator-fiscal in Scotland, and crown attorney in Canada). The prosecutor may be an elected local official (as in many jurisdictions in the United States) or a member of an organization responsible to a minister of the national government.",
  "Generally, the prosecutor first assesses the information collected by the investigators to determine whether sufficient evidence exists to justify criminal proceedings. In common-law systems the prosecutor usually is entrusted with extensive discretion in deciding whether to institute criminal proceedings. That discretion arises in part out of the ambiguity of the criminal law; frequently a statute defining a particular criminal offense does not make absolutely clear what kind of behaviour it is intended to cover or includes a much wider range of circumstances than it was intended to prohibit. In such cases, the prosecutor must decide whether the case falls within the intended scope of the law. Changing societal attitudes toward particular kinds of behaviour may mean that, although a criminal prohibition remains on the statute books, it no longer reflects the sentiment of the community, and the prosecutor is no longer expected to bring charges against people who violate it. In other cases, laws may be enacted without the usual exemptions from responsibility for those who commit the act unintentionally (offenses of strict liability). In such cases, the prosecutor may nevertheless feel justified in not bringing proceedings against those who are technically guilty but appear morally innocent.",
  "Although common-law countries have adopted different arrangements for the conduct and procedure of criminal trials, most of these countries generally follow what is called an adversary procedure , in which allegations are made by the prosecution, resisted by the defendant, and determined by an impartial trier of fact—judge or jury—who is usually required to acquit the defendant if there is any reasonable doubt regarding guilt. English criminal procedure, employing the adversarial method, is the model from which the court systems of many common-law countries developed (although distinctively different rules evolved independently in Scotland). Over the years the differences between the English criminal courts and those of other common-law countries widened in some aspects, but the same basic principles often still apply in the latter countries. The court systems of most common-law countries provide two or more sets of criminal procedures to deal with the more-serious and less-serious cases and a further set of procedures for hearing appeals against the decisions of trial courts.",
  "Criminal cases brought to trial in England begin in a magistrates’ court . This court has a number of different functions, including determining the mode of trial, trying the case if summary trial is chosen, and dealing with ancillary matters, such as bail and the granting of legal aid . Long ago, magistrates had the power to investigate crimes, but their function is now wholly concerned with the adjudicatory phase. Most magistrates are laypeople chosen for their experience and knowledge of society and are appointed by the central government on the advice of a committee, known as the Lord Lieutenant’s Advisory Committee, for the particular county in which they are to sit. Magistrates, who are attended by a legally qualified clerk, develop significant experience in their work, but they are not considered professionals. In large cities there are professional, legally qualified magistrates, known as stipendiary magistrates. The stipendiary magistrate can sit alone, but lay magistrates may sit only as a bench of two or more. Magistrates’ courts commit the trials of more serious crimes—such as murder, rape, and robbery—to the Crown Court system. These courts consist of a judge and 12 jury members selected from the general public. Appeals of the decisions of magistrates’ courts also are heard by a Crown Court.",
  "Trial procedure in U.S. states has followed a pattern derived from English traditions and principles with many variations. Prosecutors (district attorneys), serving as the key courtroom figure, establish the charges, which in turn may determine whether the accused appears before a lower court (dealing with misdemeanours) or a higher court (dealing with felonies). The accused is offered bail in most cases but is not released unless he deposits with the court either cash or security in the form of a bond, often posted by a bondsman who charges a proportion of the amount of the bond. In some states it has been common for an accused person to be released without bond on his own recognizance . The grand jury , which examines the evidence produced by the prosecutor and, if warranted, returns an indictment against the accused, plays a key role in the U.S. legal system. The deliberations and proceedings before the grand jury are normally conducted in private. When the case is brought before the trial court, it is often settled on the basis of a plea bargain made between the prosecutor and the defense lawyer, by which the accused pleads guilty to some of the charges and the prosecutor recommends a sentence that has been agreed upon beforehand. Plea bargaining, which can take many other forms, is more readily accepted in the United States than in most common-law countries; basic rules, designed to ensure fair dealing for the accused, govern plea arrangements. In jury trials, one significant difference between the American and English systems is that lawyers in the United States are allowed to question potential jurors about their beliefs and attitudes so as to exclude those who may be biased against their clients.",
  "In countries following the Anglo-American legal tradition, sentencing is a function separate from the determination of guilt or innocence. In some U.S. jurisdictions, juries determine the sentence; in capital cases, the U.S. Supreme Court ruled in 2002 that only juries could determine whether a convicted defendant should be executed. Normally, however, sentencing is the responsibility of the judge. Most systems traditionally have given judges considerable discretion in determining both the kind of penalty to be imposed (e.g., imprisonment, fine, or probation) and its severity. Such discretion has prompted complaints about disparities in the sentences given to different offenders and arbitrariness and idiosyncrasy in the decisions of individual judges. Many observers have maintained that the sentence imposed on an offender depends more on the presiding judge than on the gravity of the offense or on the existence of mitigating circumstances.",
  "In response to such concerns, the federal system and a number of state systems in the United States have instituted sentencing guidelines, which prescribe narrow ranges of sentences and require judges to provide a written rationale for issuing a sentence that falls outside the guidelines’ prescriptions. States began enacting sentencing guidelines in the early 1980s, while sentencing guidelines for the federal system went into effect in 1987. The guidelines generally are presented in tables, where relatively narrow sentence ranges are specified according to the seriousness of the present offense and the length of the defendant’s prior record. However, in United States v. Booker (2005), the U.S. Supreme Court found that judges could not use facts that had not been proved during the trial in order to enhance a sentence. In practice, this means that the guidelines are considered discretionary rather than mandatory—i.e., judges use them as a starting point when determining a sentence.",
  "Many jurisdictions also have implemented mandatory sentences, which remove any judicial discretion. One popular type of mandatory sentence is described by the phrase “three strikes and you’re out”; i.e., a defendant receives an extended or even a life sentence upon conviction for a third felony. All mandatory sentences, and particularly the “three strikes” laws, have been criticized as being excessively harsh in particular cases, such as sentences of 25 years to life in prison for crimes of petty theft. Nevertheless, in 2003 the U.S. Supreme Court upheld the constitutionality of such sentences in two separate cases.",
  "As most countries of continental Europe base their legal systems on civil law, they follow methods of criminal procedure very different from those found in common-law countries. Often described as the inquisitorial procedure , this method emphasizes the role of the judge. Many countries in Europe (as well as civil-law countries in Latin America) also maintain the principle of full, or mandatory, prosecution, which officially means that prosecutors have no discretion at all. In theory at least, prosecutors must prosecute any and all crimes that come to their attention, according to the letter of the law and without regard for public sentiment. (However, even in those countries, prosecutors necessarily exercise at least some discretion.) The judge is normally responsible for calling and questioning all witnesses, and the process is not separated into two distinct phases of trial and sentencing. The tribunal may consist of several judges, or a combination of judges and lay assessors, who deliberate together on both conviction and sentence. The rules of evidence are generally less restrictive; materials that would be considered hearsay in common-law countries are often admitted, and information about the accused person’s prior record is available to the tribunal. In addition, most countries utilizing civil law do not permit conviction on the basis of a plea of guilty. Although the accused may be willing to admit guilt, the court is still required to investigate the evidence fully. Another major difference between civil- and common-law procedure is that the decision of the tribunal in civil-law countries is normally accompanied by a statement of reasons—unlike common-law verdicts, which usually simply announce the guilt or acquittal of a defendant. Regarding sentencing, the law in civil-law countries identifies penalties with considerable detail and considerable specificity for the entire range of criminal offenses, so judges have very little discretion.",
  "A civil-law institution without parallel in common law is France’s unified magistracy, whose members include judges and prosecuting attorneys. Both the prosecuting attorneys and the judges work for the national justice ministry, whose central administration is also a part of the unified magistracy. Prosecuting attorneys receive the same training as judges, and their primary responsibility is to seek justice rather than solely a conviction.",
  "In Russia in 1722, Tsar Peter I created a “procuracy” office that was responsible not only for prosecution but also for overseeing the entire criminal-justice system, including the police and the courts. That system was reformed in 1864, when prosecutorial power was again restricted to the prosecution of cases. An independent judiciary and trial by jury also were instituted in the reforms of 1864, but both were eliminated after the Russian Revolution of 1917 . The procuracy was revived during the Soviet period, when prosecutors became the central administrators of the entire justice system. Trials were heard by a panel consisting of one career judge and two “people’s assessors,” all of whom were appointed by local Communist Party officials.",
  "The contemporary Russian court system is based on civil law. After the fall of the Soviet Union in 1991, laws were passed both to ensure the independence of judges from local politics and to reinstate trial by jury. Prosecutorial supervision of the courts also was eliminated, but prosecutors still maintained fairly broad powers.",
  "Some Islamic countries of English and French colonial heritage adopted the procedure of the colonial countries that ruled them. For example, Pakistan, which originally inherited the Indian Criminal Procedure Code, adopted an adversarial system similar to that of England. Both sides in a trial present their oral arguments to an impartial judge, and there is a competent and independent bar from whose ranks judges are chosen. The regular courts were supplemented by special Islamic courts and judges beginning in 1980.",
  "By contrast, the criminal procedure of Egypt, which adopted an inquisitorial system, generally mirrors that of France. Judges have a high degree of power to question, to intervene, and to determine the method of proceeding. Egypt also has established the Niyaba, a system of state prosecutors very similar to those of the French unified magistracy. Egyptian judges, unlike their English and Pakistani counterparts, are often career officials.",
  "In Islamic states, ordinary criminal courts are often supplemented by police courts, which tend to deal with lesser criminal offenses, and military courts, which hear questions affecting security and military matters. In countries (e.g., Saudi Arabia and Iran) where the legal system is principally derived from Shariʿah (traditional Islamic law), Islamic judges, called qadis , exercise jurisdiction. In these countries, sentences are largely determined by Shariʿah. The most-serious offenses, ḥadd crimes, have punishments that are fixed and unalterable. Less-serious offenses ( taʿzīr ) allow judges discretion in sentencing offenders. In addition, for certain offenses ( jinayat ), the victim or the victim’s family is allowed by law to take retaliatory action against the offender or the offender’s family.",
  "The court systems in African countries generally follow the systems of the former colonial rulers. In the common-law countries this means that, though there is state prosecution, considerable responsibility falls on the police forces to initiate prosecutions. In some countries, such as Sudan and parts of Nigeria, where Indian legal influence was strong, versions of the Indian Criminal Procedure Code were adopted; in those places the magistrate, rather than the police, takes charge of the investigation and levels charges. Other countries blend customary or traditional law with modern legal systems.",
  "The Chinese penal system broadly divides procedures and sanctions into criminal and administrative categories; in this way, crimes are distinguished from ordinary illegal acts. Crime is defined as behaviour punishable by a court under the criminal law or other laws calling specifically for criminal punishment for violators. Ordinary illegal acts can be punished administratively by nonjudicial bodies (such as the police) on their own initiative and according to less-formal procedures. In general, administrative punishments cannot be appealed to a court.",
  "The distinction between crimes and acts that are merely illegal often depends on the concept of circumstances (e.g., the identity of the accused or the victim, the existence of an official campaign against the particular type of crime involved, or even such matters as whether a robber also beat his victim or showed repentance). Although many countries take such factors into account in sentencing, Chinese law differs by allowing circumstances to bring an act within or entirely outside the coverage of the criminal law and, more important, the associated criminal procedural law, the only type of law in China that provides for a public trial by a court and the right to a defense. The law itself frequently uses only general terms such as “minor,” “serious,” or “very serious” to describe criminal acts, and the exact meaning of those words is then left up to the officials who administer the law. This is a major source of the extensive discretion that Chinese officials have in deciding criminal cases. For instance, a person suspected of selling pornographic books may, if the police deem the circumstances clearly minor, be judged by the police and punished by up to 15 days’ detention in a police station. Otherwise, the case could be tried in criminal court, where the offender would be subject to much more severe punishments. Even when the law is more specific, officials have considerable discretion.",
  "Crime is a feature of all societies at all times. Nevertheless, certain trends and patterns appear consistently at different times and places. In general, traditional societies—i.e., rural and agricultural societies that lack significant economic development—tend to have more violent crime and less property crime than economically developed societies. In traditional societies, violent crimes such as murder, rape, and assault may be fairly common and often are accepted and tolerated as an unavoidable part of ordinary life. As these societies modernize and become economically developed, violent acts become increasingly unacceptable as they also become increasingly rare. At the same time, while valuable property exists in traditional societies, it generally is not very portable—the most valuable property may include such things as land and animals—and thus there is little property crime. Ownership of valuable, portable goods expands rapidly with economic development, and with that expansion comes a vast increase in the stealing of those goods, along with a vast increase in the ways in which those goods can be stolen (e.g., stealing with a pen rather than with a gun).",
  "Traditional societies also generally focus on responding to crime after it has occurred. Consistent with the view that crime is an ordinary and unavoidable part of life, there often are few expectations that responses to crime will influence future criminality. Rather, the responses attempt to return the society to a kind of balance that had been disrupted by the crime itself. In contrast, in modern, economically developed societies, crime policies increasingly focus on the achievement of future reductions in crime. That effort is limited by the need to retain a sense of legitimacy and fairness in crime-control policies. But, in general, support for crime policies largely depends on beliefs about their predicted ability to reduce crime.",
  "In the 1970s in the United States, for example, rehabilitation programs were largely abandoned because of the widely held view that they did not reduce future criminal activity, and the death penalty was reinstated because of the pervasive sentiment that it did. By the beginning of the 21st century, however, support for capital punishment appeared to be weakening because of the belief that it did not reduce future criminality, and support for rehabilitation programs in prisons was increasing because of the belief that those programs worked. All such beliefs can be subjected to empirical testing by criminologists, who can determine whether and how the policies implemented in a certain area have affected the crime rate.",
  "In addition to punishment policies, criminologists also have studied the effectiveness of various policing strategies. Influential research on police responses to domestic violence, for example, showed that arresting the offender tended to reduce future violence in most cases but to increase it in others. That research influenced the handling of domestic violence in many police departments.",
  "More recently, criminologists have turned their attention to programs that attempt to prevent crime by reducing the likelihood that certain groups of people will engage in criminal behaviour. Many biological, psychological, and social factors increase the risk of such behaviour, and social policies that focus on the reduction or elimination of such factors have been shown to have long-term crime-reduction effects. For example, several successful programs directed at high-risk (e.g., low-income or unmarried) mothers have provided prenatal health care, home visits by nurses after the birth of the child, and parenting classes for the mother when the child is a toddler. These programs have been shown to reduce delinquent offending when the child becomes an adolescent. Similarly, educational programs that provide preschool to high-risk children have been shown to reduce offending by those children when they become adolescents and adults. Given the wide attention that studies of such programs have received, it is likely that criminological research will play an increasingly important role in the development of future crime policies.",
  "General coverage of crime can be found in Joshua Dressler (ed.), Encyclopedia of Crime and Justice , 4 vol. (2002); David Levinson (ed.), Encyclopedia of Crime and Punishment (2002); and Mike Maguire , Rod Morgan , and Robert Reiner (eds.), The Oxford Handbook of Criminology , 2nd ed. (1997). Helpful introductory texts on criminal justice or criminology include James A. Inciardi , Criminal Justice , 6th ed. (2000); Joel Samaha , Criminal Justice , 5th ed. (1999); George B. Vold , Thomas J. Bernard , and Jeffrey B. Snipes , Theoretical Criminology , 5th ed. (2002); Larry J. Siegel , Criminology , 7th ed. (2000); and John Monahan and Laurens Walker , Social Science in Law , 6th ed. (2006).",
  "Criminal policy considerations are the subject of Samuel Walker , Sense and Nonsense About Crime and Drugs: A Policy Guide , 4th ed. (1998), an examination of various positions on crime control and the research related to them; and Franklin E. Zimring and Gordon Hawkins , Crime Is Not the Problem: Lethal Violence in America (1997), which argues for a highly focused crime policy to address high homicide rates.",
  "Works on crime detection include Joe Nickell and John F. Fischer , Crime Science: Methods of Forensic Detection (1999); Peter White (ed.), Crime Scene to Court: The Essentials of Forensic Science (1998); and Rudolf vom Ende , Criminology and Forensic Sciences: An International Bibliography, 1950–1980 , 3 vol. (1981–82). Works on criminal procedure include Great Britain Royal Commission on Criminal Procedure , Report (1981); and Yale Kamisar et al., Modern Criminal Procedure: Cases, Comments and Questions , 9th ed. (1999), and 1999 Supplement to Ninth Editions: Modern Criminal Procedure, Cases, Comments, Questions: Basic Criminal Procedure, Cases, Comments, Questions, and Advanced Criminal Procedure (1999).",
  "Works examining sentencing include Michael Tonry and Kathleen Hatlestad (eds.), Sentencing Reform in Overcrowded Times: A Comparative Perspective (1997); Norval Morris and Michael Tonry , Between Prison and Probation: Intermediate Punishments in a Rational Sentencing System (1990); and Peter H. Rossi and Richard A. Berk , Just Punishments (1997).",
  "Crime victims are the subject of Andrew Karmen , Crime Victims: An Introduction to Victimology , 4th ed. (2001); Leslie W. Kennedy and Vincent F. Sacco , Crime Victims in Context (1998); R.I. Mawby and S. Walklate , Critical Victimology: International Perspectives (1994); and Joel Best , Random Violence: How We Talk About New Crimes and New Victims (1999).",
  "An international perspective is provided by Gregg Barak (ed.), Crime and Crime Control: A Global View (2000); and Jerome L. Neapolitan , Cross-National Crime: A Research Review and Sourcebook (1997). Piers Beirne and Joan Hill (compilers), Comparative Criminology: An Annotated Bibliography (1991), is a useful resource for a wide range of material. Books focusing on criminal-justice systems in different countries include Richard J. Terrill , World Criminal Justice Systems: A Survey , 4th ed. (1999); Philip L. Reichel , Comparative Criminal Justice Systems: A Topical Approach , 2nd ed. (1999); and Charles B. Fields and Richter H. Moore, Jr. , Comparative Criminal Justice: Traditional and Nontraditional Systems of Law and Control (1996)."
]