[
  "  telescope , device used to form magnified images of distant objects. The telescope is undoubtedly the most important investigative tool in astronomy . It provides a means of collecting and analyzing radiation from celestial objects, even those in the far reaches of the universe .",
  " Galileo revolutionized astronomy when he applied the telescope to the study of extraterrestrial bodies in the early 17th century. Until then, magnification instruments had never been used for this purpose. Since Galileo’s pioneering work, increasingly more powerful optical telescopes have been developed, as has a wide array of instruments capable of detecting and measuring radiation in every region of the electromagnetic spectrum . Observational capability has been further enhanced by the invention of various kinds of auxiliary instruments (e.g., the camera , spectrograph, and charge-coupled device ) and by the use of electronic computers , rockets , and spacecraft in conjunction with telescope systems. These developments have contributed dramatically to advances in scientific knowledge about the solar system , the Milky Way Galaxy , and the universe as a whole.",
  "This article describes the operating principles and historical development of optical telescopes. For explanation of instruments that operate in other portions of the electromagnetic spectrum, see  radio telescope ; X-ray telescope ; and gamma-ray telescope .",
  "    Commonly known as refractors, telescopes of this kind are typically used to examine the Moon , other objects of the solar system such as Jupiter and Mars , and binary stars . The name refractor is derived from the term  refraction  , which is the bending of light when it passes from one medium to another of different density—e.g., from air to glass . The glass is referred to as a lens and may have one or more components. The physical shape of the components may be convex, concave, or plane-parallel. This diagram illustrates the principle of refraction and the term focal length. The focus is the point, or plane, at which light rays from infinity converge after passing through a lens and traveling a distance of one focal length. In a refractor the first lens through which light from a celestial object passes is called the objective lens. It should be noted that the light will be inverted at the focal plane. A second lens, referred to as the eyepiece lens, is placed behind the focal plane and enables the observer to view the enlarged, or magnified, image. Thus, the simplest form of refractor consists of an objective and an eyepiece, as illustrated in the diagram .",
  "The diameter of the objective is referred to as the aperture; it typically ranges from a few centimetres for small spotting telescopes up to one metre for the largest refractor in existence. The objective, as well as the eyepiece, may have several components. Small spotting telescopes may contain an extra lens behind the eyepiece to erect the image so that it does not appear upside-down. When an object is viewed with a refractor, the image may not appear sharply defined, or it may even have a predominant colour in it. Such distortions, or aberrations, are sometimes introduced when the lens is polished into its design shape. The major kind of distortion in a refractor is chromatic aberration , which is the failure of the differently coloured light rays to come to a common focus. Chromatic aberration can be minimized by adding components to the objective. In lens-design technology, the coefficients of expansion of different kinds of glass are carefully matched to minimize the aberrations that result from temperature changes of the telescope at night.",
  "Eyepieces, which are used with both refractors and reflectors ( see below  Reflecting telescopes ), have a wide variety of applications and provide observers with the ability to select the magnification of their instruments. The magnification, sometimes referred to as magnifying power, is determined by dividing the focal length of the objective by the focal length of the eyepiece. For example, if the objective has a focal length of 254 cm (100 inches) and the eyepiece has a focal length of 2.54 cm (1 inch), then the magnification will be 100. Large magnifications are very useful for observing the Moon and the planets . However, since stars appear as point sources owing to their great distances, magnification provides no additional advantage when viewing them. Another important factor that one must take into consideration when attempting to view at high magnification is the stability of the telescope mounting. Any vibration in the mounting will also be magnified and may severely reduce the quality of the observed image. Thus, great care is usually taken to provide a stable platform for the telescope. This problem should not be associated with that of atmospheric seeing , which may introduce a disturbance to the image because of fluctuating air currents in the path of the light from a celestial or terrestrial object. Generally, most of the seeing disturbance arises in the first 30 metres (100 feet) of air above the telescope. Large telescopes are frequently installed on mountain peaks in order to get above the seeing disturbances.",
  "The most important of all the powers of an optical telescope is its light-gathering power. This capacity is strictly a function of the diameter of the clear objective—that is, the aperture—of the telescope. Comparisons of different-sized apertures for their light-gathering power are calculated by the ratio of their diameters squared; for example, a 25-cm (10-inch) objective will collect four times the light of a 12.5-cm (5-inch) objective ([25 × 25] ÷ [12.5 × 12.5] = 4). The advantage of collecting more light with a larger-aperture telescope is that one can observe fainter stars , nebulae , and very distant galaxies .",
  "Resolving power is another important feature of a telescope. This is the ability of the instrument to distinguish clearly between two points whose angular separation is less than the smallest angle that the observer’s eye can resolve. The resolving power of a telescope can be calculated by the following formula: resolving power = 11.25 seconds of arc/ d, where d is the diameter of the objective expressed in centimetres. Thus, a 25-cm-diameter objective has a theoretical resolution of 0.45 second of arc and a 250-cm (100-inch) telescope has one of 0.045 second of arc. An important application of resolving power is in the observation of visual binary stars . There, one star is routinely observed as it revolves around a second star. Many observatories conduct extensive visual binary observing programs and publish catalogs of their observational results. One of the major contributors in this field is the United States Naval Observatory in Washington, D.C.",
  "Most refractors currently in use at observatories have equatorial mountings. The mounting describes the orientation of the physical bearings and structure that permits a telescope to be pointed at a celestial object for viewing. In the equatorial mounting, the polar axis of the telescope is constructed parallel to Earth ’s axis. The polar axis supports the declination axis of the instrument. Declination is measured on the celestial sky north or south from the celestial equator. The declination axis makes it possible for the telescope to be pointed at various declination angles as the instrument is rotated about the polar axis with respect to right ascension . Right ascension is measured along the celestial equator from the vernal equinox (i.e., the position on the celestial sphere where the Sun crosses the celestial equator from south to north on the first day of spring). Declination and right ascension are the two coordinates that define a celestial object on the celestial sphere. Declination is analogous to latitude , and right ascension is analogous to longitude. Graduated dials are mounted on the axis to permit the observer to point the telescope precisely. To track an object, the telescope’s polar axis is driven smoothly by an electric motor at a sidereal rate—namely, at a rate equal to the rate of rotation of Earth with respect to the stars. Thus, one can track or observe with a telescope for long periods of time if the sidereal rate of the motor is very accurate. High-accuracy motor-driven systems have become readily available with the rapid advancement of quartz -clock technology. Most major observatories now rely on either quartz or atomic clocks to provide accurate sidereal time for observations as well as to drive telescopes at an extremely uniform rate.",
  "A notable example of a refracting telescope is the 66-cm (26-inch) refractor of the U.S. Naval Observatory. This instrument was used by the astronomer Asaph Hall to discover the two moons of Mars , Phobos and Deimos , in 1877. Today, the telescope is used primarily for observing binary stars. The 91-cm (36-inch) refractor at Lick Observatory on Mount Hamilton, California, U.S., is the largest refracting system currently in operation. (The 1-metre [40-inch] instrument at Yerkes Observatory in Williams Bay, Wisconsin, U.S., has been inactive since 2018 [ see ].)",
  "Another type of refracting telescope is the astrograph, which usually has an objective diameter of approximately 20 cm (8 inches). The astrograph has a photographic plateholder mounted in the focal plane of the objective so that photographs of the celestial sphere can be taken. The photographs are usually taken on glass plates. The principal application of the astrograph is to determine the positions of a large number of faint stars. These positions are then published in catalogs such as the   AGK 3  and serve as reference points for deep-space photography.",
  "   Reflectors are used not only to examine the visible region of the electromagnetic spectrum but also to explore both the shorter- and longer-wavelength regions adjacent to it (i.e., the ultraviolet and the infrared ). The name of this type of instrument is derived from the fact that the primary mirror reflects the light back to a focus instead of refracting it. The primary mirror usually has a concave spherical or parabolic shape, and, as it reflects the light, it inverts the image at the focal plane. The diagram illustrates the principle of a concave reflecting mirror. The formulas for resolving power, magnifying power, and light-gathering power, as discussed for refractors, apply to reflectors as well.",
  "The primary mirror is located at the lower end of the telescope tube in a reflector and has its front surface coated with an extremely thin film of metal, such as aluminum . The back of the mirror is usually made of glass , although other materials have been used from time to time. Pyrex was the principal glass of choice for many of the older large telescopes, but new technology has led to the development and widespread use of a number of glasses with very low coefficients of expansion. A low coefficient of expansion means that the shape of the mirror will not change significantly as the temperature of the telescope changes during the night. Since the back of the mirror serves only to provide the desired form and physical support, it does not have to meet the high optical quality standards required for a lens.",
  "  Reflecting telescopes have a number of other advantages over refractors. They are not subject to chromatic aberration because reflected light does not disperse according to wavelength. Also, the telescope tube of a reflector is shorter than that of a refractor of the same diameter, which reduces the cost of the tube. Consequently, the dome for housing a reflector is smaller and more economical to construct. So far only the primary mirror for the reflector has been discussed. One might wonder about the location of the eyepiece. The primary mirror reflects the light of the celestial object to the prime focus near the upper end of the tube. Obviously, if an observer put his eye there to observe with a modest-sized reflector, he would block out the light from the primary mirror with his head. Isaac Newton placed a small plane mirror at an angle of 45° inside the prime focus and thereby brought the focus to the side of the telescope tube. The amount of light lost by this procedure is very small when compared to the total light-gathering power of the primary mirror. The Newtonian reflector is popular among amateur telescope makers.",
  " Laurent Cassegrain of France, a contemporary of Newton, invented another type of reflector. Called the Cassegrain telescope, this instrument employs a small convex mirror to reflect the light back through a small hole in the primary mirror to a focus located behind the primary. The diagram illustrates a typical Cassegrain reflector . Some large telescopes of this kind do not have a hole in the primary mirror but use a small plane mirror in front of the primary to reflect the light outside the main tube and provide another place for observation. The Cassegrain design usually permits short tubes relative to their mirror diameter.",
  "One more variety of reflector was invented by another of Newton’s contemporaries, the Scottish astronomer James Gregory . Gregory placed a concave secondary mirror outside the prime focus to reflect the light back through a hole in the primary mirror. Notable is the fact that the Gregorian design was adopted for the Earth-orbiting space observatory, the Solar Maximum Mission (SMM), launched in 1980.",
  "Most large reflecting telescopes that are currently in use have a cage at their prime focus that permits the observer to sit inside the telescope tube while operating the instrument. The 5-metre (200-inch) reflector at Palomar Observatory , near San Diego, Calif., is so equipped. While most reflectors have equatorial mounts similar to refractors, the world’s largest reflector, the 10.4-metre (34.1-foot) instrument at the Gran Telescopio Canarias at La Palma, Canary Islands, Spain, has an altitude-azimuth mounting. The significance of the latter design is that the telescope must be moved both in altitude and in azimuth as it tracks a celestial object. Equatorial mountings, by contrast, require motion in only one coordinate while tracking, since the declination coordinate is constant. Reflectors, like refractors, usually have small guide telescopes mounted parallel to their main optical axis to facilitate locating the desired object. These guide telescopes have low magnification and a wide field of view, the latter being a desirable attribute for finding stars or other remote cosmic objects.",
  "The parabolic shape of a primary mirror has a basic failing in that it produces a narrow field of view. This can be a problem when one wishes to observe extended celestial objects. To overcome this difficulty, most large reflectors now have a modified Cassegrain design. The central area of the primary mirror has its shape deepened from that of a paraboloid, and the secondary mirror is configured to compensate for the altered primary. The result is the Ritchey-Chrétien design, which has a curved rather than a flat focus. Obviously, the photographic medium must be curved to collect high-quality images across the curved focal plane. The 1-metre telescope of the U.S. Naval Observatory in Flagstaff, Arizona, was one of the early examples of this design.",
  " The Ritchey-Chrétien design has a good field of view of about 1°. For some astronomical applications, however, photographing larger areas of the sky is mandatory. In 1930 Bernhard Schmidt , an optician at the Hamburg Observatory in Bergedorf, Germany, designed a catadioptric telescope that satisfied the requirement of photographing larger celestial areas. A catadioptric telescope design incorporates the best features of both the refractor and the reflector—i.e., it has both reflective and refractive optics. The Schmidt telescope has a spherically shaped primary mirror. Since parallel light rays that are reflected by the centre of a spherical mirror are focused farther away than those reflected from the outer regions, Schmidt introduced a thin lens (called the correcting plate) at the radius of curvature of the primary mirror. Since this correcting plate is very thin, it introduces little chromatic aberration. The resulting focal plane has a field of view several degrees in diameter. The diagram illustrates a typical Schmidt design.",
  "The National Geographic Society–Palomar Observatory Sky Survey made use of a 1.2-metre (47-inch) Schmidt telescope to photograph the northern sky in the red and blue regions of the visible spectrum. The survey produced 900 pairs of photographic plates (about 7° by 7° each) taken from 1949 to 1956. Schmidt telescopes of the European Southern Observatory in Chile and of the Siding Spring Observatory in Australia have photographed the remaining part of the sky that cannot be observed from Palomar Observatory . (The survey undertaken at the latter included photographs in the infrared as well as in the red and blue spectral regions.)",
  "The main reason astronomers build larger telescopes is to increase light-gathering power so that they can see deeper into the universe. Unfortunately, the cost of constructing larger single-mirror telescopes increases rapidly—approximately with the cube of the diameter of the aperture. Thus, in order to achieve the goal of increasing light-gathering power while keeping costs down, it has become necessary to explore new, more economical and nontraditional telescope designs.",
  "  The two 10-metre (33-foot) Keck Observatory multimirror telescopes represent such an effort. The first was installed on Mauna Kea on the island of Hawaii in 1992, and a second telescope was completed in 1996. Each of the Keck telescopes comprises 36 contiguous adjustable mirror segments, all under computer control. Even-larger multimirror instruments are currently being planned by American and European astronomers.",
  "  Either a refractor or a reflector may be used for visual observations of solar features, such as sunspots or solar prominences . Special solar telescopes have been constructed, however, for investigations of the Sun that require the use of such ancillary instruments as spectroheliographs and coronagraphs . These telescopes are mounted in towers and have very long focus objectives. Typical examples of tower solar telescopes are found at the Mount Wilson Observatory in California and the McMath-Hulbert Observatory in Michigan. The long focus objective produces a very good scale factor, which in turn makes it possible to look at individual wavelengths of the solar electromagnetic spectrum in great detail. A tower telescope has an equatorially mounted plane mirror at its summit to direct the sunlight into the telescope objective. This plane mirror is called a coelostat . Bernard Lyot constructed another type of solar telescope in 1930 at Pic du Midi Observatory in France. This instrument was specifically designed for photographing the Sun’s corona (the outer layer), which up to that time had been successfully photographed only during solar eclipses . The coronagraph, as this special telescope is called, must be located at a high altitude to be effective. The high altitude is required to reduce the scattered sunlight, which would reduce the quality of the photograph. The High Altitude Observatory in Colorado has such a coronagraph. The principle has been extended to build instruments that can search for extrasolar planets by blocking out the light of their parent stars. Coronagraphs are also used on board satellites, such as the Solar and Heliospheric Observatory , that study the Sun.",
  " While astronomers continue to seek new technological breakthroughs with which to build larger ground-based telescopes, it is readily apparent that the only solution to some scientific problems is to make observations from above Earth ’s atmosphere . A series of Orbiting Astronomical Observatories (OAOs) was launched by the National Aeronautics and Space Administration (NASA). The OAO launched in 1972—later named Copernicus—had an 81-cm (32-inch) telescope on board. The most sophisticated observational system placed in Earth orbit so far is the Hubble Space Telescope (HST; see  photograph ). Launched in 1990, the HST is essentially a telescope with a 2.4-metre (94-inch) primary mirror. It has been designed to enable astronomers to see into a volume of space 300 to 400 times larger than that permitted by other systems. At the same time, the HST is not impeded by any of the problems caused by the atmosphere. It is equipped with five principal scientific instruments: (1) a wide-field and planetary camera, (2) a faint-object spectrograph, (3) a high-resolution spectrograph, (4) a high-speed photometer, and (5) a faint-object camera. The HST was launched into orbit from the U.S. space shuttle at an altitude of more than 570 km (350 miles) above Earth. Shortly after its deployment in Earth orbit, HST project scientists found that a manufacturing error affecting the shape of the telescope’s primary mirror severely impaired the instrument’s focusing capability. The flawed mirror caused spherical aberration, which limited the ability of the HST to distinguish between cosmic objects that lie close together and to image distant galaxies and quasars . Project scientists devised measures that enabled them to compensate for the defective mirror and correct the imaging problem.",
  "These small but extremely important telescopes have played a vital role in mapping the celestial sphere . Astronomical transit instruments are usually refractors with apertures of 15 to 20 cm (6 to 8 inches). ( Ole Rømer , a Danish astronomer, is credited with having invented this type of telescope system.) The main optical axis of the instrument is aligned on a north-south line such that its motion is restricted to the plane of the meridian of the observer. The observer’s meridian is a great circle on the celestial sphere that passes through the north and south points of the horizon as well as through the zenith of the observer. Restricting the telescope to motion only in the meridian provides an added degree of stability, but it requires the observer to wait for the celestial object to rotate across his meridian. The latter process is referred to as transiting the meridian, from which the name of the telescope is derived. There are various types of transit instruments—for example, the transit circle telescope, the vertical circle telescope, and the horizontal meridian circle telescope. The transit circle determines the right ascension of celestial objects, while the vertical circle measures only their declinations . Transit circles and horizontal meridian circles measure both right ascension and declination at the same time. The final output data of all transit instruments are included in star or planetary catalogs. A notable example of this class of telescopes is the transit circle of the National Astronomical Observatory in Tokyo.",
  "Another special type of telescopic instrument is the modern version of the astrolabe. Known as a prismatic astrolabe, it too is used for making precise determinations of the positions of stars and planets . It may sometimes be used inversely to determine the latitude and longitude of the observer, assuming the star positions are accurately known. The aperture of a prismatic astrolabe is small, usually only 8 to 10 cm (3 to 4 inches). A small pool of mercury and a refracting prism make up the other principal parts of the instrument. An image reflected off the mercury is observed along with a direct image to give the necessary position data. The most notable example of this type of instrument is the French-constructed Danjon astrolabe. During the 1970s, however, the Chinese introduced various innovations that resulted in a more accurate and automatic kind of astrolabe, which is now in use at the National Astronomical Observatories of China’s headquarters in Beijing.",
  " Galileo is credited with having developed telescopes for astronomical observation in 1609. While the largest of his instruments was only about 120 cm (47 inches) long and had an objective diameter of 5 cm (2 inches), it was equipped with an eyepiece that provided an upright (i.e., erect) image. Galileo used his modest instrument to explore such celestial phenomena as the valleys and mountains of the Moon , the phases of Venus , and the four largest Jovian satellites , which had never been systematically observed before.",
  "The reflecting telescope was developed in 1668 by Newton , though John Gregory had independently conceived of an alternative reflector design in 1663. Cassegrain introduced another variation of the reflector in 1672. Near the end of the century, others attempted to construct refractors as long as 61 metres, but these instruments were too awkward to be effective.",
  "The most significant contribution to the development of the telescope in the 18th century was that of Sir William Herschel . Herschel, whose interest in telescopes was kindled by a modest 5-cm Gregorian, persuaded the king of England to finance the construction of a reflector with a 12-metre (39-foot) focal length and a 120-cm mirror. Herschel is credited with having used this instrument to lay the observational groundwork for the concept of extragalactic “nebulas”—i.e., galaxies outside the Milky Way system.",
  "Reflectors continued to evolve during the 19th century with the work of William Parsons, 3rd earl of Rosse , and William Lassell . In 1845 Lord Rosse constructed in Ireland a reflector with a 185-cm (73-inch) mirror and a focal length of about 16 metres (52 feet). For 75 years this telescope ranked as the largest in the world and was used to explore thousands of nebulae and star clusters . Lassell built several reflectors, the largest of which was on Malta; this instrument had a 124-cm (49-inch) primary mirror and a focal length of more than 10 metres (33 feet). His telescope had greater reflecting power than Rosse’s, and it enabled him to catalog 600 new nebulae as well as to discover several satellites of the outer planets — Triton ( Neptune ’s largest moon ), Hyperion ( Saturn ’s 8th moon), and Ariel and Umbriel (two of Uranus ’s moons).",
  "Refractor telescopes, too, underwent development during the 18th and 19th centuries. The last significant one to be built was the 1-metre (40-inch) refractor at Yerkes Observatory . Installed in 1897, it was the largest refracting system in the world. Its objective was designed and constructed by the optician Alvan Clark , while the mount was built by the firm of Warner & Swasey.",
  "The reflecting telescope predominated in the 20th century. The rapid proliferation of increasingly larger instruments of this type began with the installation of the 2.5-metre (60-inch) reflector at the Mount Wilson Observatory near Pasadena, Calif., U.S. The technology for mirrors underwent a major advance when the Corning Glass Works (in Steuben county, N.Y., U.S.) developed Pyrex . This borosilicate glass, which undergoes substantially less expansion than ordinary glass does, was used in the 5-metre (200-inch) Hale Telescope built in 1948 at the Palomar Observatory . Pyrex also was utilized in the main mirror of the 6-metre (236-inch) reflector of the Special Astrophysical Observatory in Zelenchukskaya, Russia. Since then, much better materials for mirrors have become available. Cer-Vit, for example, was used for the 4.2-metre (165-inch) William Herschel Telescope of the Roque de los Muchachos Observatory in the Canary Islands, and Zerodur was used for the 10.4-metre (410-inch) reflector at the Gran Telescopio Canarias in the Canary Islands.",
  "Almost as important as the telescope itself are the auxiliary instruments that the astronomer uses to exploit the light received at the focal plane. Examples of such instruments are the camera, spectrograph, photomultiplier tube , charge-coupled device ( CCD ), and charge injection device (CID). Each of these instrument types is discussed below.",
  "American John Draper photographed the Moon as early as 1840 by applying the daguerreotype process. The French physicists A.-H.-L. Fizeau and J.-B.-L. Foucault succeeded in making a photographic image of the Sun in 1845. Five years later astronomers at Harvard Observatory took the first photographs of the stars .",
  "The use of photographic equipment in conjunction with telescopes benefited astronomers greatly, giving them two distinct advantages: first, photographic images provided a permanent record of celestial phenomena, and, second, photographic plates integrated the light from celestial sources over long periods of time and thereby permitted astronomers to see much-fainter objects than they would be able to observe visually. Typically, the camera’s photographic plate (or film) was mounted in the focal plane of the telescope. The plate or film consisted of glass or of a plastic material that was covered with a thin layer of a silver compound. The light striking the photographic medium caused the silver compound to undergo a chemical change. When processed, a negative image resulted; i.e., the brightest spots (the Moon and the stars, for example) appeared as the darkest areas on the plate or the film. In the 1980s the CCD supplanted photography in the production of astronomical images.",
  "  Newton noted the interesting way in which a piece of glass can break up light into different bands of colour, but it was not until 1814 that the German physicist Joseph von Fraunhofer discovered the lines of the solar spectrum and laid the basis for spectroscopy . The spectrograph consists of a slit, a collimator, a prism for dispersing the light, and a focusing lens. The collimator is an optical device that produces parallel rays from a focal plane source—i.e., it gives the appearance that the source is located at an infinite distance. The spectrograph enables astronomers to analyze the chemical composition of planetary atmospheres, stars, nebulae, and other celestial objects. A bright line in the spectrum indicates the presence of a glowing gas radiating at a wavelength characteristic of the chemical element in the gas. A dark line in the spectrum usually means that a cooler gas has intervened and absorbed the lines of the element characteristic of the intervening material. The lines may be displaced to either the red end or the blue end of the spectrum. This effect was first noted in 1842 by the Austrian physicist Christian Johann Doppler . When a light source is approaching, the lines are shifted toward the blue end of the spectrum, and when the source is receding, the lines are shifted toward its red end. This effect, known as the Doppler effect , permits astronomers to study the relative motions of celestial objects with respect to Earth’s motion.",
  "The slit of the spectrograph is placed at the focal plane of the telescope. The resulting spectrum may be recorded photographically or with some kind of electronic detector, such as a photomultiplier tube, CCD, or CID. If no recording device is used, then the optical device is technically referred to as a spectroscope.",
  "The photomultiplier tube is an enhanced version of the photocell, which was first used by astronomers to record data electronically. The photocell contains a photosensitive surface that generates an electric current when struck by light from a celestial source. The photosensitive surface is positioned just behind the focus. A diaphragm of very small aperture is usually placed in the focal plane to eliminate as much of the background light of the sky as possible. A small lens is used to focus the focal plane image on the photosensitive surface, which, in the case of a photomultiplier tube, is referred to as the photocathode . In the photomultiplier tube a series of special sensitive plates are arranged geometrically to amplify or multiply the electron stream. Frequently, magnifications of a million are achieved by this process.",
  "The photomultiplier tube has a distinct advantage over the photographic plate. With the photographic plate the relationship between the brightness of the celestial source and its registration on the plate is not linear. In the case of the photomultiplier tube, however, the release of electrons in the tube is directly proportional to the intensity of light from the celestial source. This linear relationship is very useful for working over a wide range of brightness. A disadvantage of the photomultiplier tube is that only one object can be recorded at a time. The output from such a device is sent to a recorder or digital storage device to produce a permanent record.",
  "The charge-coupled device (CCD) uses a light-sensitive material on a silicon chip to electronically detect photons in a way similar to the photomultiplier tube. The principal difference is that the chip also contains integrated microcircuitry required to transfer the detected signal along a row of discrete picture elements (or pixels) and thereby scan a celestial object or objects very rapidly. When individual pixels are arranged simply in a single row, the detector is referred to as a linear array. When the pixels are arranged in rows and columns, the assemblage is called a two-dimensional array.",
  "Pixels can be assembled in various sizes and shapes. The Hubble Space Telescope has a CCD detector with a 1,600 × 1,600 pixel array. Actually, there are four 800 × 800 pixel arrays mosaicked together. The sensitivity of a CCD is 100 times greater than a photographic plate and so has the ability to quickly scan objects such as planets, nebulae, and star clusters and record the desired data. Another feature of the CCD is that the detector material may be altered to provide more sensitivity at different wavelengths. Thus, some detectors are more sensitive in the blue region of the spectrum than in the red region.",
  "Today, most large observatories use CCDs to record data electronically. Another similar device, the charge injection device, is sometimes employed. The basic difference between the CID and the CCD is in the way the electric charge is transferred before it is recorded; however, the two devices may be used interchangeably as far as astronomical work is concerned.",
  "Besides the telescope itself, the electronic computer has become the astronomer’s most important tool. Indeed, the computer has revolutionized the use of the telescope to the point where the collection of observational data is now completely automated. The astronomer need only identify the object to be observed, and the rest is carried out by the computer and auxiliary electronic equipment.",
  "A telescope can be set to observe automatically by means of electronic sensors appropriately placed on the telescope axis. Precise quartz or atomic clocks send signals to the computer, which in turn activates the telescope sensors to collect data at the proper time. The computer not only makes possible more efficient use of telescope time but also permits a more detailed analysis of the data collected than could have been done manually. Data analysis that would have taken a lifetime or longer to complete with a mechanical calculator can now be done within hours or even minutes with a high-speed computer.",
  "Improved means of recording and storing computer data also have contributed to astronomical research. Optical disc data-storage technology, such as the CD-ROM ( compact disc read-only memory) or the DVD -ROM (digital video disc read-only memory), has provided astronomers with the ability to store and retrieve vast amounts of telescopic and other astronomical data.",
  "The quest for new knowledge about the universe has led astronomers to study electromagnetic radiation other than just visible light. Such forms of radiation, however, are blocked for the most part by Earth’s atmosphere , and so their detection and analysis can only be achieved from above this gaseous envelope.",
  "During the late 1940s, single-stage sounding rockets were sent up to 160 km (100 miles) or more to explore the upper layers of the atmosphere. From 1957, more sophisticated multistage rockets were launched as part of the International Geophysical Year . These rockets carried artificial satellites equipped with a variety of scientific instruments. Beginning in 1959, the Soviet Union and the United States, engaged in a “space race,” intensified their efforts and launched a series of robotic probes to explore the Moon. Lunar exploration culminated with the first crewed landing on the Moon, by the U.S. Apollo 11 astronauts on July 20, 1969. Numerous other U.S. and Soviet spacecraft were sent to further study the lunar environment until the mid-1970s. Lunar exploration revived in the early years of the 21st century with the United States, China, Japan, and India all sending robotic probes to the Moon.",
  "  Starting in the early 1960s, both the United States and the Soviet Union launched a multitude of robotic deep-space probes to learn more about the other planets and satellites of the solar system . Carrying television cameras, detectors, and an assortment of other instruments, these probes sent back impressive amounts of scientific data and close-up pictures. Among the most successful missions were those involving the U.S. Messenger flybys of Mercury (2008–15), the Soviet Venera probes to Venus (1967–83), the U.S. Mars Exploration Rover landings on Mars (2004–18), and the U.S. Voyager 2 flybys of Jupiter, Saturn, Uranus, and Neptune (1979–89). When the Voyager 2 probe flew past Neptune and its moons in August 1989, every known major planet had been explored by spacecraft. Many long-held views, particularly those about the outer planets, were altered by the findings of the Voyager probe. These findings included the discovery of several rings and six additional satellites around Neptune, all of which are undetectable to ground-based telescopes.",
  "Specially instrumented spacecraft have enabled astronomers to investigate other celestial phenomena as well. The Orbiting Solar Observatories and Solar Maximum Mission (Earth-orbiting U.S. satellites equipped with ultraviolet detector systems) have provided a means for studying solar activity. Another example is the Giotto probe of the European Space Agency , which enabled astronomers to obtain detailed photographs of the nucleus of Halley’s Comet during its 1986 passage.",
  "Techniques of observation with the help of telescopes are detailed in P. Clay Sherrod and Thomas L. Koed,  A Complete Manual of Amateur Astronomy: Tools and Techniques for Astronomical Observations (1981), including a discussion of telescope setup; Robert T. Dixon,  Dynamic Astronomy, 5th ed. (1989), a comprehensive, well-illustrated text; and Jay M. Pasachoff,  Astronomy, from the Earth to the Universe, 3rd ed. (1987). A highly readable and profusely illustrated discussion of radio telescopes is given in Gerrit L. Verschuur,  The Invisible Universe Revealed: The Story of Radio Astronomy , 2nd ed. (2006). More technical accounts are offered in Bernard F. Burke and Francis Graham-Smith,  An Introduction to Radio Astronomy , 2nd ed. (2002); Gerrit L. Verschuur and Kenneth Kellermann , Galactic and Extragalactic Radio Astronomy , 2nd ed. (1988); and K. Rohlfs and T.L. Wilson,  Tools of Radio Astronomy, 4th ed. (2004). Bernard Lovell,  The Story of Jodrell Bank (1968), presents a dramatic story of the construction of the 76-metre Jodrell Bank Radio Telescope. Other modern types of telescopes are described in D.S. Finley et al., “Design of the Extreme Ultraviolet Explorer Long-Wavelength Grazing Incidence Telescope Optics,” Applied Optics 27(8):1476–80 (April 15, 1988); Adelaide Hewitt (ed.), Optical and Infrared Telescopes for the 1990s, 2 vol. (1980); and Joseph F. Baugher,  The Space-Age Solar System (1988). Numerous articles on various types of telescopes are found in Sky and Telescope (monthly). Historical surveys tracing the development of the telescope from the earliest versions to those constructed in the late 1980s include Arthur Berry,  A Short History of Astronomy (1898, reprinted 1961); Henry C. King,  The History of the Telescope (1955, reprinted 1979); and Richard Learner,  Astronomy Through the Telescope (1981)."
]