[
  "  museum , institution dedicated to preserving and interpreting the primary tangible evidence of humankind and the environment. In its preserving of this primary evidence, the museum differs markedly from the library, with which it has often been compared, for the items housed in a museum are mainly unique and constitute the raw material of study and research. In many cases they are removed in time, place, and circumstance from their original context, and they communicate directly to the viewer in a way not possible through other media. Museums have been founded for a variety of purposes: to serve as recreational facilities, scholarly venues, or educational resources; to contribute to the quality of life of the areas where they are situated; to attract tourism to a region; to promote civic pride or nationalistic endeavour; or even to transmit overtly ideological concepts. Given such a variety of purposes, museums reveal remarkable diversity in form, content, and even function. Yet, despite such diversity, they are bound by a common goal: the preservation and interpretation of some material aspect of society’s cultural consciousness.",
  "  As institutions that preserve and interpret the material evidence of humankind, human activity, and the natural world, museums have a long and varied history, springing from what may be an innate human desire to collect and interpret and having discernible origins in large collections built up by individuals and groups before the modern era.",
  "The word museum has classical origins. In its Greek form, mouseion , it meant “seat of the Muses” and designated a philosophical institution or a place of contemplation. Use of the Latin derivation, museum , appears to have been restricted in Roman times mainly to places of philosophical discussion. Thus, the great Museum at Alexandria , founded by Ptolemy I Soter early in the 3rd century bce , with its college of scholars and its famous library , was more a prototype university than an institution to preserve and interpret material aspects of one’s heritage. The word museum was revived in 15th-century Europe to describe the collection of Lorenzo de’ Medici in Florence, but the term conveyed the concept of comprehensiveness rather than denoting a building. By the 17th century, museum was being used in Europe to describe collections of curiosities. Ole Worm’s collection in Copenhagen was so called, and in England visitors to John Tradescant ’s collection in Lambeth (now a London borough) called the array there a museum; the catalog of this collection, published in 1656, was titled Musaeum Tradescantianum . In 1675 the collection, having become the property of Elias Ashmole, was transferred to the University of Oxford . A building was constructed to receive it, and this, soon after being opened to the public in 1683, became known as the Ashmolean Museum . Although there is some ambivalence in the use of museum in the legislation, drafted in 1753, founding the British Museum , nevertheless the idea of an institution called a museum and established to preserve and display a collection to the public was well established in the 18th century. Indeed, Denis Diderot outlined a detailed scheme for a national museum for France in the ninth volume of his Encyclopédie , published in 1765.",
  "Use of the word museum during the 19th and most of the 20th century denoted a building housing cultural material to which the public had access. Later, as museums continued to respond to the societies that created them, the emphasis on the building itself became less dominant. Open-air museums, comprising a series of buildings preserved as objects, and ecomuseums, involving the interpretation of all aspects of an outdoor environment, provide examples of this. In addition, so-called virtual museums exist in electronic form on the Internet . Although virtual museums provide interesting opportunities for and bring certain benefits to existing museums, they remain dependent upon the collection, preservation, and interpretation of material things by the real museum.",
  "Along with the identification of a clear role for museums in society, there gradually developed a body of theory the study of which is known as museology. For many reasons, the development of this theory was not rapid. Museum personnel were nearly always experienced and trained in a discipline related to a particular collection, and therefore they had little understanding of the museum as a whole, its operation, and its role in society. As a result, the practical aspects of museum work—for example, conservation and display—were achieved through borrowing from other disciplines and other techniques, whether or not they particularly met the requirements of the museum and its public.",
  "Thus, not only was the development of theory slow, but the theory’s practical applications—known as museography—fell far short of expectations. Museums suffered from a conflict of purpose, with a resulting lack of clear identity. Further, the apprenticeship method of training for museum work gave little opportunity for the introduction of new ideas. This situation prevailed until other organizations began to coordinate, develop, and promote museums. In some cases, museums came to be organized partly or totally as a government service; in others, professional associations were formed, while an added impetus arose where universities and colleges took on responsibilities for museum training and research.",
  "The words derived from museum have a respectable, if confused, history. Emanuel Mendes da Costa, in his Elements of Conchology , published in 1776, referred to “museographists,” and a Zeitschrift für Museologie und Antiquitätenkunde (“Journal of Museology and Antique Studies”) appeared in Dresden in 1881. But the terms museology and museography have been used indiscriminately in the literature, and there is a tendency, particularly in English-speaking countries, to use museology or museum studies to embrace both the theory and practice of museums.",
  "The origins of the twin concepts of preservation and interpretation, which form the basis of the museum, lie in the human propensity to acquire and inquire. Collections of objects have been found in Paleolithic burials, while evidence of inquiry into the environment, and communication of the findings, can be seen in the cave and mobiliary art of the same period. A development toward the idea of the museum certainly occurred early in the 2nd millennium bce at Larsa, in Mesopotamia , where copies of old inscriptions were made for use in the schools. But the idea also involves the interpretation of original material—criteria that seem to have been met by objects discovered by Sir Leonard Woolley in the 6th-century- bce levels of the Babylonian city of Ur . Woolley’s findings indicated that the Babylonian kings Nebuchadrezzar and Nabonidus certainly collected antiquities in their day. In addition, in a room next to the unearthed temple school there was found not only a collection of antiquities but also a tablet describing 21st-century- bce inscriptions. Woolley interpreted the tablet as a museum label. This discovery seems to suggest that Ennigaldi-Nanna, Nabonidus’s daughter and a priestess who ran the school, had a small educational museum there.",
  "The archaeological and historical records do not provide evidence that the museum as it is known today developed in such early times, nor does the word museum support this, despite its classical origin. Nevertheless, the collection of things that might have religious, magical, economic, aesthetic, or historical value or that simply might be curiosities was undertaken worldwide by groups as well as by individuals. In the Greek and Roman empires the votive offerings housed in temples , sometimes in specially built treasuries, are but one example: they included works of art and natural curiosities, as well as exotic items brought from far-flung parts of the empires, and they were normally open to the public, often upon payment of a small fee. Closer to the concept of a museum was the Greek pinakotheke , such as that established in the 5th century bce on the Acropolis at Athens, which housed paintings honouring the gods. Nor was there a lack of public interest in art at Rome. Indeed, art abounded in the public places of Rome, but there was no museum. The inaccessibility of the collection of more than one Roman emperor was the subject of public comment, and Agrippa , a deputy of Augustus, commented in the 1st century bce to the effect that paintings and statues should be available to the people.",
  "In Asia veneration of the past and of its personalities also led to the collection of objects. Collecting commenced at least as early as the Shang dynasty , which ruled China from approximately the mid-16th to the mid-11th century bce , and it was well developed by the Qin dynasty (3rd century bce )—as attested by the tomb of the Qin emperor  Shihuangdi , near Xi’an (Sian), which was guarded by an army of terra-cotta warriors and horses. Together with other grave goods, these objects are preserved on-site in the Museum of Qin Figures. The palace of Shihuangdi is recorded as having many rare and valuable objects.",
  "Successive Chinese emperors continued to promote the arts, manifest in fine works of painting , calligraphy , metalwork , jade , glass , and pottery . For example, the Han emperor Wudi (reigned 141/140–87/86 bce ) established an academy that contained paintings and calligraphies from each of the Chinese provinces, and the last Han emperor, Xiandi (abdicated 220 ce ), established a gallery containing portraits of his ministers.",
  "In Japan the Tōdai Temple, housing a colossal seated bronze statue of the Great Buddha (Daibutsu), was built in the 8th century at Nara. The temple’s treasures still can be seen in the Shōsō-in repository there.",
  "At about the same time, Islamic communities were making collections of relics at the tombs of early Muslim martyrs. The idea of waqf , formalized by Muhammad himself, whereby property was given for the public good and for religious purposes, also resulted in the formation of collections. In tropical Africa the collection of objects also has a long history, as instanced in wayside shrines and certain religious ceremonies. Similar collections were made in many other parts of the world.",
  "In medieval Europe collections were mainly the prerogative of princely houses and the church. Indeed, there was often a close link between the two, as in the case of the fine treasures of the emperor Charlemagne , which were divided among a number of religious houses early in the 9th century. Such treasures had economic importance and were used to finance wars and other state expenses. Other collections took the form of alleged relics of Christendom, in which there was a considerable trade. At this time Europe’s maritime links with the rest of the world were largely through the northern Mediterranean ports of Lombardy and Tuscany, which, together with the ecclesiastical significance of Rome, brought considerable contact between the Italian peninsula and the Continent. There is evidence of the movement of antiquities, and of a developing trade in them, from the 12th century. Henry of Blois , bishop of Winchester, is reported to have bought ancient statues during a visit to Rome in 1151 and to have dispatched them to England, a journey of about one month’s duration.",
  "The movement of antiquities was not confined to those of Italy. Exotic material from other areas entering Italian ports soon found its way into royal collections, while the Venetian involvement in the Fourth Crusade early in the 13th century resulted in the transfer of the famous bronze horses from Constantinople (now Istanbul) to the San Marco Basilica in Venice.",
  "  The influences that led to the Renaissance were already at work in Italy, and, as a result, the first great collections began to form. A reawakening of interest in Italy’s classical heritage and the rise of new merchant and banking families at this northern Mediterranean gateway to the Continent produced impressive collections of antiquities, as well as considerable patronage of the arts. Outstanding among the collections was that formed by Cosimo de’ Medici in Florence in the 15th century. The collection was developed by his descendants until it was bequeathed to the state in 1743, to be accessible “to the people of Tuscany and to all nations.” In order to display some of the Medici paintings, the upper floor of the Uffizi Palace (designed to hold offices, or uffizi ) was converted and opened to the public in 1582. Indeed, many of the palaces holding such collections were open to visitors and were listed in the tourist guides of the period.",
  "Elsewhere in Europe, royal collections were developed. King Matthias I of Hungary maintained his paintings at Buda and kept Roman antiquities at Szombathely Castle during the 15th century. Maximilian I of Austria acquired a collection for his castle in Vienna. Samples of both scientific material and art were featured in the “green vaults” of the Dresden palace of Augustus of Saxony, while the archduke Ferdinand of Tirol housed a varied collection that included Benin ivories and Chinese paintings at Ambras Castle near Innsbruck. Other notable central European collections included those of the Holy Roman emperor Rudolf II at Prague and of Albert V, duke of Bavaria, who from 1563 to 1571 had buildings designed and erected to house his collections in Munich. The collection of the Polish king Sigismund II Augustus was housed at Wawel Castle, Kraków.",
  "Royal patronage was crucial to the encouragement of the arts at this time. Rudolf II sponsored astrologers and alchemists as well as artists. Francis I of France invited famed French and Italian craftsmen and artists, including Leonardo da Vinci , to rebuild and embellish his château at Fontainebleau, and there he kept his outstanding collection of art. In England Henry VIII gave his attention to music and thus did not form a collection of significance. He was responsible, however, for the appointment in 1533 of a King’s Antiquary, whose task was to list and describe the antiquities of the country. (Similar appointments were made subsequently by the Habsburg monarchs and by King Gustav II Adolf of Sweden.) It was not until the 17th century that the first important royal collection was formed in England by Charles I , only to be much dispersed after his execution in 1649. Following the Restoration , Charles II also maintained a collection, but this was lost in a fire at Whitehall Palace in 1698. Early in the reign of Charles II, displays of arms and armour were being prepared at the Tower of London ; clearly intended for the public benefit, these displays marked an important step in the development of a museum of the Royal Armouries .",
  "The developing interest in human as well as natural history in the 16th century led to the creation of specialized collections. In Italy alone more than 250 natural history collections are recorded in that century, including the fine herbarium of Luca Ghini at Padua and the more eclectic collection of Ulisse Aldrovandi at Bologna. Other notable natural history collections of the time elsewhere in Europe were those of Conrad Gesner , Félix Platter, and, a little later, the John Tradescants , father and son. Among the specialized historical collections were those of portraits of great men assembled by Paolo Giovio at Como, the archaeological collection of the Grimani family of Venice, and the fine collection of illuminated manuscripts gathered by Sir Robert Cotton in England. A number of the latter had been acquired from monasteries closed during the Reformation . In due time these various collections found their way into museums. So did the collections of Ferrante Imperato of Naples, Bernard Paludanus (Berant ten Broecke) of Amsterdam, and Ole Worm of Copenhagen.",
  "A collection such as these was normally known as a cabinet in 16th-century England and France, while in German-speaking Europe the equivalents Kammer or Kabinett were used. Greater precision was sometimes applied, the terms Kunstkammer and Rüstkammer , for example, referring respectively to a collection of art and a collection of historical objects or armour. Natural specimens were to be found in a Wunderkammer or Naturalienkabinett . In England the term gallery , borrowed from Italian galleria , referred to a place where paintings and sculpture were exhibited. One Italian collection of natural specimens was called a museo naturale .",
  "In 1565 Samuel van Quicheberg published a work on the nature of collections, advocating that they represent a systematic classification of all materials in the universe. His view reflects a spirit of system and rational inquiry that had begun to emerge in Europe. Collections of natural and artificial objects were to play an important part in this movement. This can be seen in antiquarian studies, in the work of Nicolas-Claude Fabri de Peiresc at Aix-en-Provence in France early in the 17th century, for example, or in the classification of the plant and animal kingdoms by Carolus Linnaeus a century later. For the less-specialized collector, works such as Museographia , by Casper F. Neickel (pseudonym of Kaspar Friedrich Jenequel), published at Leipzig in 1727, were generally available to aid in classification, care of a collection, and the identification of potential sources from which collections might be developed.",
  "Another product of the age was the learned society, many of which were established to promote corporate discussion, experimentation, and collecting. Some commenced as early as the 16th century. Better-known societies, however, date from later years; examples are the Royal Society in London (1660) and the Academy of Sciences in Paris (1666). By the turn of the century, organizations covering other subject areas were being established, among them the Society of Antiquaries of London (1707), and learned societies were also appearing in provincial towns. This was the beginning of a movement that, through the collections formed and the promotion of their subjects, contributed much to the formation of museums in the modern meaning of the term.",
  "Many private Renaissance collections were symbols of social prestige and served as an important element in the traditions of the nobility and the ruling families, but over time a developing spirit of inquiry brought to collecting a different meaning and purpose as well as a much wider group of practitioners. These new collectors, concerned with enjoyment and study and the advancement of knowledge, while equally concerned with the continuity of their collections, had no such guarantee of succession. If this guarantee could not be found in the family unit, then the route of succession had to be found elsewhere, and the corporate unit provided greater security. Furthermore, if knowledge were to have lasting significance, it had to be transmitted in the public domain. It is the transferral of collections from the private to the public domain that is the subject of this section.",
  "The earliest recorded instance of a public body receiving a private collection occurs in the 16th century with the bequest of Domenico Cardinal Grimani to the Venetian republic in 1523, to be supplemented in 1583 with a further bequest from the Grimani family. The motivation seems to have been both to promote scholarship and to grace the seat of government. At the time of the Reformation in Switzerland, material was transferred from ecclesiastical establishments to the authorities of Zürich and other municipalities, eventually forming important components of their museums. The city of Basel, concerned that the fine cabinet of Basilius Amerbach might be exported, purchased it in 1662 and nine years later arranged for its display in the university library. In 1694 the head abbot of Saint-Vincent-de-Besançon in France bequeathed his collection of paintings and medallions to the abbey to form a public collection. To some extent the emerging learned societies also were becoming repositories for such collections, in addition to developing their own. In the case of Ole Worm’s collection, as in other cases, lack of interest among the owner’s family after his death resulted in the transfer of the collection in 1655 to the royal cabinet in Copenhagen.",
  "The first corporate body to receive a private collection, erect a building to house it, and make it publicly available was the University of Oxford. The gift was from Elias Ashmole; containing much of the Tradescant collection, it was made on the condition that a place be built to receive it. The resulting building, which eventually became known as the Ashmolean Museum, opened in 1683. (The Ashmolean later moved to another new building nearby, and its original building is now occupied by the Museum of the History of Science .)",
  "  The 18th century saw the flowering of the Enlightenment and the encyclopaedic spirit, as well as a growing taste for the exotic. These influences, encouraged by increasing world exploration, by trade centred on northwestern Europe, and by developing industrialization, are evident in the opening of two of Europe’s outstanding museums, the British Museum, in London, in 1759 and the Louvre Museum , in Paris, in 1793. The British Museum was formed as the result of the government’s acceptance of responsibility to preserve and maintain three collections “not only for the inspection and entertainment of the learned and the curious, but for the general use and benefit of the public.” These were housed at Montagu House, in Bloomsbury , specially purchased for this purpose. The collections had been made by Sir Robert Cotton, Robert Harley, 1st earl of Oxford , and Sir Hans Sloane . The Cotton and Harley collections were composed mainly of manuscripts; since 1998 these have been housed in a separate building, the British Library . The Sloane collection, however, included his specimens of natural history from Jamaica and classical, ethnographic , numismatic , and art material, as well as the cabinet of William Courten, comprising some 100,000 items in all. Although public access to the British Museum was free of charge from the outset, for many years admission was by application for one of the limited number of tickets issued daily. Despite this, François de la Rochefoucauld, visiting from France in 1784, observed with approval that the museum was expressly “for the instruction and gratification of the public.”",
  "  It was a matter of public concern in France that the royal collections were inaccessible to the populace, and eventually a selection of paintings was exhibited at the Luxembourg Palace in 1750 by Louis XV . Continuing pressure, including Diderot’s proposal of a national museum, led to arrangements for more of the royal collection to be displayed for the public in the Grande Galerie of the Louvre palace. However, when the Grande Galerie was opened to the public in 1793, it was by decree of the Revolutionary government rather than royal mandate, and it was called the Central Museum of the Arts. There were many difficulties, and the museum was not fully accessible until 1801. The collection at the Louvre grew rapidly, not least because the National Convention instructed Napoleon to appropriate works of art during his European campaigns; as a result, many royal and noble collections were transported to Paris to be shown at what became known as the Musée Napoléon. The return to its owners of this looted material was required by the Congress of Vienna in 1815. Nevertheless, the Napoleonic episode awakened a new interest in art and provided the impetus that made a number of collections available to the public.",
  "The extensive collections of the Vatican also saw considerable reorganization during the 18th century. The Capitoline Museum (now comprising several buildings and called the Capitoline Museums ) was opened to the public in 1734, and the Palazzo dei Conservatori was converted to a picture gallery in 1749. The Pio-Clementino Museum, now part of the museum complex in Vatican City, opened in 1772 to house an extensive collection of antiquities. The Neoclassical architecture of this building set a standard that was emulated in a number of European countries for half a century.",
  "  By this time a number of new collections were available to the public in Europe. Many of these resulted from royal and noble patronage, while others were created on the initiative of public authorities. The Prado Museum in Madrid dates from 1785, when Charles III commissioned the erection of a new building to serve as a museum of natural science. Construction was interrupted by the Napoleonic Wars , and when the building opened in 1819 it instead housed an art gallery to display part of the royal collection. In Prussia Frederick William III had a picture gallery built in Berlin to house some of his collection, and the gallery was opened to the public in 1830. This was the beginning of a remarkable complex that developed over the next century to house various portions of the national collection on a single site, now known as the Museuminsel. Another development in Germany was the erection of the Alte Pinakothek (1836) at Munich to display the painting collections of the dukes of Wittelsbach . This building was designed to exacting standards by Leo von Klenze , who was also responsible for the New Hermitage, one of the five buildings of the Hermitage in St. Petersburg, where in 1852 Nicholas I made available to the public the major art collection of the Russian tsars. The Royal Museums in Brussels originated by royal warrant in 1835 in the interests of historical study and the arts. In the Netherlands a national art gallery was opened at the Huis ten Bosch in 1800; it was later moved to Amsterdam and eventually became the Rijksmuseum (State Museum). The National Gallery in London, founded on the personal collection of the merchant and philanthropist John Julius Angerstein, opened initially at Angerstein’s house in 1824. In 1838 it moved to purpose-built premises on Trafalgar Square .",
  "Before the end of the 18th century the phenomenon of the museum had spread to other parts of the world. In 1773 in the United States the Charleston Library Society of South Carolina announced its intention of forming a museum. Its purpose was to promote the better understanding of agriculture and herbal medicine in the area. Another early institution, the Peale Museum, was opened in 1786 in Philadelphia by the painter Charles Willson Peale . The collections rapidly outgrew the space available in his home and were displayed for a time at Independence Hall. After a number of vicissitudes the collections were finally dispersed in the middle of the 19th century, but not before the fine Chinese collection had formed a major exhibition in London.",
  "European colonial influence was responsible for the appearance of museums elsewhere. In Jakarta, Indonesia, the collection of the Batavia Society of Arts and Science was begun in 1778, eventually to become the Central Museum of Indonesian Culture and finally part of the National Museum. The origins of the Indian Museum in Kolkata (formerly Calcutta) were similar, based on the collections of the Asiatic Society of Bengal , which commenced in 1784. In South America a number of national museums originated in the early 19th century: the Argentine Museum of Natural Sciences in Buenos Aires was founded in 1812, and Brazil’s National Museum in Rio de Janeiro, which owes its origin to a selection of paintings presented by John VI , exiled king of Portugal, was opened to the public in 1818 (a fire destroyed much of the collection in 2018). Among others are the National Museum in Bogotá, Colombia (1824), and the national museums of natural history in Santiago, Chile (1830), and Montevideo, Uruguay (1837). In Canada the zoological collection of the Pictou Academy in Nova Scotia (founded in 1816) was probably opened to the public by 1822. In South Africa a museum based on the zoological collection of Andrew (later Sir Andrew) Smith was founded in Cape Town in 1825. It is likely that an amateur naturalist and diplomat, Alexander Macleay, was responsible for the initiatives that led to the opening in 1829 of what was to become the Australian Museum in Sydney.",
  "By the early 19th century, then, the granting of public access to formerly private collections had become more common. What followed for approximately the next 100 years was the founding, by regional and national authorities throughout the world, of museums expressly intended for the public good.",
  "Contributing to the establishment of museums in the early 19th century was a developing national consciousness, particularly among the peoples of central Europe. In 1807 the National Assembly of Hungary founded a national museum at Pest from collections given to the nation five years earlier by Count Ferenc Széchenyi. In Prague the natural history collections of the counts of Sternberg and other noble families were formed into a museum and opened in 1823 with the intention of promoting national identity. The Moravian Museum in Brno opened in 1817, and others followed at Zagreb and Ljubljana in 1821. At the centre of the Austro-Hungarian Empire , in Vienna, the imperial collections acted as the national museum; regional museums were formed at Graz, Innsbruck, and Salzburg during the period 1811–34. In Nürnberg the Germanisches Nationalmuseum was directed by a proponent of a unified Germany, Hans von Aufsess, and by mid-century most of the German states had a museum. Farther north, in Poland, a national museum, although conceived in 1775, was not established until 1862, but Princess Izabella Czartoryska maintained a museum in the castle park at Puławy, near Warsaw, for eight years at the beginning of the 19th century, and two private collections were opened to the public at about the same time in Wilanów and Warsaw.",
  "Increasing interest in antiquities led to the excavation of local archaeological sites and had an impact on museum development. In the years 1806–26, in Russian lands to the north of the Black Sea, four archaeological museums were opened, at Feodosiya, Kerch, Nikolayev, and Odessa (all now located in Ukraine). The Museum of Northern Antiquities was opened in Copenhagen in 1819 (it was there that its first director, Christian Jürgensen Thomsen , developed the three-part system of classifying prehistory into the Stone , Bronze , and Iron ages). This museum was merged with three others (of ethnography, antiquities, and numismatics) in 1892 to form the National Museum of Denmark. In France the Museum of National Antiquities opened at Saint-Germain-en-Laye late in the 18th century. It still acts as a national archaeological repository, as does the State Historical Museum in Stockholm, which houses material recovered as early as the 17th century. The national archaeological museum in Greece was started at Aeginia in 1829. Certain European countries, however—the United Kingdom and Germany, for example—do not have well-developed national collections of antiquities, and as a result regional museums in those countries are the richer.",
  "In Britain, social reforms to overcome problems resulting from industrialization contributed to the development of municipal museums. The support of museums by local authorities was seen as a means of providing both instruction and entertainment to the increasingly urbanized population and became the subject of special legislation in 1845. Museums were also viewed as a vehicle for promoting industrial design and scientific and technical achievement. Such promotion was the motivation behind the precursor of the Victoria and Albert Museum (for decorative arts ) and the Science Museum , both in South Kensington, London; the founding collections were acquired from the Great Exhibition of 1851—the first of the world’s fairs . International exhibitions have contributed significantly to the formation of a number of museums since then, including the Technical Museum of Industry and Trade in Vienna and the Palace of Discovery in Paris.",
  "  The Smithsonian Institution in Washington, D.C., came into existence through the remarkable bequest of nearly one-half million dollars from James Smithson , an Englishman. He wished to see established in the United States an institution “for the increase and diffusion of knowledge among men.” In 1846 the U.S. Congress accepted his bequest and passed legislation establishing the Smithsonian as an institution charged with representing “all objects of art and…curious research…natural history, plants, and geological and mineralogical specimens” belonging to the United States. The U.S. National Museum opened in 1858 as part of the Smithsonian’s scientific program and formed the first of its many museums, most of which stand along the Mall in Washington, D.C.",
  "The first of the historic house museums to be developed by a local society (a type characteristic of the United States) was Hasbrouck House at Newburgh, New York, which had served as the final headquarters of George Washington during the American Revolution . The purchase of the house by the state of New York in 1850 established another precedent, whereby public authorities provide and maintain museum buildings while a body of trustees assumes responsibility for the collections and staff. Two other well-known museums, both in New York City, provide examples of this system: the American Museum of Natural History, founded in 1869, and the Metropolitan Museum of Art, opened in 1870.",
  "  The middle of the 19th century saw the establishment of a number of other well-known museums. In Canada the collection of the National Museum commenced in 1843 in Montreal as part of the Geological Survey, while the precursor of the Royal Ontario Museum in Toronto, the Ontario Provincial Museum, was founded in 1855. In Australia the National Museum of Victoria was established at Melbourne in 1854; it was followed by the National Gallery of Victoria in 1861 and the Science Museum of Victoria in 1870. In Cairo the Egyptian Museum was established in 1858. These all followed the European model, and even in South America art collections tended to be predominately of European origin, to the neglect of indigenous works of art.",
  "  It was during the second half of the 19th century that museums began to proliferate in Europe; civic pride and the free education movement were among the causes of this development. About 100 opened in Britain in the 15 years before 1887; some 50 museums were established in Germany in the five years from 1876 to 1880; and, with the opening of the magnificent Kunsthistorisches Museum in Vienna in 1891, most of the imperial Habsburg collections were finally housed and displayed in one place. This was also a period of innovation. The Liverpool Museums in England, for example, began circulating specimens to schools for educational purposes; panoramas and habitat groups were used to facilitate interpretation. As first gas lighting and then electric lighting became available, museums extended their hours into the evenings to provide service to those unable to visit during the day.",
  "The increase in the number of museums was not, however, a peculiarity of Europe or North America. In South America particularly, new museums were founded both in the capital cities and in the provinces. Some of these were provided by universities, as in the case of the Geological Museum in Lima, Peru (1891), or the Geographical and Geological Museum at São Paulo, Brazil (1895). Others were created by provincial bodies: the regional museums at Córdoba (1887) and Gualeguaychu (1898), both in Argentina, and at Ouro Prêto, Brazil (1876); the Hualpen Museum in Chile (1882); and the Municipal Museum and Library at Guayaquil, Ecuador (1862). New specialist national museums also appeared in certain countries, while at Tigre, in Argentina, a maritime museum was founded in 1892. Early in the following century, memorial museums were created, including those dedicated to Bartolomé Mitre , a former president of Argentina, in Buenos Aires (1906) and to Simón Bolívar in Caracas, Venezuela (1911).",
  "  By this time the Indian Museum , in Kolkata, and what is now the National Museum, in Jakarta, were well-established institutions in Asia, but a number of new museums were appearing as well. In Japan a museum to encourage industry and the development of natural resources was opened in 1872; this provided the basis for the present-day Tokyo National Museum and National Science Museum (also in Tokyo). Although some learned-society museums existed in China in the late 19th century, the first museum in the strict sense of the word was the Nantong Museum in Jiangsu province, founded in 1905, to be followed within a decade by the National Museum of Chinese History in Beijing (the museum merged with the Museum of the Chinese Revolution in 2003 to create the National Museum of China ) and the Beijiang Museum in Tianjin (now Tianjin Natural History Museum). The collections established in the Grand Palace at Bangkok in 1874 eventually became the Bangkok National Museum. The National Museum of Sri Lanka, in Colombo, opened to the public in 1877; the Sarawak Museum (now in Malaysia) opened in 1891; and the Peshawar Museum, in Pakistan, opened in 1907.",
  "In central and southern Africa, museums were founded early in the 20th century. Zimbabwe’s national museums at Bulawayo and Harare (then known as Salisbury) were founded in 1901, the Uganda Museum originated in 1908 from collections assembled by the British District Commissioners, and the National Museum of Kenya (now part of the National Museums of Kenya) in Nairobi was commenced by the East Africa and Uganda Natural History Society in 1909. Mozambique’s first museum, the Alvaro de Castro Natural History Museum in Maputo, was founded in 1913. Meanwhile in North Africa the Egyptian Museum in Cairo (founded 1835) had been relocated to its new building in 1902, and certain of the collections had been transferred to form two new institutions: the Museum of Islamic Art (1903) and the Coptic Museum (1908). In South Africa there was steady museum development in a number of the provinces—for example, in Grahamstown (1837), Port Elizabeth (1856), Bloemfontein (1877), Durban (1887), Pretoria (1893), and Pietermaritzburg (1903).",
  "The first half of the 20th century saw the profound social consequences of the two World Wars, the Russian Revolution of 1917 , and periods of economic recession. For museums in Europe this was a period of major reassessment. Governments, professional associations, and other organizations reviewed the role of museums in a changing society and made a number of suggestions to improve their service to the public. In some countries new approaches were developed, in others museums continued to reflect their diverse ancestry, and some decades were to pass before resources generally became available for the implementation of major changes.",
  "Change was notably radical in Russia, where collections and museums were brought under state control following the Russian Revolution of 1917. Vladimir Lenin’s belief that culture was for the people and his efforts to preserve the country’s cultural heritage led to a trebling of the number of museums in 20 years. Not only was much of the country’s artistic, historic, and scientific heritage brought together in museums, but other types of museums emerged as well. Particular attention was given to amassing material related to Russia’s three revolutions. The earliest museum to result from such collections opened in 1919 in the Winter Palace at Petrograd (St. Petersburg); after 1924 the Central Museum of the Revolution in Moscow became the focal point for these collections. Another type was the memorial museum housing the personal effects of well-known figures. Sometimes, as with the Central Lenin Museum in Moscow (1936–93), they were means of communicating political propaganda.",
  "In Germany a large number of regional museums were established after World War I to promote the history and important figures of the homeland, and they undoubtedly encouraged the nationalistic tendencies that led to the Nazi era.",
  "In the main, however, museums were not well organized to meet changing social conditions. In Britain a diversity of providers—government at both national and local levels, universities, societies, companies, and individuals—did not encourage cohesive policy making at a national level. In central Europe associations attempted to develop and run individual museums, but they were unable to provide the necessary resources. Outside Europe the influence of social change was less marked, and there was little evidence that museums were being organized as a national force. In the United States museum development was influenced by a desire to establish a coherent past—a movement that was widely encouraged through private patronage.",
  "In the industrialized world new types of museums appeared. Some nations made conscious attempts to preserve and display structures and customs of their more recent past. Examples, following Sweden’s pioneering re-erection of significant buildings, include the open-air museums at Arnhem, Netherlands (Netherlands Open Air Museum; opened 1912), and at St. Fagans, Wales (the Museum of Welsh Life; opened as the Welsh Folk Museum in 1948). The preservation and restoration of buildings or entire settlements in situ also began; particularly well known is Colonial Williamsburg, founded in Virginia in 1926. A new type of science museum also emerged, in which static displays of scientific instruments and equipment were replaced with demonstrations of the applications of science. London’s Science Museum, founded in 1857, eventually was moved to specially built premises in 1919 and is now one of three museums that constitute the National Museum of Science and Industry. Similarly, the Deutsches Museum (German Museum) in Munich was transferred to new premises in 1925, and its growth continued throughout the century. Both established worldwide reputations for excellence in interpreting science and technology for the general public.",
  "The years immediately following World War II were a period of remarkable achievement for museums. This was reflected both in international and national policy and in the individual museums as they responded to a rapidly changing, better-educated society. Museums became an educational facility, a source of leisure activity, and a medium of communication. Their strength lay in the fact that they were repositories of the “real thing,” which—unlike the surrounding world of plastics, reproduced images, and a deteriorating natural and human environment—could inspire and invoke a sense of wonder, reality, stability, and even nostalgia.",
  "In Europe particularly there was a period of postwar reconstruction. Many art treasures had been removed to places of safety during the war, and they now had to be recovered and redisplayed; buildings also had to be refurbished. In some cases museums and their collections had been destroyed; in others collections had been looted (though in some cases restitution followed). Reconstruction provided opportunities for the realization of some of the ideas that had been advanced earlier in the century. A new approach emerged in which curators in the larger museums became members of a team comprising scientists as conservators, designers to assist in exhibition work, educators to develop facilities for both students and the public, information scientists to handle the scientific data inherent in collections, and even marketing managers to promote the museum and its work. There was a perceptible shift from serving the scholar, as befits an institution holding much of the primary evidence of the material world, to providing for a lay public as well. As a result of such innovations, museums found a new popularity and attracted an increasing number of visitors. Many of the visitors were tourists, and governments, particularly in certain European countries, soon acknowledged the contribution of museums to the economy.",
  "Statistics from the United States give an indication of the increase in the number of museums and in museum visiting. Of some 16,000 museums reported in the early 21st century, almost 90 percent had been founded since 1950 and more than 70 percent since 1970. According to the American Alliance of Museums, American museums had nearly 850 million visits in 2008; in 1988 the recorded figure was 566 million. Some of the oldest established museums in Europe—such as the British Museum, the Louvre, and the Hermitage—each regularly attract more than 5 million visitors a year. Some science and technology museums are even more popular.",
  "  Among other factors that have contributed to the development of museums since the mid-20th century is an increased awareness of the environment and the need to preserve it. Many sites of scientific significance have been preserved and interpreted, sometimes under the aegis of a national park service, and historic sites and buildings have been restored, the latter sometimes being used as museums. This has led to the development of historic and natural landscapes as museums, such as the renovation of Mystic Seaport in Connecticut as a maritime museum, the use of Ironbridge Gorge as a museum to interpret the cradle of the Industrial Revolution in England, and the restoration of the walled medieval cities at Suzdal and Vladimir in Russia. In Australia the heyday of the gold rush has been re-created in the form of the Sovereign Hill Historical Park, at the gold-mining town of Ballarat. Gorée Island, off the Senegal coast, served as a major entrepôt for the Atlantic slave trade and has been restored as a historic site with a number of supporting museums.",
  "A related development is the ecomuseum, such as the Ecomuseum of the Urban Community at Le Creusot–Montceau-les-Mines in France. There a bold experiment involves the community as a whole, rather than specialists, in interpreting the human and natural environment, thereby generating a better understanding among its inhabitants of the reasons for cultural, social, and environmental change. Some of these projects have involved the acquisition and preservation of massive artifacts, but perhaps no undertaking has been as spectacular as the recovery from the seabed of ships such as the Song dynasty ship from Quanzhou, the Vasa , the Mary Rose , and the Hanseatic cog from Bremerhaven; all these vessels are now preserved in museums in China, Sweden, England, and Germany, respectively.",
  "  Contemporary museum development has been much influenced by changing policies in public sector finance. In many countries the contribution of public funds to museums has remained static or has fallen, so that museums’ governing bodies and directors have had to seek funding from alternative sources. This has not only affected the way museums are organized but also accentuated the need for marketing and fund-raising expertise. Thus, with Russian state museums having acquired greater budgetary autonomy since the collapse of the Soviet Union , the Hermitage in St. Petersburg has drawn on international expertise and financing to conduct major renewal work. In the United Kingdom the National Museum of Arms and Armour raised substantial funding from the private sector to build its new Royal Armouries Museum in Leeds; in addition, it established a public company to operate the museum after it opened in 1996.",
  "Despite constraints in public funding, governments were not inactive in the second half of the 20th century. In 1982, for instance, Australia opened its National Gallery of Art in Canberra. Also in Australia the National Gallery of Victoria was developed as part of Melbourne’s arts complex, while Sydney’s Powerhouse Museum (1988) introduced a major attraction in that city. In Paris the Pompidou Centre (1977) brought together several public collections of modern art that had been previously held across a number of galleries. In addition to housing a collection of modern art, the building also offers space for special exhibitions and other cultural activities. In an effort to enlarge its capacity, the Louvre renovated its building and added the now iconic glass pyramid entrance to the museum in the late 1980s and early ’90s. The Museum of London, amalgamating the collections of two previous museums, was established in 1975 to tell the story of the capital and its immediate environs. In 1964 the National Museum of Anthropology, just one of a fine complex of museums in Mexico City, opened a magnificent building to display the country’s archaeological richness. The Smithsonian Institution in Washington, D.C., added the Hirshhorn Museum and Sculpture Garden in 1974 and the National Air and Space Museum in 1976. Among several architecturally notable museums are the Canadian Museum of Civilization (1989; now Canadian Museum of History) at Hull, Quebec, and the Guggenheim Museum Bilbao (1997) in Bilbao, Spain.",
  "Many buildings of historical significance were adapted to house museums. Examples include the Musée d’Orsay, formerly a major railroad station in Paris, which was reopened in 1986 as a national museum of the 19th century, and Tate Modern (2000), an art museum housed in a refurbished power station on the South Bank in London. Other buildings and building sites of historical and cultural significance have themselves become museums.",
  "The museum-building impulse was not restricted to industrialized countries. For example, a desire to preserve their local history led many Caribbean islands to establish small museums, and several African states gave high priority to the provision of museums. In Nigeria, for instance, museums were established in all the principal cities by its National Museums and Monuments Commission to assist in developing cultural identity and to promote national unity. The Jos Museum, one of the earliest of these, also administers a museum of traditional buildings, while others developed workshops where traditional crafts could be demonstrated. Crafts are also a feature of the National Museum in Niamey, Niger, and products of these workshops are exported to Europe and North America.",
  "  Following the success of Guggenheim Bilbao, eye-catching buildings seemed to become the norm for cultural institutions at the beginning of the 21st century, especially as museums recognized the need to compete for audience attention in the advent of new media and entertainment. Visitor experience increasingly became a priority. Public programming, including lectures, concerts, and exercise sessions, expanded, as did the need for additional public spaces for gathering, dining, and retail. Many established museums commissioned additions in the 21st century not necessarily for the display of objects but to accommodate changing visitor demands. The Quadracci Pavilion, Santiago Calatrava ’s addition for the Milwaukee Art Museum , includes an exhibition space, but it primarily houses an entrance hall, auditorium, gift shop, and two cafes. The Switch House, Herzog & de Meuron ’s addition (2016) for Tate Modern, designates only 40 percent of its space for the display of art.",
  "  As museums contended with changing visitor needs in the early 21st century, they also attempted to move away from what had come to be seen as outdated Eurocentric displays and the exclusionary practices of the past, a shift that had begun in the previous century. Two museums constructed in the late 2010s—the Louvre Abu Dhabi (2017), a Louvre outpost in the United Arab Emirates , and the Smithsonsian’s National Museum of African American History and Culture (2016; NMAAHC) in Washington, D.C.—demonstrated differing approaches for representing often marginalized cultures. The NMAAHC promoted a multiculturalist route, providing an exclusive space for African Americans to tell their history and to promote their customs. The Louvre Abu Dhabi, on the other hand, advanced a holistic plan, wherein the arts of all civilizations are displayed together around a theme or era so that each culture has an equal platform. Some scholars, however, acknowledge that neither method fully resolves the problem: the multicultural method practiced by the NMAAHC has been criticized for maintaining the self-other dichotomy of the colonial period, while the thematic narrative of the Louvre Abu Dhabi has long been criticized for downplaying unsavory events of history, notably eras of colonialism and slavery, to mere episodes in the great scheme of human existence.",
  "  Given their diverse origins, varying philosophies, and differing roles in society, museums do not lend themselves to rigid classification. Certain museums provide for a specialist audience—for example, children, societies, universities, or schools. Some have particular responsibilities for a defined geographic area, such as a city or region. Other museums—especially ones where the primary ethos is nationalistic, religious, or political—may offer unusual perspectives, resulting in alternative interpretations of artistic, historical, or scientific collections.",
  "Sometimes museums are classified according to the source of their funding (e.g., state, municipal, private), particularly in statistical work. Classifying by source of funding, however, fails to indicate the true character of the museums’ collections. For example, institutions funded by the national government—national museums—may hold outstanding international collections, as do the British Museum , the Hermitage , and the Louvre ; they may hold specialized collections, as do a number of the national museums of antiquities on the European continent; or these may have an essentially local character, as does the Smithsonian Institution ’s Anacostia Neighborhood Museum in Washington, D.C.",
  "An analysis of museums based on the nature of their collections, although it fails to indicate disparities of scale and quality, does have the merit of distinguishing between general and specialized museums. In addition, by emphasizing collections, this method focuses on the very raison d’être of museums. In this article, museums are classified into five basic types—general, natural history and natural science, science and technology, history , and art . A more recent kind of museum—the virtual museum —transcends all other types by virtue of its unique electronic presentation and is discussed as well.",
  "General museums hold collections in more than one subject and are therefore sometimes known as multidisciplinary or interdisciplinary museums. Many were founded in the 18th, 19th, or early 20th century. Most originated in earlier private collections and reflected the encyclopaedic spirit of the times. Certain general museums reflect the influence of cultural contact made through trade. Some museums hold a number of important specialized collections that would qualify them to be grouped in more than one category of specialization. This is true particularly of many of the large general museums, which may have collections in one or more fields equal to if not exceeding both the quantity and quality of material exhibited in a specialized museum. Some national museums display general collections within their main building; indeed, many commenced in this fashion, but the necessity of finding additional space later caused a division of the collections and encouraged the growth of specialized museums.",
  "Most common among general museums are those which serve a region or a locality. Many of these owe their foundation to civic pride and a desire to promote knowledge of the area. They are widespread in eastern and western Europe and are found as well in India, Australia, New Zealand, and North and South America. Their prime responsibility is to reflect the natural and human history, traditions, and creative spirit of the area. In many cases the community thus served is culturally homogeneous. Where it is not, the museum may develop specific programs to foster mutual understanding among the diverse peoples. In cities that have a sizable immigrant population, such as, for example, Bradford or Leicester in England, the regional museum has engaged actively in such work. Sometimes special exhibitions prepared by the national museum or other agencies provide opportunities at regional museums for the community to appreciate the wider aspects of the national or even international heritage.",
  "The general museum, particularly at the regional or local level, faces severe problems because of the high cost of employing the large numbers of specialists necessary to care for the variety of collections involved, particularly if a strong research program is maintained. In some museums research has diversified as curators, particularly in archaeology , history, and the natural sciences, have become involved in recording the environment of an area or in preparing data banks in order to advise planners and developers who are considering projects to be conducted on sites of scientific or historical interest. Other general museums have maintained their more traditional roles but have concentrated their efforts on public services, as at the Kanazawa Bunko Museum in Yokohama, Japan, where a multidisciplinary approach is apparent in its exhibitions. Among other developments fostered by many regional and local museums are the erection of on-site museums to interpret archaeological or natural features; the provision of heritage centres, particularly in urban areas, to tell the story of an aspect of the historic environment; or, as an extramural activity of the museum, the development of heritage and nature trails.",
  "Certain museums provide for a particular audience, often acquiring general collections to suit the purpose. One of these is the children’s museum (also frequented by adults), which routinely now features interactive exhibits. Notable examples include the Brooklyn Children’s Museum in New York City, the Children’s Museum in Boston, the enormous Children’s Museum of Indianapolis in Indiana (situated on a 29-acre [12-hectare] campus and attracting more than one million visitors annually), and the National Children’s Museum of New Delhi. At the opposite end of the spectrum are museums devoted to esoterica, designed for the specialist, or museums founded exclusively for an adult audience, such as the Museum of Sex, which opened to much controversy in New York City in 2002.",
  "Museums of natural history and natural science are concerned with the natural world; their collections may contain specimens of birds, mammals, insects, plants, rocks, minerals, and fossils. These museums have their origins in the cabinets of curiosities built up by prominent individuals in Europe during the Renaissance and Enlightenment. Specimens from the natural world were also included (albeit as part of an encyclopaedic collection) in some of the earliest museums: the Ashmolean Museum at Oxford, England, the British Museum in London, and the National Museum of Natural History in Paris. With the development of the natural sciences in the 19th century, museums exhibiting objects from the natural world flourished and their number multiplied. In the United States and Latin America their collections often included objects of physical and social anthropology as well as the natural sciences. Later, natural science museums responded to new trends of nature conservation and broader environmental matters. Some established programs for recording biological data for the area they serve, to facilitate environmental planning (often in conjunction with local planning authorities) and to provide information to assist in the interpretation of ecological displays.",
  "  Major museums, such as the Natural History Museum in London, the Smithsonian Institution’s National Museum of Natural History in Washington, D.C., and the American Museum of Natural History in New York City, hold enormous comparative collections from the natural world, including the type specimens from which species have been named. Such museums are international centres of taxonomic work and sustain considerable research programs.",
  "  Museums of science and technology are concerned with the development and application of scientific ideas and instrumentation. Like museums of natural science and natural history, science museums have their origins in the Enlightenment . Some of them developed from the collections of learned societies, others from private collections such as the Teylers Museum at Haarlem, Netherlands, in the 18th century. A later development in science museums involved the applications of science, so that museums began to preserve the material evidence of technological as well as scientific endeavour. Some science and technology museums concentrate on demonstrating science and its applications; in these museums the preservation of process is emphasized over the preservation of objects.",
  "Science museums are particularly popular with children as well as adults and often provide opportunities for their visitors to participate through demonstration models and interactive displays. Well-known examples of these are at the Deutsches Museum in Munich, the Science Museum in London, and (of a more specialized nature) the National Air and Space Museum in Washington, D.C. Other specialized institutions include transport museums, such as the National Railway Museum in York, England, or the Swiss Transport Museum on the shores of Lake Lucerne. Of more recent establishment are industrial museums, which often include a large technical component.",
  "Museums devoted to modern science, such as the Palace of Discovery in Paris, also provide demonstrations of scientific theory. In India, where museums of science and technology are seen as having an important role in education, the National Council for Science Museums has established a network of such museums across the country. Performing a similar function are science centres where science is demonstrated but where there is not normally a responsibility for collecting and conserving historical apparatus. A pioneer in this field is the Ontario Science Centre in Toronto.",
  "  Some science and technology museums, such as the very popular Museum of Science and Industry in Chicago or the Technological Museum in Mexico City, are of a more technical nature. These museums are often sponsored directly or indirectly by industries, which occasionally found their own museums in order to preserve their heritage and promote their work. Other museums highlight a specific product resulting from the application of science and technology, such as the American Clock & Watch Museum in Bristol, Connecticut.",
  "The term history museum is often used for a wide variety of museums where collections are amassed and, in most cases, are presented to give a chronological perspective. Because of the encompassing nature of history, museums of this type may well hold so many objects of art and science that they would more properly be called general museums ( see above General museums ).",
  "Museums dealing with specialized aspects of history may be found at the national, provincial, or local level, while museums of general history are rare at the national level. One example of the latter is the National Museum of History in Chapultepec Castle, Mexico City. Other national museums of history can be found particularly among newer states, where they have been used as a means of arousing national consciousness and providing historical perspective. At the local and regional level there are many examples, of which the Museum of London and the city museums of Amsterdam, Dresden, Luxembourg, New York City, Stockholm, and Warsaw are but a few. In many cases, if artifacts are not available or are inappropriate, curators use reconstructions, models, and graphics, sometimes with multimedia techniques, to maintain chronological continuity and to increase the opportunity for interpretation within their essentially didactic approach.",
  "While history museums may include archaeological material, there is nevertheless a distinctive type that specializes in it: the antiquities museum. Collections of material of the ancient world can be found in national museums in a number of cities—for example, Amman, Jordan; Athens ; Cairo ; Copenhagen; Edinburgh; Madrid; and Mexico City . The antiquities museum is particularly common in Europe and Asia. Specialized archaeology museums also are found in areas of rich antiquity or as on-site museums. The archaeology museum is concerned mainly with historical evidence recovered from the ground and in many cases provides information on a period for which the written record can make little or no contribution.",
  "Another specialized form of the history museum collects and exhibits material from an ethnographic viewpoint. As the term suggests, emphasis is placed on culture rather than chronology in the presentation of the collections. A good example of this is the Smithsonian Institution’s National Museum of the American Indian in Washington, D.C. When it opened in 2004, it was hailed as a unique institution, where in a single museum the cultural life of the native peoples from all of the Americas—North, Central, and South—would be researched, analyzed, and celebrated for the public on a scale unmatched by the many other museums devoted to the Native American. Ethnography museums have been especially important to the newer nation-states of Africa and Oceania, where they are seen as a means of contributing to national unity among different cultural groups. Among the industrialized nations, and particularly in countries that have been involved in colonization, the ethnography museum traditionally was a museum of the cultures of other peoples. Many of these institutions were established in the capital cities, which at the height of colonization were windows on a world otherwise distant and unknown. Thus were founded the Musée de l’Homme (Museum of Man) in Paris, the extensive ethnographic collections of the British Museum in London, and the Tropenmuseum (Museum of the Royal Tropical Institute) in Amsterdam. Restructuring of such collections in the late 20th and early 21st centuries, however, suggested efforts to move away from the self-other dichotomy of colonialism. Specialized ethnography museums are also to be found in provincial cities. Normally, these arose through personal associations, as with the Pitt Rivers Museum in Oxford, or because of trade connections, as with the Overseas Museum in Bremen, Germany, or the National Museums and Galleries on Merseyside, Liverpool, England. The last two examples resulted from proximity to a major international port.",
  "Many other forms of the cultural history museum exist. Particularly prolific are museums concerned with preserving urban and rural traditions; these have rapidly increased in number with the pace of technological progress. Indeed, some history museums are involved in documenting various material aspects of contemporary life and in the selective collection of artifacts. Work of this type was pioneered in Sweden, where in 1873 Artur Hazelius developed the first museum of traditional life at the Nordic Museum in Stockholm. This was followed 18 years later by the first open-air museum, at Skansen. Museums of both types soon appeared in other countries. The former National Museum of Popular Arts and Traditions in Paris exemplified a national approach within a museum building. The museum’s closure in 2005, however, suggested changing trends in an era of increased globalization. The Museum of Civilizations from Europe and the Mediterranean (Mucem) absorbed some of the former museum’s collection and opened in Marseilles, France, in 2013. It endeavoured to offer a regional, as opposed to national, approach to cultural history. Outdoor museums preserving traditional architecture, sometimes in situ, and often demonstrating the activities associated with it, are to be found in many parts of the world—for example, the National Museum of Niamey, Niger; the Museum of Traditional Architecture in Jos, Nigeria; the National Village Museum in Bucharest, Romania; Upper Canada Village in Morrisburg, Ontario; Colonial Williamsburg in Virginia, U.S.; and the Novgorod State Museum Preserve in Russia.",
  "  Individual historic houses have been preserved as museums, in some cases because they are typical of the period and in other cases because of their associations. Among the latter are the memorial museums, such as the cottage of Du Fu at Chengdu in the Chinese province of Sichuan; the Leo Tolstoy Museum in Moscow; Mount Vernon, George Washington’s home in Virginia; and Paul Gauguin ’s residence in Tahiti, now the Paul Gauguin Museum.",
  "Other museums commemorate events, as do the Australian War Memorial in Canberra or the Imperial War Museum in London; both are military museums, members of a category that grew after World War I . Another development in the 20th-century history museum was the maritime museum. Like other types of museums, it may be housed in historic buildings, as at the National Maritime Museum at Greenwich, England; in new premises, as in the case of the German Shipping Museum at Bremerhaven; or in a restored waterfront environment, as at South Street, New York City.",
  "Another form of history museum is the portrait gallery, in which pictures are collected and displayed less for aesthetic reasons than for the purpose of communicating the images of actual persons. Although the idea of a portrait gallery is of some antiquity—a large collection of portraits of the kings of France and their statesmen was exhibited in Paul Ardier’s gallery at the Château de Beauregard near Blois in the 1620s, for example—the national portrait gallery as a public institution is a later development. In a similar vein, paintings and prints of people, as well as of places and events, often constitute an important element in other types of history museums.",
  "  The art museum (called art gallery in some places) is concerned primarily with the object as a means of unaided communication with its visitors. Aesthetic value is therefore a major consideration in accepting items for the collection. Traditionally, these collections have comprised paintings , sculpture , and the decorative arts . A number of art museums have included the industrial arts since the 19th century, when they were introduced, particularly to encourage good industrial design. It can be argued that aesthetics have subordinated function and association to such an extent that objects often are presented in a totally alien context. In some countries this criticism applies to archaeological material as well.",
  "The display of works of art presents the curator with certain problems . Works of art are exhibited to convey a visual message. While other disciplines tend to adopt didactic methods of display, the art curator is concerned particularly with unimpeded presentation of a given work. The ambience of the work is enhanced by highlighting its form and colour with proper lighting and background. At one time, artificial light was preferred for paintings, both to create an effect and to prevent exposure to harmful elements in natural light, but it sometimes provides an unnecessarily theatrical presentation or creates an artificiality that can inhibit the visitor’s appreciation and enjoyment of the work. Much greater use is now made of indirect natural light or—as at Tate Britain in London, for example—a controlled mixture of daylight and simulated daylight. Some art museums have returned to the earlier custom of hanging paintings in a tiered arrangement in order to exhibit more of their works. Digital art and digital displays of non-digital art present a whole host of additional opportunities and challenges.",
  "  (Read Glenn Lowry’s essay on \"Art Museums & Their Digital Future.\")  ",
  "The search for context has led to the design of period settings in which to present certain art objects, to the development of furnished period-house museums, and to the preservation of country houses and other appropriate properties, together with their contents, in situ. In a specialized context, the restoration of the Moscow Kremlin, particularly the Great Palace and the churches with their fine murals and icons, provides an example of this approach. Some of the churches are open to the public as museums. Some art museums have introduced other visual and performing arts—music, film, video, or theatre—to facilitate or enhance interpretation. Artist-in-residence programs also assist in promoting art and art appreciation.",
  "Another factor in the display of art objects concerns their continued preservation. Because of the sensitivity of some of the materials used in their creation, it is necessary to control within narrow limits the temperature, humidity, and lighting to which they are exposed. In addition, sophisticated security precautions are necessary for items of high value.",
  "In many cases, contemporary art is displayed in a separate institution . The role of such museums is to confront the public with art in the process of development, and there is a considerable experimental component in their exhibits. This is particularly so at the Pompidou Centre in Paris, the Stedelijk Museum in Amsterdam, and the museums of modern art in Stockholm and New York City, where unconventional art forms are presented. Because of the experimental nature of contemporary art and the high cost involved in purchases, temporary exhibitions normally play a major role in such museums and in some cases are their principal activity. Sculpture is often exhibited outdoors, as at the Hirshhorn Museum and Sculpture Garden in Washington, D.C., the Open-Air Museum in Hakone, Japan, and the Billy Rose Art Garden in Jerusalem.",
  "A virtual museum is a collection of digitally recorded images, sound files, text documents, and other data of historical, scientific, or cultural interest that are accessed through electronic media. A virtual museum does not house actual objects and therefore lacks the permanence and unique qualities of a museum in the institutional definition of the term. In fact, most virtual museums are sponsored by institutional museums and are directly dependent upon their existing collections. Nevertheless, through the hyperlinking and multimedia capabilities available via the Internet, digitized representations can be brought together from multiple sources for enjoyment and study in a manner largely determined by the individual user. Virtual museums of this type can be a powerful tool for comparative study and for research into a particular subject, material, or locality.",
  "Many virtual museums have their roots in a museum’s Web site. At their most basic, these sites offer administrative information such as opening hours, policies, and services; some even include a floor plan of the museum. Virtual museums in this limited sense join the exhibition, the guidebook, the photograph, and the video as a medium for promoting and interpreting a museum and its collection. But these sites are growing in sophistication. Many offer “virtual exhibitions”—that is, online tours of certain key exhibits. Still other museums or administrative organs provide access to databases on collections—for instance, the Joconde database, maintained by the French Ministry of Culture, from which information can be obtained on important works of art held by more than one thousand French museums.",
  "Several institutions collect representations of widely dispersed objects that may or may not be found in museums. One of the pioneers in this field was ArtServe, a collection of thousands of images, particularly of classical art and architecture, made available by the Australian National University for teachers and students of art history. Virtual museums in this sense offer the student many benefits—not least in the selection of material for detailed study—even though final recourse may be necessary to the original material.",
  "Virtual museums in the fullest sense of the term consist of collections that take full advantage of the easy access, loose structure, hyperlinking capacity, interactivity, and multimedia capabilities of the Internet. Indeed, some early electronic collections were used to promote Mosaic, the first graphical Web browser, when it was introduced in 1993. One of the first was EXPO, which originated in 1993 with an online guide to artifacts from the Vatican Library that were on display at the U.S. Library of Congress in Washington, D.C. EXPO was later maintained on servers outside of the Library of Congress network and was expanded into several “pavilions”—including archaeological, architectural, historical, and paleontological exhibits—which have been donated by several organizations. Another pioneer was the WebMuseum, an exhibition of artworks by Western painters from medieval times to the present day that began in 1994 by a computer scientist at the École Polytechnique near Paris. The WebMuseum grew to incorporate reproductions of paintings, background text, and musical selections submitted by a large number of contributors.",
  "  Establishing a new museum or refurbishing an old one is normally a prestigious event with a high public profile. Its design is expected to reflect this, whether involving an existing building—probably preserved for its own historic or architectural significance—or new premises. As a building that houses items of excellence, it is expected to match the quality and distinction that the exhibits bring to it. Today’s museum building is multifunctional in character, providing open space to accommodate exhibits and visitors but with high security and stringent environmental controls to protect the collections. Public facilities such as shops and restaurants figure prominently. Less obvious is the storage for reserve collections, laboratory and workshop space for exhibit conservation and preparation, facilities for teaching and studying, and offices.",
  "  For the architect and designer, meeting contemporary public expectations of museums and the changes to their function in society brings considerable challenge. The concept of the museum as a “seat of the Muses” is much diminished, although hints of this still linger; for example, the classical portico so common in earlier museums is still to be found in vestigial form in Josef Paul Kleihues’s design (1996) for the Museum of Contemporary Art in Chicago. The concept of the museum as a cathedral, seen among some 19th-century museums and typified in London’s Natural History Museum , also lingers: the massive cylindrical light at the San Francisco Museum of Modern Art’s original building (1995), designed by Mario Botta, reflects the architect’s belief that a museum has a role analogous to a cathedral. In contrast, the designs of Kisho Kurokawa for the Ehime Prefectural Science Museum in Niihama and the Shiga Kogen Roman Art Museum in Nagano reflect the implicit awareness of Japanese culture to its impermanence and perpetual change. Both of these museums have a glazed conical structure to house service functions.",
  "  The best-known glazed structure built to service a museum is the pyramid in the Cour Napoléon of the historic Louvre Museum in Paris. The pyramid is the only external feature of the massive refurbishment and expansion of the principal museum of France during the 1990s. It acts as the hub linking old with new, establishing new circulation patterns within the museum as well as a variety of commercial and other facilities underground. Across the river from the Louvre is another example of the adaptation of a historic building—a major railway terminus—that serves as a museum of the 19th century, the Musée d’Orsay . In London, Tate Modern, which opened in 2000, is also housed in an enormous industrial building, the Bankside Power Station.",
  "  The long-held belief that the container should not usurp the collection was challenged by a number of museums built around the turn of the 21st century. Preeminent among these was Frank Gehry ’s Guggenheim Museum in Bilbao , Spain. Opened in 1997, it has a metal-clad curvaceous sculptural form that places it among the masterpieces of 20th-century architecture. Internally, the museum is no less spectacular, and the design of the vast open spaces presents potential conflict with the exhibits. Another building that exploited a new architectural paradigm is Daniel Libeskind ’s Jewish Museum in Berlin , built to create an aesthetic and emotional experience appropriate to the subject. The Groninger Museum in Groningen, Netherlands, is another building that challenged traditional museum and architectural values. It features a series of pavilions that were built for each collection by a different designer to create a varied visitor experience. The search continues to find the extent to which a stage set is required to enhance the museum experience.",
  "There is no consistent pattern for the general administration of museums throughout the world. In part, the lack of such a pattern reflects the diversity of museums’ collections, but it also reflects an ambivalence in the understanding of the role of museums in society—i.e., whether museums are guardians and interpreters of the cultural heritage, repositories for the study of primary evidence relating to human and natural history, social instruments in community development, or facilities for leisure and recreation.",
  "On the most general level, museums may be either privately or publicly administered. Since 1970 there has been a marked increase in the number of private-sector museums, yet even some of these have corporate standing under general legislation and receive public moneys. In addition, private patronage has become important for public museums, which often find themselves competing with private museums for additional funding from individual and corporate sources. In the public sector, national museums may be overseen by such diverse ministries as education, tourism, defense, environment, national heritage, culture, and leisure. The situation can be even more complicated at the local level.",
  "The level of state control varies from country to country. In France, for instance, the state has traditionally exercised greater control over museums. A number of the national museums in Paris operate under a semiautonomous administrative council, with an executive chairman who has a dual responsibility for policy and executive matters. In addition, there are a number of national museums located outside Paris, and some technical control over the country’s municipal museums is exercised by the central administration. In the United Kingdom, on the other hand, public museums have traditionally enjoyed greater autonomy. Britain’s national museums—located mainly in the capital cities of London, Edinburgh, Cardiff, and Belfast—receive funds from the national government, but each museum has been established by its own specific legislation, which empowers a board of trustees (nominally independent of the government) to administer and raise funds and to guide the museum’s policies. British municipal museums, however, are provided under general legislation, and representatives from local government form the management committees by law. The British model can be found in other European and English-speaking countries. In the United States only the dependent museums of the Smithsonian Institution and the National Park Service have national status and are financed by the federal government.",
  "Most museums operate under some form of governing body. This body defines the general policy of the museum and provides and controls the necessary resources to deliver it. The appointment of the director and perhaps of other staff members is usually among its responsibilities. The director of a museum governed by this type of body is responsible for the formulation and implementation of policy, for the day-to-day running of the institution, and for facilitating communication among the museum’s governing body, staff, supporters, and visitors.",
  "The operation of a museum involves a wide variety of skills. These involve specialists in subjects relevant to museum collections (normally designated curators or keepers), information scientists involved in the documentation of collections and related scientific information (sometimes known as registrars), and conservators concerned with the scientific examination and treatment of collections to prevent deterioration. Another group is involved more actively with the public functioning of the museum. It includes specialists in education, communication, and interpretation, designers, the security staff, and marketing and public relations personnel as well as administrative, maintenance, and other support workers. Such diversity can lead to complex staff structures. Many of the larger, older established museums with encyclopaedic collections have a large number of senior specialized personnel. In museums where the emphasis is on providing services for the general public and the collections are less wide-ranging, there are likely to be fewer curatorial and more service personnel. Nevertheless, museums are labour-intensive, and the extent to which new technologies can alleviate the need for labour is limited. In all types of museums, operation is based on teamwork, and this has important implications for the management structures adopted as well as for the training of museum staffs.",
  "Organized training for museum personnel to meet the requirements of such a diverse operation is of relatively recent origin. Early attempts were made in the context of subject-based studies, with little attempt at providing an understanding of the museum as a public institution. By 1910 three courses were being provided in the United States. The following decade, however, saw the commencement of further courses, some in the United States at Harvard University’s Fogg Art Museum and at the Newark Museum in New Jersey and others in Europe. One of these was the well-known École du Louvre, created to train curators for the French museums. Museology was also introduced in the curriculum of Masaryk University in Brno, Moravia (now in the Czech Republic), in 1921. The first validation for museum training, organized on an in-service basis, appears to have been the diploma of the Museums Association introduced in Britain in 1930. There the University of London also introduced postgraduate courses intended to train specialist curators in art history and archaeology.",
  "It was not until about 1965, however, that university faculties or departments of museology—museum studies, as it is more commonly known in English-speaking countries—were created with a specific emphasis on the theory and practice of museums, as opposed to an emphasis on the subjects represented in their collections. In certain countries, notably Japan and some Latin American nations, curators are required by law to have graduated in museology before they can practice. Such courses, where available, normally provide some training in museum management. Although some museum studies are taught at the undergraduate level, postgraduate training is the generally recognized requirement.",
  "Until the mid-1970s, public funds constituted the major income source for public museums and in many cases contributed a considerable percentage of the income of those operated privately. With increasing restrictions on expenditure of public moneys, however, funding from multiple sources has become far more commonplace. In both developed and developing countries this can be crucial to the formation and continued maintenance of a museum service.",
  "The main source of funds for museums in the public sector remains the local or national government. This can result in a lack of flexibility in the use of such moneys, because the funds usually are subject to government policies that have little bearing on the particular requirements of museums. In addition, these museums are required to compete for funds against such traditional public expenditures as education, social services, defense, and law and order, and, in consequence, museums often are given low priority.",
  "Many museums were founded through private benefaction, and a few have endowments that help to support their routine operation. Others may have received bequests, many of which are designated to be used only for the purchase of objects. Such sources, although they may seem appropriate when secured, can suffer from changes in economic circumstances and may have attached to them conditions that are incompatible with requirements of the modern museum.",
  "Museums have become increasingly involved in fund-raising, in seeking commercial sponsorship, and in their own trading activities. Fund-raising may be undertaken by the museum, by a commissioned organization, or by a support body such as the many “friends of the museum” organizations now in existence. Fund-raising and sponsorship are normally directed toward a specific project or development.",
  "Many museums charge entrance fees to help finance operations—even in some countries, such as the United Kingdom, that previously had a strong tradition of free entry to museums. Some museums charge admission fees only for major exhibitions. Others have introduced a system of voluntary donations by visitors on entry to supplement their income, but the results of this approach have been generally disappointing.",
  "Commercial activities have become a significant feature of many museums. These may take the form of restaurants or shops that provide a service to visitors as well as income to the museum. Some museums have separate trading companies that act as publishers or engage in mail-order business, the profits from which are directed to the museum for general purposes. In this way the museum retains its charitable status, is not exposed to the direct dangers that would follow commercial failure, and also circumnavigates any requirements that direct income be returned to the public purse.",
  "A number of museums have support organizations, sometimes known as “friends of the museum.” These groups often engage in fund-raising and provide voluntary assistance in a number of ways, and they can provide a powerful lobby for the museum’s cause. The museum’s volunteers may form a separate organization. The museum usually acts as host to such organizations for their various activities. In some countries a national coordinating body provides advice and assistance, and the World Federation of Friends of Museums was founded in 1975 to encourage worldwide cooperation among such societies.",
  "The first organized cooperation among museums at the international level arose through the League of Nations ’ Committee of Intellectual Cooperation. In 1922 the Committee established an International Museums Office, which initiated a number of studies and publications until it went out of existence in 1946. In that year the International Council of Museums (ICOM) was created, and today this nongovernmental organization provides a world forum for museum professionals through regular meetings and through continuous communication over the Internet. In some countries where there are no separate associations for museum personnel, the national committees of ICOM fill the role of professional association. ICOM is also the recognized adviser on museum matters to the Social and Economic Council of the United Nations as well as the United Nations Educational, Scientific, and Cultural Organization (UNESCO).",
  "Since its inception in 1946, UNESCO has been responsible for a growing body of legislation to protect the world’s cultural heritage, has been active in promoting the return and restitution of cultural property to its country of origin, has initiated campaigns to ensure the protection of what it deems “ World Heritage site s,” and has provided financial assistance for the renovation of older museums and the establishment of new ones, particularly in developing countries. Some of its member states were responsible for the creation in 1956 of the International Centre for the Study of the Preservation and Restoration of Cultural Property (ICCROM).",
  "A number of regional governmental bodies also have an interest in museum provision. For example, the Council of Europe has promoted legislation for the protection of Europe’s archaeological heritage, has undertaken a number of studies on museum provision, and has promoted an award for museums. The European Union has promoted exchanges between museums, encouraged the development of “European Rooms” in certain museums of its member states, and contributed substantially to the capital costs of museum development.",
  "Relatively few museums have been established with the specific goal of forming a collection; instead, most have been created to receive an existing collection. With the existing collection as its base, the museum then traditionally works to fill in gaps in the collection or extend its activities into other, usually related, fields. For this reason, many museums have heterogeneous collections, at best accumulated under an “encyclopaedic” philosophy (which has rarely been successful unless major resources were available to achieve it) and at worst continuing a “cabinet of curiosities” approach (which may amuse and entertain the clientele but does little to engender scholarship or research). Often the collections made depended on the expertise or whim of the curator and were sure to change when that curator was succeeded by someone with different interests. This method has produced some outstanding special collections, but these resulted from circumstance rather than long-term planning.",
  "Explicit collection policies are now more common. Indeed, where national codes of practice exist, a strong recommendation is normally to be found on the need for a clear statement of collecting activity. This arose for a number of reasons. Not only should a public institution’s policies be available for scrutiny, but the cost of maintaining collections of ever-increasing size must be justified, a factor highlighted at times of economic pressure. Further, although a museum may have arisen from circumstance, an assessment of its available resources, the clientele it attracts or intends to attract, and the role it can serve in society generally must be matched against its primary resource, its collections.",
  "Every museum is responsible for ensuring the legality of its acquisitions. Laws regulating collection vary from country to country, but, whether or not a state has enacted its own legislation or ratified relevant international conventions, museum staff are expected to conform to generally recognized professional codes of ethics. Most regulation of collecting activity embodies principles established in the 1954 Convention for the Protection of Cultural Property in the Event of Armed Conflict and the 1970 Convention on the Means of Prohibiting and Preventing the Illicit Import, Export, and Transfer of Ownership of Cultural Property, both approved by member states of UNESCO. However, a number of countries involved in international trade found it difficult to ratify the 1970 convention, and certain difficulties arose over the definition of cultural property. The 1995 Unidroit Convention on Stolen or Illegally Exported Cultural Objects was intended to resolve these issues. Similar conventions exist on the regional level as well: for instance, in 1976 the Organization of American States adopted the San Salvador Convention on the Protection of the Archaeological, Historical, and Artistic Heritage of the American Nations, and, with a similar purpose in mind, in 1992 the Council of Europe issued a revised European Convention on the Protection of the Archaeological Heritage.",
  "Given the number and variety of legal regulations and professional codes, it is unlikely that a museum with clearly stated academic objectives will acquire illicit material. Indeed, methods of collection reflect the fact that a museum is concerned not only with collections per se but also with the information inherent in or associated with them. Where applicable, direct acquisition through fieldwork is much preferred. This involves collecting material through archaeological excavation, ethnological expeditions, or natural science fieldwork, and the collecting either is undertaken by the staff of the museum or is sponsored by it. Indirect acquisition is handled through purchases, gifts, bequests, and loans of objects. Where objects are thus acquired, art museums often stipulate that staff must assess a number of qualifications, notably the provenance (a record of the object’s ownership) of each piece, and that a committee must approve the acquisition.",
  "Conventions such as those cited above reflect the fact that the collecting activities of the industrialized world are markedly different from those available to the developing nations. In some instances the significant cultural property of entire nations has been dispersed to private collections and museums in different parts of the world, leaving the developing museums to rely on casts and replicas to convey the area’s cultural achievements. The international community has had only limited success in encouraging the return, through exchange or loan, of such material to its country of origin.",
  "The true significance of cultural property, collectively the universal heritage of humankind, places on museums a considerable responsibility. The acceptance of objects or collections into their care implies a permanence not associated with the acceptance of other types of property. Some museum legislation acknowledges this, declaring such collections inalienable. The disposal of museum collections in part or in full therefore normally only occurs in cases where items no longer serve a useful scholarly or interpretative purpose. The case for deaccessioning, as it is known, can only otherwise have any validity where it is done to correct the imbalances of earlier indiscriminate collecting, and in that case the material concerned should first be made available to other suitable museums before disposal. The Baltimore Museum of Art, for example, sold several pieces in the 2010s to acquire work by previously underrepresented populations. During this time, however, the Berkshire Museum in Pittsfield, Massachusetts, caused controversy when it announced that it would use proceeds from the sale of dozens of artworks not for the care of its collection or for acquisition purposes, as recommended by the American Alliance of Museums, but for the operation of the institution.",
  "A museum’s prime responsibility must be to maintain its collections and to do everything possible to delay the natural laws of deterioration. The acquisition of an item almost certainly brings it into a new and potentially alien environment. Material that has been recovered from the ground through archaeological excavation may need immediate treatment to stabilize it. Many of the materials from which objects are made are inherently unstable and undergo chemical or structural change as they age. A new or shifting environment can accelerate these changes, and temperature, light, humidity, and human and other biological factors all need to be controlled. In addition, conservation involves the treatment and, where feasible and acceptable, the restoration of objects as nearly as possible to their former condition.",
  "Most large museums have their own laboratories where preservation and restoration work is carried out, and some take on projects for other museums as well. In some cases, as at the British Museum, a separate department of scientific research supports the museum’s academic and conservation work, providing advanced scientific equipment for the analysis, dating, and identification of materials. Some museums are served by independent conservation laboratories, an example of which is the Canadian Conservation Institute in Ottawa, which uses a fleet of mobile laboratories to attend to museum collections in many parts of the country.",
  "Documentation is a significant function of any museum, whether it holds only a few hundred objects or many millions of items. Quite apart from the need for records to maintain adequate control of its collections, a museum’s documentation system provides an indispensable record of the information associated with the objects for research. The documentation system also may include records to facilitate the museum’s interpretative and other work.",
  "The form of a museum’s documentation system may vary considerably, but to meet these requirements it should provide the fullest possible information about each item and its history. There are no generally accepted classification schemes for museum objects, although certain subjects have developed schemes with numeric or alphanumeric notations to facilitate the ordering and retrieval of information. For the natural sciences, taxonomic names are normally used.",
  "A number of museums have developed computerized documentation systems, some online but others relying on machine-generated indexes, periodically updated, to meet most of their information requirements. The advantages of computerized documentation have been exploited in a number of ways—for instance, in exchanging data between museums to facilitate study and research or in making collection information available for public use in the museum gallery or over the Internet.",
  "Because they hold the primary material evidence for a number of subjects concerned with an understanding of humankind and the environment, museums clearly have an important role in research. A museum’s research program is related to its objectives as an institution. A program may be concerned directly with the public services provided, in preparing exhibitions, catalogs, and other publications, or with promoting a better understanding of the discipline or region that it serves. In large museums, and in university museums in particular, pure and applied research may be of national or international significance and may be associated with fieldwork or study visits. Active research and publication on a given topic, apart from contributing to the academic standing of the institution, may attract further collections relevant to the topic.",
  "Many museums provide facilities, apart from those used by casual visitors, for researchers to study collections and associated documentation. Such facilities may include study rooms with a supporting library and equipment to assist in the examination of collections. Certain museums have accommodations for visiting foreign scholars; this feature is particularly helpful at site museums that are difficult to reach.",
  "Many museums have abandoned the traditional view of exhibition, by which storage and display are ends in themselves, in favour of an approach that enhances the setting of the object or collection. To this end museums use the expertise of a number of specialists—designers, educators, sociologists, and interpreters as well as curators—to improve communication through objects. The result has been a remarkable transformation in the presentation of museum displays. Far greater use is made of colour and light (within the bounds prescribed by conservation requirements), in the way material is interpreted through a variety of mediums (sound, video, interaction between visitor and exhibit, virtual reality , as well as more traditional methods), and in the provision of a more relaxing environment in which to enjoy the exhibits. A result of museums’ increased awareness of the needs of their visitors has been a considerable increase in museum attendance.",
  "As the museum’s cultural role has developed, so its exhibition work has diversified. Large international exhibitions have been organized by cooperating nations and have been shown in the major museums of the participating countries. Exhibitions organized for national circulation are also increasingly common. Museums concerned with a particular region have arranged topical exhibitions to tour the area, and, in places without suitable premises for display or in sparsely populated areas, exhibitions have toured in specially adapted buses or trains. Some countries have developed multipurpose cultural centres, and collaboration with museums has resulted in exhibition programs successfully reaching a wide audience.",
  "  Interest in the historic and natural environment globally has involved museums in the preservation and interpretation of sites, monuments, and landscapes (as in the Slave House museum at Gorée Island , Senegal). Here the conflict inherent in imposing an interpretive medium into a natural or historical context has to be resolved. In its simplest form, interpretation may be conveyed through nature or history trails in which information is provided in written or recorded form. With a historic property there are also opportunities to reenact events associated with the property, such as period battle scenes and banquets, to demonstrate industrial or craft techniques, or to use theatre and son et lumière performances to interpret the site.",
  "The contribution that museums can make to education is widely acknowledged. The majority of their clientele learn by looking at exhibitions and displays. There has been, however, a long association with schools, and many museums provide services specifically designed to meet schools’ needs. Services include facilities for use both in the museum and at the school, many of which are administered by separate departments of museum education employing teachers for the purpose.",
  "Special rooms equipped for teaching and for handling specimens are provided in many museums. By allowing the study and handling of objects from its collections, the museum can give substance and form to the bare facts of art, history, and science. Some museums build special collections for this purpose. Teaching may be undertaken by the museum’s educational staff or, more often, by the schoolteacher, who will have been advised and instructed by the staff. For advanced studies, particularly in subjects like archaeology and geology, the availability of museum collections can be indispensable.",
  "Although opinion differs as to the value of school loan collections, many museums do provide small exhibit cases or kits that may be borrowed by the school for a limited period for classroom teaching. Unlike libraries, museums are not able to provide extensive loan services (which would conflict with their prime purpose), but, for rural schools unable to visit the museum, such a facility, albeit limited, meets a need. In some areas museums include the larger community schools within their traveling exhibition schedules.",
  "As a better-educated adult population with increased leisure time seeks purposeful outlets, museums are well placed to provide activities. Many museums offer lectures, courses, demonstrations, field excursions, and extensive travel-abroad opportunities.",
  "A museum acts as an information centre for its community. In addition to its displays and exhibitions, its data banks and publications, it has a staff of specialists, who in most cases are available by appointment to provide information on request.",
  "Museum publications may be educational or cultural or may be designed for a popular market. They may take the form of periodicals, handbooks, catalogs, research papers, or general guides to aspects of the museum and are an important medium for disseminating information to the lay public and scholar alike; such information and products are now commonly available via the museum’s Web site. Many museums also offer an opinion on items brought to them for identification. This can be of value to both the inquirer and the museum because it provides an awareness of local discoveries and holdings that aids the museum’s efforts to build up a picture of its area of responsibility. At the same time it provides an informed opinion as a public service. Museums rarely provide valuations, however, and some, to avoid conflicts of interest, decline to have any connection with the antiques trade.",
  "Until recently the information relating to museums has been much dispersed, but detailed studies are now being published in book form. The following list identifies some of the literature available.",
  "The most comprehensive bibliographic listing is International Museological Bibliography (annual), maintained by the ICOM and also available on CD-ROM. A number of other bibliographies are published, such as Simon J. Knell (compiler and ed.), A Bibliography of Museum Studies , 11th ed. (1994); Michael Steven Shapiro and Louis Ward Kemp (eds.), The Museum: A Reference Guide (1990); and Peter Woodhead and Geoffrey Stansfield , Keyguide to Information Sources in Museum Studies , 2nd ed. (1994). Art and Archaeology Technical Abstracts (semiannual) provides abstracts on museum techniques within these fields. István Éri and Béla Végh (eds.), Dictionary of Museology (1986), lists museum terms in 20 languages.",
  "General periodicals include Museum International (quarterly); I C O M News (quarterly); Curator (quarterly); Museum Management and Curatorship (quarterly); Museums Journal (quarterly); Museum News (bimonthly); and Museum Practice (3/yr.).",
  "Works concerning the history of museums and collecting include Edward P. Alexander , Museums in Motion: An Introduction to the History and Functions of Museums (1979), and Museum Masters: Their Museums and Their Influence (1983), tracing the origins of 12 important 18th-, 19th-, and 20th-century museums; Germain Bazin , The Museum Age , trans. from French (1967); Paula Findlen , Possessing Nature: Museums, Collecting, and Scientific Culture in Early Modern Italy (1994), on natural history collecting before 1700; Kenneth Hudson , Museums of Influence (1987), reviewing worldwide museum development over the past 200 years through the histories of 37 pioneer museums; Oliver Impey and Arthur MacGregor (eds.), The Origins of Museums: The Cabinets of Curiosities in Sixteenth and Seventeenth Century Europe (1985); Susan Sheets-Pyenson , Cathedrals of Science: The Development of Colonial Natural History Museums During the Late Nineteenth Century (1988); and Niels von Holst , Creators, Collectors, and Connoisseurs: The Anatomy of Artistic Taste from Antiquity to the Present Day (1967; originally published in German, 1960). Ongoing research is published in Journal of the History of Collections (semiannual).",
  "Directories of museums providing worldwide coverage include Bettina Bartz , Helmut Opitz , and Elisabeth Richter (eds.), Museums of the World , 4th rev. and enlarged ed. (1992); and Kenneth Hudson and Ann Nicholls , The Directory of Museums & Living Displays , 3rd ed. (1985), including zoos, aquaria, botanical gardens, and living history farms. Susan Peters et al. (eds.), Directory of Museums in Africa (1990), in English and French; International Council of Museums , Directory of Museums in the Arab Countries, 1995 (1995), also in English and French, and Directory of Museums of the Asia-Pacific Countries , vol. 1 (1993), covering Australia, New Zealand, and the Pacific Islands, provide lists for these regions. A number of national museum directories are published, including Museums Yearbook , published by the Museums Association and covering museums in the United Kingdom; and The Official Museum Directory (annual), published by the American Association of Museums for museums of art, history, and science. The International Council of Museums (ICOM) also publishes several directories of specialized museums, including International Repertory of Glass Museums and Glass Collections (1966); Hugo G. Rodeck (compiler), Directory of the Natural Sciences Museums of the World (1971); and Jean Jenkins (ed.), International Directory of Musical Instrument Collections (1977).",
  "General works about museums and their operation include Timothy Ambrose and Crispin Paine , Museum Basics (1993); John M.A. Thompson et al. (eds.), Manual of Curatorship: A Guide to Museum Practice , 2nd ed. (1992); and Gary Edson and David Dean , The Handbook for Museums (1994). Professional training is covered in Victor J. Danilov , Museum Careers and Training: A Professional Guide (1994); Gary Edson , International Directory of Museum Training (1995); Jane R. Glaser and Artemis A. Zenetou , Museums: A Place to Work: Planning Museum Careers (1996); and Stephen E. Weil , A Cabinet of Curiosities: Inquiries into Museums and Their Prospects (1995), and Rethinking the Museum and Other Meditations (1990), on museum administration and techniques. Examples of national position statements may be found in American Association of Museums , Museums for a New Century (1984), and Museums Count (1994); and Great Britain, Museums and Galleries Commission , Museums Matter (1992).",
  "Museum operations in various types of museums are considered in Susan Pearce (ed.), Art in Museums (1995); Stella V.F. Butler , Science and Technology Museums (1992); Peter Davis , Museums and the Natural Environment: The Role of Natural History Museums in Biological Conservation (1996); Gaynor Kavanagh , History Curatorship (1990); and Susan M. Pearce , Archaeological Curatorship (1990). Works on specific aspects of museum operation include Josep Ma. Montaner , New Museums , trans. from Spanish (1990), an architectural view of recent museums; Gail Dexter Lord and Barry Lord , The Manual of Museum Planning (1991); H.J. Plenderleith and A.E.A. Werner , The Conservation of Antiquities and Works of Art: Treatment, Repair, and Restoration , 2nd ed. (1971); Garry Thomson , The Museum Environment , 2nd ed. (1986, reissued 1994); David Liston (ed.), Museum Security and Protection (1993); D. Andrew Roberts , Planning the Documentation of Museum Collections (1985); and Dorothy H. Dudley et al., Museum Registration Methods , 3rd ed., rev. (1979).",
  "Interpretive functions of museums are treated in R.S. Miles et al. (compilers), The Design of Educational Exhibits , 2nd ed. (1988); Michael Belcher , Exhibitions in Museums (1991); Giles Velarde , Designing Exhibitions (1988); Eilean Hooper-Greenhill , Museum and Gallery Education (1991); Eilean Hooper-Greenhill (ed.), The Educational Role of the Museum (1994); Roger Miles and Lauro Zavala (eds.), Towards the Museum of the Future: New European Perspectives (1994), which utilizes case studies to demonstrate the museum as communicator and educator in a rapidly changing world; Sue Runyard , The Museum Marketing Handbook (1994); and G. Donald Adams , Museum Public Relations (1983).",
  "The legal arrangements concerning museums are closely related to those of the preservation of cultural property, and the following are helpful: Lyndel V. Prott and P.J. O’Keefe , Law and the Cultural Heritage (1984– ); The Protection of Movable Cultural Property (1984– ), collected legislative texts for many countries published by UNESCO; Stephen E. Weil , Beauty and the Beasts: On Museums, Art, the Law, and the Market (1983); and Marie C. Malaro , A Legal Primer on Managing Museum Collections (1985), and Museum Governance: Mission, Ethics, Policy (1994)."
]