[
  " race , the idea that the human species is divided into distinct groups on the basis of inherited physical and behavioral differences. Genetic studies in the late 20th century refuted the existence of biogenetically distinct races, and scholars now argue that “races” are cultural interventions reflecting specific attitudes and beliefs that were imposed on different populations in the wake of western European conquests beginning in the 15th century.",
  "The modern meaning of the term race with reference to humans began to emerge in the 17th century. Since then it has had a variety of meanings in the languages of the Western world. What most definitions have in common is an attempt to categorize peoples primarily by their physical differences. In the United States, for example, the term race generally refers to a group of people who have in common some visible physical traits, such as skin colour, hair texture, facial features, and eye formation. Such distinctive features are associated with large, geographically separated populations, and these continental aggregates are also designated as races, as the “African race,” the “European race,” and the “Asian race.” Many people think of race as reflective of any visible physical (phenotypic) variations among human groups, regardless of the cultural context and even in the absence of fixed racial categories.",
  "The term race has also been applied to linguistic groups (the “Arab race” or the “Latin race”), to religious groups (the “Jewish race”), and even to political, national, or ethnic groups with few or no physical traits that distinguish them from their neighbours (the “Irish race,” the “French race,” the “Spanish race,” the “Slavic race,” the “Chinese race”, etc.).",
  "For much of the 20th century, scientists in the Western world attempted to identify, describe, and classify human races and to document their differences and the relationships between them. Some scientists used the term race for subspecies, subdivisions of the human species which were presumed sufficiently different biologically that they might later evolve into separate species.",
  "At no point, from the first rudimentary attempts at classifying human populations in the 17th and 18th centuries to the present day, have scientists agreed on the number of races of humankind, the features to be used in the identification of races, or the meaning of race itself. Experts have suggested a range of different races varying from 3 to more than 60, based on what they have considered distinctive differences in physical characteristics alone (these include hair type, head shape, skin colour, height, and so on). The lack of concurrence on the meaning and identification of races continued into the 21st century, and contemporary scientists are no closer to agreement than their forebears. Thus, race has never in the history of its use had a precise meaning.",
  "Although most people continue to think of races as physically distinct populations, scientific advances in the 20th century demonstrated that human physical variations do not fit a “racial” model. Instead, human physical variations tend to overlap. There are no genes that can identify distinct groups that accord with the conventional race categories. In fact, DNA analyses have proved that all humans have much more in common, genetically, than they have differences. The genetic difference between any two humans is less than 1 percent. Moreover, geographically widely separated populations vary from one another in only about 6 to 8 percent of their genes. Because of the overlapping of traits that bear no relationship to one another (such as skin colour and hair texture) and the inability of scientists to cluster peoples into discrete racial packages, modern researchers have concluded that the concept of race has no biological validity.",
  "Many scholars in other disciplines now accept this relatively new scientific understanding of biological diversity in the human species. Moreover, they have long understood that the concept of race as relating solely to phenotypic traits encompasses neither the social reality of race nor the phenomenon of “ racism .” Prompted by advances in other fields, particularly anthropology and history, scholars began to examine race as a social and cultural, rather than biological, phenomenon and have determined that race is a social invention of relatively recent origin. It derives its most salient characteristics from the social consequences of its classificatory use. The idea of “race” began to evolve in the late 17th century, after the beginning of European exploration and colonization, as a folk ideology about human differences associated with the different populations—Europeans, Amerindians, and Africans—brought together in the New World. In the 19th century, after the abolition of slavery, the ideology fully emerged as a new mechanism of social division and stratification.",
  "Racial classifications appeared in North America, and in many other parts of the world, as a form of social division predicated on what were thought to be natural differences between human groups. Analysis of the folk beliefs, social policies, and practices of North Americans about race from the 18th to the 20th century reveals the development of a unique and fundamental ideology about human differences. This ideology or “racial worldview” is a systematic, institutionalized set of beliefs and attitudes that includes the following components:",
  "These are the beliefs that wax and wane but never entirely disappear from the core of the American version of race differences. From its inception, racial ideology accorded inferior social status to people of African or Native American ancestry. This ideology was institutionalized in law and social practice, and social mechanisms were developed for enforcing the status differences.",
  "Although race categories and racial ideology are both arbitrary and subjective, race was a convenient way to organize people within structures of presumed permanent inequality. South Africa’s policy of apartheid exhibited the same basic racial ideology as the North American system but differed in two respects: the systematic state classification of races and the creation of an intermediate “racial” category; the Coloured category, for historical reasons, was made distinct and defined as those who were neither Blacks (called Bantus or natives), most of whom retained their own traditional cultures, nor whites (Europeans), who brought different cultural forms to South Africa. The relative exclusiveness of South Africa’s race categories was compromised by an institutionalized mechanism for changing one’s race, the Race Classification Board established by the Population Registration Act of 1950. This body, unique to South Africa, adjudicated questionable classifications and reassigned racial identities to individuals.",
  "Although they are easily and often confused, race and racism must be distinguished from ethnicity and ethnocentrism. While extreme ethnocentrism may take the same offensive form and may have the same dire consequences as extreme racism, there are significant differences between the two concepts. Ethnicity, which relates to culturally contingent features, characterizes all human groups. It refers to a sense of identity and membership in a group that shares common language, cultural traits (values, beliefs, religion, food habits, customs, etc.), and a sense of a common history. All humans are members of some cultural (ethnic) group, sometimes more than one. Most such groups feel—to varying degrees of intensity—that their way of life, their foods, dress, habits, beliefs, values, and so forth, are superior to those of other groups.",
  "The most significant quality of ethnicity is the fact that it is unrelated to biology and can be flexible and transformable. People everywhere can change or enhance their ethnicity by learning about or assimilating into another culture. American society well illustrates these facts, consisting as it does of groups of people from hundreds of different world cultures who have acquired some aspects of American culture and now participate in a common sense of ethnic identity with other Americans.",
  "Ethnic identity is acquired, and ethnic features are learned forms of behaviour. Race, on the other hand, is a form of identity that is perceived as innate and unalterable. Ethnicity may be transient and even superficial. Race is thought to be profound and grounded in biological realities. Ethnocentrism is based in a belief in the superiority of one’s own culture over others, and it too may be transient and superficial. Racism is the belief in and promotion of the racial worldview described above. Ethnocentrism holds skin colour and other physical features to be irrelevant as long as one is a member of the same culture, or becomes so. The racial worldview holds that, regardless of behaviour or cultural similarities, a member of an inferior race (who is usually perceived to be so by means of physical features) can never be accepted. Race is an invented, fictional form of identity; ethnicity is based on the reality of cultural similarities and differences and the interests that they represent. That race is a social invention can be demonstrated by an examination of the history of the idea of race as experienced in the English colonies.",
  " Race as a categorizing term referring to human beings was first used in the English language in the late 16th century. Until the 18th century it had a generalized meaning similar to other classifying terms such as type , sort , or kind . Occasional literature of Shakespeare’s time referred to a “race of saints” or “a race of bishops.” By the 18th century, race was widely used for sorting and ranking the peoples in the English colonies—Europeans who saw themselves as free people, Amerindians who had been conquered, and Africans who were being brought in as slave labour—and this usage continues today.",
  "The peoples conquered and enslaved were physically different from western and northern Europeans, but such differences were not the sole cause for the construction of racial categories. The English had a long history of separating themselves from others and treating foreigners, such as the Irish, as alien “others.” By the 17th century their policies and practices in Ireland had led to an image of the Irish as “savages” who were incapable of being civilized. Proposals to conquer the Irish, take over their lands, and use them as forced labour failed largely because of Irish resistance. It was then that many Englishmen turned to the idea of colonizing the New World. Their attitudes toward the Irish set precedents for how they were to treat the New World Indians and, later, Africans.",
  "One of the greatest problems faced by settlers in the New World, particularly in the southern colonies, was the shortage of labour. Within a few decades after the settlement of Jamestown, planters had established indentured servitude as the main form of labour. Under this system, young men (and some women) worked for masters, to whom they were indebted for their transportation, normally for a period of four to seven years. They were paid no wages, received only minimal upkeep, and often were treated brutally.",
  "By the mid-17th century a wealthy few had encumbered virtually all lands not under Indian control and were attempting to work these lands using indentured servants. The working poor and those eventually freed from servitude had little on which to survive, and their dissatisfaction with the inequities of colonial society led to riots and numerous threats of revolt. After 1619 this group of poor servants included many Africans and their descendants, some of whom had experience in the Spanish and Portuguese colonies, where slave labour was widely used.",
  "The social position of Africans in the early colonies has been a source of considerable debate. Some scholars have argued that they were separated from European servants and treated differently from the beginning. Later historians, however, have shown that there was no such uniformity in the treatment of Africans. Records indicate that many Africans and their descendants were set free after their periods of servitude. They were able to purchase land and even bought servants and slaves of their own. Some African men became wealthy tradesmen, craftsmen, or farmers, and their skills were widely recognized. They voted, appeared in courts, engaged in business and commercial dealings, and exercised all the civil rights of other free men. Some free Africans intermarried, and their children suffered little or no special discrimination. Other Africans were poor and lived with other poor men and women; Blacks and whites worked together, drank together, ate together, played together, and frequently ran away together. Moreover, the poor of all colours protested together against the policies of the government (at least 25 percent of the rebels in Bacon’s Rebellion [1676] were Blacks, both servants and freedmen). The social position of Africans and their descendants for the first six or seven decades of colonial history seems to have been open and fluid and not initially overcast with an ideology of inequality or inferiority.",
  "Toward the end of the 17th century, labour from England began to diminish, and the colonies were faced with two major dilemmas. One was how to maintain control over the restless poor and the freedmen who seemed intent on the violent overthrow of the colony’s leaders. There had been several incidents that threatened the leadership of the fragile colonies. The aforementioned rebellion led by Nathaniel Bacon in Virginia was a high point in the caustic relations between the planters and leaders of the colony and the impoverished workers. Although that rebellion failed, discontent continued to be expressed in riots, destruction of property, and other forms of social violence.",
  "The second dilemma was how to obtain a controllable labour force as cheaply as possible. Tobacco was the chief source of wealth, and its production was labour-intensive. The colonial leaders found a solution to both problems: by the 1690s they had divided the restless poor into categories reflecting their origins, homogenizing all Europeans into a “white” category and instituting a system of permanent slavery for Africans, the most vulnerable members of the population.",
  "Between 1660 and 1690, leaders of the Virginia colony began to pass laws and establish practices that provided or sanctioned differential treatment for freed servants whose origins were in Europe. They conscripted poor whites, with whom they had never had interests in common, into the category of free men and made land, tools, animals, and other resources available to them. African Americans and Africans, mulattoes, and American Indians, regardless of their cultural similarities or differences, were forced into categories separate from whites. Historical records show that the Virginia Assembly went to great extremes not only to purposely separate Europeans from Indians and Africans but to promote contempt on the part of whites against Blacks. Recognizing the vulnerability of African labour, colonial leaders passed laws that increasingly bound Africans and their children permanently as servants and, eventually, as slaves. White servants had the protection of English laws, and their mistreatment was criticized abroad. Africans, however, had no such recourse. By 1723 even free African Americans, descendants of several generations then of free people, were prohibited from voting and exercising their civil rights. Colonial leaders thus began using the physical differences among the population to structure an inegalitarian society. In the island colonies of Barbados and Jamaica, the numbers of Irish and Indian slaves had also declined, and planters turned increasingly to Africans. Southern planters, who were in regular communication with these island communities, brought in large numbers of Africans during the 18th century and systematically developed their slave practices and laws. Christianity provided an early rationalization for permanent enslavement: Africans were heathens and slaves in their own lands; under English slavery, their souls would be saved.",
  "The underlying reality was that their labour was needed to produce wealth for the colonies and for England’s upper classes. During the early decades of the 17th century, many Englishmen considered the Africans to be civilized. Unlike the Indians, whom they called “savages” and who were largely nomadic hunter-gatherers, the English knew the Africans in the colonies as sophisticated cultivators who understood how to grow foods and other crops in tropical soils. In this they surpassed the Irish who had been enslaved on plantations in the Caribbean; with no tradition of agriculture in tropical habitats, the Irish failed as producers of necessary goods. Some Africans were skilled metalworkers, knowledgeable about smelting, blacksmithing, and toolmaking. Many others were skilled in woodworking, weaving, pottery production, rope making, leatherwork, brick making, thatching, and other crafts.",
  "Two additional factors made Africans more desirable as slaves: Africans were immune to Old World diseases, which caused Indians to sicken and die, and, most important, Africans had nowhere to run, unlike the Indians, who could escape from slavery into their own familiar territory. The Irish, who were also in an alien land, were perceived as unruly and violent. When they escaped, they often joined their fellow Catholics, the Spanish and the French, in conspiracies against the English.",
  "Thus, Africans became the preferred slaves, not because of their physical differences, although such differences became increasingly important, but because they had the knowledge and skills that made it possible to put them to work immediately to develop the colonies. They were not Christian, they were vulnerable, with no legal or moral opposition to their enslavement, and, once transported to the New World, they had few options. Moreover, the supply of Africans increased as the costs of transporting them fell, and English merchants became directly involved in the slave trade.",
  "Chattel slavery was not established without its critics. From the beginning, many Englishmen condemned the presence of slavery in English territories. They argued that theirs was a society of free men and of democratic institutions and that it was committed to the preservation of human rights, justice, and equality. For several hundred years, trends in English culture had been toward the expansion of human rights and the recognition of individual liberty. Slavery, many argued, was antithetical to a free society and subversive of Christian values.",
  "Throughout the 18th century, however, another powerful value in English culture, the sanctity of property and property rights, came to dominate colonial concerns. When faced with growing antislavery arguments, planters in the southern colonies and Caribbean islands, where slavery was bringing great wealth, turned to the argument that slaves were property and that the rights of slave owners to their property were by law unquestionable and inviolable. The laws and court decisions reflected the belief that the property rights of slave owners should take precedence over the human rights of slaves.",
  "Historians concur that the emphasis on the slave as property was a requisite for dehumanizing the Africans. Says the historian Philip D. Morgan, “The only effective way to justify slavery was to exclude its victims from the community of man.” Attitudes and beliefs about all Africans began to harden as slavery became more deeply entrenched in the colonies. A focus on the physical differences of Africans expanded as new justifications for slavery were needed, especially during the Revolutionary War period, when the rallying cry of freedom from oppression seemed particularly hypocritical. Many learned men on both sides of the Atlantic disputed the moral rightness of slavery. Opponents argued that a society of free men working for wages would be better producers of goods and services. But pro-slavery forces, which included some of the wealthiest men in America and England, soon posed what they came to believe was an unassailable argument for keeping Blacks enslaved: the idea of Black inferiority.",
  "A number of 18th-century political and intellectual leaders began publicly to assert that Africans were naturally inferior and that they were indeed best suited for slavery. A few intellectuals revived an older image of all living things, the scala naturae (Latin: “scale of nature”), or Great Chain of Being , to demonstrate that nature or God had made men unequal. This ancient hierarchical paradigm—encompassing all living creatures, starting with the simplest organisms and reaching to humans, angels, and ultimately to God—became for the advocates of slavery a perfect reflection of the realities of inequality that they had created. The physical differences of Blacks and Indians became the symbols or markers of their status. It was during these times that the term race became widely used to denote the ranking and inequality of these peoples—in other words, their placement on the Chain of Being.",
  "Beginning in the late 18th century, differences between the races became magnified and exaggerated in the public mind. Hundreds of battles with Indians had pushed these populations westward to the frontiers or relegated them increasingly to reservation lands. A widely accepted stereotype had grown that the Indian race was weak and would succumb to the advances of white civilization so that these native peoples would no longer be much of a problem. Their deaths from disease and warfare were seen as a testament to the inevitable demise of the Indian.",
  "Racial stereotyping of Africans was magnified by the Haitian rebellion of 1791 . This heightened the American fear of slave revolts and retaliation, causing greater restrictions and ever harsher and more degrading treatment. Grotesque descriptions of the low-status races, Blacks and Indians, were widely publicized, and they helped foster fear and loathing. This negative stereotyping of low-status racial populations was ever present in the public consciousness, and it affected relations among all people.",
  "By the mid-19th century, race in the popular mind had taken on a meaning equivalent to species-level distinctions, at least for differences between Blacks and whites. The ideology of separateness that this proclaimed difference implied was soon transformed into social policy. Although legal slavery in the United States ended in 1865 with the passage of the Thirteenth Amendment to the Constitution, the ideology of race continued as a new and major form of social differentiation in both American and British society. The Black codes of the 1860s and the Jim Crow laws of the 1890s were passed in the United States to legitimate the social philosophy of racism. More laws were enacted to prevent intermarriage and intermating, and the segregation of public facilities was established by law, especially in the South. The country’s low-paying, dirty, and demeaning jobs were relegated to “the Negro,” as he was seen fit for only such tasks. Supreme Court decisions, such as the Dred Scott case of 1857, made clear that Negroes were not and could not be citizens of the United States. They were to be excluded from the social community of whites but not from the production of their wealth. The Supreme Court decision in Plessy v. Ferguson (1896), which permitted “separate but equal” facilities, guaranteed that the racial worldview, with its elements of separateness and exaggerated difference, would continue to flourish.",
  "In the 1860s, when Chinese labourers immigrated to the United States to build the Central Pacific Railroad, a new population with both physical and cultural differences had to be accommodated within the racial worldview. While industrial employers were eager to get this new and cheap labour, the ordinary white public was stirred to anger by the presence of this “yellow peril.” Political party caucuses, labour unions, and other organizations railed against the immigration of yet another “inferior race.” Newspapers condemned the policies of employers, and even church leaders decried the entrance of these aliens into what was seen as a land for whites only. So hostile was the opposition that in 1882 Congress finally passed the Chinese Exclusion Act.",
  "The large migrations from southern and eastern Europe that started in the 1880s required the reassessments of other new people and their incorporation into the racial ranking system. Old-stock Americans (English, Dutch, German, Scandinavian) were horrified at the onslaught of large numbers of people speaking Italian, Greek, Hungarian, Russian, and other foreign languages. They held that such “races” could not be assimilated into “Anglo-Saxon” culture, and policies and practices had to be put into place to separate them from the mainstream.",
  "Despite much opposition, these European groups soon lost their inferior race status, and within a few generations their descendants not only were assimilated into the “white” category but had also incorporated the white racial worldview. More than half the ancestors of late 20th-century American whites immigrated to the United States during the period 1880–1930. The “white” racial category was constructed flexibly enough to enclose even those who could not claim an Anglo-Saxon background.",
  "During the 19th century the idea and ideology of race were diffused throughout the European colonial systems, reinforced by the fact that the peoples conquered and colonized by western European powers were also physically different. Such conquests buttressed the idea of European racial superiority. The racial worldview, with its tenets regarding the limited capacities of inferior races, was employed to justify the extermination of peoples, including the Tasmanians , most of the Maori , and many indigenous Australians . It was an essential ingredient in the colonial policies and practices of the British in India and Southeast Asia and, later, in Africa. Numerous British writers of the 19th century, such as Rudyard Kipling , openly declared that the British were a superior race destined to rule the world.",
  "The development of the idea and ideology of race coincided with the rise of science in American and European cultures. Much of the inspiration for the growth of science has been credited to the period known as the Enlightenment that spanned most of the 18th century. Many early Enlightenment writers believed in the power of education and fostered very liberal ideals about the potentiality of all peoples, even “savages,” for human progress. Yet, later in the century, some of the earliest assertions about the natural inferiority of Africans were published. Major proponents of the ideology of race inequality were the German philosopher Immanuel Kant , the French philosopher Voltaire , the Scottish philosopher and historian David Hume , and the influential American political philosopher Thomas Jefferson . These writers expressed negative opinions about Africans and other “primitives” based on purely subjective impressions or materials gained from secondary sources, such as travelers, missionaries, and explorers. These philosophers expressed the common attitudes of this period; most also had investments in the slave trade or slavery.",
  "During the same period, influenced by taxonomic activities of botanists and biologists that had begun in the 17th century, other European scholars and scientists were involved in the serious work of identifying the different kinds of human groups increasingly discovered around the world. The work of the naturalists and systematists brought attention to the significance of classifying all peoples into “natural” groupings, as had been done with flora and fauna. Eighteenth-century naturalists had greater information and knowledge about the world’s peoples than their predecessors, and a number of scholars attempted to organize all this material into some logical scheme. Although many learned men were involved in this enterprise, it was the classifications developed by the Swedish botanist Carolus Linnaeus and the German physiologist Johann Friedrich Blumenbach that provided the models and terms for modern racial classifications.",
  "In publications issued from 1735 to 1759, Linnaeus classified all the then-known animal forms. He included humans with the primates and established the use of both genus and species terms for identification of all animals. For the human species, he introduced the still-current scientific name Homo sapiens . He listed four major subdivisions of this species, H. americanus , H. africanus , H. europaeus , and H. asiaticus . Such was the nature of knowledge at the time that Linnaeus also included the categories H. monstrosus (which included many exotic peoples) and H. ferus (“wild man”), an indication that some of his categories were based on tall tales and travelers’ myths.",
  "Blumenbach divided humankind into five “varieties” and noted that clear lines of distinction could not be drawn between them, as they tended to blend “insensibly” into one another. His five categories included American, Malay, Ethiopian, Mongolian, and Caucasian. (He chose the term Caucasian to represent the Europeans because a skull from the Caucasus Mountains of Russia was in his opinion the most beautiful.) These terms were still commonly used by many scientists in the early 20th century, and most continue today as major designations of the world’s peoples.",
  "These classifications not only rendered human groups as part of nature but also gave them concreteness, rigidity, and permanence. Moreover, some descriptions, especially those of Linnaeus, included statements about the temperament and customs of various peoples that had nothing to do with biophysical features but were forms of learned behaviour that are now known as “culture.” That cultural behaviour and physical characteristics were conflated by these 18th-century writers reflects both their ethnocentrism and the limited scientific knowledge of the time.",
  "Slavery always creates social distance between masters and slaves, and intellectuals are commonly called upon to affirm and justify such distinctions. As learned men began to write a great deal about the “racial” populations of the New World, Indians and Negroes were increasingly projected as alien. In this way did some Enlightenment thinkers help pro-slavery interests place responsibility for slavery in the “inferior” victims themselves.",
  "Would-be “scientific” writings about the distinctiveness of Blacks and Indians commenced late in the 18th century in tandem with exaggerated popular beliefs, and writings of this type continued on into the 20th century. The European world sought to justify not only the institution of slavery but also its increasingly brutal marginalization of all non-European peoples, slave or free. Science became the vehicle through which the delineation of races was confirmed, and scientists in Europe and America provided the arguments and evidence to document the inferiority of non-Europeans.",
  "About the turn of the 19th century, some scholars advanced the idea that the Negro (and perhaps the Indian) was a separate species from “normal” men (white and Christian), an idea that had been introduced and occasionally expressed in the 18th century but that had drawn little attention. This revived notion held that the “inferior races” had been created at a different time than Adam and Eve, who were the progenitors of the white race. Although multiple creations contradicted both the well-known definition of species in terms of reproductively isolated populations and the biblical description of creation, it is clear that in the public mind the transformation from race to species-level difference had already evolved. In the courts, statehouses, assemblies, and churches and throughout American institutions, race became institutionalized as the premier source, and the causal agent, of all human differences.",
  "One of those whose direct experience of African slaves and assessment of them was given great weight was Edward Long (1734–1813), a former plantation owner and jurist in Jamaica. In a book titled The History of Jamaica (1774), Long asserted that “the Negro” was “void of genius” and “incapable” of civilization; indeed, he was so far inferior as to constitute a separate species of mankind. Long’s work was published as a defense of slavery during a period of rising antislavery sentiment. Its greatest influence came during and after the American Revolutionary War (1775–83), when some southern Americans started freeing their slaves and moving north. Long’s writings, published in popular magazines, were widely read in the United States during the last decade of the 18th century.",
  "In 1799 Charles White, a Manchester physician, published the earliest proper “scientific” study of human races. He described each racial category in physical terms, identifying what he thought were differences in the head, feet, arms, complexion, skin colour, hair texture, and susceptibility to disease. White actually measured the body parts of a group of Blacks and whites, lending the semblance of hard science to his conclusions. He not only advocated a gradation of the races, but he provided support for the speculation that the Negro, the American Indian, some Asiatic tribes, and Europeans were of different species. His explanation for the presumed savagery of Africans was that they had degenerated from the pure and idyllic circumstances provided in the Garden of Eden while Europeans had made advances toward civilization.",
  "Such works as those of Long and White initiated a debate among scholars and scientists that had long-range implications for European attitudes toward human differences. The issue, as expressed by mid-19th-century scientists, was “the Negro’s place in nature”—that is, whether “the Negro” was human like Europeans or a separate species nearer to the ape.",
  "Samuel Morton, a Philadelphia physician and founder of the field of craniometry, collected skulls from around the world and developed techniques for measuring them. He thought he could identify racial differences between these skulls. After developing techniques for measuring the internal capacity of the skull, he concluded that Blacks had smaller brains than whites, with Indian brains intermediate between the two. Because brain size had long been correlated with intelligence in both the popular mind and science, Morton’s findings seemed to confirm that Blacks were also less intelligent than whites. In publications of 1839 and 1844, he produced his results, identifying the Native Americans as a separate race from Asians and arguing from his Egyptian materials that these ancient peoples were not Negroes. His findings magnified and exaggerated the differences between racial populations, imposing meaning on the differences that led to the conclusion that they were separate species.",
  "Morton soon became the centre of a network of scholars and scientists who advocated multiple creations (polygeny) and thus contradicted the long-established biblical view of one single creation from which all humans descended (monogeny). The most influential of the scientists involved in this debate was Louis Agassiz , who accepted a position at Harvard University and revolutionized the field of natural science. Agassiz converted from monogenism to polygenism after moving to the United States from Switzerland in 1846. It was then that he saw Blacks for the first time. He was also impressed with Morton’s work with skulls, and eventually he became the most important advocate of polygenism, conveying it in public lectures and to generations of students, many of whom took leading intellectual roles in American society.",
  "One result of the mid-19th-century concern with documenting racial distinctions by means of body measurements was the establishment of the “scientific” enterprise of anthropometry . During the Civil War the U.S. Sanitary Commission and the provost marshall general’s office collected data on the physical condition of military conscripts and volunteers in the army, navy, and marines. Using anthropometric techniques, they produced massive tables of quantitative measurements of the body dimensions of tens of thousands of whites, Blacks, mulattoes, and Indians. Scientists interpreted the data in a way that strengthened the argument that races were fundamentally distinct and that confirmed that Blacks, Indians, and mulattoes were inferior to whites. Anthropometry flourished as a major scientific method for demonstrating race differences well into the 20th century.",
  "For the first half of the 20th century, scholars continued to debate “the Negro’s place in nature.” But the debate over multiple or single origins receded after 1859, when the publication of Charles Darwin ’s theory of evolution led to a more dynamic understanding of human diversity. Evolution produced a new perspective on the causes of Blacks’ (supposedly) innate condition; the central problem became whether they evolved before or after whites. By the 1860s Black primitiveness was assumed without question. “The Negro,” in fact, had become the new savage, displacing Indians and Irishmen, and the ideology proclaimed that his savagery was intrinsic and immutable.",
  "The use of metrical descriptions, while they seemed objective and scientific, fostered typological conceptions of human group differences. From massive quantitative measurements, experts computed averages, means, and standard deviations from which they developed statistical profiles of each racial population. These profiles were thought to represent the type characteristics of each race expressed in what seemed to be impeccable scientific language. When statistical profiles of one group were compared with those of others, one could theoretically determine the degree of their racial differences.",
  "The activities of typologists carried a number of false assumptions about the physical characteristics of races. One was that racial characteristics did not change from one generation to another, meaning that averages of measurements such as body height would remain the same in the next generations. Another false assumption was that statistical averages could accurately represent huge populations, when the averaging itself obliterated all the variability within those populations.",
  "Expressed alongside existing myths and popular racial stereotypes, these measurements inevitably strengthened the assumption that some races were “pure” and some not so “pure.” Scholars argued that all the major races were originally pure and that some races represented the historical mixing of two or more races in the past. “Racial types” were conceived as representing populations with certain inherited morphological features that were originally characteristic of the race; every member of a race thus retained such traits. These beliefs attempted to validate the image of races as internally homogeneous and biologically discrete, having no overlapping features with other races.",
  "Typological thinking about race, however, was soon contradicted by the works of some early 20th-century anthropologists. Franz Boas , for example, published studies that showed that morphological characteristics varied from generation to generation in the same population, that skeletal material such as the cranium was malleable and subject to external influences, and that metrical averages in a given population changed in succeeding generations.",
  "Boas and the early anthropologists trained in the United States recognized that the popular conception of race linked, and thus confused, biology with language and culture. They began to advocate the separation of “race,” as purely a biological phenomenon, from behaviour and language, denying a relationship between physical traits and the languages and cultures that people carry.",
  "Though their arguments had little impact on the public at the time, these scholars initiated a new way of thinking about human differences. The separation of culture and language, which are learned behaviours, from biological traits that are physically inherited became a major tenet of anthropology. As the discipline grew and spread by means of scholarship and academic training, public understanding and recognition of this fundamental truth increased. Yet the idea of a hereditary basis for human behaviour remained a stubborn element of both popular and scientific thought.",
  "In 1900, after the rediscovery of Gregor Mendel ’s experiments dealing with heredity, scientists began to focus greater attention on genes and chromosomes. Their objective was to ascertain the hereditary basis for numerous physical traits. Once the ABO blood group system was discovered and was shown to follow the pattern of Mendelian heredity, other systems—the MN system, the Rhesus system, and many others—soon followed. Experts thought that at last they had found genetic features that, because they are inherited and not susceptible to environmental influences, could be used to identify races. By the 1960s and ’70s, scientists were writing about racial groups as populations that differed from one another not in absolute features but in the frequencies of expression of genes that all populations share. It was expected that each race, and each population within each race, would have frequencies of certain ascertainable genes that would mark them off from other races.",
  "Information on blood groups was taken from large numbers of populations, but, when scientists tried to show a correlation of blood group patterns with the conventional races, they found none. While populations differed in their blood group patterns, in such features as the frequencies of A, B, and O types, no evidence was found to document race distinctions. As knowledge of human heredity expanded, other genetic markers of difference were sought, but these also failed to neatly separate humanity into races. Most differences are expressed in subtle gradations over wide geographic space, not in abrupt changes from one “race” to another. Moreover, not all groups within a large “geographic race” share the same patterns of genetic features. The internal variations within races have proved to be greater than those between races. Most importantly, physical, or phenotypic, features assumed to be determined by DNA are inherited independently of one another, further frustrating attempts to describe race differences in genetic terms.",
  "Anthropometric measurements did not provide any direct data to prove group superiority or inferiority. As various fields of study emerged in the late 19th century, some scholars began to focus on mental traits as a means to examine and describe human differences. Psychology as a growing field began developing its own programmatic interests in discovering race differences.",
  "In the 1890s the psychologist Alfred Binet began testing the mental abilities of French schoolchildren to ascertain how children learned and to help those who had trouble learning. Binet did not call his test an intelligence test, and its purpose was not to divide French schoolchildren into hierarchical groups. But with these tests a new mechanism was born that would provide powerful support to those who held beliefs in racial differences in intelligence.",
  "Psychologists in the United States very quickly adopted Binet’s tests and modified them for American use. More than that, they reinterpreted the results to be clear evidence of innate intelligence. Lewis Terman and his colleagues at Stanford University developed the Stanford-Binet IQ (intelligence quotient) test, which set the standard for similar tests produced by other American psychologists.",
  "IQ tests began to be administered in large numbers during the second decade of the 20th century. The influences of hereditarian beliefs and the power of the racial worldview had conditioned Americans to believe that intelligence was inherited and permanent and that no external influences could affect it. Indeed, heredity was thought to determine a person’s or a people’s place in life and success or failure. Americans came to employ IQ tests more than any other nation. A major reason for this was that the tests tended to confirm the expectations of white Americans; on average, Blacks did less well than whites on IQ tests. But the tests also revealed that the disadvantaged people of all races do worse on IQ tests than do the privileged. Such findings were compatible with the beliefs of large numbers of Americans who had come to accept unqualified biological determinism.",
  "Opponents of IQ tests and their interpretations argued that intelligence had not been clearly defined, that experts did not agree on its definition, and that there were many different types of intelligence that cannot be measured. They also called attention to the many discrepancies and contradictions of the tests. One of the first examples of empirical evidence against the “innate intelligence” arguments was the revelation by psychologist Otto Klineberg in the 1930s that Blacks in four northern states did better on average than whites in the four southern states where expenditures on education were lowest. Klineberg’s analysis pointed to a direct correlation between income and social class and performance on IQ tests. Further evidence indicated that students with the best primary education and greater cultural experiences always did better on such tests. Experts thus argued that such tests are culture-bound; that is, they reflect and measure the cultural experiences and knowledge of those who take the tests and their levels of education and training. Few would deny that African Americans and Native Americans have long had a much more restricted experience of American culture and a far inferior education.",
  "Inheritance as the basis of individual social position is an ancient tenet of human history, extending to some point after the beginnings of agriculture (about 10,000 bce ). Expressions of it are found throughout the world in kinship-based societies where genealogical links determine an individual’s status, rights, and obligations. Wills and testaments capture this principle, and caste systems, such as that of India, reflect the expression of another form of this principle, buttressed by religious beliefs. Arguments for the divine right of kings and succession laws in European societies mirrored deep values of hereditary status.",
  "But many trends in European cultural history over the 18th and 19th centuries contradicted the idea of social placement by kinship fiat. Ever since the enclosure movement in England in the 15th century, the transformation to wage labour, the rise of merchant capitalism, and the entry into public consciousness of the significance of private property, Europeans have been conditioned to the values of individualism and of progress through prosperity. Wage labour strengthened ideas of individual freedom and advancement. The philosophy of autonomous individualism took root in western European societies, beginning first in England, and became the engine of social mobility in these rapidly changing areas. For their descendants in America, the limitations of hereditary status were antithetical to the values of individual freedom, at least freedom for those of European descent.",
  "Reflecting and promoting these values were the works of some of the Enlightenment writers and philosophers, including Voltaire , Jean-Jacques Rousseau , John Locke , and Montesquieu . Their writings had a greater impact on Americans than on their compatriots. Their advocacy of human freedom and the minimal intrusion of government was uniquely interpreted by Americans.",
  "European societies had long been structured into class divisions that had a strong hereditary basis, but the gulf between those who benefited from overseas trade and the impoverished masses who competed for low-paying jobs or survived without work in the gutters of towns and cities widened dramatically during the age of empire building. In France the dissatisfaction of the masses erupted periodically, reaching a peak in the French Revolution of 1789 , which overthrew the Bourbon monarch and brought Napoleon I to power.",
  "As early as the turn of the 18th century, some intellectuals were concerned with these seething class conflicts that occasionally burst forth into violence in France. Henri de Boulainvilliers , a French count whose works were published in the 1720s and ’30s, put forth an argument designed to justify the dominance of the aristocratic classes in France. He maintained that the noble classes were originally Germanic Franks who conquered the inferior Gauls, Romans, and others and established themselves as the ruling class. The Franks derived their superiority from German forebears, who were a proud, freedom-loving people with democratic institutions, pure laws, and monogamous marriage. They were great warriors, disciplined and courageous, and they ruled by the right of might. According to Boulainvilliers, they carried and preserved their superiority in their blood. With this argument, hereditarian ideology intruded into the consciousness of France’s elite class and synthesized with a growing belief in “race” as the causal explanation for historical events.",
  "In England, from the time that Henry VIII broke with the Roman Catholic Church and Protestant sects emerged on the horizon, historians, politicians, and philosophers had been wrestling with the creation of a new English identity. Indeed, European powers were soon to be caught up in the ethnic rivalries, extreme chauvinism, and intolerance out of which all the nation-states of Europe would be created. The English sought their new identity in the myths and heroics of the past and strove to create an image of antiquity that would rival those of other great civilizations. They created a myth of an Anglo-Saxon people, distinguished from the Vikings , Picts , Celts , Romans, Normans , and others who had inhabited English territory. In their histories the Anglo-Saxons were a freedom-loving people who had advanced political institutions, an early form of representative government, and a pure religion long before the Norman Conquest . Although in part the English were concerned about the identification and preservation of ancient institutions to justify the distinctiveness of their political and ecclesiastical structures, they also wanted to establish and glorify a distinguished ancestry. The English too turned toward the German tribes and a “racial” ideology on which to base their claims of superiority.",
  "The English scholars and Boulainvilliers derived their depictions of the Germans and their arguments from a common source, the works of Tacitus , a Roman historian born in the middle of the 1st century ce . At the end of the 1st century, Tacitus had published the Germania , a study of the German tribes to the north of Rome. It is the first, and most comprehensive, ethnographic study compiled in the ancient world and remains today a good description of a people seen at that time as barbarians.",
  "Tacitus idealized the simple, unadulterated lives of the German tribes and contrasted what he saw as their positive cultural features with the decadence and decline of the Romans. The German tribes were indeed the first noble savage s of the Western world. Tacitus sought to provide a moral lesson about the corruption and decline of civilizations in contrast to the virtues and moral uprightness of simple societies. Little could he have anticipated that his descriptions of a simple tribal people, written for 2nd-century Romans, would form one of the bases for a powerful theory of racial superiority that dominated the Western world during the 19th and 20th centuries.",
  "None of the writers harking back to the German tribes for a depiction of good government and pure institutions noted any of the negative or unsavory characterizations that Tacitus also detailed in the Germania . Among other things, he claimed that the Germans were intensely warlike; they hated peace and despised work; when not fighting—and they loved fighting, even among themselves—they idled away their time or slept. They had a passion for gambling and drinking, and they gave blind obedience to their chiefs.",
  "The Germanic myth flourished and spread. Boulainvilliers was widely read in England and by segments of the intellectual classes in Germany and France. By the mid- to late 18th century the English version of the Germanic myth—Anglo-Saxonism—had been transformed from an idea of superior institutions into a doctrine of English biological superiority. The French version remained a competing idea validating social class interests in that nation, and, with the defeat of Napoleon and the restoration of the Bourbon monarchy after 1815, it was revived by those political forces that believed in the permanence of the unequal social hierarchy. It would grow and penetrate into many other areas, notably the modern German nation itself.",
  "The most important promoter of racial ideology in Europe during the mid-19th century was Joseph-Arthur, comte de Gobineau , who had an almost incalculable effect on late 19th-century social theory. Published in 1853–55, his Essay on the Inequality of Human Races was widely read, embellished, and publicized by many different kinds of writers. He imported some of his arguments from the polygenists, especially the American Samuel Morton. Gobineau claimed that the civilizations established by the three major races of the world (white, Black, and yellow) were all products of the white races and that no civilization could emerge without their cooperation. The purest of the white races were the Aryans. When Aryans diluted their blood by intermarriage with lower races, they helped to bring about the decline of their civilization.",
  "Following Boulainvilliers, Gobineau advanced the notion that France was composed of three separate races—the Nordics, the Alpines, and the Mediterraneans—that corresponded to France’s class structure. Each race had distinct mental and physical characteristics; they differed in character and natural abilities, such as leadership, economic resourcefulness, creativity, and inventiveness, and in morality and aesthetic sensibilities. The tall, blond Nordics, who were descendants of the ancient Germanic tribes, were the intellectuals and leaders. Alpines, who were brunet and intermediate in size between Nordics and Mediterraneans, were the peasants and workers; they required the leadership of Nordics. The shorter, darker Mediterraneans he considered a decadent and degenerate product of the mixture of unlike races; to Gobineau they were “nigridized” and “semitized.”",
  "Americans of this period were among Gobineau’s greatest admirers. So were many Germans. The latter saw in his works a formula for unifying the German peoples and ultimately proclaiming their superiority. Many proponents of German nationalism became activists and organized political societies to advance their goals. They developed a new dogma of “Aryanism” that was to expand and become the foundation for Nazi race theories in the 20th century.",
  "Gobineau was befriended by the great composer Richard Wagner , who was a major advocate of racial ideology during the late 19th century. It was Wagner’s future son-in-law Houston Stewart Chamberlain , writing at the end of the 19th century, who glorified the virtues of the Germans as the superrace. In a long book titled The Foundations of the Nineteenth Century , Chamberlain explained the history of the entire 19th century—with its European conquests, dominance, colonialism, and exploitation—as a product of the great accomplishments of the German people. Though English-born, Chamberlain had a fanatical attraction to all things German and an equally fanatic hatred of Jews. He believed Jesus was a Teuton, not a Jew, and argued that all Jews had as part of their racial character a moral defect. Fueled by rising anti-Semitism in Europe, race ideology facilitated the manufacture of an image of Jews as a distinct and inferior population. Chamberlain’s publications were widely disseminated in Germany during the turn of the 20th century. His speculations about the greatness of the Germans and their destiny were avidly consumed by many, especially young men such as Adolf Hitler and his companions in the National Socialist Party .",
  "As this history shows, European intellectual leaders took the constituent components of the ideology of race and molded them to the exigencies of their particular political and economic circumstances, applying them to their own ethnic and class conflicts. Race thus emerged as a powerful denoter of unbridgeable differences that could be applied to any circumstances, particularly of ethnic conflict. The German interpretation of race eventually took the ideology to its logical extreme, the belief that a “superior race” has the right to eliminate “inferior races.”",
  "Hereditarian ideology also flourished in late 19th-century England. Two major writers and proselytizers of the idea of the innate racial superiority of the upper classes were Francis Galton and Herbert Spencer . Galton wrote books with titles such as Hereditary Genius (1869), in which he showed that a disproportionate number of the great men of England—the military leaders, philosophers, scientists, and artists—came from the small upper-class stratum. Spencer incorporated the themes of biological evolution and social progress into a grand universal scheme. Antedating Darwin, he introduced the ideas of competition, the struggle for existence, and the survival of the fittest. His “fittest” were the socially and economically most successful not only among groups but within societies. The “savage” or inferior races of men were clearly the unfit and would soon die out. For this reason, Spencer advocated that governments eschew policies that helped the poor; he was against all charities, child labour laws, women’s rights, and education for the poor and uncivilized. Such actions, he claimed, interfered with the laws of natural evolution; these beliefs became known as social Darwinism .",
  "The hereditarian ideologies of European writers in general found a ready market for such ideas among all those nations involved in empire building. In the United States these ideas paralleled and strengthened the racial ideology then deeply embedded in American values and thought. They had a synergistic effect on ideas of hereditary determinism in many aspects of American life and furthered the acceptance and implementation of IQ tests as an accurate measure of innate human ability.",
  "As they were constructing their own racial identities internally, western European nations were also colonizing most of what has been called, in recent times, the Third World, in Asia and Africa. Since all the colonized and subordinated peoples differed physically from Europeans, the colonizers automatically applied racial categories to them and initiated a long history of discussions about how such populations should be classified. There is a very wide range of physical characteristics among Third World peoples, and subjective impressions generated much scientific debate, particularly about which features were most useful for racial classification. Experts never reached agreement on such classifications, and some questions, such as how to classify indigenous Australians, were subjects of endless debate and were never resolved.",
  "Race and race ideology had become so deeply entrenched in American and European thought by the end of the 19th century that scholars and other learned people came to believe that the idea of race was universal. They searched for examples of race ideology among indigenous populations and reinterpreted the histories of these peoples in terms of Western conceptions of racial causation for all human achievements or lack thereof. Thus, the so-called Aryan invasions of the Indian subcontinent that began about 2000 bce were seen, and lauded by some, as an example of a racial conquest by a light-skinned race over darker peoples. The Aryans of ancient India (not to be confused with the Aryans of 20th-century Nazi and white supremacist ideology) were pastoralists who spread south into the Indian subcontinent and intermingled with sedentary peoples, such as the Dravidians, many of whom happened to be very dark-skinned as a result of their long adaptation to a hot, sunny tropical environment. Out of this fusion of cultures and peoples, modern Indian culture arose. Such conquests and syntheses of new cultural forms have taken place numerous times in human history, even in areas where there was little or no difference in skin colour (as, for example, with the westward movements of Mongols and Turkish peoples).",
  "India has a huge population encompassing many obvious physical variations, from light skins to some of the darkest in the world and a wide variety of hair textures and facial features. Such variations there, as elsewhere, are a product of natural selection in tropical and semitropical environments, of genetic drift among small populations, and of historical migrations and contact between peoples.",
  "The Hindu sociocultural system was traditionally divided into castes that were exclusive, hereditary, and endogamous. They were also ranked and unequal and thus appeared to have many of the characteristics of “race.” But the complex caste system was not based primarily on skin colour, as castes included people of all physical variations. Nor was it based on a “scientific” ideology of superiority or inferiority, although late 19th-century pseudoscientific analyses attempted to explain the system’s longevity ( see below ). Although some early 20th-century European scholars tried to divide the Indian and other Asian peoples into races, their efforts were hindered not only by the complexity of physical variations in India, parts of Southeast Asia, and Melanesia but by the developing fields of science.",
  "Castes were, and are still, occupational groups as well as elements in a religious system that accords different values and different degrees of purity to different occupations. They also are the main regulators of marriage and inheritance rights. Some castes were originally small-scale tribal groups who were incorporated into the Hindu kingdoms. It has been noted that there are thousands of castes in India and many different ways of ranking them, including through such cultural features as food taboos and sharing obligations, but none derive from skin colour or “race.”",
  "Caste discrimination has been outlawed in India, although it remains deeply rooted in the cultures of ordinary people. Moreover, democratic values, the human rights movement, and the processes of industrialization have affected the rigid social caste system of India and led in some areas to a blurring of caste boundaries and a decline in the importance of caste identity.",
  "A few ethnographic studies have suggested that a form of racial ideology has developed independently of the West in some traditional societies such as that of Japan, where various minority peoples, notably the  burakumin  and the Ainu , have been victimized and exploited by the dominant society. The burakumin , the former outcastes, have suffered from various forms of discrimination because of folk myths about their “polluted blood,” a discourse that has historical origin but no biological reality. Discrimination against them has been made possible by identifying group membership on the basis of descent—in modern times this discrimination is most pronounced in marriage, but historically it also affected housing and employment—and “traditional” occupations—such as butchering animals or disposing of corpses—which had been considered undesirable for the centuries during which Buddhism was a dominant religion. Medieval documents reveal that long before Japan imported Western racial ideology in the modern age, they were portrayed as being of a different shu (“race”), and discrimination against them was institutionalized and legalized. Although the burakumin were declared by law in 1871 to be of equal status, prejudice against them persisted into the 21st century.",
  "The Ainu are an indigenous people who once occupied the northern part of Japan. Today they inhabit Hokkaido and various other parts of Japan as well, including the greater Tokyo region. Contemporary scholars agree that both the Ainu and the more dominant Japanese share the ancestral Jōmon culture . The old theory that claimed that the Ainu bore greater resemblance to Europeans than to Asians, as seen in their abundance of body hair and rounder eyes, is no longer accepted.",
  "It should be noted that when the indigenous racial worldview that developed independently in premodern Japan merged with Western scientific racism after the 1868 Meiji Restoration , the “biological differences” from the dominant Japanese of such groups as the Ainu, the Okinawans, and the burakumin , which physical anthropologists “found” or redefined through various body measures, were used to justify both the government’s assimilation policies and discriminatory practices.",
  "In the post-World War II era, discrimination against Koreans, one of the largest minorities in contemporary Japan, has been a major issue of racism. Ethnic Koreans are forced to choose between giving up various resources available only to Japanese citizens so that they can maintain their Korean identities and giving up recognition of their Korean identity in order to receive Japanese citizenship.",
  "A crucial element in understanding the various ideas of race in Asia is that morphological ( phenotypic ) differences do not always play the major role in determining racial differences, although exposure to Western definitions of race and forms of racism since the mid-19th century have made morphological differences more important than they once were.",
  "As elsewhere, Asian ideologies of status arose with the development of agriculture and the accompanying territorial expansions of imperial states. Traditionally, Asian notions of difference tended to be shaped by criteria such as descent, religion, and language rather than by physical characteristics. The historical discrimination against the burakumin in Japan and the demarcation between ethnic Chinese and “barbarians” in the Qing dynasty (1644–1911/12), for example, were already as rigidly institutionalized in the premodern period as the anti-Semitism found throughout European history.",
  "Thus, perceptions of skin colour did not have the same significance or connotation as in Europe and the Americas. In India many of the supreme deities, including Shiva , Rama , and Krishna , were depicted as dark blue or black—colours that are said to symbolize the dark clouds that bring rain to the fields and, by implication, the prosperity that accompanies a plentiful harvest. Japanese paintings depicting encounters with European missionaries in the 17th century emphasize differences in the shapes of noses and hair and eye colour but depict the skin tone of visiting Europeans as the same as that of Japanese. Yet, in various Asian regions, Europeans are sometimes referred to as “red faces” or “red people,” while in other cases Chinese and Japanese are labeled as “white people.”",
  "The introduction of European theories of race in the 19th century had enormous impact almost everywhere in Asia—as it did in the rest of the world. Recognized as part of Western knowledge, and thus symbolizing modernity, racial classification theories became a new tool of authority for European colonizers and Asian leaders alike. These ideas were invoked to justify the hierarchical relationship between “white” colonizers and “yellow” or “brown” Asians in general, as well as that between high- and low-status Asians.",
  "Colonizers were preoccupied with race (a term they rarely defined, and then inconsistently) and began to use it as a gloss for the aforementioned forms of traditional Asian social differentiation. By the mid-1800s colonial Europeans were employing techniques such as ethnographic research, mapping, and census taking to describe Asia’s various “races.” In Japan, Western racial classification theories, along with Western sciences, started to become known by the late Tokugawa period (1603–1867) through missionaries and Dutch writings. They spread widely throughout the country after the Meiji Restoration in 1868, and Johann Friedrich Blumenbach ’s five classifications (Caucasian, Mongolian, Malayan, Ethiopian, and American), for instance, appeared in elementary school textbooks as early as the 1870s. Blumenbach’s classifications were introduced to China by missionaries and by Chinese intellectuals who had studied Japan in the late 19th century. About the same time, the Han Chinese started to celebrate their descent from Huangdi ( c. 2700 bce ) and to reclaim their mythical Yellow Emperor as the founder of Chinese civilization—a narrative that bolstered the Chinese arguments according to which they were the prime race within the “yellow” race.",
  "There was a relatively short time span in Asia between the acceptance of a Westernized racial classificatory system and the adoption of social Darwinism , a philosophy positing that “weak” groups or races will eventually be driven to extinction by those that are more “fit.” Chinese and Japanese intellectuals—the former in the social chaos partly rooted in the aftermath of the Opium Wars , and the latter on the brink of modernization—did not critically question the Eurocentric and bigoted nature of the Western conception of race or of social Darwinism. In fact, “racial improvement” through amalgamation with the white race was proposed by some influential thinkers in both countries. Various anthropometric methods were employed or invented in China and Japan under the influence of Western scientific racism and were soon used to “verify” the “low” racial status of domestic marginalized groups and of the “barbarian” races outside national boundaries. Such findings were soon used to justify the state-led subjugation of these groups.",
  "Western racial characterizations spread to other parts of Asia in the latter half of the 19th century. These classifications not only justified the superior social position of European colonizers in regard to Asian subordinates but also evolved into detailed subdivisions between colonial subjects themselves, wherein the elite characterized “tribes” and other marginalized groups as “barbarian” and “primitive.” In colonial India the British anthropologists who conducted ethnographic research built reciprocal relationships with Indian elites and went so far as to construct a defense of the country’s caste system. This defense was based on the “scientific” analysis of cranial differences between members of different castes. The findings were taken seriously at the time, however, and indicated that Bengali upper castes were Aryan in origin and that the lower castes such as foragers and pastoralists were, under the precepts of social Darwinism, destined to die out. Thus, in the closing decades of the 19th century, the idea of race gained a particular meaning in colonial Southeast Asia and India—a meaning that supported public policies that were beneficial to colonizers and the ruling classes and very injurious to nonelites, who were presumed to be on the path to extinction.",
  "European racial ideology was put to a different use in independent Southeast Asian countries such as Siam (now Thailand ). There, in the late 19th century, elites seeking to create a modern state employed European ideas of race to position within a global racial and civilizational hierarchy not only their own peoples but also those of neighbouring states. They located each group in a hierarchy according to perceived degrees of “civilization.” Western studies tracing the common linguistic origins of various cultures led to the conceptualization of a Thai “nation” or Thai “race” that consisted of all Thai -speaking peoples living within or beyond Siam’s national borders. As elsewhere, public policy was affected by concepts of race: Siam initiated assimilation and integration policies in the early 20th century as part of a pan-Thai movement, intending to build a Thai empire that would politically and geographically unite all peoples of the Thai race into one nation-state.",
  "Two contrasting censuses taken in Malaysia in 1911 reflect sharp differences in race consciousness: while the Straits Settlements census used alphabetic ordering starting with “Aboriginees of the Peninsula,” the Federated Malay States ( Negeri Sembilan , Pahang , Perak , and Selangor ) census listed categories by racial classification, with Europeans appearing at the top, followed by Eurasians, Malays, Chinese, Indians, and “other.” After 1911 ethnic classification generally followed the latter pattern.",
  "The “Yellow Race” began to be perceived as a threat to “White civilized countries,” particularly after Japan’s victory in the Russo-Japanese War of 1904–05, which was sensationally cast in the West as the first loss of the white race to a nonwhite race in centuries. Resistance to the mounting European invasion of China and other parts of Asia and Euro-American racism toward the burgeoning Asian population grew and intensified. A commonly shared and mutually reinforcing conviction developed between the Chinese and the Japanese: they saw themselves as different branches of a single “yellow” race that was involved in a pan-Asiatic struggle against Western imperialism. Simultaneously, they projected their own prejudices against the “brown” races of other Asian countries, whom they regarded as barbarian and backward.",
  "Yet each country also interpreted the situation to its own benefit. China believed its central position within the “yellow” race was to counteract the hegemony of the “white” race while at the same time advocating that the “red,” “brown,” and “black” races be allowed (under the auspice of social Darwinism) to pass into extinction. Japan, on the other hand, claimed its destiny was to be the leading race in Asia. Japan used this concept to justify its invasion of Manchuria in 1931–32 and later to expand its reach across different Asian countries in the name of the Greater East Asia Co-Prosperity Sphere in an attempt to control these regions and obtain much-needed natural resources.",
  "In the period following World War II, as Asian countries embarked on nation building, perceptions of race have played essential roles in defining their national identities and shaping their external relations, particularly with Europe and America. The advancement of Westernization and the wide presence of U.S. military bases in Asia have significantly affected aesthetic ideals among Asian peoples. In different regions of contemporary Asia, lighter skin and other phenotypes that are traditionally considered traits of Europeans are now regarded as more desirable. Asian countries are not exempt from trends in global migration since the late 20th century. Even a society such as that of Korea, which is considered to be one of the most “homogeneous” in the world, is facing increasing immigration and issues of multiculturalism.",
  "Nongovernmental organizations (NGOs) and government-sponsored multicultural policies have helped spread the notions of civil rights and antiracism in Asia. However, the influence of neoliberal economic policies has also affected immigrants and minorities, further marginalizing them economically and socially. Racism today sometimes appears not just within a nation-state framework but also in complex transnational and global frameworks, thus making it more difficult to combat. Since the turn of the 21st century, transnational alliances to combat racism have been formed, such as that between the burakumin in Japan and the Dalits (or “ untouchables ”) in India, as exemplified in the UN World Conference Against Racism and Anti-Discrimination (2001), held in Durban, S.Af.",
  "On the other hand, the global hegemony of neoliberalism after the end of the Cold War has made it more difficult to combat racism because of the emergence of new divisions within the same racialized group. While those with corresponding cultural resources may become power brokers and represent their communities vis-à-vis the multicultural state apparatus, the poor are increasingly exploited and are pushed into informal and insecure forms of employment. Meanwhile, a new nonwhite economic elite has risen to global power while maintaining diasporic connections across the world. Whether all these developments together will result in a change in the global racial hierachies remains to be seen.",
  "Race is a highly variable construct in Latin America , where racial ideas typically refer to “Blacks” (Africans brought to the region as slaves and their descendants), “whites” (European colonists who conquered and settled the region and their descendants), and “Indians” (the indigenous population that inhabited the region before European conquest). A key feature of race in Latin America is the idea of mestizaje or mestiƈagem (“mixture” in Spanish and Portuguese, respectively), which refers to the biological and cultural blending that has taken place among these three populations.",
  "The process of mixture in Latin America began with European colonization . It was conditioned by factors that varied from one region to the next, such as the number and nature of an area’s indigenous societies, the origins and goals of its colonists, and the extent and type of slavery they practiced.",
  "Before the European conquest, the American Indian population was quite diverse and ranged from densely settled, politically stratified societies with urban centres (as with the Inca and Aztec empires) to mobile, egalitarian hunting and gathering cultures . Although the indigenous peoples of Latin America were quickly decimated by European diseases and ill treatment, the indigenous groups that had been populous at the time of contact generally remained relatively large. In these cases, most notably in the central Andes and central Mexico , Spanish colonists primarily enslaved native peoples, although they also used some enslaved Africans. In other areas, such as Brazil , Cuba , and Colombia , indigenous populations had plummeted so greatly that the Portuguese and Spanish colonists imported large numbers of African slaves.",
  "Genetic and cultural mixing between Europeans, Africans, and indigenous peoples started almost immediately upon contact, although some elite Europeans disavowed it. The offspring of mixed unions were recognized as socially distinct from their parents, and new social classifications proliferated. Although  mestizo  (“mixed person”) was a general label, it often referred specifically to people of indigenous and European heritage, while the term mulato (“mulatto”) usually referred to a person of African and European descent. Labels multiplied as time went on, as with zambo (Black-indigenous mix) and pardo (literally, “brown person,” commonly used to denote a person of African and European descent). Spanish colonists attempted to systematize a hierarchy of socio-racial classes, known as a sociedad de castas (“society of castes, or breeds”). Portuguese colonists were less pedantic about this.",
  "In all cases, mixture occurred in a setting in which Europeans were socially, economically, and militarily dominant and thus able to exploit Black and indigenous labour and to enforce—or at least attempt to enforce—cultural changes in such areas as religious practice. However, many Black and indigenous people resisted the colonial powers. They mounted many rebellions, and sizeable numbers escaped to the hinterlands, where they joined or rejoined extant communities or began new settlements.",
  "By the mid-19th century most Latin American countries had become independent republics and abolished slavery. Important exceptions were Brazil, Cuba, and Puerto Rico, where slavery persisted until the 1880s, although by then most slaves had already been freed. Elites were keen to define their new nations’ identities in a positive light but had difficulty reconciling the mixed nature of their populations with the era’s popular, but since disproved, theories about the supposed biological inferiority of people of colour.",
  "Especially around the turn of the 20th century, some Latin Americans responded to this dilemma by invoking a notion of “progressive mixture.” This theory admitted that the national populations of Latin America were mixed but also assumed that the region was moving toward a “superior” state of increasing “whiteness.” Many countries encouraged European immigration in order to hasten this supposed process of blanqueamiento (“whitening”). The beliefs and practices of elites in countries with large indigenous populations (e.g., Mexico) became quite contradictory: they tended to glorify the indigenous past in ideologies of indigenismo while still envisaging a future of integration and mixedness, all the while discriminating against extant indigenous peoples.",
  "Many Latin American intellectuals tried to distance themselves from Euro-American theories of race by asserting that mixture had created a tolerant society in which racism was not an issue and in which biology played little part in defining social identities. This image of “racial democracy” was made in explicit contrast to the racial segregation of the United States and persisted into the 21st century. In everyday practice, however, Latin American ideas about “race” continued to play an important role: although identity categories such as “Black,” “Indian,” “white,” and “mestizo” were recognized as highly variable and predominantly cultural, they nonetheless continued to be informed by ideas about descent (in terms of some internal “essence”) and the body (in terms of appearance).",
  "An example from Brazil helps to illustrate the complex ways that these issues played out in everyday life: much evidence collected since the 1950s indicates that, despite the indeterminacy of “Black” as a collective identity, substantial racial inequality exists and is maintained in part by continuing discrimination against individual Blacks. Other evidence, for example, from Colombia, Guatemala , and Peru , indicates that positive notions about physical and cultural mixture have continued to coexist with ideas about the superiority of whiteness and the inferiority of blackness and indigenousness.",
  "In the late 20th century, several Latin American countries redefined their national identities, moving away from ideas of blanqueamiento and toward an official recognition and celebration of cultural and ethnic plurality. This was partly in response to indigenous and, to a lesser extent, Black political activism that, building on long-standing traditions of resistance, flowered from the 1960s. The term race rarely occurs in this new discourse, yet the same categories—Black, white, Indian—are in evidence. These developments have reaffirmed Black and indigenous identities, especially in the public realm and when particular rights—most importantly, to land—are tied to what is now called “ethnicity.” Although indigenous peoples have long had special land reserves in many parts of Latin America, it was only at the turn of the 21st century, most notably in Colombia, that the possibility of Black communities applying for reserve land emerged.",
  "The impact of these developments on Latin American ideas of race is not clear. Despite changes over the long term, the key trope of “mixture” has remained a vital (if publicly de-emphasized) part of Latin American national identities. In the past this trope did not erase the presence of Blacks and indigenous peoples, but it did marginalize them—sometimes to the point of near invisibility. Although an emphasis on multiculturalism has helped to increase the visibility of these groups, the question of whether such developments will help to reduce their social, economic, and political marginality remains unanswered.",
  "Scientists have known for many decades that there is little correlation between “race,” used in its popular sense, and actual physical variations in the human species. In the United States, for example, the people identified as African Americans do not share a common set of physical characteristics. There is a greater range of skin colours, hair colours and textures, facial features, body sizes, and other physical traits in this category than in any other human aggregate identified as a single race. Features of African Americans vary from light skins, blue or gray eyes, and blond hair to dark skins, black eyes, and crinkly hair and include every range and combination of characteristics in between. American custom has long classified any person with known African ancestry as Black, a social mandate often called the “one-drop rule.” This principle not only attests to the arbitrary nature of Black racial identity, but it was also presumed to keep those classified as racially “white” pure and untainted by the “blood” of low-status and inferior races. This rule has not applied to other “racial” mixtures, such as children born of white and Asian parents, although some of these children have suffered discrimination because of physical similarities to their lower-status parent. All this gives clear evidence of the socially arbitrary nature of race categories in North America.",
  "Other types of anomalies have frequently appeared in efforts to classify “racial” populations around the world. Whereas British scholars, for example, tend to separate East Indians into their own racial category (during the colonial period, natives of India, Burma, Melanesia, and Australia were, and still are, called “Blacks”), American scholars have usually included East Indians in the “Caucasian” category to differentiate them from American Blacks. Light-skinned Indians usually from northern India have been accepted as “white,” but very dark Indians have sometimes experienced colour discrimination in the United States.",
  "Since World War II, travel and immigration have greatly increased the contact of Western peoples with a wide variety of peoples throughout the world. Contact with peoples of the South Pacific and Southeast Asia, as well as with peoples from several areas of Africa and the Middle East, has shown that most of these people do not neatly fit into existing racial stereotypes. Some appear to have a mixture of Asian and African or European and African physical characteristics. Others, such as Melanesians, can easily be mistaken for Africans or Black Americans. More anomalous are native Australians, some of whom have light or blond wavy hair combined with dark skins. Many Americans are recognizing that the social categories of race as evolved in the United States are inadequate for encompassing such peoples who, indeed, do not share the social history of racial minorities in the United States.",
  "In the 1950s and ’60s the United States began experiencing an influx of new immigrants from Latin America. Spanish and Portuguese colonial societies exhibited very different attitudes toward physical differences. Even before Christopher Columbus set sail, the Mediterranean world had long been a world of heterogeneous peoples. Africans, southern Europeans, and peoples of the Middle East have interacted and interbred over thousands of years, as long as humans have occupied these regions. The Iberian peoples brought their customs and habits to the New World. There, as described above, intermating among Europeans, Africans, and Native Americans soon began to produce a population of “mixed” peoples. The descendants of these peoples who entered the United States since the mid-20th century further confound “racial” categories for those who believe in them.",
  "U.S. military personnel fighting in the Persian Gulf region were startled to see that many Saudi Arabians, Yemenis, Omanis, and other peoples in the Middle East resembled African Americans or Africans in their skin colour, hair texture, and facial features. Many Southeast Asians and Middle Easterners have found that they are frequently mistaken for Blacks in America. Some American Indians are mistaken for Chinese, Japanese, or other Asian ethnic groups on the basis of their skin colour, eye structure, and hair colour and texture. Some Central and South Americans and many Puerto Ricans are perceived as Arabs. In like manner, many Arab Americans or Persians are thought to be Latinos. “Race” is, indeed, in the eye of the beholder.",
  "Clearly, physical features are insufficient clues to a person’s ethnic identity. They reveal nothing about a person’s culture, language, religion, and values. Sixth-generation Chinese Americans have American ethnicity; many know little or nothing about traditional Chinese culture, just as European Americans and African Americans may know little or nothing about the cultures of their ancestors. Moreover, all cultures change, and they do so independently of the biogenetic features of their carriers.",
  "Contemporary scientists hold that human physical variations, especially in those traits that are normally used to classify people racially—skin colour, hair texture, facial features, and to some extent bodily structure—must be understood in terms of evolutionary processes and the long-range adaptation of human groups to differing environments. Other features may simply reflect accidental mutations or functionally neutral changes in the genetic code.",
  "In any given habitat, natural forces operate on all of the living forms, including human groups. The necessary interaction with these forces will affect the survival and reproduction of the members of these societies. Such groups already have a wide and complex range of hereditary physical characteristics; indeed, human hereditary variability is a product of human sexual reproduction, whereby every individual receives half of his or her genetic endowment from each parent and no two individuals (except for identical twins) inherit the same combination of genetic features.",
  " The global distribution of skin colour ( see  map ) is the best example of adaptation, and the consequences of this process have long been well known. Skin colour clines (gradations) in indigenous populations worldwide correlate with latitude and amounts of sunlight. Indigenous populations within a broad band known as the tropics (the regions falling in latitude between the Tropics of Cancer and Capricorn ) have darker skin colours than indigenous populations outside of these regions.",
  "Within the tropics, skin colours vary from light tan to very dark brown or black, both among populations and among individuals within groups. The darkest skin colours are found in those populations long residing in regions where intense ultraviolet sunlight is greatest and there is little natural forest cover. The bluish black skins of some peoples—such as some of the Dravidians of South India, the peoples of Sri Lanka and Bangladesh, and peoples of the eastern Sudan zone, including Nubia, and the grasslands of Africa—are examples of the extremes of dark skin colour. Medium brown to dark brown peoples are found in the rest of tropical Africa and India and throughout Australia, Melanesia, and other parts of Southeast Asia.",
  "Peoples with light skin colours evolved over thousands of years in northern temperate climates. Human groups intermittently migrating into Europe and the northern parts of the Eurasian landmass over the past 25,000–50,000 years experienced a gradual loss of skin pigmentation. The changes were both physiological and genetic; that is, there were systemic changes in individuals and long-range genetic changes as a result of natural selection and, possibly, mutations. Those individuals with the lightest skin colours, with lowest amounts of melanin , survived and reproduced in larger numbers and thus passed on their genes for lighter skin. Over time, entire populations living in northern climates evolved lighter skin tones than those individuals living in areas with higher levels of sunlight. Between populations with light skin and those with the darkest coloration are populations with various shades of light tan to brown. The cline in skin colours shows variation by infinite degrees; any attempts to place boundaries along this cline represent purely arbitrary decisions.",
  "Scientists at the turn of the 21st century understood why these superficial visible differences developed. Melanin, a substance that makes the skin dark, has been shown to confer protection from sunburn and skin cancers in those very areas where ultraviolet sunlight is strongest. Dark skin, which tends to be thicker than light skin, may have other protective functions in tropical environments where biting insects and other vectors of disease are constant threats to human survival. But humans also need vitamin D, which is synthesized by sunlight from sterols (chemical compounds) present in the skin. Vitamin D affects bone growth, and, without a sufficient amount, the disease known as rickets would have been devastating to early human groups trying to survive in the cold, wintry weather of the north. As these groups adapted to northern climates with limited sunlight, natural selection brought about the gradual loss of melanin in favour of skin tones that enabled some individuals to better synthesize vitamin D.",
  "Other physical characteristics indicate adaptations to cold or hot climates, to variations in elevation from sea level, to rainforests with high levels of rainfall, and to hot deserts. Body structure and the amount of body fat have also been explained by evolutionists in terms of human adaptation to differing environments. Long, linear body builds seems to be highly correlated with hot, dry climates. Such people inhabit the Sahara and the desiccated areas of the Sudan in Africa. Short, stocky body builds with stubby fingers and toes are correlated with cold, wet climates, such as are found in Arctic areas. People adapted to cold climates have acquired genetic traits that provide them extra layers of body fat, which accounts for the epicanthic fold over their eyes. People who live in areas of high elevation, as in the mountains of Peru, tend to have an adaptive feature not found among peoples who live at sea level; they have larger lungs and chest cavities. In an atmosphere where the oxygen supply is low, larger lungs are clearly adaptive.",
  "Some adaptive variations are not obviously visible or measurable. Many peoples adapted to cold climates, for example, have protective physiological reactions in their blood supply. Their blood vessels either constrict the flow to extremities to keep the inner body warm while their surface skin may be very cold (vasoconstriction) or dilate to increase the blood flow to the hands, feet, and head to warm the outer surfaces (vasodilation).",
  "The prevalence of diseases has been another major factor in the evolution of human diversity, and some of the most important of human genetic variations reflect differences in immunities to diseases. The sickle cell trait (hemoglobin S), for example, is found chiefly in those regions of the tropical world where malaria is endemic. Hemoglobin S in its heterozygous form (inherited from one parent only) confers some immunity to those people who carry it, although it brings a deadly disease ( sickle cell anemia ) in its homozygous form (inherited from both parents).",
  "In the last decades of the 20th century, scientists began to understand human physical variability in clinal terms and to recognize that it reflects much more complex gradations and combinations than they had anticipated. To comprehend the full expression of a feature’s genetic variability, it must be studied separately over geographic space and often in terms of its adaptive value. Many features are now known to relate to the environmental conditions of the populations that carry them.",
  "Although their numbers are dwindling, some scientists continue to believe that it is possible to divide Homo sapiens into discrete populations called races. They believe that the physical differences manifest in wide geographic regions are more than superficial—that they reflect innate intellectual, moral, emotional, and other behavioral differences between human groups. They deny that social circumstances and the cultural realities of racism have any effect on behaviour or the performance of children and adults on IQ tests. Those scientists who advocate the continued acceptance of race and racial differences have been labeled “splitters.” Among the highly popularized reflections of this point of view was The Bell Curve: Intelligence and Class Structure in American Life (1994) by Richard Herrnstein and Charles Murray. This work is a representation of social Darwinism in that the authors argue not only that minority or low-status races have innate deficiencies but that poor people of all races, including whites, are genetically inferior.",
  "Those who deny the biological salience of race or argue against the use of the term have been labeled “lumpers.” The latter see their position as being buttressed and confirmed by ongoing genetic and other research. They emphasize the failure of science to establish exclusive boundaries around populations or lines of rigid distinctions that the term race conveys. They also point to the evidence demonstrating that all people regardless of their physical variations are capable of learning any kind of cultural behaviour. They argue that genes and cultural conditioning work in tandem and together contribute to the formation of individual personalities.",
  "An increasing number of scholars and other educated people now believe that the concept of race has outlived its usefulness. Social scientists, biologists, historians, and philosophers now point out that increasing migration and changes in attitudes toward human differences have brought about extensive intermingling of peoples so that a growing number of people have ancestors originating in three or more continents. Such “mixed” people are not easily lumped into a single “racial” category. As a result, many scholars perceive that “race” is becoming more and more irrelevant and may eventually be eliminated as people increasingly are recognized in terms of their ethnic or cultural identities, occupations, education, and local affiliations.",
  "A contradictory trend also seems to be occurring among some writers who find it difficult to relinquish some elements of race ideology. Instead, they “biologize” ethnic identity and interpret peoples’ cultures and behaviour as if such features stem from genetic heredity. Should this trend expand, society may continue to manifest the broad elements of race ideology, though perhaps in diminished intensity or in a different form.",
  "Histories dealing with the origin of the concept of race include Theodore Allen , The Invention of the White Race (1994); Ivan Hannaford , Race: The History of an Idea in the West (1996); and Audrey Smedley , Race in North America: Origin and Evolution of a Worldview , 3rd ed. (2007).",
  "The history of race in science is discussed in Thomas F. Gossett , Race: The History of an Idea in America (1965); Elazar Barkan , The Retreat of Scientific Racism (1992); Nancy Stepan , The Idea of Race in Science: Great Britain 1800–1960 (1992).",
  "Modern scientific views of human diversity are the subjects of Richard Lewontin , Human Diversity (1995); Jonathan Marks , Human Biodiversity: Genes, Race, and History (1995); Luigi Luca Cavalli-Sforza and F. Cavalli-Sforza , The Great Human Diasporas: The History of Diversity and Evolution (1995); and Christopher Stringer and Robin McKie , African Exodus: The Origins of Modern Humanity (1996).",
  "Race also continues to be the focus of discourse on specific topics. Among these are IQ, as in Steven Jay Gould , The Mismeasure of Man (1981); Mark Snyderman and Stanley Rothman , The IQ Controversy: The Media and Public Policy (1988); and Richard J. Herrnstein and Charles Murray , The Bell Curve: Intelligence and Class Structure in American Life (1994); and sports, as in John Hoberman , Darwin’s Athletes: How Sport Has Damaged Black America and Preserved the Myth of Race (1997); and Jon Entine , Taboo: Why Black Athletes Dominate Sports and Why We Are Afraid to Talk About It (2000).",
  "Detailed descriptions of 17th- and 18th-century colonial history, including analyses of the English attitudes toward the Irish and the persistence of such attitudes in the New World and descriptions of the events leading to the enslavement of Africans, are discussed in Edmund Morgan , American Slavery, American Freedom (1975); Theodore Allen , The Invention of the White Race , vol. 2 (1997); George Frederickson , White Supremacy (1981); Philip D. Morgan , Slave Counterpoint (1998); Winthrop D. Jordan , White over Black (1968); and Gary B. Nash , Red, White and Black: The Peoples of Early America , 3rd ed. (1992).",
  "General works on race in Latin America include Norman E. Whitten and Arlene Torres , Blackness in Latin American and the Caribbean: Social Dynamics and Cultural Transformations , 2 vol. (1998); and Peter Wade , Race and Ethnicity in Latin America (1997).",
  "General overviews include Magnus Mörner , Race Mixture in the History of Latin America (1967); Marvin Harris , Patterns of Race in the Americas , 2nd ed. (1974); and George Reid Andrews , Afro-America, 1800–2000 (2004).",
  " Nancy P. Appelbaum , Anne S. MacPherson , and Karin A. Rosemblatt (eds.), Race and Nation in Modern Latin America (2003), has very good country studies and a good overview. Richard Graham (ed.), The Idea of Race in Latin America, 1870–1940 (1990), gives several country studies and contains a useful introductory chapter. Anthony Marx , Making Race and Nation: A Comparison of Brazil, the United States, and South Africa (1998), is a significant comparative analysis.",
  " Nancy Leys Stepan , “The Hour of Eugenics”: Race, Gender, and Nation in Latin America (1991), examines late 19th- and early 20th-century ideologies of race and eugenics. Leslie Rout, Jr. , The African Experience in Latin America: 1502 to the Present Day (1976); and Ann Pescatello , The African in Latin America (1975), focus on slavery and post-abolition Black-white race relations. Florencia E. Mallon , “Indian Communities, Political Cultures and the State in Latin America, 1780–1990,” Journal of Latin American Studies , 24:35–53 (1992), focuses on indigenous peoples. Richard Price (ed.), Maroon Societies: Rebel Slave Communities in the Americas , 2nd ed. (1979), presents many case studies of Black resistance.",
  " Charles R. Hale (ed.), “Mestizaje,” special issue of Journal of Latin American Anthropology 2(1) (1996), contains good case studies, including some from the late 19th century. Norman E. Whitten , Black Frontiersmen: Afro-Hispanic Culture of Ecuador and Colombia (1974), is a classic ethnographic text. Marisol de la Cadena , Indigenous Mestizos: The Politics of Race and Culture in Cuzco, Peru, 1919–1991 (2000), reviews the unusual way Peru dealt with ideas of mixture. Peter Wade , Blackness and Race Mixture: The Dynamics of Racial Identity in Colombia (1993), is an ethnographic study and includes an epilogue on Colombia’s legal changes that recognize “Black communities.” France Winddance Twine , Racism in a Racial Democracy: The Maintenance of White Supremacy in Brazil (1998), is an ethnography of a small town in Brazil. Greg Grandin , The Blood of Guatemala: A History of Race and Nation (2000), covers the 19th and 20th centuries. Helen Safa (ed.), “Race and National Identity in the Americas,” special issue of Latin American Perspectives , 25(3) (1998), combines historical and contemporary material and includes articles on Latin America in general as well as material on Cuba, Colombia, Brazil, and the Dominican Republic. Shane Greene (ed.), “Entre ‘lo Indio’ y ‘lo Negro’: Interrogating the Effects of Latin America’s New Afro-Indigenous Multiculturalisms,” special issue of Journal of Latin American and Caribbean Anthropology , 12(2) (2007), considers indigenous and Black social movements across the region. Robin E. Sheriff , Dreaming Equality: Color, Race, and Racism in Urban Brazil (2001), is an ethnographic study of Rio de Janeiro.",
  "Discussions of race as it is perceived in Asia include Peter Robb (ed.), The Concept of Race in South Asia (1997); Frank Dikötter , The Discourse of Race in Modern China (1993); Charles F. Keyes , “‘The Peoples of Asia’: Science and Politics in Ethnic Classification of Races in Thailand, China, and Vietnam,” Journal of Asian Studies , 61(4):1163–1203 (November 2002); and Charles Hirschman , “The Meaning and Measurement of Ethnicity in Malaysia: An Analysis of Census Classifications,” Journal of Asian Studies 46(3):555–582 (August 1987).",
  "Sources on South Asia, particularly the caste system of India, are J.H. Hutton , Caste in India: Its Nature, Function, and Origins (1963); Adrian Mayer , Caste and Kinship in Central India (1970); and Jonathan Perry , Caste and Kinship in Kangra (1979)."
]