[
  "  basic oxygen process (BOP) , a steelmaking method in which pure oxygen is blown into a bath of molten blast-furnace iron and scrap. The oxygen initiates a series of intensively exothermic (heat-releasing) reactions, including the oxidation of such impurities as carbon, silicon, phosphorus, and manganese.",
  "The advantages of using pure oxygen instead of air in refining pig iron into steel were recognized as early as 1855 by Henry Bessemer, but the process could not be brought to commercial fruition until the 20th century, when large tonnages of cheap, high-purity oxygen became available. Commercial advantages include high production rates, less labour, and steel with a low nitrogen content. Development of the BOP was initiated in Switzerland by Robert Durrer in the late 1940s. After experimenting with a 2.5-ton pilot unit, Durrer worked with engineers at the Voest company at Linz, Austria, who set up a commercially operating 35-ton converter in 1952. A second unit began operation within a year at Donawitz, also in Austria. Consequently, the BOP was first known as the LD (Linz-Donawitz) process. Within 40 years, virtually all of the steel in Japan and more than half of the steel worldwide was produced by the BOP.",
  "A typical top-blown basic oxygen furnace is a vertical cylindrical vessel with a closed bottom and an open upper cone through which a water-cooled oxygen lance can be raised and lowered. The vessel is lined with a refractory such as magnesite and is mounted on trunnions so that it can be tilted for charging and also for tapping liquid steel. A charge typically consisting of 70–75 percent molten blast-furnace iron (containing approximately 4 percent carbon), 25–30 percent scrap metal, and lime and other fluxes is fed into the furnace. The lance is lowered into the vessel, and oxygen is injected into the bath at supersonic velocities with flow rates that can exceed 800 cubic m (28,000 cubic feet) per minute. The duration of the oxygen “blow,” normally close to 20 minutes, is varied to reduce the carbon in the steel to the required level. The steel is then tapped into a ladle at temperatures close to 1,600° C (2,900° F), and appropriate ferroalloys and deoxidizers are added to meet the required steel composition. “Heats” of steel, ranging in size from 30 to 360 tons, can be produced in 30 to 45 minutes.",
  "Another, though less common, oxygen steelmaking system is a bottom-blown process known as the Q-BOP (quick-quiet BOP) in North America and the OBM (from the German, Oxygen bodenblasen Maxhuette, or “oxygen bottom-blowing furnace”) in Europe. In this system, oxygen is injected with lime through nozzles, or tuyeres, located in the bottom of the vessel. The tuyeres consist of two concentric tubes: oxygen and lime are introduced through the inner tube, and a hydrocarbon such as natural gas is injected through the outer annulus. The endothermic (heat-absorbing) decomposition of the hydrocarbon near the molten bath cools the tuyeres and protects the adjacent refractory. Yet another variation, which has found wide application in top-blown furnaces, is the injection of inert gases into the molten bath through permeable blocks in the bottom of the vessel for the purpose of enhancing chemical reactions."
]