[
  " bathyal zone , marine ecologic realm extending down from the edge of the continental shelf to the depth at which the water temperature is 4° C (39° F). Both of these limits are variable, but the bathyal zone is generally described as lying between 200 and 2,000 m (660 and 6,600 feet) below the surface.",
  "Photosynthesis does not occur in bathyal waters as a rule, the zone being characteristically dark except in the clear, virtually lifeless waters of the tropics, where small amounts of sunlight can penetrate as deeply as 600 m (2,000 feet). Temperatures in high latitudes range from about 3° to -1° C (37° to 30° F). Elsewhere, normal temperatures range between 5° and 15° C (41° and 59° F), the western oceanic margins being warmer owing to currents from the equator and the eastern margins receiving colder boreal currents and experiencing upwelling. Salinities typically range between 34 and 36 parts per thousand in the bathyal zone, varying with local conditions of water-mass formation. Bathyal fauna reflect the generally narrow ranges of temperature and salinity that occur.",
  "At bathyal depths, currents are exceedingly slow, and in many areas bathyal waters deeper than 1,000 m (3,280 feet) are essentially stagnant, resulting in low oxygen concentrations and impoverished faunal levels.",
  "Although upwelling and countercurrents may create favourable conditions for fish and other aquatic life in some middle- to high-latitude areas, the number of individuals in a bathyal faunal assemblage is generally only about half as large as in shallow-water fauna. It has been demonstrated, however, that single-habitat species diversity is higher for bathyal fauna. It has been suggested that this condition is caused by the constancy of the bathyal environmental conditions, especially its temperature. Bottom dwellers in areas with adequate circulation are adapted to local substrate conditions. Terrigenous bottoms near the continents support the most abundant suspension and mud-eating populations. Cold-water bathyal corals are found in sub-Arctic to equatorial regions.",
  "Bathyal sediments are terrestrial, pelagic, or authigenic (formed in place). Terrestrial (or land-derived) sediments are predominantly clays and silts and are commonly coloured blue because of accumulated organic debris as well as bacterially produced ferrous iron sulfides. Coarser terrigenous sediments are also brought to the bathyal seafloor by sporadic turbidity currents originating in shallower areas. Where supplies of terrigenous materials are scarce, microscopic shells of phytoplankton (coccolithophorids) and zooplankton (foraminiferous and pteropods) fall through the water grain by grain, accumulating as white calcareous ooze deposits. Authigenic sediments result from the interaction of clay, feldspar, and volcanic-glass particles with seawater, forming the minerals glauconite, chlorite, phillipsite, and palagonite. These sediments are characteristically green because of their chlorite and glauconite contents."
]