[
  "  bay , concavity of a coastline or reentrant of the sea, formed by the movements of either the sea or a lake. The difference between a bay and a gulf is not clearly defined, but the term bay usually refers to a body of water somewhat smaller than a gulf. Numerous exceptions, however, are found throughout the world, such as the Bay of Bengal, which is larger than the Gulf of Mexico and about the same size as the Arabian Sea.",
  "A brief treatment of bays follows. For additional information, see  gulf .",
  "A bay is usually located where more easily eroded rocks, such as clays, silts, and some sandstones, are bounded by harder and more resistant formations made from igneous rocks, such as granite, or hard calcareous rocks, such as massive limestones, which are more resistant to the erosional forces of the land and sea or lake. The harder rocks therefore stand out as promontories projecting out to sea, often with caves that may in some cases link the two sides of the promontory, thus creating an island, perhaps with a natural bridge to the mainland. This bridge will later fall as a result of erosion and weathering and leave an island completely separated from the mainland.",
  "The softer rocks between the promontories are subjected to more rapid erosion as lines of waves, initially with their crests approaching the coastline at an oblique angle, turn to approach the shoreline head-on because of wave impedance by the shallower, nearshore seabed, so that the end of the line of waves closest to shore moves forward more slowly than the end farther out to sea. In this way the lines of waves gradually turn as they move around the windward headland to sweep directly onshore in the bay. The erosion of the soft rocks of the bay is most rapid during storms, when material eroded just behind the line of breakers is thrown by the waves farther up the beach; in this way a series of ridges may mark a succession of storms, particularly where the beach material is mainly pebbles. The wind may then carry the finest beach material inland beyond the high-water mark, where it may be deposited in a zone of sand dunes. These may, if uncontrolled, move miles inland. The most common method of dune stabilization is the encouragement of deep-rooted marram grass.",
  "There are no defined dimensions for bays. Smaller bays may be only a few hundred metres wide, while others, such as the Bay of Biscay off Spain and France and Hudson Bay in Canada, are several hundred kilometres from side to side. Some of these larger bays may represent depressions in the ground, formed by vertical earth movements or glacial erosion by ice sheets. Hudson Bay is of this latter type. All bays are semicircular or nearly circular in shape, which distinguishes them from estuaries, which are elongated and funnel-shaped with a river running along the centre line and with beaches mainly near the mouth of the estuary. Estuaries and some of the more enclosed and sheltered bays form excellent harbours, provided that the seabed is deep enough and well-scoured. They were popular sites for early settlements, and a number of the larger coastal cities today have their original cores around a bay that provided protection for ships at anchor."
]