[
  "  optical storage , electronic storage medium that uses low-power laser beams to record and retrieve digital (binary) data. In optical-storage technology, a laser beam encodes digital data onto an optical, or laser, disk in the form of tiny pits arranged in a spiral track on the disk’s surface. A low-power laser scanner is used to “read” these pits, with variations in the intensity of reflected light from the pits being converted into electric signals. This technology is used in the compact disc , which records sound; in the CD-ROM (compact disc read-only memory), which can store text and images as well as sound; in WORM (write-once read-many), a type of disk that can be written on once and read any number of times; and in newer disks that are totally rewritable.",
  "Optical storage provides greater memory capacity than magnetic storage because laser beams can be controlled and focused much more precisely than can tiny magnetic heads, thereby enabling the condensation of data into a much smaller space. An entire set of encyclopedias, for example, can be stored on a standard 12-centimetre (4.72-inch) optical disk. Besides higher capacity, optical-storage technology also delivers more authentic duplication of sounds and images. Optical disks are also inexpensive to make: the plastic disks are simply molds pressed from a master, as phonograph records are. The data on them cannot be destroyed by power outages or magnetic disturbances, the disks themselves are relatively impervious to physical damage, and unlike magnetic disks and tapes, they need not be kept in tightly sealed containers to protect them from contaminants. Optical-scanning equipment is similarly durable because it has relatively few moving parts.",
  "Early optical disks were not erasable—i.e., data encoded onto their surfaces could be read but not erased or rewritten. This problem was solved in the 1990s with the development of WORM and of writable/rewritable disks. The chief remaining drawback to optical equipment is a slower rate of information retrieval compared with conventional magnetic-storage media. Despite its slowness, its superior capacity and recording characteristics make optical storage ideally suited to memory-intensive applications, especially those that incorporate still or animated graphics, sound, and large quantities of text. Multimedia encyclopedias, video games, training programs, and directories are commonly stored on optical media."
]