[
  "  Berry , historical and cultural region encompassing the Indre and Cher départements in the Centre  région of central France . It is coextensive with the former province of Berry, which included the départements of Cher (roughly corresponding to Upper Berry) and Indre (Lower Berry).",
  "The home of a people called the Bituriges Cubi in Roman times, the country later passed to the Visigoths ( ad 475), the Franks ( c. 507), and the Carolingians. The chief authority in Berry eventually passed to the viscounts of Bourges, who, while recognizing the royal suzerainty, preserved a certain independence until 1101, when the fief was sold to the crown. When Aquitaine was acquired by Henry II of England, Berry became a matter of dispute between England and France. After 1360 it was held as an appanage of the French crown, usually by a member of the royal family. Jean de France, duc de Berry (1340–1416), was an important patron of the arts, for whom a number of famous illuminated manuscripts were produced (notably the Limbourg brothers ’ Très Riches Heures du duc de Berry ).",
  "In 1601 on the death of Henry III’s widow, Louise of Lorraine, the country was finally reabsorbed into the royal domain. The title duc de Berry was subsequently granted to Louis XIV’s grandson Charles (1686–1714) and to Louis XVI’s nephew Charles-Ferdinand (1778–1820).",
  "Berry lies on the northern rim of the Massif Central. It has a mixture of agriculture that ranges from the intensive cultivation of cereals and oleaginous plants in the central zone between Bourges and Châteauroux, to the raising of beef, cattle, and goats (for the production of cheese) in the bocage areas of the south, and to viticulture around Sancerre. Industrial activity is equally varied and includes the manufacture of textiles, machines, armaments, and chemicals. Employment in service industries is important and expanding.",
  "The population is predominantly Roman Catholic, although there are small Calvinist parishes in Cher département , at Bourges and Sancerre. The population is largely of Celtic origin, but numerous immigrants from Poland, Italy, and Spain have been assimilated since 1950.",
  "The regional dialect is derived from French and closely resembles the dialects of Bourbonnais, which borders Berry to the east and Touraine to the west. The dialect of Berry is distinguished by numerous words of late Latin origin and continues to be spoken in Cher around Sancergues, Sancerre, and Sancoins and in Indre département near La Châtre. The Noëls berriauds (1898) and Bestiaire berrichon (1919) of Hughes Lapaire helped to revive the folkloric literature of Berry. Folkloric traditions show strong Celtic influences from Auvergne, Brittany, Scotland, and Ireland. La Borne in Cher and Verneuil-sur-Igneraie in Indre continue to produce traditional pottery.",
  "Regional cuisine is simple and relies on local produce. Dishes are usually cooked over a low fire. Soups of vegetables, pickled pork, or bread are simmered in a crock and served with cream. Poulet en barbouille is chicken cooked in brandy and served with a sauce made from blood, cream, yolk, and chopped liver. Wines from Quincy and Sancerre in Cher and Reuilly in Indre are produced from Sauvignon vines and have a flinty taste."
]