[
  "  Battle of Blenheim , (Aug. 13, 1704), the most famous victory of John Churchill, 1st duke of Marlborough, and Eugene of Savoy in the War of the Spanish Succession. The first major defeat that the French army suffered in over 50 years, it saved Vienna from a threatening Franco-Bavarian army, preserved the alliance of England, Austria, and the United Provinces against France, and knocked Bavaria out of the war.",
  "The battle was fought at the town of Blenheim (now Blindheim) on the Danube River, 10 miles (16 km) southwest of Donauwörth in Bavaria, and engaged about 52,000 British, Dutch, and Austrian troops under Marlborough and Eugene and about 60,000 French and Bavarian troops under the French marshal Camille, comte de Tallard. To prevent an Austrian collapse under intense French military pressure, Marlborough had marched his army to the Danube River. Tallard, knowing the desire of Marlborough and Eugene to protect Vienna from French attack, did not expect to be attacked by their slightly weaker forces. But Marlborough and Eugene joined forces on August 12 and the next day attacked the surprised and unprepared French. The French were drawn up behind the Nebel River (a tributary of the Danube), with their right wing resting on the Danube at Blenheim and their left wing on hilly terrain bounded by the town of Lützingen. The French army consisted of two nearly independent sections, with Tallard in command of the right wing and Marsin and Maximilian II Emanuel (the elector of Bavaria) in charge of the left wing. The junction between these two armies was weakly held by almost unsupported cavalry. Eugene’s forces faced those of Marsin and Maximilian II Emanuel at Lützingen, while Marlborough opposed Tallard at Blenheim.",
  "Prince Eugene mounted a strong diversionary assault on his flank while Marlborough’s general Lord John Cutts mounted two unsuccessful assaults upon Blenheim. Cutts’s attacks forced Tallard to commit more reserves to defend Blenheim than he had intended, and thus served to further weaken the French centre. Since Eugene kept Marsin fully occupied, Marlborough then launched the main attack across the Nebel River against the French centre. Marlborough’s advance was hotly contested by French cavalry attacks, and only his personal direction and Eugene’s selfless loan of one of his own cavalry corps enabled Marlborough to maintain the momentum of his attack. Once successfully launched, however, the attack proved irresistible. The Allied cavalry broke through the French centre, dividing Marsin’s army from that of Tallard, and then wheeled left, sweeping Tallard’s forces into the Danube River. Tallard himself was taken prisoner, and about 23 battalions of his infantry and 4 regiments of dragoons were pinned in Blenheim. Marsin and Maximilian II Emanuel managed to withdraw their troops from the battle in the meantime, but on the French right wing all the infantry around Blenheim surrendered.",
  "At a cost of 12,000 casualties, the Allies captured 13,000 Franco-Bavarian troops and killed, wounded, or caused to be drowned approximately 18,000 more. The Battle of Blenheim saved Vienna from the French and demonstrated that the armies of the French king Louis XIV were by no means irresistible. The battle also exemplified the near-perfect cooperation that was to exist between Marlborough and Eugene for the remainder of their association in the war."
]