[
  " Bar Hebraeus , Arabic Ibn Al-ʿIbrī (“Son of the Hebrew”) , or Abū al-Faraj , Latin name Gregorius , (born 1226, Melitene, Armenia [now Malatya, Turkey]—died July 30, 1286, Marāgheh, Iran), medieval Syrian scholar noted for his encyclopaedic learning in science and philosophy and for his enrichment of Syriac literature by the introduction of Arabic culture.",
  "Motivated toward scholarly pursuits by his father, a Jewish convert to Christianity, Bar Hebraeus emigrated to Antioch (now Antakya, Turkey) and at the age of 17 became a hermit. He was made a bishop at 20 and an archbishop at 26, and by 1264 he was assistant patriarch (chief prelate) of the Eastern Jacobite church, a group named after its founder, Jacob Baradaeus. The Jacobites were members of a west Syrian church that refused to accept the decrees of the Council of Chalcedon concerning the nature of Christ.",
  "Bar Hebraeus’ travels to libraries throughout Syria and Armenia enabled him to compile collections of classical Arabic texts in philosophy and theology, which he transmitted to posterity through his own copies, condensations, and Syriac translations. He himself wrote treatises on grammar, astronomy, mathematics, medicine, philosophy, theology, and history, thereby reinvigorating the Syriac language and making Islāmic learning accessible to his fellow Jacobites. Among his chief works was an encyclopaedia of philosophy, Ḥ  ēʾwath ḥ  ekkmthā (“The Butter of Wisdom”), in which he commented on every branch of human knowledge in the Aristotelian tradition. Another was his Chronography, consisting of a secular history from the time of creation and an ecclesiastical history of the patriarchate of Antioch and the Eastern Jacobite church.",
  "Bar Hebraeus’ scholarship and political tact significantly enhanced the cultural exchange between the Christian and Muslim worlds. In the midst of 13th-century Muslim rule, he followed a conciliatory policy, seeking tolerance from the Arabs, whom he served as physician, and promoting rapport among disputing Christian groups.",
  " Hidemi Takahashi , Barhebraeus: A Bio-Bibliography (2005)."
]