[
  " Pinus aristata  Pinus aristata  bristlecone pine ,  (species Pinus longaeva and P. aristata ), either of two species of small pine trees that belong to the family Pinaceae and include some of the oldest individual organisms known to science. The species are native to the Rocky Mountains and other ranges of the southwestern United States, occurring usually at elevations above 1,700 metres (5,500 feet). Despite the inherent hardiness necessary to survive millennia at the environmental extremes of such arid climates and high elevations, bristlecone pines are vulnerable to changing climate conditions, particularly drought . Several populations of Great Basin bristlecone pines experienced a rare die-off event in 2022 that resulted from a combination of drought stress and bark beetle infestation.",
  " Pinus longaeva  The Great Basin bristlecone pine ( P. longaeva ) has the longest life span of any conifer and is likely the oldest non-clonal organism on Earth. A stand of these pines on Wheeler Peak in eastern Nevada is known to contain several trees over 3,000 years old and was the site of the Prometheus tree, which was cut down and dated to be just under 5,000 years old. The Methuselah tree of the White Mountains of California is about 4,850 years of age and was once thought to be the oldest living bristlecone pine. It was surpassed in 2012 by the discovery of a nearby tree that is estimated to be more than 5,060 years old. Of the Rocky Mountain bristlecone pines ( P. aristata ), the oldest known individual is estimated to be over 2,480 years old.",
  " Pinus longaeva  Bristlecone pines are small to medium-sized windblown trees ranging from about 5 to 16 metres (15 to 50 feet) in height. The bark of the Great Basin bristlecone pine is typically orange-yellow to light brown, while that of the Rocky Mountain bristlecone pine is usually gray-brown. The short needles of both species are borne in fascicles (groups) of five. The female cones are ovoid in shape and deep purple when young; they mature to a pale brown and bear a characteristic bristle on each scale."
]