[
  "  bronze ,  alloy traditionally composed of copper and tin. Modern bronze is typically 88 percent copper and about 12 percent tin. Bronze is of exceptional historical interest and still finds wide applications. The earliest bronze artifacts were made about 4500 bce , though use of bronze in artifacts did not become common until much later, in the 2nd millennium bce during the Bronze Age . The proportions of copper and tin varied widely (from 67 to 95 percent copper in surviving artifacts), but, by the Middle Ages in Europe, certain proportions were known to yield specific properties. An alloy described in an 11th-century Greek manuscript in the library of St. Mark’s in Venice was cited as having a proportion of one pound copper to two ounces of tin (8 to 1), approximately that used for bronze gunmetal in later times. Some modern bronzes contain no tin at all, having other metals substituted—such as aluminum , manganese , and even zinc .",
  " bce  Bronze is harder than copper, as a result of alloying that metal with tin or other metals. Bronze is also more fusible (i.e., more readily melted) and is hence easier to cast. It is harder than pure iron and far more resistant to corrosion . The substitution of iron for bronze in tools and weapons from about 1000 bce was the result of the abundance of iron compared with copper and tin rather than any inherent advantages of iron. Besides its traditional use in weapons and tools, bronze was widely used in coinage ; most “copper” coins were actually bronze, typically with about 4 percent tin and 1 percent zinc.",
  "Bell metal, characterized by its sonorous quality when struck, is a bronze with a high tin content of 20–25 percent. Statuary bronze, with a tin content of less than 10 percent and an admixture of zinc and lead, is technically a brass (a copper-zinc alloy). Bronze is improved in hardness and strength by the addition of a small amount of phosphorus; phosphor bronze may contain 1 or 2 percent phosphorus in the ingot and a mere trace after casting, but its strength is nonetheless enhanced for such applications as pump plungers, valves, and bushings. Also useful in mechanical engineering are manganese bronzes, in which there may be little or no tin but considerable amounts of zinc and up to 4.5 percent manganese. Aluminum bronzes , containing up to 16 percent aluminum and small amounts of other metals such as iron or nickel , are especially strong and corrosion-resistant; they are cast or wrought into pipe fittings, pumps, gears, ship propellers, and turbine blades. (For more information about bronze art and implements, see  bronze work .)"
]