[
  "  Ivan Bunin , in full Ivan Alekseyevich Bunin , (born October 10 [October 22, New Style], 1870, Voronezh, Russia—died November 8, 1953, Paris, France), poet and novelist, the first Russian to receive the Nobel Prize for Literature (1933), and one of the finest of Russian stylists.",
  "Bunin, the descendant of an old noble family, spent his childhood and youth in the Russian provinces. He attended secondary school in Yelets, in western Russia, but did not graduate; his older brother subsequently tutored him. Bunin began publishing poems and short stories in 1887, and in 1889–92 he worked for the newspaper Orlovsky Vestnik (“The Orlovsky Herald”). His first book, Stikhotvoreniya: 1887–1891 (“Poetry: 1887–1891”), appeared in 1891 as a supplement to that newspaper. In the mid-1890s he was strongly drawn to the ideas of the novelist Leo Tolstoy , whom he met in person. During this period Bunin gradually entered the Moscow and St. Petersburg literary scenes, including the growing Symbolist movement. Bunin’s Listopad (1901; “Falling Leaves”), a book of poetry, testifies to his association with the Symbolists, primarily Valery Bryusov . However, Bunin’s work had more in common with the traditions of classical Russian literature of the 19th century, of which his older contemporaries Tolstoy and Anton Chekhov were models.",
  "By the beginning of the 20th century, Bunin had become one of Russia’s most popular writers. His sketches and stories Antonovskiye yabloki (1900; “Antonov Apples”), Grammatika lyubvi (1929; “Grammar of Love”), Lyogkoye dykhaniye (1922; “Light Breathing”), Sny Changa (1916; “The Dreams of Chang”), Sukhodol (1912; “Dry Valley”), Derevnya (1910; “The Village”), and Gospodin iz San-Frantsisko (1916; “The Gentleman from San Francisco”) show Bunin’s penchant for extreme precision of language, delicate description of nature, detailed psychological analysis, and masterly control of plot. While his democratic views gave rise to criticism in Russia, they did not turn him into a politically engaged writer. Bunin also believed that change was inevitable in Russian life. His urge to keep his independence is evident in his break with the writer Maxim Gorky and other old friends after the Russian Revolution of 1917 , which he perceived as the triumph of the basest side of the Russian people.",
  "Bunin’s articles and diaries of 1917–20 are a record of Russian life during its years of terror. In May 1918 he left Moscow and settled in Odessa (now in Ukraine), and at the beginning of 1920 he emigrated first to Constantinople (now Istanbul) and then to France, where he lived for the rest of his life. There he became one of the most famous Russian émigré writers. His stories, the novella Mitina lyubov (1925; Mitya’s Love ), and the autobiographical novel Zhizn Arsenyeva ( The Life of Arsenev )—which Bunin began writing during the 1920s and of which he published parts in the 1930s and 1950s—were recognized by critics and Russian readers abroad as testimony of the independence of Russian émigré culture.",
  "Bunin lived in the south of France during World War II , refusing all contact with the Nazis and hiding Jews in his villa. Tyomnye allei (1943; Dark Avenues, and Other Stories ), a book of short stories, was one of his last great works. After the end of the war, Bunin was invited to return to the Soviet Union, but he remained in France. Vospominaniya ( Memories and Portraits ), which appeared in 1950. An unfinished book, O Chekhove (1955; “On Chekhov”; Eng. trans. About Chekhov: The Unfinished Symphony ), was published posthumously. Bunin was one of the first Russian émigré writers whose works were published in the Soviet Union after the death of Soviet leader Joseph Stalin.",
  "Bunin’s life and work are examined in Julian W. Connolly, Ivan Bunin (1982); Thomas Gaiton Marullo (ed.), Ivan Bunin: Russian Requiem, 1885–1920 (1993), and Ivan Bunin: From the Other Shore, 1920–1933 (1995), comprising Bunin’s letters, diaries and fiction, as well as writings of his wife; and James B. Woodward, Ivan Bunin: A Study of His Fiction (1980)."
]