[
  " button , usually disklike piece of solid material having holes or a shank through which it is sewed to one side of an article of clothing and used to fasten or close the garment by passing through a loop or hole in the other side. Purely decorative, nonutilitarian buttons are also frequently used on clothing.",
  "In medieval Europe, garments were laced together or fastened with brooches or clasps and points, until buttonholes were invented in the 13th century. Then buttons became so prominent that in some places sumptuary laws were passed putting limits on their use.",
  "By the 14th century buttons were worn as ornaments and fastenings from the elbow to the wrist and from the neckline to the waist. The wearing of gold, silver, and ivory buttons was an indication of wealth and rank. Expensive buttons were also made of copper and its alloys. The metalsmith frequently embellished such buttons with insets of ivory , tortoiseshell , and jewels. More commonly, buttons were made of bone or wood. Button forms of these materials were also used as foundations for fabric-covered buttons. Thread buttons were made by wrapping the thread over a wire ring.",
  "In the 18th century luxury metals and ivory largely replaced fabric, although embroidered buttons in designs to complement particular garments were popular. Pewter , the familiar metal of the age, was used to make molded or stamped-out buttons, but these were scorned by the wealthy. Cast brass buttons, particularly calamine brass, with ornamental and distinguishing designs, also became popular on both military and civilian dress.",
  "In the middle of the 18th century, Matthew Boulton , the English manufacturer and partner of James Watt , introduced the bright, costly, cut-steel button, which was made by attaching polished steel facets to a steel blank. In France the facets of the cut-steel button were elaborated by openwork designs. During the first quarter of the 19th century, a less costly stamped steel button was made in an openwork pattern. Brass buttons that were gilded by dipping in an amalgam of mercury and gold also became popular.",
  "The two-shell metal button was introduced about the same time as the stamped-steel type by B. Sanders, a Danish manufacturer in England. The two shells, thin metal disks enclosing a small piece of cloth or pasteboard, were crimped together on the edges. Sanders also originated the canvas shank. By 1830 fabric-covered buttons were being made mechanically. Also coming into use were animal horns and hoofs, which could be made malleable by heating and then could be cut, dyed, and molded.",
  "Buttons were also made of ceramics and glass. Porcelain buttons became a French specialty; they were decorated by hand painting or by transfer printing designs using coloured inks. Bohemia, in the present-day Czech Republic, produced most of the coloured glass used in button manufacture.",
  "In Japan, ceramic buttons, hand painted in traditional motifs, were developed. Buttons with an intricately carved thickness of vermilion lacquer on a wooden base became a Chinese specialty, and decorated and lacquered papier-mâché buttons became popular in Europe in the late 1800s.",
  "The use of the pearly shells of sea mollusks in button making increased with the mechanization of production. Shell was separated into its component layers by treatment with a nitric acid solution, and blanks were cut out by tubular saws. Holes were bored in the blanks for sewing, and an engraved decoration was mechanically applied. At first only seashell was used, but in the 1890s the American manufacturer John F. Boepple began to use the less iridescent but abundant freshwater mussel shells found along the Mississippi River and its tributaries.",
  "In the 20th century, buttons became primarily utilitarian, not decorative, and in many applications were supplanted by the zipper . Buttons began to be made of plastics such as cellulose, polystyrene, and polyvinyl resins; designs tended to be abstract or geometric. Mass-production machines produce molded buttons either by compressing powdered plastics or by injection—forcing liquid plastic into individual molds through small openings.",
  "Some old buttons are considered valuable and are collected for their art and workmanship. The place, date, and name of the maker are usually marked on their backs."
]