[
  " camouflage , in military science, the art and practice of concealment and visual deception in war. It is the means of defeating enemy observation by concealing or disguising installations, personnel, equipment, and activities. Conventional camouflage is restricted to passive defensive measures. The surface camoufleur, for example, does not try to prevent aerial surveillance by jamming the enemy’s radar but rather seeks to deceive the enemy by proffering misleading visual information.",
  "Both concealment and deception adversely affect the enemy’s intelligence effort. The withholding of information compels him to increase his surveillance efforts, and thus to divert from combat a greater number of personnel and machines. The receipt of incorrect reports may confuse the enemy and may thus contribute to indecision on the part of the enemy commander, costing him critical time and resources and even leading him to make wrong decisions.",
  "Conventional camouflage does not try to obviously impair the enemy’s gathering of information but rather seeks to give false information to the enemy without arousing his suspicions. Countermeasures, on the other hand, do impair the ability of the sensing device to “see” and are not concerned with whether the enemy is aware of this action as long as his ability to detect is destroyed. For example, the dropping of tinfoil from aircraft in flight and the launching of diversionary guided missiles are designed to confuse, divert, and saturate air defense systems; they are normally considered countermeasures rather than camouflage.",
  "Camouflage, from the French word camoufler (“to disguise”), came into English usage during World War I when air warfare was introduced. The development of military aircraft exposed enemy positions to aerial reconnaissance, which could be used for purposes of directing artillery fire and anticipating potential offensives. Each major army therefore organized a camouflage service of specially trained troops to practice the art of deception. By World War II the increased capabilities of aircraft for long-range bombing threatened warring countries in their entirety, not just the front lines, thus increasing both the importance and the scope of camouflage. At the same time, camouflage concepts were broadened to include active deception of the enemy as well as passive concealment against observation and aerial photography.",
  "In World War II practically everything of military significance was camouflaged to some degree using such materials as mottled, dull-coloured paint patterns, cloth garnishing, chicken-wire, netting, and the use of natural foliage: these disguises were intended to make a weapon, vehicle, or installation indistinguishable from the surrounding vegetation and terrain when viewed from the air. Almost all tactical vehicles carried camouflage nets and were painted in greenish, grayish, or brown colours. All military personnel received training in camouflage fundamentals during basic training.",
  "Dummies, displays, and decoys were widely used during World War II to accomplish various objectives. In Great Britain and Germany entire airfields and large manufacturing plants were camouflaged to protect them against aerial attack. False targets were also set up to divert enemy bomber attacks from real targets. At the close of the war the British air ministry reported that:",
  "A network of 500 dummy cities, airfields, shipyards and other targets so realistic they blazed at night under enemy attack caused thousands of tons of German bombs to drop harmlessly on open fields during the Battle of Britain. Mock airfields drew even more raids than the real ones—443 compared with 434 on actual installations. The fields appeared so genuine that Allied pilots had to exercise great care to avoid trying to land on them.",
  "In evaluating German camouflage in World War II, the United States Strategic Bombing Survey reported that:",
  "Protective concealment was practiced with greater variety of materials, probably with greater ingenuity, and certainly with greater expenditures of manpower, than had been used by any warring nation previously. One of these ambitious camouflage projects was undertaken in Hamburg where the inner basin of the Alster, measuring roughly 500 by 450 yards, surrounded by the main business district, was covered to make it appear like terrain.",
  "In the Second Battle of el-Alamein (1942), the British commander Bernard L. Montgomery surprised the German commander Erwin Rommel by using dummies combined with a feint. Montgomery’s intention to force a gap through the German defensive system in the northern sector was masked by a long-term deception designed to make the Germans think that the attack was to take place in the southern sector. By skillful use of dummy material, Montgomery shifted his tanks and other equipment to the north without any visible decrease of strength in the south. These deceptions kept Rommel guessing where the actual British attack would take place during the battle, which was won by the British.",
  "Another notable use of dummies was in the elaborate simulation of an entire army in England prior to the Normandy invasion in an effort to confuse the Germans about where the invasion force would land. During this time German reconnaissance aircraft often reported “loaded fleets in British ports and large-size mechanized units in the field.” These displays in reality consisted of pneumatic decoys made to resemble different types of weapons and concentrations of landing craft, tanks, trucks, and artillery. Dummy assault boats drew some of the defensive fire during the actual assault on the Normandy beaches. The protective concealment provided by smoke was also effective during World War II. Land and sea movements, fleets at anchor, and preparations for river crossings were all temporarily hidden by blankets of smoke, some extending for miles. The 60-mile- (100-kilometre-) long smoke screen along the Rhine River that covered the reorganization of the Allied 21st Army group and its subsequent crossing of the river in March 1945 was probably the greatest smoke cover ever produced.",
  "The Korean War (1950–53) brought little change in camouflage techniques. But a variety of new detection devices appeared in the 1950s and ’60s that were used to notable effect in the Vietnam War. The Communist guerrilla units in that conflict used stealth, natural concealment, and camouflage very effectively, and sophisticated electro-optical sensing devices were often used by American aircraft to pinpoint these elusive forces’ presence in the dense vegetation of combat zones. American aircraft and drones were equipped with television, radar, infrared scanning devices, acoustic detection, and high-speed photographic equipment with multiple filters. American ground battle area surveillance equipment included television, radar, and aids to night vision.",
  "Camouflage research and development have meanwhile provided new techniques, materials, and equipment for countering such surveillance devices. Improved pneumatic devices were produced to simulate items of military equipment such as trucks, armoured vehicles, artillery, and guided missiles. Other materials were developed to simulate bridges, convoys, bivouac areas, airstrips, marshaling yards, post activities, and supply dumps. Computers have now become a standard tool of analysts seeking to piece together large masses of photographic and other data in an effort to distinguish between real and dummy/decoy activities by an enemy."
]