[
  " Catskill Mountains , dissected segment of the Allegheny Plateau , part of the Appalachian Mountain system , lying mainly in Greene and Ulster counties, southeastern New York , U.S. Bounded north and east by the valleys of the Mohawk and Hudson rivers, respectively, the mountains are drained by headstreams of the Delaware River and by numerous small creeks. Many peaks rise more than 3,000 feet (900 metres) abruptly above adjacent valley floors, the highest being Slide Mountain (4,204 feet [1,281 metres]). The northern portion along the Mohawk is called the Helderberg Hills. The much higher elevations in the Catskills compared with the surrounding area are mainly due to the durability of the top layers of sandstone and conglomerate.",
  "  The unusually steep-sided valleys and massive rounded uplands comprise a natural wilderness within easy reach of New York City . Heavily mantled with mixed broad-leaved and coniferous forests, the area’s scenery is made more spectacular by deeply scored cloves (rocky glens). Tourism and outdoor recreation are popular in Catskill Park (1,100 square miles [2,850 square km]), which includes the state-owned Catskill Forest Preserve (450 square miles [1,165 square km]), and in the more accessible, privately owned parts of the mountains. Artificial lakes in the Catskills include Ashokan, Pepacton, Neversink, Rondout, and Schoharie reservoirs, which are important to the water supply of metropolitan New York.",
  "The mountains were made famous through Washington Irving ’s short stories about the legendary Rip Van Winkle, who supposedly took his long nap near the town of Catskill, on the Hudson River at the eastern entrance to the park. The origin of the name Catskill is somewhat contentious. It has long been argued that the name is derived from Kaaterskill (Dutch: “Wildcat Creek”), as one of the better-known nearby streams is called (probably because of the presence of bobcats). But it has also been suggested that the name comes from kaatsbaan , the Dutch name for the field on which a tennislike racquet game was played, an association that may have sprung from Dutch settlers witnessing local Native Americans playing lacrosse .",
  ""
]