[
  " centrifuge , any device that applies a sustained centrifugal force—that is, a force due to rotation. Effectively, the centrifuge substitutes a similar, stronger, force for that of gravity. Every centrifuge contains a spinning vessel; there are many configurations, depending on use. A perforated rotating drum in a laundry that throws off excess water from clothes, for example, is a type of centrifuge. A similar type is used in industry to separate fluids from solid matter after crushing.",
  "As enunciated by Sir Isaac Newton in his first law of motion, a freely moving body (such as a ball) tends to travel in a straight line, and, if directed along a curved path by some restraining force (such as would result were a hand-held string tied to it), it will exert a force against the directing or restraining force in its continual effort to fly off onto a straight tangential course. It is a familiar observation that an object revolving in a circle exerts a force away from the centre of rotation. This force, which is the outward pull of the ball on its string, is the centrifugal force. Also, there is general appreciation of the fact that the amount of this force can be increased by increasing either the angular velocity of rotation, the mass of the object, or the radius of the circle through which the object moves. Perhaps not so generally appreciated is the fact that, whereas the centrifugal force is directly proportional to the radius and to the mass, it is proportional to the square of the angular velocity. For example, doubling the mass of the rotating object will increase the centrifugal force by a factor of 2, but doubling the number of revolutions per minute (rpm) will increase the centrifugal force by a factor of 4 (equals 2 times 2); similarly, increasing the speed by a factor of 10 will increase the force by a factor of 100 (equals 10 times 10). Centrifugal force is expressed by the basic relation F = mν  2 / R = 4π 2  mn  2  R ; F is the centrifugal force, m the mass, R the radius, v the speed, and n the number of revolutions per second.",
  "The centrifugal force is often compared directly with the weight (pull of gravity) of the object, and the amount of force is stated as so many “times gravity” or so many “ g .” Through the use of special research apparatus, forces greater than 5,000,000 times gravity have been produced by spinning small metal rotors of about pea size at speeds exceeding 1,000,000 revolutions per minute.",
  "The rotating element of a centrifuge is usually driven about a fixed axis by an electric motor, or by an air turbine in some high-speed machines, and is known as a rotor, bowl, or drum. For the minimizing of vibration and strain on the shaft and bearings, it is essential that a loaded rotor be well balanced—i.e., that its total mass be so distributed about the axis of rotation that the resultant of all the elemental forces is zero. If the bearings are suited to high speeds and if ample power is available to overcome the frictional resistance of the bearings, the only limitation to the speed of a well-balanced rotor is the strength against rupture of the material from which it is made.",
  "For example, a rotor with a 15-cm (6-inch) diameter used in certain biological studies and designed especially for high speeds has a limiting speed for routine operation of about 60,000 revolutions per minute. In a rotor of given design, the maximum angular velocity obtainable before rupture is to a close approximation inversely proportional to the rotor’s diameter. Thus, a small rotor having only one-half the diameter of a larger one can be as safely rotated at twice the angular velocity and with the production at the periphery of twice the centrifugal force.",
  "The widest use of centrifuges is for the concentration and purification of materials in suspension or dissolved in fluids. Suspended particles denser than the suspending liquid tend to migrate toward the periphery, while those less dense move toward the centre. The rapidity with which the migration proceeds is dependent on the intensity of the centrifugal field, the difference between the density of the particle and that of the suspending liquid, the viscosity of the liquid, the size and shape of the particle, and to some extent the concentration of the particles and the degree to which they are electrically charged. The net motivating force exerted on the particle is the difference between the centrifugal field acting on it and the opposing buoyancy of the liquid. All other things being equal for two particles, one with a diameter 10 times that of the other will require only  1  100  as much average centrifugal field to move a given distance in a given time as the smaller.",
  "From the foregoing discussion, it is clear that a practically complete separation of the suspending medium and the suspended particles can be produced if the centrifugation is allowed to continue until all particles have collected against the outer wall of the spinning vessel or centrifuge. It should also be noted that a partial separation of two groups of suspended particles of different size can be effected by allowing centrifugation to continue only long enough for all of the larger particles to be completely packed into the sediment, since then many of the small particles will still be suspended in the fluid. If separation of the larger as well as the smaller particles is desired, the surface fluid can be drawn off and the sediment resuspended in some suitable liquid and subsequently centrifuged again to effect further separation.",
  "Centrifuges may be classified in three general categories depending on whether the spinning centrifuge bowl that contains the material to be separated has a solid wall, a perforated wall, or some combination of the two. Also, they may be characterized according to whether the material is treated in a continuous flow process, a batch process, or a combination of the above processes.",
  "A bottle centrifuge is a batch-type separator that is primarily used for research, testing, or control. The separation takes place in test tube or “bottle-type” containers, which are symmetrically mounted on a vertical shaft. The shaft of a bottle centrifuge is usually driven by an electric motor, gas turbine, or a hand-driven gear train located above or below the rotor. In most cases, the bottles are supported by high-strength metal containers so that their axis is perpendicular to the axis of rotation. The sedimentation occurs in a radial direction, and in some bottle centrifuges the test tubes or bottles are inclined at an angle of about 37° to the axis of rotation in order to reduce the distance that the material must settle.",
  "Bottle centrifuges are standard equipment for most biological, chemical, or medical laboratories. They are used to separate solid materials in suspension or to clarify liquids when precipitation will not take place in a reasonable time in the gravitational field g . In most commercial bottle centrifuges the centrifugal field may be varied from a few g up to tens of thousands. Commercial uses of the bottle centrifuge include tests for the butterfat content of milk, determination of the sediment in crude mineral and vegetable oils, and clinical tests of various kinds.",
  " The tubular centrifuge is used primarily for the continuous separation of liquids from liquids or of very fine particles from liquids, although in some cases it is employed as a batch-type centrifuge. In general, it is used when higher centrifugal fields are required for separation. The rotating bowl of a tubular centrifuge consists of a long hollow tube (length many times its diameter) as shown schematically in Figure 1 . For continuous separation the feed or material to be centrifuged enters at one end near the axis and is removed in two streams containing the separated material. In many cases the separation is not complete, and the separated fractions must be passed through the machine several times. Many different designs for the internal structure of the tube are employed, but, in general, radial vanes are used to bring the feed material up to speed and to slow down the separated streams before they are discharged. The centrifuge is driven by a high-speed motor or an air or steam turbine. The sedimentation takes place as the fluid flows from one end of the tube to the other. When the heavy material consists of very fine particles or molecules and the concentration is very low, the solid material is usually allowed to deposit on the wall. In this case the machine is operated as a batch centrifuge.",
  "The tubular centrifuge is finding an increasing number of applications because of the high centrifugal fields that may be used (10 5  g near the periphery in some cases). A few typical uses are as follows: (1) the purification of vaccines (uncentrifuged vaccines contain a large amount of nonessential and harmful material), (2) purification of lubricating and industrial oils, (3) clarification and purification of food products such as essential oils, extracts, and fruit juices, and (4) separation of immiscible liquids that cannot be separated by gravity.",
  "The disk-type centrifuge consists of a vertical stack of thin disks in the shape of cones. The sedimentation takes place in the radial direction in the space between adjacent cones. This greatly reduces the settling distance and hence increases the rate at which the material is separated. The angle of the cones is designed so that upon reaching the inside surface of the cone the heavier material slides down along its surface in a manner that is similar to that of the 37° fixed-angle bottle centrifuge.",
  "The disk-type centrifuge usually operates continuously. The material to be processed enters in one stream and is separated into two purified streams. These centrifuges are used primarily for the separation of liquids in which the solid or immiscible components occur in relatively low concentrations. The familiar cream separator, widely used in the dairy industry and on farms for separating cream from milk, is a typical example of this type of centrifuge. They also are used for the purification of fuel oil, the reclamation of used motor oil, and the removal of soap stock in the refining of vegetable oils.",
  "Basket centrifuges are often called centrifugal filters or clarifiers. They have a perforated wall and cylindrical tubular rotor. In many cases the outer wall of a basket centrifuge consists of a fine mesh screen or a series of screens with the finer mesh screens supported by the heavier coarse screen, which in turn is supported by the bowl. The liquid passes through the screen, and the particles too large to pass through the screen are deposited. The basket centrifuge is employed in the manufacture of cane sugar, in the home and in laundries for the rapid drying of clothes, and in the washing and drying of many kinds of crystals and fibrous materials, etc.",
  "In the centrifuges described above, the rotor spins in air or some other gas at atmospheric pressure. The gaseous friction on a spinning rotor increases at a relatively high rate so that the power required to drive the rotor also increases rapidly. As a result, the temperature of the rotor rises drastically, sometimes exceeding the boiling point of water. As the rotor surface near the periphery moves faster than near the axis, a thermal gradient or variation in temperature through the rotor wall is established along the radius with the periphery at a higher temperature than the axis. These small radial temperature gradients produce convection within the centrifuge, and these convection currents can cause remixing and disturb sedimentation.",
  " The heat buildup and convection problems caused within a centrifuge by air resistance can be avoided by spinning the rotor within an evacuated chamber. The elimination of air resistance also makes possible the attainment of high rotational speeds with relatively little expenditure of energy. Many vacuum-type centrifuges are ultracentrifuges; i.e., they operate at speeds of more than about 20,000 revolutions per minute. Figure 2 shows a schematic diagram of an early vacuum-type ultracentrifuge. The centrifuge rotor located inside the vacuum chamber is connected to the air-supported, air-driven turbine by a vertical, small-diameter, flexible steel shaft.",
  "The rotor of a typical vacuum-type ultracentrifuge is 18 cm (7 inches) in diameter and carries 300 ml (10 ounces) of liquid in a centrifugal field of more than 300,000 g . Practically all substances of importance in medicine and biology and all other substances with molecular weights of 50 daltons (one dalton is 1.66 × 10 −24 grams) or more are easily purified in this type of bottle centrifuge. The rotor of a vacuum-type ultracentrifuge can be replaced by one with sector-shaped cells and transparent windows so that the progress of the sedimentation can be optically measured and photographed. This method was first used by T. Svedberg and J.B. Nichols in 1923 and was widely applied thereafter to determine the sedimentation rates and sizes of many submicroscopic particles, particularly protein molecules and viruses.",
  "The vacuum-type centrifuge may be used for the determination of the molecular weights of practically all substances in solution. In modern commercial vacuum-type centrifuges the air drive and support have been replaced by the more efficient and convenient electric motor drive, and the entire machine has been redesigned and made almost automatic in its operation. The present commercial vacuum-type ultracentrifuge has become an indispensable tool in laboratories where it is necessary to purify substances of importance in biochemistry, biophysics, biology, medicine, and the pharmaceutical industry.",
  "The ultracentrifuge can be used in two principal ways for determining the molecular weights of various proteins . The first consists in carrying out the sedimentation in a centrifugal field high enough to produce a relatively sharp sedimentation boundary—i.e., the boundary between the sedimenting molecules and the pure solvent. The rate at which this boundary moves out along the radius toward the periphery is then measured and the value of the molecular weight is calculated. This is called the rate of sedimentation method. The second method consists in centrifuging the material until equilibrium is established in the centrifuge cell—i.e., until the rate at which the material settles out is balanced by back diffusion. If the concentration in the cell is then determined at various radial distances, the value of the molecular weight can be calculated.",
  "Vacuum-type tubular centrifuges are used to purify many biological materials that cannot easily be separated in other ways. They have been employed both as continuous-flow and as density-gradient centrifuges. The density-gradient centrifuge consists in setting up a radial density variation or gradient in the tubular centrifuge with slowly sedimenting nonreactive smaller molecules such as sucrose or calcium chloride. If, then, the density of the substance to be purified falls within the range of the artificial density gradient, it will collect in a thin cylindrical surface at a definite radius. If more than one substance is in the solution, each of the substances will collect at a radius determined by its particle density.",
  "Another important use of the vacuum-type centrifuge is gas separation. When a gas is subjected to a centrifugal field, a radial pressure gradient is immediately established. Consequently, a mixture of any two gases with different molecular weights may be separated in a centrifuge with the lighter gas being concentrated on the axis. In 1919, after it was pointed out that it should be possible to separate the isotopes of an element by centrifuging, a number of attempts were made to obtain separation but were all unsuccessful, probably due to convection and remixing in the centrifuge. In 1937 the isotopes of chlorine were separated with a vacuum-type ultracentrifuge. An evaporative centrifuge method was used in which the material to be separated is admitted to the rotor and condensed on the periphery with the rotor stationary. The rotor is then driven to operating speed and the lighter material pumped out through the hollow shaft while the heavier material remains in the centrifuge to be collected later. The centrifuge used in gas separation should be spun as rapidly as possible and should be as long as possible. The centrifuge method is suited to the separation of the heavier isotopes as well as the lighter ones, because it depends on the differences in the masses rather than on their absolute values.",
  "Since the mid-1940s the technique of gaseous centrifuging has been further developed and extended. Workers in Germany and in the Netherlands have had considerable success with the method. A remarkably simple vacuum-type gas centrifuge that is especially adapted to uranium isotope separation has been devised. During the 1970s a centrifuge plant was constructed in Europe for the purpose of commercially producing reactor-grade uranium-235 for use in nuclear power plants."
]