[
  " New York Philharmonic , symphony orchestra based in New York, New York, the oldest major symphony orchestra in the United States in continual existence and one of the oldest in the world. Founded in 1842 as the Philharmonic Society of New York under the conductorship of American-born Ureli Corelli Hill, the orchestra merged with Walter Damrosch ’s Symphony Society of New York in 1928.",
  "Its music directors, music advisers, and principal conductors were Ureli Corelli Hill (1842–47), Theodore Eisfeld (1848–65), Carl Bergmann (1855–76), Leopold Damrosch (1876–77), Theodore Thomas (1877–91), Anton Seidl (1891–98), Emil Paur (1898–1902), Walter Damrosch (1902–03), Wassily Safonoff (1906–09), Gustav Mahler (1909–11), Josef Stransky (1911–23), Willem Mengelberg (1922–30), Arturo Toscanini (1928–36), John Barbirolli (1936–41), Artur Rodzinski (1943–47), Bruno Walter (1947–49), Leopold Stokowski (1949–50), Dimitri Mitropoulos (1949–58), Leonard Bernstein (1958–69; laureate conductor 1969–90), George Szell (1969–70), Pierre Boulez (1971–77), Zubin Mehta (1978–91), Kurt Masur (1991–2002), Lorin Maazel (2002–09), Alan Gilbert (2009–17), and Jaap van Zweden (2018– ).",
  "In addition to performing the standard central European repertoire, the Philharmonic has championed contemporary and avant-garde music throughout its history, performing world premieres of Pyotr Ilyich Tchaikovsky ’s Piano Concerto No. 2 , in 1881; Antonín Dvořák ’s Symphony No. 9 in E Minor (From the New World) , in 1893; Sergey Rachmaninoff ’s Piano Concerto No. 3 in D Minor , in 1909; George Gershwin ’s Concerto in F , in 1925; and Igor Stravinsky ’s Symphony in Three Movements , in 1946.",
  "The orchestra first toured the United States in 1882 under Leopold Damrosch. In 1920 Walter Damrosch led the Symphony Society on a European tour. In 1930 Toscanini led the combined orchestra on its first European tour. The Philharmonic first toured the Soviet Union in 1959 and Asia in 1984. In 1993, to celebrate its 150th anniversary season, the orchestra commissioned works by 36 composers and also made a European tour."
]