[
  " Gallus gallus  chicken , ( Gallus gallus ), any of more than 60 breeds of medium-sized poultry that are primarily descended from the wild red jungle fowl ( Gallus gallus , family Phasianidae, order Galliformes ) of India. The chicken is perhaps the most widely domesticated fowl, raised worldwide for its meat and eggs.",
  "Despite the chicken’s close relationship with the red jungle fowl, there is evidence that the gray jungle fowl ( G. sonneratii ) of southern India and other jungle fowl species, also members of Gallus , may have contributed to the bird ’s ancestry. There is some debate about what the chicken’s scientific name should be. Although many taxonomists and ornithologists consider it as a domesticated form of the wild red jungle fowl, some classify it as a subspecies of the red jungle fowl (i.e., G. gallus domesticus ), whereas others, including the U.S. Department of Agriculture , classify the bird as G. domesticus .",
  "Chickens have a squat and rounded appearance. They stand less than 70 cm (27.6 inches) tall and weigh approximately 2.6 kg (5.7 pounds) on average. Males (called cocks or roosters) and females (hens) are known for their fleshy combs, lobed wattles hanging below the bill, and high-arched tails. In some roosters, the tail can extend more than 30 cm (12 inches) in length.",
  "Chickens breed in the spring and summer months. Egg laying is stimulated by the long stretches of daylight that occur during the warmer months; however, artificial lights placed in chicken coops can trigger a hen’s egg laying response throughout the year. The time between ovulation and egg-laying is approximately 23–26 hours. Subsequent ovulations may occur within an hour after the previous egg was laid, allowing some hens to produce as many as 300 eggs per year.",
  "Fertilized embryos develop quickly, and chicks hatch approximately 21 days later. Chicks are born covered in down, but they mature quickly, becoming fully feathered after four to five weeks. At about six months, males produce viable sperm , and females produce viable eggs. Members of free-ranging flocks may live for six to eight years under the best conditions, but most chickens used in the poultry industry serve as egg layers for two to three years before being slaughtered for their meat, with much of it being used in pet food. Chickens in captivity have been known to live for up to 30 years.",
  "Each flock of chickens develops a social hierarchy that determines access to food, nesting sites, mates, and other resources. A flock usually includes one dominant adult male, a few subdominant males, and two or more females that are carefully watched over by the dominant male. Social hierarchies in chickens are segregated by sex and manifest as a pecking order, in which individuals of higher social rank may strike out at individuals of lower rank with their beaks (pecking) to ensure access to food and other resources. Altercations, however, may also include pummeling with wings and scratching with claws.",
  "Chickens belonging to the same age cohort and sex are often kept together in industrial production settings. The pecking order is established within groups of female chicks by the 10th week of life. In groups of male chicks, however, fights for dominance may continue into adulthood. In situations where one adult bird challenges another—which happens most often when a new bird is introduced into the flock—fights involving males risk injury and death more often than fights involving females.",
  " Gallus gallus  Chicken domestication likely occurred more than once in Southeast Asia and possibly India over the most recent 7,400 years, and the first domestications may have been for religious reasons or for the raising of fighting birds. Descendants of those domestications have spread throughout the world in several waves for at least the last 2,000 years. For most of that period, chickens were a common part of the livestock complement of farms and ranches throughout Eurasia and Africa. Only in the early 20th century, however, did chicken meat and eggs become mass-production commodities.",
  " Gallus gallus  Modern high-volume poultry farms, with rows of cages stacked indoors for control of heat, light, and humidity, began to proliferate in Great Britain about 1920 and in the United States after World War II. Females (mature hens and younger chickens, called pullets) are raised for meat and for their edible eggs. Farmers have developed numerous breeds and varieties to fulfill commercial requirements.",
  "Originally, meat production was a by-product of egg production. Only hens that could no longer produce enough eggs were killed and sold for meat. By the mid-20th century, however, meat production had outstripped egg production as a specialized industry. The market for chicken meat has grown dramatically since then, with worldwide exports reaching nearly 12.5 million metric tons (about 13.8 million tons) by the early 21st century.",
  "Mature males have long been used for sport (i.e., cockfighting , now outlawed in many jurisdictions) as well as for breeding. Many immature males (cockerels) are castrated (usually chemically, with hormones that cause atrophying of the testicles) to become meat birds (capons)."
]