[
  " ad et al.  clock , mechanical or electrical device other than a watch for displaying time. A clock is a machine in which a device that performs regular movements in equal intervals of time is linked to a counting mechanism that records the number of movements. All clocks, of whatever form, are made on this principle. See also  atomic clock ; nuclear clock .",
  "  The origin of the all-mechanical escapement clock is unknown; the first such devices may have been invented and used in monasteries to toll a bell that called the monks to prayers. The first mechanical clocks to which clear references exist were large, weight-driven machines fitted into towers and known today as turret clocks. These early devices struck only the hours and did not have hands or a dial.",
  "  The oldest surviving clock in England is that at Salisbury Cathedral, which dates from 1386. A clock erected at Rouen, France, in 1389 is still extant, and one built for Wells Cathedral in England is preserved in the Science Museum in London. The Salisbury clock strikes the hours, and those of Rouen and Wells also have mechanisms for chiming at the quarter hour. These clocks are large, iron-framed structures driven by falling weights attached to a cord wrapped around a drum and regulated by a mechanism known as a verge (or crown wheel) escapement . Their errors probably were as large as a half hour per day. The first domestic clocks were smaller wall-mounted versions of these large public clocks. They appeared late in the 14th century, and few examples have survived; most of them, extremely austere in design, had no cases or means of protection from dust.",
  "  About 1450, clockmakers working probably in southern Germany or northern Italy began to make small clocks driven by a spring. These were the first portable timepieces, representing an important landmark in horology. The time-telling dials of these clocks usually had an hour hand only (minute hands did not generally appear until the 1650s) and were exposed to the air; there was normally no form of cover such as a glass until the 17th century, though the mechanism was enclosed, and the cases were made of brass.",
  "  About 1581 Galileo noticed the characteristic timekeeping property of the pendulum . The Dutch astronomer and physicist Christiaan Huygens was responsible for the practical application of the pendulum as a time controller in clocks from 1656 onward. Huygens’s invention brought about a great increase in the importance and extent of clock making. Clocks, weight-driven and with short pendulums, were encased in wood and made to hang on the wall, but these new eight-day wall clocks had very heavy weights, and many fell off weak plaster walls and were destroyed. The next step was to extend the case to the floor, and the grandfather clock was born. In 1670 the long, or seconds, pendulum was introduced by English clock makers with the anchor escapement.",
  "The pendulum is a reliable time measurer because, for small arcs, the time required for a complete swing (period) depends only on the length of the pendulum and is almost independent of the extent of the arc. The length of a pendulum with a period of one second is about 39 inches (990 mm), and an increase in length of 0.001 inch (0.025 mm) will make the clock lose about one second per day. Altering the length of a pendulum is therefore a sensitive means of regulation. The alteration is usually carried out by allowing the bob to rest upon a nut that can be screwed up or down the pendulum rod.",
  "Any expansion or contraction of the rod caused by changes of temperature will affect the timekeeping of a pendulum; e.g., a pendulum clock with a steel rod will lose one second a day for a rise in temperature of approximately 4 °F (2.2 °C). For accurate timekeeping, the length of the pendulum must be kept as nearly constant as possible. This may be done in several ways, some of which use the differing coefficients of expansion (the amount of expansion per degree change in temperature) of different metals to obtain a cancelling-out effect. In one popular compensation method, the bob consists of a glass or metal jar containing a suitable amount of mercury. The gridiron pendulum employs rods of different metal, usually brass and steel, while in the zinc-iron tube the pendulum rod is made of concentric tubes of zinc and iron. An improved method, however, is to make the pendulum rod from a special alloy called Invar . This material has such a small coefficient of expansion that small changes of temperature have a negligible effect and can easily be compensated for if required.",
  "  In a pendulum clock an escape wheel is allowed to rotate through the pitch of one tooth for each double swing of the pendulum and to transmit an impulse to the pendulum to keep it swinging. An ideal escapement would transmit the impulse without interfering with the free swing, and the impulse should be as uniform as possible. The double three-legged gravity escapement, which achieves the second of these but not the first, was invented by Edmund Beckett, afterward Lord Grimthorpe , and used by him for the great clock at Westminster, now generally known as Big Ben , which was installed in 1859. It became the standard for all really accurate tower clocks.",
  "  The true innovation of the weight-driven clock was the escapement, the system that mediated the transfer of the energy of the gravitational force acting on the weights to the clock’s counting mechanism. The most common escapement was the verge-and-foliot.",
  "In a typical verge-and-foliot escapement, the weighted rope unwinds from the barrel, turning the toothed escape wheel. Controlling the movement of the wheel is the verge, a vertical rod with pallets at each end. When the wheel turns, the top pallet stops it and causes the foliot, with its regulating weights, to oscillate. This oscillation turns the verge and releases the top pallet. The wheel advances until it is caught again by the bottom pallet, and the process repeats itself. The actions of the escapement stabilize the power of the gravitational force and are what produce the ticktock of weight-driven clocks.",
  "The wheelwork, or train, of a clock is the series of moving wheels (gears) that transmit motion from a weight or spring, via the escapement, to the minute and hour hands. It is most important that the wheels and pinions be made accurately and the tooth form designed so that the power is transferred as steadily as possible.",
  "In a clock driven by a weight or a spring, the power is first transmitted by the main, or great, wheel. This engages with a pinion (a gear with a small number of teeth designed to mesh with a larger wheel), whose arbor (a turning rod to which gears are attached) is attached to the second wheel that, in its turn, engages with the next pinion, and so on, down through the train to the escapement. The gear ratios are such that one arbor, usually the second or third, rotates once an hour and can be used to carry the minute hand. A simple 12-to-1 gearing, known as the motion work, gives the necessary step-down ratio to drive the hour hand. The spring or weight is fitted with a mechanism so it can be rewound when necessary, and the arbor carrying the minute hand is provided with a simple slipping clutch that allows the hands to be set to the correct time.",
  "  The timekeeping part of all weight-driven clocks, including large tower clocks, is substantially the same. The frame is made up of two plates that carry the pivots of the various wheels and other moving parts and that are united and spaced by four pillars. The driving weight hangs from a line coiled around a barrel or sprocket, which is raised by turning the winding square or, in some cases, by pulling on the line. The main wheel engages with the centre pinion, on the arbor (axle) of which is also mounted the centre wheel. The front pivot of this wheel and pinion carries the minute hand and part of the gearing necessary to drive the hour hand.",
  "The centre wheel is also coupled through a suitable gear train to the escape wheel, which engages with the pallets that are fixed to the arbor between the front plate and the pendulum suspension cock. Also fixed to the pallet arbor is the crutch, which terminates at its lower end in a fork that embraces the pendulum rod.",
  "The motion work used for driving the hands is mounted between the dial and the front plate of the frame. The cannon pinion, which drives the motion work, rotates once an hour; it is coupled to the centre arbor by a flat spring that acts as a clutch and permits the hands to be set.",
  "Electric currents can be used to replace the weight or spring as a source of power and as a means of signaling time indications from a central master clock to a wide range of distant indicating dials. Invented in 1840, the first battery electric clock was driven by a spring and pendulum and employed an electrical impulse to operate a number of dials. Considerable experimental work followed, and it was not until 1906 that the first self-contained battery-driven clock was invented.",
  "In a master clock system, electricity is used to give direct impulses to the pendulum, which in turn causes the clock’s gear train to move, or to lift a lever after it has imparted an impulse to the pendulum. In various modern master clocks the pendulum operates a light count wheel that turns through the pitch of one tooth every double swing and is arranged to release a lever every half minute. This lever gives an impulse to the pendulum and is then restored to its original position by an electromagnet. The pulse of current that operates the electromagnet can also be transmitted to a series of distant dials, or slave clocks, advancing the hands of each through the space of a half minute. Thus, a master clock can control scores of dials in a large group of buildings, as well as such other apparatus as time recorders and sirens.",
  "Electric master clocks of this type are good timekeepers, since the impulse can be given symmetrically as the pendulum passes through its middle position and the interference with its motion is small.",
  "With the application of the synchronous electric motor to clocks in 1918, domestic electric clocks became popular. A synchronous electric motor runs in step with the frequency of the electric power source, which in most countries alternates at 60 hertz (cycles per second). The electric motor is coupled to a reduction gearing that drives the clock hands at the correct rate.",
  "The synchronous electric clock has no timekeeping properties in itself and is wholly dependent upon the frequency stability of the alternating current supplied. If this frequency changes, the electric clock will not keep correct time.",
  "The most accurate mechanical timekeeper is the Shortt pendulum clock; it makes use of the movement described above for electric master clock systems. The Shortt pendulum clock consists of two separate clocks, one of which synchronizes the other. The timekeeping element is a pendulum that swings freely, except that once every half minute it receives an impulse from a gently falling lever. This lever is released by an electrical signal transmitted from its slave clock. After the impulse has been sent, a synchronizing signal is transmitted back to the slave clock that ensures that the impulse to the free pendulum will be released exactly a half minute later than the previous impulse. The pendulum swings in a sealed box in which the air is kept at a constant, low pressure. Shortt clocks in observatories are kept in a room, usually a basement, where the temperature remains nearly constant, and under these conditions they can maintain the correct time to within a few thousandths of a second per day.",
  "In 1929 the quartz crystal was first applied to timekeeping; this invention was probably the single greatest contribution to precision time measurement. Quartz crystals oscillating at frequencies of 100,000 hertz can be compared and frequency differences determined to an accuracy of one part in 10 10 .",
  "  The timekeeping element of a quartz clock consists of a ring of quartz about 2.5 inches (63.5 mm) in diameter, suspended by threads and enclosed in a heat-insulated chamber. Electrodes are attached to the surfaces of the ring and connected to an electrical circuit in such a manner as to sustain oscillations. Since the frequency of vibration, 100,000-hertz, is too high for convenient time measurement, it is reduced by a process known as frequency division or demultiplication and applied to a synchronous motor connected to a clock dial through mechanical gearing. If a 100,000 hertz frequency, for example, is subjected to a combined electrical and mechanical gearing reduction of 6,000,000 to 1, then the second hand of the synchronous clock will make exactly one rotation in 60 seconds. The vibrations are so regular that the maximum error of an observatory quartz-crystal clock is only a few ten-thousandths of a second per day, equivalent to an error of one second every 10 years."
]