[
  " cognition , the states and processes involved in knowing, which in their completeness include perception and judgment. Cognition includes all conscious and unconscious processes by which knowledge is accumulated, such as perceiving, recognizing, conceiving, and reasoning . Put differently, cognition is a state or experience of knowing that can be distinguished from an experience of feeling or willing.",
  "Questions about the nature of cognition and the relationship between the knowing mind and external reality have been debated by philosophers since antiquity ( see  epistemology: The history of epistemology ). Cognition and its development have been studied from many viewpoints and subjected to many interpretations. The essence of cognition is judgment, which occurs when a certain object is distinguished from other objects and is characterized by some concept or concepts. The psychologist is concerned with cognitive processes as they affect learning and behaviour .",
  "There are two broad approaches to contemporary cognitive theory. The information-processing approach attempts to understand human thought and reasoning processes by comparing the mind (or the brain ) to a sophisticated computer system that is designed to acquire, process, store, and use information in specific ways ( see also  philosophy of mind: The computational-representational theory of thought [CRTT] ). The American psychologist Robert Sternberg, for example, examined the information-processing procedures used by people taking intelligence tests . Herbert A. Simon , another American social scientist, attempted to understand how the mind processes information, programming computers to mimic human thought processes. Researchers in this area strive to develop a unified theory of cognition by creating computer programs that can learn, solve problems, and remember as humans do.",
  "The second approach is based on the work of Swiss psychologist Jean Piaget , who viewed cognitive adaptation in terms of two basic processes: assimilation and accommodation. Assimilation is the process of interpreting reality in terms of a person’s internal model of the world (based on previous experience); accommodation represents the changes one makes to that model through the process of adjusting to experience. The American psychologist Jerome S. Bruner broadened Piaget’s concept by suggesting that cognitive processes are influenced by the three modes that are used to represent the world: the enactive mode involves representation through action; the iconic mode uses visual and mental images; and the symbolic mode uses language . See also  cognitive science ."
]