[
  " World Wide Web (WWW) , byname the Web , the leading information retrieval service of the Internet (the worldwide computer network ). The Web gives users access to a vast array of content—via the deep web , the dark web , and the commonly accessible surface web—that is connected by means of hypertext or hypermedia links—i.e., hyperlinks, electronic connections that link related pieces of information in order to allow a user easy access to them. Hypertext allows the user to select a word or phrase from text and thereby access other documents that contain additional information pertaining to that word or phrase. Hypermedia documents feature links to images, sounds, animations, and movies. The Web operates within the Internet’s basic client-server format; servers are computer programs that store and transmit documents to other computers on the network when asked to, while clients are programs that request documents from a server as the user asks for them. Browser software allows users to view the retrieved documents. Special browsers and platforms such as Tor allow users to do so anonymously.",
  "A hypertext document with its corresponding text and hyperlinks is written in HyperText Markup Language ( HTML ) and is assigned an online address called a Uniform Resource Locator ( URL ).",
  "  The development of the World Wide Web was begun in 1989 by Tim Berners-Lee and his colleagues at CERN , an international scientific organization based in Geneva, Switzerland. They created a protocol, HyperText Transfer Protocol ( HTTP ), which standardized communication between servers and clients. Their text-based Web browser was made available for general release in January 1992.",
  "The World Wide Web gained rapid acceptance with the creation of a Web browser called Mosaic, which was developed in the United States by Marc Andreessen and others at the National Center for Supercomputing Applications at the University of Illinois and was released in September 1993. Mosaic allowed people using the Web to use the same sort of “point-and-click” graphical manipulations that had been available in personal computers for some years. In April 1994 Andreessen cofounded Netscape Communications Corporation, whose Netscape Navigator became the dominant Web browser soon after its release in December 1994. BookLink Technologies’ InternetWorks, the first browser with tabs, in which a user could visit another Web site without opening an entirely new window, debuted that same year. By the mid-1990s the World Wide Web had millions of active users.",
  "The software giant Microsoft Corporation became interested in supporting Internet applications on personal computers and developed its own Web browser (based initially on Mosaic), Internet Explorer (IE), in 1995 as an add-on to the Windows 95 operating system . IE was integrated into the Windows operating system in 1996 (that is, it came “bundled” ready-to-use within the operating system of personal computers), which had the effect of reducing competition from other Internet browser manufacturers, such as Netscape. IE soon became the most popular Web browser.",
  " Apple ’s Safari was released in 2003 as the default browser on Macintosh personal computers and later on iPhones (2007) and iPads (2010). Safari 2.0 (2005) was the first browser with a privacy mode, Private Browsing, in which the application would not save Web sites in its history, downloaded files in its cache, or personal information entered on Web pages.",
  "The first serious challenger to IE’s dominance was Mozilla’s Firefox , released in 2004 and designed to address issues with speed and security that had plagued IE. In 2008 Google launched Chrome , the first browser with isolated tabs, which meant that when one tab crashed, other tabs and the whole browser would still function. By 2013 Chrome had become the dominant browser, surpassing IE and Firefox in popularity. Microsoft discontinued IE and replaced it with Edge in 2015.",
  "In the early 21st century, smartphones became more computer-like, and more-advanced services, such as Internet access, became possible. Web usage on smartphones steadily increased, and in 2016 it accounted for more than half of Web browsing."
]