[
  " conductor , in music, a person who conducts an orchestra, chorus, opera company, ballet, or other musical group in the performance and interpretation of ensemble works. At the most fundamental level, a conductor must stress the musical pulse so that all the performers can follow the same metrical rhythm. The keeping of this rhythmic beat is accomplished by a stylized set of arm and hand movements that outline the basic metre— e.g., two beats to the measure (as in a polka), three beats (as in a waltz or mazurka), or four beats (as in a march), in each case the primary accent being indicated by a downstroke.",
  "For nearly two centuries, conductors favoured a baton, or thin wand, in the right hand as a device for emphasizing the metrical outline, reserving the left hand for indicating entries of different parts and nuances. Some contemporary conductors, however, follow a practice long established in unaccompanied choral conducting and dispense with the baton; the absence of the baton frees both hands for more elaborately interpretive directions. With the removal of the baton and the elimination, through memorization, of the printed score in public performance, the conductor is free to use not only his hands and arms but also the movement of his torso and facial muscles to express to the group his wishes in the execution of phrasing, dynamic level, nuance, individual entrances, and other aspects of a finished performance.",
  "Conducting became a specialized form of musical activity only in the early 19th century. As early as the 15th century, performances by the Sistine Choir in the Vatican were kept together by slapping a roll of paper (or in other cases, a lengthy pole, or baton) to maintain an audible beat. This practice continued until it became an actual intrusion on the performance and was of necessity abandoned. By the time of J.S. Bach and George Frideric Handel (late 17th to mid-18th century), the role of key musician was not only to compose music on demand but to conduct it as well, usually from the composer-performer’s chair at the organ or harpsichord. At the Paris Opéra, the position of the conductor fell to the concertmaster, operating from the first violin desk and handling his complicated chores as best he could. But throughout this time, the “conductor” was largely a major functionary, first among equals, whose chief responsibility was to perform with the ensemble and only secondarily to lead it.",
  "The 19th century bred a new kind of musician—the composer-conductor, as exemplified by Carl Maria von Weber, Hector Berlioz, Felix Mendelssohn, and Richard Wagner—men of autocratic and creative character who assumed full control over performance and brought to their work a singleminded creative viewpoint and a cultivated sensitivity that was a hallmark of much of the 19th-century period in music. In some instances, this new breed commanded such influence that they were able successfully to champion unpopular causes, such as Mendelssohn’s revival of the music of Bach, considered at the time to be old-fashioned and academic. Hermann Levi, Hans Richter, and Felix Mottl followed Wagner’s example of imaginative gesture and control in conducting, and Hans von Bülow epitomized the virtuoso conductors who flourished at this time. In their pivotal role between composer, performer, and public, Bülow and other conductors acquired stature and prestige unequaled among musicians.",
  "In the years encompassing World Wars I and II particularly, exceptional conductors often achieved international fame through well-nigh legendary control over their musicians in their quest for the perfect interpretation. Arturo Toscanini was the personification of such figures. The most effective 20th-century conductors have been both gifted musicians and skilled and sensitive leaders, capable of dealing authoritatively with professionals in their own field while possessing the deftness to understand the needs of their economic supporters and public. Among the most notable conductors since World War II have been Sir Georg Solti, Herbert von Karajan, and Leonard Bernstein. Women conductors—most notably the American Sarah Caldwell—began to achieve recognition after the mid-20th century."
]