[
  " The Conjurer The Conjurer  magic , also called conjuring,  prestidigitation , or sleight of hand , theatrical representation of the defiance of natural law. Legerdemain , meaning “light, or nimble, of hand,” and juggling , meaning “the performance of tricks,” were the terms initially used to designate exhibitions of deception. The words magic and conjuring had no theatrical significance until the end of the 18th century. Descriptions of magical demonstrations were recorded in Egypt as early as 2500 bce . Such accounts reflect an inevitable mix of fact and fantasy, a quality they share with even their most modern counterparts.",
  "  (Read Harry Houdini’s 1926 Britannica essay on magic.)  ",
  "One of the tenets of magic —indeed, one employed and exploited by some of its foremost practitioners—is that spectators cannot perceive correctly the miraculous effects they have witnessed. Perhaps conjurers have always understood that when viewers are in a state of amazement, their capacity for accurate recall is diminished. The use of psychology, therefore, is one of the principal techniques of the conjurer, especially in the practice of misdirection, in which a spectator’s attention is directed to a specific point determined by the performer. The knowledge of scientific principles, the implementation of ingenious mechanical devices, and impressive physical dexterity are also essential tools of the successful magician.",
  "Although several previous references exist, the printed literature of magic dates in earnest from the mid-16th century and encompasses thousands of texts. Descriptions of the art can be gleaned from widely divergent categories of literature: refutations of witchcraft that find it necessary to expose magicians’ tricks; books of secrets, which may include not only recipes for salves, japanning metals, medicines, and artists’ colours but also a few simple conjuring effects; the literature of lowlife, which may offer explanations of cheating maneuvers used by picaresque characters; works on hydraulics and optics, which discuss scientific principles used by conjurers; works of mathematical recreations; and books of tricks sold for the purpose of teaching, or at least disclosing to the curious, methods used by magicians. The Discoverie of Witchcraft by Reginald Scot and The First Part of Clever and Pleasant Inventions by Jean Prevost, both published in 1584, in London and Lyons, respectively, are the seminal texts on magic. These early descriptions reflect performances of conjurers that probably took place decades or even hundreds of years before they were recorded, and these books provide the basis for much of the sleight of hand still in use.",
  "In spite of a fondness for taxonomy within the literature of the profession, no universally accepted list of illusions defines the conjurer’s art. S.H. Sharpe (1902–92) presented a representative classification of six basic effects: production (e.g., a coin appears in a hand previously shown to be empty); disappearance (a woman is covered with a cloth, and when the covering is whisked away the woman has vanished); transformation (a dollar bill is changed into a hundred-dollar bill); transposition (the ace of spades is placed on top of a glass and the three of hearts under the glass, and the cards change places); the defiance of natural sciences (a person is levitated and appears to float in the air); and mental phenomena ( mind reading ).",
  "Many sources, beginning with the earliest works on magic, describe the attributes common to the best practitioners of the art and detail the skills they must cultivate. Hocus Pocus Junior: The Anatomie of Legerdemain; or, the Art of Jugling … (1634) suggests the following:",
  "The great French magician Jean-Eugène Robert-Houdin (1805–71) stated: “To succeed as a conjurer, three things are essential—first, dexterity; second, dexterity; and third, dexterity.” But he also stressed the study of science and the application of mental subtleties. Harry Kellar (1849–1922), the most famous American magician in the early years of the 20th century, suggested more-unconventional qualifications for the successful conjurer: “The will, manual dexterity, physical strength, the capacity to perform things automatically, an accurate, perfectly ordered and practically automatic memory, and a knowledge of a number of languages, the more the better.”",
  "Although some conjurers are cited by name in the early literature, accounts devoted to particular magicians are fragmentary until the 18th century. Isaac Fawkes (d. 1731), the English fairground conjurer, and Matthew Buchinger (1674–1739), “The Little Man of Nuremberg”—who exhibited the classic cups and balls effect although he had no arms or legs—were the best-known performers in the first half of the century. By the 1780s the Italian wizard Chevalier Pinetti (1750–1800) had introduced magic in a theatrical setting, liberating it from centuries of itinerant performance in street fairs and taverns.",
  "Two great conjurers emerged in the 19th century: the previously mentioned Robert-Houdin, a watchmaker who combined a scientific approach to conjuring with the social graces of a gentleman and who is considered the father of modern magic; and the Viennese enchanter Johann Nepomuk Hofzinser , a master of both inventive apparatus and original sleight of hand, especially with playing cards . Both men performed in small, elegant theatres and elevated the art to its highest levels, making the performance of magic as viable for the beau monde as a trip to the ballet or opera.",
  "  At the turn of the 20th century, magic was a successful form of popular entertainment. Elaborate stage shows such as that offered by Alexander Herrmann (1844–96) in the United States or John Nevil Maskelyne (1839–1917) and David Devant (1868–1941) in London became the rage. In 1903, Okito, T. Nelson Downs, the Great Lafayette, Servais LeRoy, Paul Valadon, Howard Thurston , and Horace Goldin, a veritable all-star team of renowned conjurers, appeared simultaneously in different London theatres. At the same time, Max Malini (1873–1942) traveled the globe giving impromptu performances in private settings for members of high society and nobility. In the United States, Harry Houdini specialized in a single aspect of the art, escapology—extrication from restraints such as handcuffs or straitjackets—to become magic’s most famous practitioner in the vaudeville era, while Kellar, Thurston, and Harry Blackstone, Sr. (1885–1965), conducted large and popular touring shows. After a considerable slump in the popularity of stage illusion, Doug Henning revitalized the art by appearing on Broadway in the 1970s and paved the way for the success of the magic show of David Copperfield and the Las Vegas extravaganza of Siegfried and Roy. What may have been the most lasting contribution to the magic art in the 20th century was the advancement of close-up or sleight-of-hand magic in intimate performance. The greatest exponent of this branch of conjuring was the Canadian-born Dai Vernon (1894–1992), who revolutionized the art and whose legacy is shared by professional performers and by thousands of amateur enthusiasts around the world.",
  "Magic is a universal art form. Although it may reflect specific features of nationality, ethnicity, or religion, it thrives without regard to them, and it has developed independently in various cultures. It has survived hundreds of years of exposure and trivialization. No matter how often and how egregiously its secrets are revealed, the passage of years, a change of context, and the power of a splendid performer can rekindle an old principle to create a performance miracle.",
  "Overviews are provided by Nevil Maskelyne and David Devant , Our Magic (1911; 2nd ed. 1946), with a reprint of part 1 entitled Maskelyne on the Performance of Magic (1976); Milbourne Christopher and Maurine Christopher , The Illustrated History of Magic (1996); and T.A. Waters , The Encyclopedia of Magic and Magicians (1988). Various personalities are also treated in Edwin A. Dawes , The Great Illusionists (1979); and Ricky Jay , Learned Pigs and Fireproof Women (1986; reissued 1998)."
]