[
  " continuity , in mathematics, rigorous formulation of the intuitive concept of a function that varies with no abrupt breaks or jumps. A function is a relationship in which every value of an independent variable—say x —is associated with a value of a dependent variable—say y . Continuity of a function is sometimes expressed by saying that if the x -values are close together, then the y -values of the function will also be close. But if the question “How close?” is asked, difficulties arise.",
  "For close x -values, the distance between the y -values can be large even if the function has no sudden jumps. For example, if y = 1,000 x , then two values of x that differ by 0.01 will have corresponding y -values differing by 10. On the other hand, for any point x , points can be selected close enough to it so that the y -values of this function will be as close as desired, simply by choosing the x -values to be closer than 0.001 times the desired closeness of the y -values. Thus, continuity is defined precisely by saying that a function f ( x ) is continuous at a point x  0 of its domain if and only if, for any degree of closeness ε desired for the y -values, there is a distance δ for the x -values (in the above example equal to 0.001ε) such that for any x of the domain within the distance δ from x  0 , f ( x ) will be within the distance ε from f ( x  0 ). In contrast, the function that equals 0 for x less than or equal to 1 and that equals 2 for x larger than 1 is not continuous at the point x = 1, because the difference between the value of the function at 1 and at any point ever so slightly greater than 1 is never less than 2.",
  "A function is said to be continuous if and only if it is continuous at every point of its domain. A function is said to be continuous on an interval, or subset of its domain, if and only if it is continuous at each point of the interval. The sum, difference, and product of continuous functions with the same domain are also continuous, as is the quotient, except at points at which the denominator is zero. Continuity can also be defined in terms of limits by saying that f ( x ) is continuous at x  0 of its domain if and only if, for values of x in its domain,   ",
  "A more abstract definition of continuity can be given in terms of sets, as is done in topology , by saying that for any open set of y -values, the corresponding set of x -values is also open. (A set is “open” if each of its elements has a “neighbourhood,” or region enclosing it, that lies entirely within the set.) Continuous functions are the most basic and widely studied class of functions in mathematical analysis , as well as the most commonly occurring ones in physical situations."
]