[
  " Sebastian Coe , in full Sebastian Newbold Coe, Baron Coe of Ranmore , (born September 29, 1956, London, England), British athlete, who won four Olympic medals and set eight world records in middle-distance running . His great rivalry with fellow Briton Steve Ovett dominated middle-distance racing for much of the 1980s.",
  "Coe studied economics and social history at Loughborough University and won his first major race in 1977, an 800-metre event at the European indoor championships in San Sebastián, Spain. He first ran against Ovett in Prague in 1978 in an 800-metre race that neither won. The next year in Oslo, Norway, Coe set his first world records, in 800-metre and one-mile races. At the 1980 Olympic Games in Moscow , the graceful Coe was favoured in the 800-metre race, and the powerful Ovett was favoured in the 1,500-metre race, an event in which he and Coe shared the world record. Instead, Ovett won the 800 metres, with Coe taking a silver medal; in the 1,500 metres, Coe accelerated at the final curve and won the gold medal.",
  "Coe set world records in the 800- and 1,000-metre races in 1981, the year his rivalry with Ovett reached a climax. He beat Ovett’s mile record, running it in 3 min 48.53 sec on August 19; only a week later Ovett set another mile record, which was then shattered by Coe with a 3 min 47.33 sec run on August 28. Illness limited Coe’s racing in the next two years, but he rebounded strongly to win another gold medal in the 1,500 metres and another silver medal in the 800 metres at the 1984 Olympics in Los Angeles . He won the 800-metre European championship in 1986, but illness hampered the late years of his career, and he was not chosen to participate in the 1988 Olympic Games.",
  "He served as a Conservative member of the House of Commons from 1992 to 1997 and was elevated to the House of Lords as a life peer in 2000. In 2003 he became a council member of the International Association of Athletic Federations (IAAF), and he was appointed vice president of the IAAF in 2007. In 2004 Coe was named head of London’s bid for the 2012 Olympics. After London was awarded the Games in 2005, he became the chair of the London Organising Committee of the Olympic Games. In 2015 he was elected president of the IAAF. Coe was made an Officer of the Order of the British Empire (OBE) in 1991, was promoted to Knight Commander (KBE) in 2006, and was invested as a Companion of Honour in 2013."
]