[
  " cosmic ray , a high-speed particle—either an atomic nucleus or an electron —that travels through space. Most of these particles come from sources within the Milky Way Galaxy and are known as galactic cosmic rays (GCRs). The rest of the cosmic rays originate either from the Sun or, almost certainly in the case of the particles with the highest energies, outside the Milky Way Galaxy.",
  "Cosmic ray particles are not directly observed on the surface of Earth . This is because cosmic ray “primaries”—that is, the particles that arrive at the outer edge of Earth’s atmosphere —collide with atmospheric nuclei and give rise to “secondaries.” Some secondaries are fragments of the colliding nuclei, including neutrons, and others are short-lived particles created from the energy of the collisions. Secondary nuclei soon have their own collisions. It is the secondaries (neutrons and short-lived particles such as muons) that are observed at sea level . Primaries must be studied by using either high-altitude balloons or spacecraft.",
  "Among the GCRs, the relative abundances of the different nuclei and electrons vary with energy. Above about 1 GeV per nucleon (gigaelectron volts, or one billion electron volts, per nucleon), the proportions are about 85 percent protons (nuclei of hydrogen atoms), with approximately 13 percent consisting of alpha particles ( helium nuclei). (An energy of 1 GeV corresponds to speeds greater than about 87 percent of the speed of light.) The remaining 2 percent are electrons and nuclei of heavier atoms. At energies of several hundred MeV per nucleon (megaelectron volts, or one million electron volts, per nucleon), the corresponding figures are about 90, 9, and 1 percent.",
  "Most of the GCRs detected near Earth have kinetic energies in excess of about 1 GeV per nucleon. The steady flux of these primaries at the top layer of the atmosphere is around 1,500 particles per square metre per second. The number of particles drops rapidly with increasing energy, but individual particles with energies as high as several times 10 20 eV have been detected. (This energy is comparable to that of a baseball thrown at 160 km [100 miles] per hour.)",
  "The trajectories of the lowest-energy cosmic ray primaries are strongly influenced by Earth’s magnetic field . Consequently, at energies below about 1 GeV per nucleon, at each geomagnetic latitude there is a cutoff energy below which primary GCRs are not detected. The flux of these low-energy particles is influenced by solar activity, and the amount of cosmic radiation reaching Earth is inversely correlated with the number of sunspots through the 11-year solar cycle . This inverse correlation is called the Forbush effect and occurs because, at maximum solar activity, stronger magnetic fields are carried out into interplanetary space by the solar wind, and these fields block the cosmic rays.",
  "Because of their deflection by magnetic fields in the Milky Way Galaxy , primary GCRs follow convoluted paths and arrive at the top of Earth ’s atmosphere nearly uniformly from all directions. Consequently, cosmic ray sources cannot be identified from the direction of arrival but rather must be inferred from the elemental and isotopic abundances of those cosmic rays that are atomic nuclei. This can be attempted by comparing cosmic ray abundances with those deduced spectroscopically for stars and interstellar regions. The relative abundances of different elements among cosmic ray nuclei have been well studied for particles with energies from roughly 100 MeV to several tens of GeV per nucleon. Abundances have been measured for elements up to uranium. From such data it has been possible to reconstruct much of the history of the cosmic ray particles’ journeys through the Milky Way Galaxy. The light elements lithium , beryllium , and boron are rare throughout the universe but are surprisingly abundant among the primary GCRs. It is accepted that these light nuclei are produced when heavier primaries (e.g., carbon and oxygen ) are fragmented during collisions with the thin interstellar gas composed mostly of hydrogen .",
  "After appropriate corrections for the collisions of GCRs with interstellar gas, it is found that the inferred composition of the sources is similar to that of general solar-system matter; however, too little hydrogen and helium are present, and significant differences exist for isotopes of neon and iron. Those elements that preferentially form dust grains are found to have enhanced abundances. It is thought that the cosmic rays represent a mixture of material, with about 80 percent having solar-system composition and with about 20 percent of nuclei coming from massive evolved stars, such as Type II, or core-collapse, supernovas and Wolf-Rayet stars that are found in groups of young, hot stars called OB associations.",
  "With an average life of 15 million years, GCRs must be replenished at an average power level of about 10 41 ergs per second. Supernova explosions can supply this much power as they occur about every 50 years in the galaxy. Core-collapse supernovas, coming from OB stars, comprise about 85 percent of all galactic supernovas, and close to 90 percent of heavy GCRs are probably accelerated there. While it appears that particle acceleration can be accomplished by the expanding shock waves from supernovas, details of the processes involved in cosmic ray production and acceleration remain unclear.",
  "The GCRs must have been traveling for about 15 million years to produce enough interstellar collisions to yield the observed number of light nuclei. The timescale for this travel is based in part on the observation of such radioactive fragments as beryllium-10. This radionuclide has a half-life of 1.5 million years, and the number of such particles that can survive to be detected on Earth depends on their total travel time.",
  "Most of the electrons in the primaries are produced in the original cosmic ray sources that produce the primary nuclei. A small portion of the electrons do come from collisions between primary cosmic ray atomic nuclei and interstellar hydrogen, which produce charged mesons —mostly pions. These pions have half-lives of about two hundred-millionths of a second and decay into muons ; the muons then decay and produce electrons, positrons , and neutrinos . The electrons and positrons travel along spiral paths in the galactic magnetic field and so generate synchrotron radiation , which is detected by radio telescopes . There is general agreement between radio observations of the synchrotron radiation and the intensities calculated from the electron flux. Synchrotron radiation has been detected from supernova remnants such as the Crab Nebula , confirming their identification as potential cosmic-ray sources.",
  "Interstellar cosmic ray collisions also yield neutral pions, which decay quickly to produce high-energy gamma rays . Gamma-ray surveys (conducted from Earth-orbiting satellites) indicate that cosmic rays are strongly concentrated in the disk of the Milky Way Galaxy , with a much smaller percentage in the surrounding halo. The measured intensity of the gamma rays is in general agreement with calculated values.",
  "Primary particles with energies above about 10 18 eV are so rare that they can be detected only through the extensive air showers (EASs) that they produce in the atmosphere . An EAS may consist of billions of secondaries including photons, electrons , muons , and some neutrons that arrive at ground level over areas of many square kilometres. Very high-energy primaries arrive at the top of the atmosphere at a rate of about one per square kilometre per century, and detection of their showers can involve an array of over a thousand particle detectors over a wide area. Primary gamma rays with energies above about 1 TeV (teraelectron volt, or one trillion electron volts) can also be detected by large-area ground arrays or atmospheric Cerenkov telescopes.",
  "The galactic magnetic field is not strong enough to confine the most energetic primary particles within the Milky Way Galaxy, and there have been suggestions that the origins of these particles lie outside the Milky Way, perhaps in active galaxies powered by supermassive black holes with masses a hundred million times the mass of the Sun . A small anisotropy in arrival directions has been reported at multi-TeV energies. The anisotropy is a few tenths of a percent, but it is not understood.",
  "The intergalactic magnetic fields are still strong enough to deflect most cosmic ray particles in their transit, making it difficult to use their arrival directions to pinpoint their precise origins. There is, however, a constraint on the distances that these particles can travel: major energy losses will occur in their collisions with photons of the cosmic microwave background . Consequently, there might be an upper limit to the energies of detectable particles, but this has not yet been definitively observed.",
  "Because of the small number of very high-energy particles observed, strong inferences cannot yet be drawn from their analysis. An alternative analysis of shower data has suggested an increased proportion of heavy nuclei (such as iron ) among the primaries.",
  "Some high-energy showers are produced by cosmic gamma rays, which are of particular interest because their paths are not affected by magnetic fields. Their arrival directions can point to sources in very energetic cosmic objects—e.g., supernova remnants such as the Crab Nebula and Tycho’s Nova and active galaxies such as Markarian 421 and 501. These can also be sources of cosmic ray particles.",
  "Energetic particles emerge from solar flares and coronal mass ejections where they have been accelerated by the strong magnetic fields near the Sun. Most of these particles are protons , with decreasing numbers of helium and heavier nuclei . Observations of the helium- oxygen ratio among energetic solar particles have contributed significantly to solar studies, because the Sun ’s helium abundance is difficult to estimate by means of conventional spectroscopy. The energy spectrum of solar particles, as compared with that of GCRs, generally decreases more rapidly with increasing energy, but there is great variability in the shape of the spectrum from one solar flare event to another, and the energy spectrum rarely extends above about 1 GeV per nucleon.",
  "The first cosmic ray studies were conducted atop mountains, where only secondary particles were detectable. Since then further studies have been carried out from far below Earth ’s surface to outer space. Some secondary muons have such high energies that they are able to penetrate Earth to depths of more than 3.2 km (2 miles). To study primary cosmic rays directly, high-altitude balloons (typically reaching altitudes of 37 km [about 120,000 feet]) have been extensively used. Rockets can reach greater heights but carry smaller payloads and remain at those altitudes for only a few minutes. Cosmic ray observations also have been made from Earth-orbiting satellites and from long-range probes. Cosmic rays are observed with instruments such as scintillation counters and proportional counters .",
  "From the early 1930s to the 1950s, cosmic rays played a critical role in the scientific study of the atomic nucleus and its components, for they were the only source of high-energy particles. Short-lived subatomic particles were discovered through cosmic ray collisions. The field of particle physics was in fact established as a result of such discoveries, beginning with those of the positron and the muon . Even with the advent of powerful (multi-GeV) particle accelerators in the 1950s, investigators in the field have continued to study cosmic rays, albeit on a more-limited scale, because they contain particles with energies far beyond those attainable under laboratory conditions. Astroparticle physics is a vibrant research field.",
  " Michael W. Friedlander , A Thin Cosmic Rain: Particles from Outer Space (2000), is a book on cosmic rays for the general reader. At a distinctly higher level, for college or graduate students, are Thomas K. Gaisser , Cosmic Rays and Particle Physics (1991); Peter K.F. Grieder , Cosmic Rays at Earth: Researcher’s Reference Manual and Data Book (2001); and Malcolm S. Longair , High Energy Astrophysics , 3rd ed. (2011)."
]