[
  " creativity , the ability to make or otherwise bring into existence something new, whether a new solution to a problem, a new method or device, or a new artistic object or form.",
  "  A number of personality characteristics have been shown to be associated with creative productivity. One of these is autonomy: creative individuals tend to be independent and nonconformist in their thoughts and actions. Equally important is mastery of a particular domain—that is, a sphere of activity or knowledge that requires a high level of ability. For example, in applying their knowledge of computers to the design of the Apple II, inventors Steve Jobs and Steve Wozniak revolutionized the computer industry by appealing to individuals as well as businesses. French fashion designer Coco Chanel forever changed the way women dressed by designing simple yet stylish clothes. On the other hand, creative people may not have equally strong gifts across the spectrum of human ability. (A notable exception was Leonardo da Vinci , whose achievements in the visual arts, mechanics, and engineering disclosed the talents of a creative polymath.) Some creative people show an interest in apparent disorder, contradiction, and imbalance—perhaps because they are challenged by asymmetry and chaos. Creative individuals may also exhibit a high degree of self-assurance. Some possess an exceptionally deep, broad, and flexible awareness of themselves. Others are shown to be intellectual leaders with a great sensitivity to problems.",
  "The unconventionality of thought that is sometimes found in creative persons may be in part a resistance to acculturation , which may be seen as demanding surrender of one’s unique fundamental nature. In fact, independence is critical to the creative process, in that creative people must often be able to work alone and must also be willing to express ideas or develop products that others might perceive as radical. It should be pointed out, however, that a nonconformist lifestyle is not essential to creativity; indeed, many creative individuals lead quite ordinary lives, expressing their autonomy mainly in their unconventional ideas and work. Another trait common among creative people is that of introversion. While this does not imply a lack of social skills, it suggests that creative people tend to be reflective and inner-directed; they look to their own intuition rather than depending upon interaction with others to inform their attitudes and responses.",
  "A third crucial characteristic combines curiosity and problem seeking. Creative individuals seem to have a need to seek novelty and an ability to pose unique questions. In Defying the Crowd (1995), for example, the American psychologists Robert Sternberg and Todd Lubart likened the combined traits of autonomy and problem solving to buying low and selling high in the “marketplace of ideas.” By this they meant that the creative individual identifies a unique need—perhaps a problem or opportunity that no one else recognizes. This is the “buying low” phase, because it typically involves dismissing a popular solution and embracing an unheard-of solution or an idea that has no currency. When creative persons find a better solution, they then work toward “selling” others on the concept. This process can be seen in the work of inventors such as Margaret Knight , who designed a number of household and industrial devices, Raymond Kurzweil , who designed text scanners and speech-recognition software, and Dean Kamen , whose numerous inventions include medical devices, water-purification systems, and the IBOT, a motorized wheelchair.",
  "High intelligence is common in creative persons, yet while they can meet the problems of life as rationally as anyone else can, their intellect does not rule at the expense of intuition or other seemingly nonrational influences. Most studies of the relationship of creativity to intelligence have also shown that extreme general intelligence does not necessarily kindle creativity. Findings such as these contributed to the “threshold” model of intelligence and creativity, which claims that, above a certain level, intelligence has little correlation with creativity—i.e., a highly intelligent person may not be as highly creative. It may be that intelligence sets the limits on the amount of information a person can learn and retain, while creative thinking provides the flexibility necessary for the original production of ideas. A distinction is sometimes made between convergent thinking (the analytic reasoning measured by intelligence tests) and divergent thinking (exemplified by a richness of ideas and originality of thought). Both seem necessary to creative performance, although the degree of each varies according to the task or occupation (i.e., a mathematician may exhibit more convergent than divergent thinking, while an artist would exhibit the reverse).",
  "Psychological experiments in the fields of motivation and learning have demonstrated the power of novelty as an inducement to action. This stems from the tension that exists between the regularity of daily life and interruptions that bring possibilities of new experience. Psychological studies of highly creative people have characterized this tension in terms of such dualities as intellect and intuition , the conscious and the unconscious , mental health and mental disorder , the conventional and the unconventional, and complexity and simplicity.",
  "Other qualities of creative individuals were identified by the American educational psychologist E. Paul Torrance. They include fluency, or the ability to think of many ideas rapidly; flexibility, the capacity to use ideas and tools in unusual ways; and originality, the capacity to think of novel ideas and products. In 1966 Torrance and his colleagues developed a means of assessment, the Torrance Test of Creative Thinking (TTCT), that accounts for all of these skills. The TTCT became one of the most widely used measures of creativity. Torrance provided additional support for his approach in follow-up studies of his subjects after 7, 12, and 22 years, and the passage of time has shown the TTCT to be among the more valid of all creativity tests.",
  "In the late 20th century the Hungarian-born American psychologist Mihalyi Csikszentmihalyi studied more than 90 men and women who possessed the following characteristics: (1) they produced works that were publicly recognized as creative, and (2) they influenced or affected their culture in some important way. Contrary to earlier theories that creative people emerged from conflicted families, Csikszentmihalyi’s findings, published as Creativity: Flow and the Psychology of Discovery and Invention (1996), showed that these individuals had, for the most part, experienced normal childhoods and grown up in families that provided them with a solid set of values. One difference between them and most other people, however, was that a number of them had suffered a parental loss—particularly the loss of a father. In such cases, most were influenced and inspired by other supportive adults.",
  "  Csikszentmihalyi’s research also identified creative individuals who were quite negative about their elementary and secondary school experiences. For them, the more crucial learning occurred elsewhere, either in college or through advanced training that linked them with mentors and significant teachers. Such was the case for Albert Einstein , whose early passion for mathematics and science was fostered by two uncles, despite his poor grades in his early school years. Csikszentmihalyi’s study showed that many creative people had followed circuitous paths to their careers. What was most striking, however, was the way they seized upon whatever opportunities or challenges had come to them. In general, they shaped circumstances to meet their own ends and showed little evidence of being constrained by events they could not control. It appeared that the excitement and satisfaction of pursuing their goals motivated these individuals to surmount barriers and persist through difficulties.",
  "Csikszentmihalyi’s work culminated in his definition of a distinctive characteristic of creative people: the capacity to experience “flow,” which he defined as the timeless and total involvement of individuals in the activity with which they are engaged. Persons experiencing a flow have a sense that their abilities are only just equal to the challenges at hand, and they become caught up in the creative process in order to achieve their goal. Notably, Csikszentmihalyi adduced the possibility that some creative people pursue flow as a form of escapism, insofar as immersion in the creative process provides them with feelings of comfort or control. The concept of flow can also be likened to what psychological researchers have identified as “intrinsic motivation”—that is, a motivation arising from intense autonomous interest in the work at hand. This is complemented by “extrinsic motivation,” which stems from a desire to fulfill goals that have been established by another person or organization.",
  "Although understanding creativity requires studying the qualities of creative individuals, these qualities represent only one part of the process of thinking, acting, and producing creatively. Equally important is the manner by which an idea or product gains public recognition and adoption. Innovations and new ideas have at times been rejected because of the prevailing attitudes of an era, a culture, or a field of practice. Similarly, many societies have adopted creative solutions to problems while failing to recognize their inventors, especially when these are women or members of minority groups. A “systems” approach to creativity—one that considers the relationship between the creative individual and the larger world—has therefore emerged as a useful way of thinking about the phenomenon of creativity.",
  "Creative individuals do not exist in a vacuum. Csikszentmihalyi went beyond the individual experience of flow to discuss the creative person’s relationship to the world. In the process he formulated a view of creativity as a system comprising (1) the creative individual, (2) the domain (the class of knowledge or activity that makes up a culture or any area of specialization, such as figure skating, chess, or singing), and (3) the particular field of practice.",
  "The primary component, the individual, is the creative person and the talents, life experiences, and aspirations that person possesses. Rather than being seen as purely autonomous, the creative individual is understood to interact with the sociocultural environment. Indeed, a central assumption of the systems view is that the individual and the environment are in constant interaction.",
  "Mastery of most domains requires a considerable investment in education, training, apprenticeship, and practice. The time and resources required to master a single domain, however, preclude most people from excelling in many other areas. An individual may therefore possess creative thinking abilities and exhibit a creative personality but fail to produce works that are valued and influential because he has not developed any specializations.",
  "The third component, the field, is represented by what scholars call the gatekeepers and opinion leaders. These individuals determine not only who will receive training and mentoring in the domain but also which ideas will be recognized and rewarded. Ideas and products deemed worthy by the field are incorporated into the domain, and only then is the originator considered creative. In some cases the field can be defined as the world at large as it adopts the product of the creative process—be it an idea, a product, or a solution to a problem.",
  "Many psychologists view creativity as a process of steps taken toward solving problems or inventing new products creatively. The American psychologist Mark Runco holds that the creative process consists of six essential stages, or phases. In the first stage, “orientation” (a time of intense interest and curiosity), the creative individual gathers information. The second stage, “incubation,” consists of defining the problem and seeking a solution and involves processing large amounts of information; this can occur at a conscious or an unconscious level. “Illumination,” the third stage, is marked by divergent thinking, openness, and excitement. In the fourth stage, “verification,” the individual evaluates his own work and compares it with what is known in the field. Next, in the “communication” stage, the individual submits his work to the field, making it available to experts who will judge its quality and usefulness. “Validation” occurs in the sixth stage, in which the work becomes available to society and is consequently supported or rejected.",
  "This phase model supports the systems view of the creative process by emphasizing the social validation that occurs if a work is supported. In this way, the mental processes of the creative individual, the requirements of the domain, and recognition by the field (or society) have combined to produce the phenomenon known as creativity—and it demonstrates how this unpredictable component of human behaviour contributes to human advancement."
]