[
  " crop rotation , the successive cultivation of different crops in a specified order on the same fields, in contrast to a one-crop system or to haphazard crop successions.",
  "Throughout human history, wherever food crops have been produced, some kind of rotation cropping appears to have been practiced. One system in central Africa employs a 36-year rotation; a single crop of finger millet is produced after a 35-year growth of woody shrubs and trees has been cut and burned. In the major food-producing regions of the world, various rotations of much shorter length are widely used. Some of them are designed for the highest immediate returns, without much regard for the continuing usefulness of the basic resources. Others are planned for high continuing returns with protected resources. The underlying principles for planning effective cropping systems began to emerge in the middle years of the 19th century.",
  "Early experiments, such as those at the Rothamsted experimental station in England in the mid-19th century, pointed to the usefulness of selecting rotation crops from three classifications: cultivated row, close-growing grains, and sod-forming, or rest, crops. Such a classification provides a ratio basis for balancing crops in the interest of continuing soil protection and production economy. It is sufficiently flexible for adjusting crops to many situations, for making changes when needed, and for including go-between crops as cover and green manures.",
  "A simple rotation would be one crop from each group with a 1:1:1 ratio. The first number in a rotation ratio refers to cultivated row crops, the second to close-growing grains, and the third to sod-forming, or rest, crops. Such a ratio signifies the need for three fields and three years to produce each crop annually. This requirement would be satisfied with a rotation of corn, oats, and clover or of potatoes, wheat, and clover-timothy. Rotations for any number of fields and crop relationships can be described in this manner. In general, most rotations are confined to time limits of eight years or less.",
  "The acreage devoted to sod-forming, or rest, crops should be expanded at the expense of row crops on soils of increasing slopes and declining fertility. This will provide better vegetative covering to protect sloping land from excessive erosion and supply organic matter for improving soil productivity on both sloping and level lands. With lessening slope and increasing fertility, the row crops may be expanded, but this should not be done with too much reduction in the sod-forming crops. The differing effects of crops on soils and on each other and in reactions to insect pests, diseases, and weeds require carefully planned sequences.",
  "Broadly speaking, cropping systems should be planned around the use of deep-rooting legumes. If too little use is made of them, productivity will decline; if too much land is devoted to them, wastes may occur and other useful crops will be displaced. Rotations depending wholly on green-manure legumes should be confined to the more level and fertile lands. It is desirable to include legumes alone or in mixtures with nonlegume sod-forming crops as a regular crop in many field rotations. In general, this should occur about once in each four-year period. Short rotations are not likely to provide the best crop balances, and long rotations on a larger number of fields may introduce complications. With a moderate number of fields, additional flexibility can be provided by split cropping on some fields.",
  "The usefulness of individual field crops is affected by regional differences in climate and soil. A major crop in one region may have little or no value in another. In each region, however, there are usually row, grain, and sod, or rest, crops that can be brought together into effective cropping systems.",
  "In addition to the many beneficial effects on soils and crops, well-planned crop rotations also provide the business aspects of farming with advantages. Labour, power, and equipment can be handled with more efficiency; weather and market risks can be reduced; livestock requirements can be met more easily; and the farm can be a more effective year-round enterprise.",
  " See also  Norfolk four-course system ; two-field system ; three-field system ."
]