[
  " z z G  s   s   damping , in physics, restraining of vibratory motion, such as mechanical oscillations, noise, and alternating electric currents , by dissipation of energy. Unless a child keeps pumping a swing, its motion dies down because of damping. Shock absorbers in automobiles and carpet pads are examples of damping devices.",
  "A system may be so damped that it cannot vibrate. Critical damping just prevents vibration or is just sufficient to allow the object to return to its rest position in the shortest period of time. The automobile shock absorber is an example of a critically damped device. Additional damping causes the system to be overdamped, which may be desirable, as in some door closers. The vibrations of an underdamped system gradually taper off to zero.",
  "There are many types of mechanical damping. Friction , also called in this context dry, or Coulomb, damping, arises chiefly from the electrostatic forces of attraction between the sliding surfaces and converts mechanical energy of motion, or kinetic energy , into heat .",
  "Viscous damping is caused by such energy losses as occur in liquid lubrication between moving parts or in a fluid forced through a small opening by a piston , as in automobile shock absorbers. The viscous-damping force is directly proportional to the relative velocity between the two ends of the damping device.",
  "The motion of a vibrating body is also checked by its friction with the gas or liquid through which it moves. The damping force of the fluid in this case is directly proportional to a quantity slightly less than the square of the body’s velocity and, hence, is referred to as velocity-squared damping.",
  "Besides these external kinds of damping, there is energy loss within the moving structure itself that is called hysteresis damping or, sometimes, structural damping. In hysteresis damping, some of the energy involved in the repetitive internal deformation and restoration to original shape is dissipated in the form of random vibrations of the crystal lattice in solids and random kinetic energy of the molecules in a fluid.",
  "There are other types of damping. Resonant electric circuits , in which an alternating current is surging back and forth, as in a radio or television receiver, are damped by electric resistance . The signal to which the receiver is tuned supplies energy synchronously to maintain resonance .",
  "In radiation damping, vibrating energy of moving charges, such as electrons, is converted to electromagnetic energy and is emitted in the form of radio waves or infrared or visible light .",
  "In magnetic damping, energy of motion is converted to heat by way of electric eddy currents induced in either a coil or an aluminum plate (attached to the oscillating object) that passes between the poles of a magnet ."
]