[
  "  Delta , series of American launch vehicles , originally based on the Thor intermediate-range ballistic missile , that have been in service since the early 1960s. The Delta launch vehicles have been built by the McDonnell Douglas Corporation and, since 1997, by the Boeing Company .",
  "    The first version, Thor-Delta, was capable of placing a 220-kg (480-pound) payload into a 480-km (300-mile) orbit . In the early 1960s Thor-Delta and its successors Delta A, Delta B, and Delta C launched TIROS weather satellites, Explorer scientific satellites, the Echo 1 passive communications satellite , and the Telstar , Relay, and Syncom communications satellites. On August 19, 1964, an improved Delta, Delta D, with a more powerful first stage and capable of placing 450 kg (990 pounds) into an 800-km (500-mile) orbit launched Syncom 3, the first satellite to be put into geostationary orbit . The three stages of the subsequent Delta E (or the Thrust Augmented Improved Delta) were more powerful than those of Delta D. The Delta G was a Delta E specially modified for the Biosatellite program, in which biological specimens were twice launched into orbit and returned to Earth , in 1966 and 1967. Several Long Tank Deltas—L, M, and N—were also built in the 1960s; an advanced version had an inertial guidance system and could be flown with either two or three stages. The two-stage version was capable of placing a 1,630-kg (3,600-pound) payload into a 370-km (230-mile) orbit.",
  "In 1972 McDonnell Douglas began naming the series according to a four-digit numbering system in which the digits stood for the type of first stage, the number of solid propellant strap-on rockets , the type of second stage, and the type of third stage, respectively. From 1972 to 1974 Delta launches were of the 0000 and 1000 series, and from 1974 to 1988 they were of the 2000 and 3000 series.",
  "  In 1982 McDonnell Douglas stopped producing the Delta, on the assumption that the space shuttle was to be the launch vehicle for most future American satellites. However, after the  Challenger disaster in 1986, the United States Air Force contracted the company to build 20 new rockets of the 6000 series, called Delta II. (Later rockets in the 7000 series were also called Delta II.) The first Delta II launch occurred on February 14, 1989, and placed a Global Positioning System satellite in orbit. The Delta II is used to launch small to medium payloads (2,170 kg [4,790 pounds] to geostationary orbit) and has launched such spacecraft as Near Earth Asteroid Rendezvous and the Mars Exploration Rovers .",
  "The Delta III, an 8000-series rocket, was designed in the late 1990s to lift much heavier payloads (3,810 kg [8,390 pounds] to geostationary orbit) than the Delta II. Delta III had an extremely powerful second stage and more powerful strap-on boosters. However, the Delta III made only three flights, and only one was successful.",
  "  The Delta IV, which entered service in 2002, has little in common with its predecessors. The Delta IV uses the first new rocket engine developed in the United States since the 1970s space shuttle main engine; the Delta IV’s RS-68 engine burns cryogenic propellant (liquefied gas kept at very low temperatures). The Delta IV has five configurations—one Medium, three Medium+, and one Heavy—depending on the weight and type of payload to be launched. The three Medium+ configurations use solid rocket motors (which are not used in the Medium configuration) attached to the vehicle’s core first stage; the Delta IV Heavy model, used to launch large spacecraft, consists of three core stages strapped together. The Delta IV Heavy vehicle can launch payloads weighing more than 13,000 kg (29,000 pounds) to geostationary orbit and can lift more than 23,000 kg (51,000 pounds) to low Earth orbit. The Delta IV has launched weather satellites in the Geostationary Operational Environmental Satellite (GOES) series and spy satellites for the National Reconnaissance Office."
]