[
  " deontological ethics , in philosophy , ethical theories that place special emphasis on the relationship between duty and the morality of human actions. The term deontology is derived from the Greek deon , “duty,” and logos , “science.”",
  "In deontological ethics an action is considered morally good because of some characteristic of the action itself, not because the product of the action is good. Deontological ethics holds that at least some acts are morally obligatory regardless of their consequences for human welfare. Descriptive of such ethics are such expressions as “Duty for duty’s sake,” “Virtue is its own reward,” and “Let justice be done though the heavens fall.”",
  "By contrast, teleological ethics (also called consequentialist ethics or consequentialism ) holds that the basic standard of morality is precisely the value of what an action brings into being. Deontological theories have been termed formalistic, because their central principle lies in the conformity of an action to some rule or law.",
  "The first great philosopher to define deontological principles was Immanuel Kant , the 18th-century German founder of critical philosophy ( see  Kantianism ). Kant held that nothing is good without qualification except a good will, and a good will is one that wills to act in accord with the moral law and out of respect for that law rather than out of natural inclinations. He saw the moral law as a categorical imperative —i.e., an unconditional command—and believed that its content could be established by human reason alone. Thus, the supreme categorical imperative is: “Act only on that maxim through which you can at the same time will that it should become a universal law.” Kant considered that formulation of the categorical imperative to be equivalent to: “So act that you treat humanity in your own person and in the person of everyone else always at the same time as an end and never merely as means.” The connection between those two formulations, however, has never been entirely clear. In any event, Kant’s critics questioned his view that all duties can be derived from a purely formal principle and argued that, in his preoccupation with rational consistency, he neglected the concrete content of moral obligation.",
  "That objection was faced in the 20th century by the British moral philosopher Sir David Ross , who held that numerous “prima facie duties,” rather than a single formal principle for deriving them, are themselves immediately self-evident. Ross distinguished those prima facie duties (such as promise keeping, reparation, gratitude, and justice) from actual duties, for “any possible act has many sides to it which are relevant to its rightness or wrongness”; and those facets have to be weighed before “forming a judgment on the totality of its nature” as an actual obligation in the given circumstances. Ross’s attempt to argue that intuition is a source of moral knowledge was, however, heavily criticized, and by the end of the 20th century, Kantian ways of thinking—especially the prohibition on using a person as a means rather than an end—were again providing the basis for the deontological views that were most widely discussed among philosophers. At a popular level, the international emphasis on protecting human rights —and thus on the duty not to violate them—can also be seen as a triumph of deontological ethics."
]