[
  " development , in biology, the progressive changes in size, shape, and function during the life of an organism by which its genetic potentials (genotype) are translated into functioning adult systems (phenotype).",
  "A brief treatment of biological development follows. For full treatment, see  biological development .",
  "The simplest form of development is a change (usually an increase) in size of an organ system or structure; simple growth, however, seldom occurs without accompanying chemical or functional changes. In general, biological development consists of an increase in both size and complexity of the entire organism and of its component organs, but under some circumstances, as when an early motile stage metamorphoses into a sessile or parasitic adult, loss or reduction of certain structures may occur. Development may be divided into morphogenesis, the process by which organ systems become structurally distinct, and differentiation, the process by which cells and tissues adopt specific and unique biological functions. In most cases the two processes concur, because a specific structure may be required to fulfill a necessary physiological function. In both plants and animals, these processes may occur at different rates in different organ systems; the human brain, for example, may reach its full adult size and complexity before the reproductive system has even begun its adult development.",
  "Animal and plant development follow very different paths. Plants in general employ a type of multiphasic development, in which two distinct forms succeed each other in alternating generations; one form, created by the union of sexual cells (gametes), contains two sets of similar chromosomes (diploid). At sexual maturity, this form, called the sporophyte, produces an offspring (gametophyte) with cells containing only one set of genetic instructions (haploid). At their sexual maturity, gametophytes produce haploid gametes that unite to begin a new cycle.",
  "Animal cells also go through a haploid phase, but the reduction of chromosomes occurs only within the sex organs of the diploid parents; gametes from the two parents immediately reunite to form a diploid embryo, without an intervening haploid generation. The male sperm fertilizes a female ovum to form the zygote, which immediately begins to divide into many smaller cells (cleavage). The embryos of animals that lay their eggs on land, such as reptiles and birds, are nourished by a yolk throughout development. Lower vertebrates that lay their eggs in water have smaller yolks and hatch less-developed offspring, which draw their nutrients directly from their environment. Most mammals have very small eggs that attach to the mother’s uterus and that develop a placenta, by which nutrients are transmitted from mother to child.",
  "After several divisions, the animal embryo forms a hollow ball called a blastula, which differentiates into three types of cells (ectoderm, mesoderm, and endoderm). In gastrulation, these cells migrate into their proper positions: ectoderm, from which develop the skin, sense organs, and nervous system, on the outside; endoderm, from which develop the digestive tract, urinary system, and lungs, on the inside; and mesoderm, from which develop muscles, skeleton, and connective tissues, between the two.",
  "Gastrulation is followed by organogenesis, during which process the various organ systems of the adult first begin to take primitive shape. A fold on the embryo’s surface closes off into a tube that further subdivides by constriction and dilation of the cell mass, as in the nervous system. A pocket in the tissue’s surface gradually lengthens and branches, as in the vertebrate lung, and local thickenings develop from primordial tissues, as in the development of the musculoskeletal system of vertebrates.",
  "Development in many organisms is not completed at birth. Many invertebrates (including insects) and lower vertebrates hatch as distinctly different forms, called larvae, which feed and grow until they have sufficient mass to sustain life as adults. Then, structures with functional importance to the larva but not to the adult ( e.g., a tadpole’s tail) disintegrate, while new structures ( e.g., a frog’s legs) are created from embryonic tissues that remained quiescent during the larval stage. This transformation is called metamorphosis.",
  "Other vertebrates, such as the mammals, are born as essentially miniature adults requiring minor further development. The sex organs are incomplete at birth, and their maturation constitutes the transition to adulthood. In humans, for example, much of the postnatal development occurs during puberty, when secondary sexual characteristics such as pubic and facial hair appear, female breasts develop, and mature sex cells are produced by the male testes and female ovaries.",
  "All plants develop through two distinct generational forms, although in some, as in the algae, the physical appearance of succeeding generations is identical, while in others, as in the flowering plants, one of the forms (usually the haploid gametophyte) goes through its entire life cycle within the body of the parent. Among higher plants, the male gametophyte may consist of as few as three cells, which form a pollen grain that is carried by the wind, water, or animals to the female gametophyte within the female flower. The male then grows through the tissues surrounding the female reproductive cell to fertilize it, again forming a zygote. As in the animal, the zygote divides into smaller cells, which quickly become differentiated; after only three cell divisions, the cells’ eventual development into seed leaves (cotyledons), shoot, root, and hypocotyl (the part of the shoot between the cotyledons and the root) has already been determined. Development continues until a tiny plant, or seedling, is formed; at this point, further development may be arrested in the higher plants until germination, which usually occurs after the seed has been dispersed and encounters environmental conditions propitious for growth.",
  "At germination, the seedling first grows larger simply by absorbing water from its environment, but it soon begins active growth through the division of cells at growth zones (meristems) at the tip of the root and shoot. Each cell division in the meristem produces one dividing cell to continue growth and a vegetative cell that helps extend the plant behind the growing tip. Smaller clusters of meristemic cells at intervals along the stem produce leaves, the shape of which is determined by the rate of growth of different cells within the meristem. Branches of the original meristem produce secondary roots underground and lateral branches from the shoot.",
  "Within the plant, vegetative cells produced by the meristem form long chains behind it. In some of these chains, a stiff compound called lignin is deposited, cutting off diffusion across the cell wall and killing the cell; the empty cell walls form long tubes, called xylem, through which water flows. Other molecules, cutin and suberin, are deposited in the walls of cells on the outer surface of the stem, creating the cork and phloem, which carries nutrients and other substances through the plant. New vascular cells are produced by a layer of reproductive tissue, the cambium, between the layers of vascular tissue. The entire growth process is controlled by plant hormones called gibberellins."
]