[
  "  apoptosis , also called programmed cell death , in biology, a mechanism that allows cells to self-destruct when stimulated by the appropriate trigger. Apoptosis can be triggered by mild cellular injury and by various factors internal or external to the cell; the damaged cells are then disposed of in an orderly fashion. As a morphologically distinct form of programmed cell death, apoptosis is different from the other major process of cell death known as necrosis . Apoptosis involves condensation of the nucleus and cytoplasm , followed by cellular partitioning into well-defined fragments for disposal. In multicellular organisms, cell number normally results from the rate of cell production minus the rate of apoptosis.",
  "In the early 1840s, a biological use for the mechanism of planned apoptosis became apparent when scientists realized that the development from fertilized egg to adult is not a linear process. In many instances, initial structures, such as the tadpole’s tail, are superseded by entirely distinct adult systems, such as the frog’s legs. In the 20th century the medical significance of cell death was recognized by Australian researcher John Foxton R. Kerr and Scottish scientists Andrew H. Wyllie and Alastair Currie. In a paper published in 1972, they used the term apoptosis (from the Greek word meaning “falling off,” as leaves do in autumn) to describe the occurrence of apoptotic cells in human tissues.",
  "The discovery of the developmental lineage and death of each cell in the nematode  Caenorhabditis elegans confirmed the role of programmed cell death in development. South African-born biologist Sydney Brenner , American biologist H. Robert Horvitz , and British biologist John E. Sulston shared the Nobel Prize in Physiology or Medicine in 2002 for this work.",
  "In adult animals apoptosis is used to remove cells that have become a threat to survival. Such cells can include cancer cells or cells that are infected with bacteria or a virus . Apoptosis also removes cells that are normal but no longer needed, such as cells that produce antibodies after the need for the antibody has passed. Apoptosis can also be triggered in otherwise normal cells by external stimuli, including nutrient removal, toxins , hormones , heat, and radiation . It is estimated that a mass of cells equal to body weight is removed by apoptosis each year. Given this range of critical situations in which apoptosis occurs or is required, the possibility for therapeutic intervention is extraordinary. This realization has generated a massive research effort focused on apoptosis.",
  "Apoptosis occurs on a cell-by-cell basis. For each affected cell, two primary phases are observed: one of initiation and a second of execution. The resulting cell remnants are processed for reuse. Both phases are complex and require exquisite organization of multiple cellular systems, including interactions between proteins and cellular membranes. The initiation phase, or “death decision,” became of significant interest following the description of a group of proteins in mammals known as the BCL-2 protein family. This protein family, which provides the framework for controlling apoptosis, takes its name from a type of cancer called B-cell lymphoma . BCL-2, the first family member, forms the molecular basis for sustaining the lymphoma cancer cells. The BCL-2 family of proteins has at least 25 members. Most of these are known as BH-3-only proteins. BH-3-only proteins function as activators or sensitizers of apoptosis and monitor important cell processes for dysfunction. They also control the function of two death-initiating, or pro-apoptotic, proteins (Bax and Bak) and a large number of death-preventing, or anti-apoptotic, proteins, which include BCL-XL and BCL-2. In mammals this control occurs primarily on the membranes of mitochondria , where the mortality decision for each cell is constantly reviewed under the supervision of the three contesting factions of the BCL-2 protein family.",
  "A second family of proteins, the caspase proteolytic enzymes , contributes to both regulation by the BCL-2 family and execution of apoptosis after the death decision is confirmed. Caspases function in large part by the activation of other enzymes that dismantle the cellular cytoskeleton and cellular organelles and that degrade the nuclear DNA (deoxyribonucleic acid), from which there is no possibility of recovery. The cellular destruction occurs in place ( in situ ), and the cellular membrane system is reorganized to package the degraded components, including the digested genetic material, in membrane compartments. This packaging system prevents the materials from being released generally within tissues. Macrophages and other scavenger cells then engulf the membrane packets and process them for reuse as the most basic cellular components. In some instances, neighbouring cells may also engulf the degraded components.",
  "Employing the intrinsic pathway, cancer cells, cells that are infected with bacteria or virus particles, and mutant cells can be assigned to apoptosis. The extrinsic pathway is commonly associated with cellular death receptors.",
  "Manipulating apoptosis is one avenue through which scientists can address a number of vexing medical problems. Cancer requires the suppression of apoptosis to allow survival of the abnormal tumour cells. Restoring effective surveillance of abnormal cells can contribute dramatically to cancer eradication. Likewise, enhanced targeting of infected cells for apoptotic destruction mimics the physiological role of apoptosis in resolving infection by disposing of the infected cells.",
  "Inhibition of apoptosis has the potential to dramatically limit the damage resulting from episodes of ischemia in cardiac and neural tissue (ischemia is a reduction in blood flow to affected tissues). In addition, the selective control of apoptosis in the immune system can dramatically improve therapy for diseases from diabetes mellitus to HIV/ AIDS . These opportunities and a basic curiosity about how cells regulate their own mortality sustain an extensive research effort centring around the mechanisms controlling and executing apoptosis.",
  "Overviews of programmed cell death and its study include Christopher Potten and James Wilson , Apoptosis: The Life and Death of Cells (2004); and Richard A. Lockshin and Zahra Zakeri (eds.), When Cells Die II: A Comprehensive Evaluation of Apoptosis and Programmed Cell Death , 2nd ed. (2004). Detailed information on the regulation and process of apoptosis is provided in Michael Jacobson and Nicola McCarthy (eds.), Apoptosis (2002)."
]