[
  " dispensation , also called Economy , in Christian ecclesiastical law, the action of a competent authority in granting relief from the strict application of a law. It may be anticipatory or retrospective.",
  "Economy is the term that is normally employed in the Eastern Orthodox churches for this type of action. The church strives for the salvation of souls, and, when this is more likely to be achieved by a relaxation of a rule rather than by a strict adherence to it, economy permits the relaxation. With typical Orthodox elasticity, no canon defines the limits or use of economy, although certain broad principles are discernible. Thus, to run counter to fundamental dogma is permissible when this is conducive to the greater good of the church and the salvation of souls. Lack of precision is also found with regard to the persons who may exercise economy. All bishops exercise it in their own right and not by delegation; but they should have regard to the views of episcopal synods, which themselves exercise economy, although only after consultation with the bishop of the district within which it is to be exercised. Above both the bishop and the synod is the general council, which has the authority to exercise economy of its own and can reverse the decisions of synods and bishops. Below the bishop is the priest, who exercises economy in day-to-day matters but whose authority is delegated to him by the bishop.",
  "The Western Christian churches have evolved rules with regard to dispensation with far greater precision and, in the Roman Catholic church, in some detail. At first, it was held that only the common good of the church as a whole justified the granting of a dispensation and that only the person or body that made the laws, whether pope, synod, or bishop, could dispense from them. With the development of canon law and the growth of the power of the papacy, however, it came to be accepted that the ultimate dispensing power resided in the pope, though it could be delegated by him to subordinate persons and bodies. The field over which dispensation could operate was significantly widened, for, whereas formerly the divine law and the natural law were outside the scope of the dispensing power, the view was gradually reached that the jurisdiction of the pope, while unable to abrogate the divine or the natural law, could nevertheless dispense from the obligations imposed by them and from their effects in particular cases, though only where the ultimate object of such laws was not thereby thwarted.",
  "Gradually, dispensations were granted solely for the benefit of individuals, regardless of whether or not the whole church could be said to benefit thereby, and the belief that such dispensations were granted too frequently and for financial gain was a factor contributing to the movement that led to the Protestant Reformation. The Council of Trent (1545–63) tried to guard against abuses but left intact the papal authority, and the Roman Catholic system of dispensation today is essentially the same as that which had developed by the end of the Middle Ages. While the authority that has the power to legislate may dispense from its own legislation, so also may its superior; and the subordinate authority’s power may be limited by superior authority. The ultimate authority resides in the pope.",
  "In England, the Reformation, which was inspired in part by the pope’s refusal to grant Henry VIII an annulment of an earlier dispensation that enabled his marriage to Catherine of Aragon, put an end to the papal authority in this and all other spheres of its previous jurisdiction. The need for a dispensing authority was, however, recognized, and a statute in 1534 preserved the bishops’ dispensational powers and conferred upon the archbishop of Canterbury the power of dispensing formerly exercised by the pope, subject in the more important cases to royal confirmation. These provisions, however, have remained largely a dead letter, with the consequent lack of any ordered, practical system of dispensation in the Church of England. The same holds true for the various Protestant churches, none of which has as elaborate a system of laws as the Roman Catholic Church."
]