[
  " electric current , any movement of electric charge carriers, such as subatomic charged particles (e.g., electrons having negative charge, protons having positive charge), ions ( atoms that have lost or gained one or more electrons), or holes (electron deficiencies that may be thought of as positive particles).",
  "Electric current in a wire, where the charge carriers are electrons, is a measure of the quantity of charge passing any point of the wire per unit of time. In alternating current the motion of the electric charges is periodically reversed; in direct current it is not. In many contexts the direction of the current in electric circuits is taken as the direction of positive charge flow, the direction opposite to the actual electron drift. When so defined the current is called conventional current.",
  "  Current is usually denoted by the symbol I . Ohm’s law relates the current flowing through a conductor to the voltage V and resistance  R ; that is, V = I  R . An alternative statement of Ohm’s law is I = V / R .",
  "Current in gases and liquids generally consists of a flow of positive ions in one direction together with a flow of negative ions in the opposite direction. To treat the overall effect of the current, its direction is usually taken to be that of the positive charge carrier. A current of negative charge moving in the opposite direction is equivalent to a positive charge of the same magnitude moving in the conventional direction and must be included as a contribution to the total current. Current in semiconductors consists of the motion of holes in the conventional direction and electrons in the opposite direction.",
  "Currents of many other kinds exist, such as beams of protons, positrons , or charged pions and muons in particle accelerators .",
  " i  Electric current generates an accompanying magnetic field , as in electromagnets . When an electric current flows in an external magnetic field, it experiences a magnetic force , as in electric motors . The heat loss, or energy dissipated, by electric current in a conductor is proportional to the square of the current.",
  "A common unit of electric current is the ampere , which is defined as a flow of one coulomb of charge per second, or 6.2 × 10 18 electrons per second. The centimetre–gram–second units of current is the electrostatic unit of charge (esu) per second. One ampere equals 3 × 10 9 esu per second.",
  "Commercial power lines make available about 100 amps to a typical home; a 60-watt lightbulb pulls about 0.5 amp of current and a one-room air conditioner about 15 amps. (For more on electric current, see  electricity: Direct electric current and electricity: Alternating electric currents .)"
]