[
  " conservation of energy , principle of physics according to which the energy of interacting bodies or particles in a closed system remains constant. The first kind of energy to be recognized was kinetic energy , or energy of motion. In certain particle collisions, called elastic, the sum of the kinetic energy of the particles before collision is equal to the sum of the kinetic energy of the particles after collision. The notion of energy was progressively widened to include other forms. The kinetic energy lost by a body slowing down as it travels upward against the force of gravity was regarded as being converted into potential energy , or stored energy, which in turn is converted back into kinetic energy as the body speeds up during its return to Earth . For example, when a pendulum swings upward, kinetic energy is converted to potential energy. When the pendulum stops briefly at the top of its swing, the kinetic energy is zero, and all the energy of the system is in potential energy. When the pendulum swings back down, the potential energy is converted back into kinetic energy. At all times, the sum of potential and kinetic energy is constant. Friction , however, slows down the most carefully constructed mechanisms, thereby dissipating their energy gradually. During the 1840s it was conclusively shown that the notion of energy could be extended to include the heat that friction generates. The truly conserved quantity is the sum of kinetic, potential, and thermal energy. For example, when a block slides down a slope, potential energy is converted into kinetic energy. When friction slows the block to a stop, the kinetic energy is converted into thermal energy. Energy is not created or destroyed but merely changes forms, going from potential to kinetic to thermal energy. This version of the conservation-of-energy principle, expressed in its most general form, is the first law of thermodynamics . The conception of energy continued to expand to include energy of an electric current , energy stored in an electric or a magnetic field , and energy in fuels and other chemicals. For example, a car moves when the chemical energy in its gasoline is converted into kinetic energy of motion.",
  "  With the advent of relativity physics (1905), mass was first recognized as equivalent to energy. The total energy of a system of high-speed particles includes not only their rest mass but also the very significant increase in their mass as a consequence of their high speed. After the discovery of relativity, the energy-conservation principle has alternatively been named the conservation of mass-energy or the conservation of total energy.",
  "When the principle seemed to fail, as it did when applied to the type of radioactivity called beta decay (spontaneous electron ejection from atomic nuclei ), physicists accepted the existence of a new subatomic particle , the neutrino , that was supposed to carry off the missing energy rather than reject the conservation principle. Later, the neutrino was experimentally detected.",
  "Energy conservation, however, is more than a general rule that persists in its validity. It can be shown to follow mathematically from the uniformity of time . If one moment of time were peculiarly different from any other moment, identical physical phenomena occurring at different moments would require different amounts of energy, so that energy would not be conserved."
]