[
  "  environmentalism , political and ethical movement that seeks to improve and protect the quality of the natural environment through changes to environmentally harmful human activities; through the adoption of forms of political, economic, and social organization that are thought to be necessary for, or at least conducive to, the benign treatment of the environment by humans; and through a reassessment of humanity ’s relationship with nature. In various ways, environmentalism claims that living things other than humans, and the natural environment as a whole, are deserving of consideration in reasoning about the morality of political, economic, and social policies.",
  "For additional discussion of ethical issues related to the natural environment, see  environmental ethics . For discussion of environmental statutes and regulations, including international conventions, see  environmental law .",
  "Environmental thought and the various branches of the environmental movement are often classified into two intellectual camps: those that are considered anthropocentric, or “human-centred,” in orientation and those considered biocentric, or “life-centred.” This division has been described in other terminology as “shallow” ecology versus “deep” ecology and as “technocentrism” versus “ecocentrism.” Anthropocentric approaches focus mainly on the negative effects that environmental degradation has on human beings and their interests, including their interests in health , recreation, and quality of life. It is often characterized by a mechanistic approach to nonhuman nature in which individual creatures and species have only an instrumental value for humans. The defining feature of anthropocentrism is that it considers the moral obligations humans have to the environment to derive from obligations that humans have to each other—and, less crucially, to future generations of humans—rather than from any obligation to other living things or to the environment as a whole. Human obligations to the environment are thus indirect.",
  "Critics of anthropocentrism have charged that it amounts to a form of human “ chauvinism .” They argue that anthropocentric approaches presuppose the historically Western view of nature as merely a resource to be managed or exploited for human purposes—a view that they claim is responsible for centuries of environmental destruction. In contrast to anthropocentrism, biocentrism claims that nature has an intrinsic moral worth that does not depend on its usefulness to human beings, and it is this intrinsic worth that gives rise directly to obligations to the environment. Humans are therefore morally bound to protect the environment, as well as individual creatures and species, for their own sake. In this sense, biocentrics view human beings and other elements of the natural environment, both living and often nonliving, as members of a single moral and ecological community.",
  "By the 1960s and ’70s, as scientific knowledge of the causes and consequences of environmental degradation was becoming more extensive and sophisticated, there was increasing concern among some scientists, intellectuals, and activists about Earth ’s ability to absorb the detritus of human economic activity and, indeed, to sustain human life. This concern contributed to the growth of grassroots environmental activism in a number of countries, the establishment of new environmental nongovernmental organizations, and the formation of environmental (“green”) political parties in a number of Western democracies . As political leaders gradually came to appreciate the seriousness of environmental problems, governments entered into negotiations in the early 1970s that led to the adoption of a growing number of international environmental agreements.",
  "The division between anthropocentric and biocentric approaches played a central role in the development of environmental thought in the late 20th century. Whereas some earlier schools, such as apocalyptic (survivalist) environmentalism and emancipatory environmentalism—as well as its offshoot, human-welfare ecology —were animated primarily by a concern for human well-being, later movements, including social ecology, deep ecology , the animal-rights and animal-liberation movements, and ecofeminism, were centrally concerned with the moral worth of nonhuman nature.",
  "The vision of the environmental movement of the 1960s and early ’70s was generally pessimistic, reflecting a pervasive sense of “civilization malaise” and a conviction that Earth’s long-term prospects were bleak. Works such as Rachel Carson ’s Silent Spring (1962), Garrett Hardin’s “The Tragedy of the Commons” (1968), Paul Ehrlich ’s The Population Bomb (1968), Donella H. Meadows’ The Limits to Growth (1972), and Edward Goldsmith’s Blueprint for Survival (1972) suggested that the planetary ecosystem was reaching the limits of what it could sustain. This so-called apocalyptic, or survivalist, literature encouraged reluctant calls from some environmentalists for increasing the powers of centralized governments over human activities deemed environmentally harmful, a viewpoint expressed most vividly in Robert Heilbroner’s An Inquiry into the Human Prospect (1974), which argued that human survival ultimately required the sacrifice of human freedom. Counterarguments, such as those presented in Julian Simon and Herman Kahn ’s The Resourceful Earth (1984), emphasized humanity’s ability to find or to invent substitutes for resources that were scarce and in danger of being exhausted.",
  "Beginning in the 1970s, many environmentalists attempted to develop strategies for limiting environmental degradation through recycling , the use of alternative energy technologies , the decentralization and democratization of economic and social planning, and, for some, a reorganization of major industrial sectors, including the agriculture and energy industries. In contrast to apocalyptic environmentalism, so-called “emancipatory” environmentalism took a more positive and practical approach, one aspect of which was the effort to promote an ecological consciousness and an ethic of “stewardship” of the environment. One form of emancipatory environmentalism, human-welfare ecology—which aims to enhance human life by creating a safe and clean environment—was part of a broader concern with distributive justice and reflected the tendency, later characterized as “postmaterialist,” of citizens in advanced industrial societies to place more importance on “quality-of-life” issues than on traditional economic concerns.",
  "Emancipatory environmentalism also was distinguished for some of its advocates by an emphasis on developing small-scale systems of economic production that would be more closely integrated with the natural processes of surrounding ecosystems. This more environmentally holistic approach to economic planning was promoted in work by the American ecologist Barry Commoner and by the German economist Ernst Friedrich Schumacher . In contrast to earlier thinkers who had downplayed the interconnectedness of natural systems, Commoner and Schumacher emphasized productive processes that worked with nature, not against it, encouraged the use of organic and renewable resources rather than synthetic products (e.g., plastics and chemical fertilizers ), and advocated renewable and small-scale energy resources (e.g., wind and solar power) and government policies that supported effective public transportation and energy efficiency .",
  "The emancipatory approach was evoked through the 1990s in the popular slogan, “Think globally, act locally.” Its small-scale, decentralized planning and production has been criticized, however, as unrealistic in highly urbanized and industrialized societies. ( See also  urban planning ; economic planning .)",
  "An emphasis on small-scale economic structures and the social dimensions of the ecological crisis also is a feature of the school of thought known as social ecology, whose major proponent was the American environmental anarchist Murray Bookchin. Social ecologists trace the causes of environmental degradation to the existence of unjust, hierarchical relationships in human society, which they see as endemic to the large-scale social structures of modern capitalist states. Accordingly, they argue, the most environmentally sympathetic form of political and social organization is one based on decentralized small-scale communities and systems of production.",
  "A more radical doctrine, known as deep ecology , builds on preservationist themes from the early environmental movement. Its main originators, the Norwegian philosopher Arne Næss, the American sociologist Bill Devall, and the American philosopher George Sessions, share with social ecologists a distrust of capitalism and industrial technology and favour decentralized forms of social organization. Deep ecologists also claim that humans need to regain a “spiritual” relationship with nonhuman nature. By understanding the interconnectedness of all organisms—including humans—in the ecosphere and empathizing with nonhuman nature, they argue, humans would develop an ecological consciousness and a sense of ecological solidarity. The biocentric principle of interconnectedness was extensively developed by British environmentalist James Lovelock , who postulated in Gaia: A New Look at Life on Earth (1979) that the planet is a single living, self-regulating entity capable of reestablishing an ecological equilibrium , even without the existence of human life. Despite their emphasis on spirituality, some more extreme forms of deep ecology have been strongly criticized as antihumanist, on the ground that they entail opposition to famine relief and immigration and acceptance of large-scale losses of life caused by AIDS and other pandemics .",
  "The emphasis on intrinsic value and the interconnectedness of nature was fundamental to the development of the animal-rights movement, whose activism was influenced by works such as Animal Liberation (1975), by the Australian philosopher Peter Singer , and The Case for Animal Rights (1983), by the American philosopher Tom Regan. Animal rights approaches go beyond a concern with ill-treatment and cruelty to animals, demanding an end to all forms of animal exploitation, including the use of animals in scientific and medical experiments and as sources of entertainment (e.g., in circuses , rodeos , and races) and food .",
  "Oppression, hierarchy, and spiritual relationships with nature also have been central concerns of ecofeminism . Ecofeminists assert that there is a connection between the destruction of nature by humans and the oppression of women by men that arises from political theories and social practices in which both women and nature are treated as objects to be owned or controlled. Ecofeminists aim to establish a central role for women in the pursuit of an environmentally sound and socially just society. They have been divided, however, over how to conceive of the relationship between nature and women, which they hold is more intimate and more “spiritual” than the relationship between nature and men. Whereas cultural ecofeminists argue that the relationship is inherent in women’s reproductive and nurturing roles, social ecofeminists, while acknowledging the relationship’s immediacy, claim that it arises from social and cultural hierarchies that confine women primarily to the private sphere.",
  "Concern for the impact on human life of problems such as air and water pollution dates to at least Roman times. Pollution was associated with the spread of epidemic disease in Europe between the late 14th century and the mid-16th century, and soil  conservation was practiced in China , India , and Peru as early as 2,000 years ago. In general, however, such concerns did not give rise to public activism.",
  "The contemporary environmental movement arose primarily from concerns in the late 19th century about the protection of the countryside in Europe and the wilderness in the United States and the health consequences of pollution during the Industrial Revolution . In opposition to the dominant political philosophy of the time, liberalism —which held that all social problems, including environmental ones, could and should be solved through the free market—most early environmentalists believed that government rather than the market should be charged with protecting the environment and ensuring the conservation of resources. An early philosophy of resource conservation was developed by Gifford Pinchot (1865–1946), the first chief of the U.S. Forest Service, for whom conservation represented the wise and efficient use of resources. Also in the United States at about the same time, a more strongly biocentric approach arose in the preservationist philosophy of John Muir (1838–1914), founder of the Sierra Club , and Aldo Leopold (1887–1948), a professor of wildlife management who was pivotal in the designation of Gila National Forest in New Mexico in 1924 as America’s first national wilderness area. Leopold introduced the concept of a land ethic, arguing that humans should transform themselves from conquerors of nature into citizens of it; his essays, compiled posthumously in A Sand County Almanac (1949), had a significant influence on later biocentric environmentalists.",
  "Environmental organizations established from the late 19th to the mid-20th century were primarily middle-class lobbying groups concerned with nature conservation, wildlife protection, and the pollution that arose from industrial development and urbanization. There were also scientific organizations concerned with natural history and with biological aspects of conservation efforts.",
  "Although the United States led the world in such efforts during this time, notable conservation developments were also occurring in Europe and Oceania . For example, Sweden established nine national parks in 1909, the first in Europe, and Switzerland created a national park of 14,000 hectares (roughly 34,600 acres) in 1914. In New Zealand the Native Bird Protection Society (later the Royal Forest and Bird Protection Society, or Forest & Bird) arose in 1923 in response to the devastation of Kapiti Island by livestock .",
  "Beginning in the 1960s, the various philosophical strands of environmentalism were given political expression through the establishment of “green” political movements in the form of activist nongovernmental organizations and environmentalist political parties. Despite the diversity of the environmental movement, four pillars provided a unifying theme to the broad goals of political ecology: protection of the environment, grassroots democracy, social justice, and nonviolence. However, for a small number of environmental groups and individual activists who engaged in ecoterrorism , violence was viewed as a justified response to what they considered the violent treatment of nature by some interests, particularly the logging and mining industries. The political goals of the contemporary green movement in the industrialized West focused on changing government policy and promoting environmental social values. Examples include the campaigns in Tasmania in the 1970s and ’80s to block the flooding of Lake Pedder and the damming of the Franklin River; protests in the United States and western Europe against nuclear power development, especially following the catastrophic accidents at Three Mile Island (1979) and Chernobyl (1986); the related decades-long controversy surrounding uranium mining in Australia’s Northern Territory , including at the Jabiluka mine; protests against deforestation in Indonesia and the Amazon basin ; and campaigns in several countries to limit the volume of greenhouse gases released through human activities. In the less-industrialized or developing world, environmentalism has been more closely involved in “emancipatory” politics and grassroots activism on issues such as poverty , democratization, and political and human rights , including the rights of women and indigenous peoples. Examples include the Chipko movement in India, which linked forest protection with the rights of women, and the Assembly of the Poor in Thailand, a coalition of movements fighting for the right to participate in environmental and development policies.",
  "The early strategies of the contemporary environmental movement were self-consciously activist and unconventional, involving direct-protest actions designed to obstruct and to draw attention to environmentally harmful policies and projects. Other strategies included public-education and media campaigns, community-directed activities, and conventional lobbying of policy makers and political representatives. The movement also attempted to set public examples in order to increase awareness of and sensitivity to environmental issues. Such projects included recycling, green consumerism (also known as “buying green”), and the establishment of alternative communities, including self-sufficient farms, workers’ cooperatives, and cooperative-housing projects.",
  "The electoral strategies of the environmental movement included the nomination of environmental candidates and the registration of green political parties. These parties were conceived of as a new kind of political organization that would bring the influence of the grassroots environmental movement directly to bear on the machinery of government, make the environment a central concern of public policy, and render the institutions of the state more democratic, transparent, and accountable. The world’s first green parties —the Values Party, a nationally based party in New Zealand, and the United Tasmania Group , organized in the Australian state of Tasmania—were founded in the early 1970s. The first explicitly green member of a national legislature was elected in Switzerland in 1979; later, in 1981, four greens won legislative seats in Belgium . Green parties also have been formed in the former Soviet bloc, where they were instrumental in the collapse of some communist regimes, and in some developing countries in Asia , South America , and Africa , though they have achieved little electoral success there.",
  "The most successful environmental party has been the German Green Party (die Grünen), founded in 1980. Although it failed to win representation in federal elections that year, it entered the Bundestag (parliament) in both 1983 and 1987, winning 5.6 percent and 8.4 percent of the national vote, respectively. The party did not win representation in 1990, but in 1998 it formed a governing coalition with the Social Democratic Party , and the party’s leader, Joschka Fischer , was appointed as the country’s foreign minister.",
  "Throughout the last two decades of the 20th century, green parties won national representation in a number of countries and even claimed the office of mayor in European capital cities such as Dublin and Rome in the mid-1990s. Outside Europe, New Zealand’s Green Party, which was reconstituted from the former Values Party in 1990, won 7 percent of the vote in the 1990 general election; its influence had grown to 9 of the country’s 121 parliamentary seats by 2002 and to 14 parliamentary seats by 2014.",
  "By this time green parties had become broad political vehicles, though they continued to focus on the environment. In developing party policy, they attempted to apply the values of environmental philosophy to all issues facing their countries, including foreign policy , defense, and social and economic policies.",
  "Despite the success of some environmental parties, environmentalists remained divided over the ultimate value of electoral politics. For some, participation in elections is essential because it increases the public’s awareness of environmental issues and encourages traditional political parties to address them. Others, however, have argued that the compromises necessary for electoral success invariably undermine the ethos of grassroots democracy and direct action. This tension was perhaps most pronounced in the German Green Party. The party’s Realos (realists) accepted the need for coalitions and compromise with other political parties, including traditional parties with views sometimes contrary to that of the Green Party. By contrast, the Fundis (fundamentalists) maintained that direct action should remain the major form of political action and that no pacts or alliances should be formed with other parties. Likewise, in Britain, where the Green Party achieved success in some local elections but failed to win representation at the national level (though it did win 15 percent of the vote in the 1989 European Parliament elections), this tension was evidenced in disputes between so-called “electoralists” and “radicals.”",
  "The implementation of internal party democracy also caused fissures within environmental parties. In particular, earlier strategies such as continuous policy involvement by party members, grassroots control over all party institutions and decisions, and the legislative rotation of elected members to prevent the creation of career politicians were sometimes perceived as unhelpful and disruptive when green parties won representation to local, national, or regional assemblies.",
  "By the late 1980s environmentalism had become a global as well as a national political force. Some environmental nongovernmental organizations (e.g., Greenpeace , Friends of the Earth , and the World Wildlife Fund ) established a significant international presence, with offices throughout the world and centralized international headquarters to coordinate lobbying campaigns and to serve as campaign centres and information clearinghouses for their national affiliate organizations. Transnational coalition building was and remains another important strategy for environmental organizations and for grassroots movements in developing countries, primarily because it facilitates the exchange of information and expertise but also because it strengthens lobbying and direct-action campaigns at the international level.",
  "Through its international activism, the environmental movement has influenced the agenda of international politics. Although a small number of bilateral and multilateral international environmental agreements were in force before the 1960s, since the 1972 United Nations Conference on the Human Environment in Stockholm, the variety of multilateral environmental agreements has increased to cover most aspects of environmental protection as well as many practices with environmental consequences, such as the burning of fossil fuels , the trade in endangered species , the management of hazardous waste , especially nuclear waste, and armed conflict. The changing nature of public debate on the environment was reflected also in the organization of the 1992 United Nations Conference on Environment and Development (the Earth Summit) in Rio de Janeiro, Brazil, which was attended by some 180 countries and various business groups, nongovernmental organizations, and the media. In the 21st century the environmental movement has combined the traditional concerns of conservation , preservation, and pollution with more contemporary concerns with the environmental consequences of economic practices as diverse as tourism , trade, financial investment, and the conduct of war . Environmentalists are likely to intensify the trends of the late 20th century, during which some environmental groups increasingly worked in coalition not just with other emancipatory organizations, such as human rights and indigenous-peoples groups, but also with corporations and other businesses.",
  "Overviews of environmental philosophy include Robyn Eckersley , Environmentalism and Political Theory: Toward an Ecocentric Approach (1992); Andrew Dobson , Green Political Thought , 3rd ed. (2000); and John Barry , Environment and Social Theory (1999). Michael E. Zimmerman (ed.), Environmental Philosophy: From Animal Rights to Radical Ecology , 3rd ed. (2001), includes discussion about key ideas in social ecology, deep ecology, and ecofeminism. Tim Hayward , Political Theory and Ecological Values (1998), also provides a useful coverage of environmental ideas.",
  " Murray Bookchin , The Ecology of Freedom: The Emergence and Dissolution of Hierarchy , rev. ed. (1991), sets out the major themes of social ecology. Arne Næss ( Arne Naess ), Ecology, Community, and Lifestyle: Outline of an Ecosophy , trans. and rev. by David Rothenberg (1989), explains the central ideas of deep ecology. Val Plumwood , Feminism and the Mastery of Nature (1993), explores ecofeminism.",
  "A detailed examination of the relationship between environmental thinking and strategies for social organization is offered in John S. Dryzek , The Politics of the Earth: Environmental Discourses (1997). Other helpful resources are Luke Martell , Ecology and Society: An Introduction (1994); and Brian Doherty and Marius de Geus (eds.), Democracy and Green Political Thought: Sustainability, Rights, and Citizenship (1996).",
  "A history of the environmental movement can be found in John  McCormick , The Global Environmental Movement , 2nd ed. (1995). A comprehensive examination of the development of the philosophy and strategies of green parties is Robert E. Goodin , Green Political Theory (1992). National and regional movements are detailed in Kenn Kassman , Envisioning Ecotopia: The U.S. Green Movement and the Politics of Radical Social Change (1997); Robert Garner , Environmental Politics: Britain, Europe, and the Global Environment , 2nd ed. (2000); Michael O’Neill , Green Parties and Political Change in Contemporary Europe: New Politics, Old Predicaments (1997); and Timothy Doyle , Green Power: The Environment Movement in Australia (2000). The British journal Environmental Politics (quarterly) publishes regular and authoritative updates on green parties in most parts of the world."
]