[
  "  equilibrium , in physics , the condition of a system when neither its state of motion nor its internal energy state tends to change with time. A simple mechanical body is said to be in equilibrium if it experiences neither linear acceleration nor angular acceleration; unless it is disturbed by an outside force, it will continue in that condition indefinitely. For a single particle, equilibrium arises if the vector sum of all forces acting upon the particle is zero. A rigid body (by definition distinguished from a particle in having the property of extension) is considered to be in equilibrium if, in addition to the states listed for the particle above, the vector sum of all torques acting on the body equals zero so that its state of rotational motion remains constant. An equilibrium is said to be stable if small, externally induced displacements from that state produce forces that tend to oppose the displacement and return the body or particle to the equilibrium state. Examples include a weight suspended by a spring or a brick lying on a level surface. An equilibrium is unstable if the least departure produces forces that tend to increase the displacement. An example is a ball bearing balanced on the edge of a razor blade.",
  "In thermodynamics the concept of equilibrium is extended to include possible changes in the internal state of a system, as characterized by its temperature , pressure , density , and any other quantities needed to specify its state completely. At strict thermodynamic equilibrium, the temperature of the system is uniform (otherwise heat would flow), and any gradients in state functions such as pressure or density are balanced by external forces so that they remain constant. For example, the equilibrium pressure at the bottom of a column of air is higher than at the top because of the force of gravity , and density gradients in a centrifuge are balanced by the centrifugal force . It is also useful to consider quasi-equilibrium processes where, for example, temperature gradients are allowed if the rate of heat flow is too slow to be significant ( adiabatic processes ), but the system is otherwise in local thermodynamic equilibrium. For example, the adiabatic expansion of a rising column of air accounts for the decrease of atmospheric temperature with altitude ."
]