[
  " ABO blood group system , the classification of human blood based on the inherited properties of red blood cells ( erythrocytes ) as determined by the presence or absence of the antigens A and B, which are carried on the surface of the red cells. Persons may thus have type A, type B, type O, or type AB blood. The A, B, and O blood groups were first identified by Austrian immunologist Karl Landsteiner in 1901. See  blood group .",
  "Blood containing red cells with type A antigen on their surface has in its serum (fluid) antibodies against type B red cells. If, in transfusion , type B blood is injected into persons with type A blood, the red cells in the injected blood will be destroyed by the antibodies in the recipient’s blood. In the same way, type A red cells will be destroyed by anti-A antibodies in type B blood. Type O blood can be injected into persons with type A, B, or O blood unless there is incompatibility with respect to some other blood group system also present. Persons with type AB blood can receive type A, B, or O blood.",
  "",
  "  Blood group O is the most common blood type throughout the world, particularly among peoples of South and Central America. Type B is prevalent in Asia, especially in northern India. Type A also is common all over the world; the highest frequency is among Australian Aboriginal peoples , the Blackfoot Indians of Montana, and the Sami people of northern Scandinavia.",
  "The ABO antigens are developed well before birth and remain throughout life. Children acquire ABO antibodies passively from their mother before birth, but by three months of age infants are making their own; it is believed that the stimulus for such antibody formation is from contact with ABO-like antigenic substances in nature. ABO incompatibility, in which the antigens of a mother and her fetus are different enough to cause an immune reaction, occurs in a small number of pregnancies. Rarely, ABO incompatibility may give rise to erythroblastosis fetalis (hemolytic disease of the newborn), a type of anemia in which the red blood cells of the fetus are destroyed by the maternal immune system. This situation occurs most often when a mother is type O and her fetus is either type A or type B."
]