[
  "  absorption , in wave motion , the transfer of the energy of a wave to matter as the wave passes through it. The energy of an acoustic, electromagnetic, or other wave is proportional to the square of its amplitude—i.e., the maximum displacement or movement of a point on the wave—and, as the wave passes through a substance, its amplitude steadily decreases. If there is only a small fractional absorption of energy, the medium is said to be transparent to that particular radiation, but if all the energy is lost, the medium is said to be opaque. All known transparent substances show absorption to some extent. For instance, the ocean appears to be transparent to sunlight near the surface, but it becomes opaque with depth.",
  "Substances are selectively absorbing; that is, they absorb radiation of specific wavelengths. Green glass is transparent to green light but opaque to blue and red, and hard rubber is transparent to infrared and X-rays but opaque to visible light. Thus, radiation of an unwanted wavelength may be removed from a mixture of waves by letting them pass through an appropriate medium. Those substances that are designed to absorb a particular wavelength or band of wavelengths are called filters.",
  " d 3 As radiation passes through matter, it is absorbed to an extent depending on the nature of the substance and its thickness. A homogeneous substance of a given thickness may be thought of as consisting of a number of equally thin layers. Each layer will absorb the same fraction of the energy that reaches it. The diagram shows a beam of waves passing from right to left through a series of layers ( d  1 , d  2 , and d  3 ) of a medium. If the fractional absorption is taken as 33 percent, or  1  3  , after the beam passes through the first layer d  1 , its initial energy ( E  0 ) will be reduced to E  0 /3. One-third the energy E  0 /3 will be absorbed passing through layer d  2 , and the beam will enter layer d  3 with energy  1  3  ( E  0 /3), or ( E  0 /9). Similarly, each successive layer absorbs one-third of the energy it receives. Thus, for radiation of a given wavelength, an infinitesimally thin layer will reduce the energy of a wave by a fractional amount that is proportional to the thickness of the layer. The change in energy as the wave passes through a layer is a constant of the material for a given wavelength and is called its absorption coefficient."
]