[
  " criminal justice , interdisciplinary academic study of the police , criminal courts , correctional institutions (e.g., prisons ), and juvenile justice agencies, as well as of the agents who operate within these institutions. Criminal justice is distinct from criminal law , which defines the specific behaviours that are prohibited by and punishable under law, and from criminology , which is the scientific study of the nonlegal aspects of crime and delinquency , including their causes, correction, and prevention.",
  "The field of criminal justice emerged in the United States in the second half of the 20th century. As the Supreme Court of the United States gradually expanded the rights of criminal defendants on the basis of the due process clause of the U.S. Constitution , the gap between the actual performance of criminal justice agencies and what was legally required and legitimately expected of them began to grow. In the 1970s, as part of a broader effort to improve these agencies, the Law Enforcement Assistance Administration of the U.S. Department of Justice provided grants for college study to thousands of criminal justice personnel, resulting in the creation of numerous criminal justice courses and programs at both the undergraduate and graduate levels. By the end of the 20th century, many colleges and universities offered bachelor’s degrees in criminal justice, and some offered master’s and doctoral degrees.",
  "Research in criminal justice developed rapidly in the 1980s and ’90s, a result of the increasing number of academics interested in the field and the growing availability of government funding. At first, such studies consisted of qualitative descriptive analyses written by individual scholars and based on observations of particular criminal justice agencies. As the discipline matured, research gradually became broader and more quantitative. Many scholars focused on evaluating the effectiveness of specific criminal justice policies in combating crime. Some studies, for example, examined whether the arrest of a physically abusive spouse tended to prevent future incidents of battering or whether prison rehabilitation programs reduced rates of recidivism . Other studies compared the effectiveness of different programs aimed at the same result—e.g., sending youthful offenders to “boot camps” or to more-traditional juvenile institutions.",
  "Since the 1980s, criminal justice policy in the United States has been profoundly influenced by scholarly research in the field. For example, community policing, a strategy designed to prevent crime and improve citizens’ overall quality of life by assigning officers to permanent neighbourhood patrols, originated in the recommendations of criminal justice scholars. Criminal justice research also influenced the widespread restructuring of sentencing and parole decisions in the 1980s and ’90s. Formerly, judges and parole boards had a great degree of discretion in making such decisions, which gave rise to disparities in sentences. Sentencing and parole guidelines reduced this disparity, but it also contributed to large increases in imprisonment. In the early 21st century a report in the United States on programs that proved effective in preventing crimes, commissioned by the U.S. Congress and published by the National Institute of Justice, generated support for the notion that such programs should be “evidence-based” (i.e., proven effective through systematic research and evaluation).",
  "Not all criminal justice research has produced fruitful results. For example, in the 1980s and ’90s numerous studies attempted to develop methods for predicting which offenders were most likely to commit future crimes. The premise was that those most likely to become habitual offenders should be incarcerated for longer periods, if not indefinitely. However, attempts to establish which offenders were likely to commit future crimes proved unsuccessful. It also was problematic because it appeared to be inconsistent with the constitutional rights of offenders, punishing them for what they might do in the future rather than for what they had actually done in the past. Outside the United States, criminal justice researchers are more closely tied to existing criminal justice agencies (i.e., tied to police agencies, courts, or correctional systems), helping to implement their policies rather than independently researching them."
]