[
  "  flower , the characteristic reproductive structure of angiosperms . As popularly used, the term “flower” especially applies when part or all of the reproductive structure is distinctive in colour and form.",
  "In their range of colour, size, form, and anatomical arrangement, flowers present a seemingly endless variety of combinations. They range in size from minute blossoms to giant blooms. In some plants, such as poppy , magnolia , tulip , and petunia , each flower is relatively large and showy and is produced singly, while in other plants, such as aster , snapdragon , and lilac , the individual flowers may be very small and are borne in a distinctive cluster known as an inflorescence . Regardless of their variety, all flowers have a uniform function, the reproduction of the species through the production of seed .",
  "    Basically, each flower consists of a floral axis upon which are borne the essential organs of reproduction ( stamens and pistils ) and usually accessory organs (sepals and petals); the latter may serve to both attract pollinating insects and protect the essential organs. The floral axis is a greatly modified stem; unlike vegetative stems, which bear leaves , it is usually contracted, so that the parts of the flower are crowded together on the stem tip, the receptacle. The flower parts are usually arrayed in whorls (or cycles) but may also be disposed spirally, especially if the axis is elongate. There are commonly four distinct whorls of flower parts: (1) an outer calyx consisting of sepals; within it lies (2) the corolla, consisting of petals; (3) the androecium, or group of stamens; and in the centre is (4) the gynoecium, consisting of the pistils.",
  "  The sepals and petals together make up the perianth, or floral envelope. The sepals are usually greenish and often resemble reduced leaves, while the petals are usually colourful and showy. Sepals and petals that are indistinguishable, as in lilies and tulips, are sometimes referred to as tepals. The androecium, or male parts of the flower, comprise the stamens, each of which consists of a supporting filament and an anther, in which pollen is produced. The gynoecium, or female parts of the flower, comprises one or more pistils, each of which consists of an ovary, with an upright extension, the style, on the top of which rests the stigma, the pollen-receptive surface. The ovary encloses the ovules , or potential seeds. A pistil may be simple, made up of a single carpel , or ovule-bearing modified leaf; or compound, formed from several carpels joined together.",
  " Tulipa A flower having sepals, petals, stamens, and pistils is complete; lacking one or more of such structures, it is said to be incomplete. Stamens and pistils are not present together in all flowers. When both are present the flower is said to be perfect, or bisexual, regardless of a lack of any other part that renders it incomplete ( see  photograph ). A flower that lacks stamens is pistillate, or female, while one that lacks pistils is said to be staminate, or male. When the same plant bears unisexual flowers of both sexes, it is said to be monoecious (e.g., tuberous begonia, hazel, oak, corn); when the male and female flowers are on different plants, the plant is dioecious (e.g., date, holly, cottonwood, willow); when there are male, female, and bisexual flowers on the same plant, the plant is termed polygamous.",
  " Rafflesia arnoldii Amorphophallus titanum  Gazania rigens  Vanda  A flower may be radially symmetrical ( see  photograph ), as in roses and petunias, in which case it is termed regular or actinomorphic. A bilaterally symmetrical flower, as in orchids ( see  photograph ) and snapdragons, is irregular or zygomorphic.",
  "  The stamens and pistils are directly involved with the production of seed . The stamen bears microsporangia (spore cases) in which are developed numerous microspores (potential pollen grains); the pistil bears ovules, each enclosing an egg cell. When a microspore germinates, it is known as a pollen grain. When the pollen sacs in a stamen’s anther are ripe, the anther releases them and the pollen is shed. Fertilization can occur only if the pollen grains are transferred from the anther to the stigma of a pistil, a process known as pollination .",
  "   Carex pendula  Iris Apis mellifera   There are two chief kinds of pollination: (1) self-pollination, the pollination of a stigma by pollen from the same flower or another flower on the same plant; and (2) cross-pollination, the transfer of pollen from the anther of a flower of one plant to the stigma of the flower of another plant of the same species. Self-pollination occurs in many species, but in the others, perhaps the majority, it is prevented by such adaptations as the structure of the flower, self-incompatibility, and the maturation of stamens and pistils of the same flower or plant at different times. Cross-pollination may be brought about by a number of agents, chiefly insects and wind. Wind-pollinated flowers ( see  photograph ) generally can be recognized by their lack of colour, odour, or nectar, while animal-pollinated flowers ( see  photograph ) are conspicuous by virtue of their structure, colour, or the production of scent or nectar .",
  "After a pollen grain has reached the stigma, it germinates, and a pollen tube protrudes from it. This tube, containing two male gametes (sperms), extends into the ovary and reaches the ovule, discharging its gametes so that one fertilizes the egg cell, which becomes an embryo, and the other joins with two polar nuclei to form the endosperm . (Normally many pollen grains fall on a stigma; they all may germinate, but only one pollen tube enters any one ovule.) Following fertilization, the embryo is on its way to becoming a seed, and at this time the ovary itself enlarges to form the fruit .",
  "Flowers have been symbols of beauty in most civilizations of the world, and flower giving is still among the most popular of social amenities. As gifts, flowers serve as expressions of affection for spouses, other family members, and friends; as decorations at weddings and other ceremonies; as tokens of respect for the deceased; as cheering gifts to the bedridden; and as expressions of thanks or appreciation. Most flowers bought by the public are grown in commercial greenhouses or horticultural fields and then sold through wholesalers to retail florists. See also articles on individual flowers (e.g., carnation ; lotus ; petunia ; rose ; tulip )."
]