[
  "  fog , cloud of small water droplets that is near ground level and sufficiently dense to reduce horizontal visibility to less than 1,000 metres (3,281 feet). The word fog also may refer to clouds of smoke particles, ice particles, or mixtures of these components. Under similar conditions, but with visibility greater than 1,000 metres, the phenomenon is termed a mist or haze , depending on whether the obscurity is caused by water drops or solid particles.",
  "Fog is formed by the condensation of water vapour on condensation nuclei that are always present in natural air. This results as soon as the relative humidity of the air exceeds saturation by a fraction of 1 percent. In highly polluted air the nuclei may grow sufficiently to cause fog at humidities of 95 percent or less. Growth of the drops may be helped by the absorption of certain soluble gases, notably sulfur dioxide to form dilute sulfuric acid . The relative humidity of the air can be increased by three processes: cooling of the air by adiabatic expansion; mixing two humid airstreams having different temperatures; and direct cooling of the air by radiation .",
  "The first process, adiabatic expansion, is responsible for the formation of clouds and plays a part in the formation of upslope fogs that are formed by the forced ascent of humid air up the sides of hills and mountains.",
  "The mixing process is manifest when air that has been in contact with a wet ground or water surface having a different temperature from that of the air above is mixed with this air.",
  "The most stable fogs occur when the surface is colder than the air above; that is, in the presence of a temperature inversion. Fogs also can occur when cold air moves over a warm, wet surface and becomes saturated by the evaporation of moisture from the underlying surface. Convection currents, however, tend to carry the fog upward as it forms, and it appears to rise as steam or smoke from the wet surface. This is the explanation of steam fogs that are produced when cold Arctic air moves over lakes, streams, inlets of the sea, or newly formed openings in the pack ice; hence, the term Arctic sea smoke.",
  "  Advection fog is formed by the slow passage of relatively warm, moist, stable air over a colder wet surface. It is common at sea whenever cold and warm ocean currents are in close proximity and may affect adjacent coasts. A good example is provided by the frequent dense fogs formed off the Grand Banks of Newfoundland in summer, when winds from the warm Gulf Stream blow over the cold Labrador Current . It also may occur over land, especially in winter when warm air blows over frozen or snow-covered ground. Advection fogs occur most readily with winds of about 5 metres per second (10 miles per hour), sufficiently light to maintain a temperature contrast between air and surface and not strong enough to produce turbulent mixing through a considerable depth of the atmosphere . Typical advection fogs extend up to heights of a few hundred metres and sometimes also occur together with radiation fogs.",
  "Radiation fog forms over land on calm, clear nights when loss of heat by radiation cools the ground and chills the air in the lowest few metres to below the dew-point temperature. Once dense fog has formed, the top of the fog replaces the ground as the effective surface cooled by radiation, and the fog increases progressively in depth as long as there is sufficiently moist air above it. The development of a strong temperature inversion tends to stabilize the fog and suppress air motions, but slow, turbulent stirring motions usually are present and probably are important in maintaining the fog. They do so by replacing the air in the lowest layers—which is losing moisture by deposition on the ground—with moister air from above. Typical inland radiation fogs reach to heights of 100 to 200 metres.",
  "  Inversion fogs are formed as a result of a downward extension of a layer of stratus cloud, situated under the base of a low-level temperature inversion. They are particularly prevalent off western coasts in tropical regions during the summer, when the prevailing winds blow toward the Equator and cause the upwelling of cold water along the coast. Air that passes over the cold water becomes chilled, its relative humidity rises, and it becomes trapped under the inversion. Subsequent nocturnal cooling may then cause a stratus layer to form and build down to the ground to form an inversion fog.",
  "Frontal fog forms near a front when raindrops, falling from relatively warm air above a frontal surface, evaporate into cooler air close to the Earth’s surface and cause it to become saturated.",
  "When the air temperature falls below 0 °C (32 °F) the fog droplets become supercooled. At temperatures between 0 and −10 °C (32 and 14 °F), only a small proportion of the droplets freeze, and the fog is composed mainly or entirely of liquid water. However, at lower temperatures, more and more droplets freeze, so that below about −35 °C (−31 °F)—and certainly below −40 °C (−40 °F)—the fog is composed entirely of ice crystals. The visibility in an ice fog is often considerably worse than that in a water fog containing the same concentration of condensed water.",
  "Although it is convenient to classify fogs according to the physical processes that produce saturation of the air, it is difficult to apply such a clear-cut classification in practice. Typically, more than one of the processes acts at the same time, and their relative importance varies from case to case and with time. Probably no two fogs are controlled by exactly the same combination of factors, a fact that makes forecasting the formation and dispersal of fog difficult.",
  "In most areas subject to fog, the frequency and persistence of the fogs show a marked seasonal dependence. Conditions favourable to the formation of radiation fog—namely, clear skies and light winds—often occur in the central regions of anticyclones ( see  anticyclone ) and ridges of high pressure, so that the advantages of dry, settled weather are often nullified by the occurrence of fog, especially in autumn and winter. Advection fog may occur in any season of the year and at any time of day or night and is not restricted to conditions of light winds and clear skies. Over land it is especially liable to occur in winter, when mild, damp air flows over a frozen or snow-covered surface. Over the coastal waters of the British Isles, it occurs chiefly in late spring and early summer when the sea is still cold.",
  "Dense fog presents one of the greatest hazards to aviation and to nearly all forms of surface transportation. Modern aircraft generally are not allowed to take off or land if the visibility along the runway is less than 600 metres. In many countries, especially those in temperate latitudes, fog causes widespread dislocation and delay in transportation systems on several days each year."
]