[
  " felsic and mafic rocks , division of igneous rocks on the basis of their silica content. Chemical analyses of the most abundant components in rocks usually are presented as oxides of the elements; igneous rocks typically consist of approximately 12 major oxides totaling over 99 percent of the rock. Of the oxides, silica (SiO 2 ) is usually the most abundant. Because of this abundance and because most igneous minerals are silicates, silica content was used as a basis of early classifications; it remains widely accepted today. Within this scheme, rocks are described as felsic, intermediate, mafic, and ultramafic (in order of decreasing silica content).",
  "In a widely accepted silica-content classification scheme, rocks with more than 65 percent silica are called felsic; those with between 55 and 65 percent silica are intermediate; those with between 45 and 55 percent silica are mafic; and those with less than 45 percent are ultramafic. Compilations of many rock analyses show that rhyolite and granite are felsic, with an average silica content of about 72 percent; syenite, diorite, and monzonite are intermediate, with an average silica content of 59 percent; gabbro and basalt are mafic, with an average silica content of 48 percent; and peridotite is an ultramafic rock, with an average of 41 percent silica. Although there are complete gradations between the averages, rocks tend to cluster about the averages. In general, the gradation from felsic to mafic corresponds to an increase in colour index (dark-mineral percentage).",
  "The fine-grained or glassy nature of many volcanic rocks makes a chemical classification such as the felsic-mafic taxonomy very useful in distinguishing the different types. Silica content is especially useful because the density and refractive index of natural glasses have been correlated with silica percentage; this makes identification possible in the absence of chemical data. For similar determinations, glasses can also be prepared in the laboratory from crystalline rocks.",
  "The influence of silica content on the particular minerals that crystallize from a rock magma is a complex interaction of several parameters, and it cannot be assumed that rocks with the same silica content will have the same mineralogy. Silica saturation is a classification of minerals and rocks as oversaturated, saturated, or undersaturated with respect to silica. Felsic rocks are commonly oversaturated and contain free quartz (SiO 2 ), intermediate rocks contain little or no quartz or feldspathoids (undersaturated minerals), and mafic rocks may contain abundant feldspathoids. This broad grouping on the basis of mineralogy related to silica content is used in many modern classification schemes."
]