[
  "  R. Buckminster Fuller , in full Richard Buckminster Fuller , (born July 12, 1895, Milton, Massachusetts, U.S.—died July 1, 1983, Los Angeles, California), American engineer, architect, and futurist who developed the geodesic dome —the only large dome that can be set directly on the ground as a complete structure and the only practical kind of building that has no limiting dimensions (i.e., beyond which the structural strength must be insufficient). Among the most noteworthy geodesic domes is the United States pavilion for Expo 67 in Montreal. Also a poet and a philosopher, Fuller was noted for unorthodox ideas on global issues.",
  "Fuller was descended from a long line of New England Nonconformists , the most famous of whom was his great-aunt, Margaret Fuller , the critic, teacher, woman of letters and cofounder of The Dial , organ of the Transcendentalist movement. Fuller was twice expelled from Harvard University and never completed his formal education. He saw service in the U.S. Navy during World War I as commander of a crash-boat flotilla. In 1917 he married Anne Hewlett, daughter of James Monroe Hewlett, a well-known architect and muralist. Hewlett had invented a modular construction system using a compressed fibre block, and after the war Fuller and Hewlett formed a construction company that used this material (later known as Soundex, a Celotex product) in modules for house construction. In this operation Fuller himself supervised the erection of several hundred houses.",
  "The construction company encountered financial difficulties in 1927, and Fuller, a minority stockholder, was forced out. He found himself stranded in Chicago, without income, alienated, dismayed, confused. At this point in his life, Fuller resolved to devote his remaining years to a nonprofit search for design patterns that could maximize the social uses of the world’s energy resources and evolving industrial complex. The inventions, discoveries, and economic strategies that followed were interim factors related to that end.",
  "In 1927, in the course of the development of his comprehensive strategy, he invented and demonstrated a factory-assembled, air-deliverable house, later called the Dymaxion house, which had its own utilities. He designed in 1928, and manufactured in 1933, the first prototype of his three-wheeled omnidirectional vehicle, the Dymaxion car. This automobile, the first streamlined car, could cross open fields like a jeep , accelerate to 120 miles (190 km) per hour, make a 180-degree turn in its own length, carry 12 passengers, and average 28 miles per gallon (12 km per litre) of gasoline. In 1943, at the request of the industrialist Henry Kaiser , Fuller developed a new version of the Dymaxion car that was planned to be powered by three separate air-cooled engines, each coupled to its own wheel by a variable fluid drive. The projected 1943 Dymaxion, like its predecessor, was never commercially produced.",
  "    Assuming that there is in nature a vectorial, or directionally oriented, system of forces that provides maximum strength with minimum structures, as is the case in the nested tetrahedron lattices of organic compounds and of metals, Fuller developed a vectorial system of geometry that he called “Energetic-Synergetic geometry.” The basic unit of this system is the tetrahedron (a pyramid shape with four sides, including the base), which, in combination with octahedrons (eight-sided shapes), forms the most economic space-filling structures. The architectural consequence of the use of this geometry by Fuller was the geodesic dome, a frame the total strength of which increases in logarithmic ratio to its size. Many thousands of geodesic domes have been erected in various parts of the world, the most publicized of which was the United States exhibition dome at Expo 67 in Montreal. One houses the tropical exhibit area of the Missouri Botanical Garden in St. Louis, Another, the Union Tank Car Company’s dome, was built in 1958 in Baton Rouge, Louisiana, and, at the time of its construction, was the largest clear-span structure in existence, 384 feet (117 metres) in diameter and 116 feet (35 metres) in height.",
  "Other inventions and developments by Fuller included a system of cartography that presents all the land areas of the world without significant distortion; die-stamped prefabricated bathrooms; tetrahedronal floating cities; underwater geodesic-domed farms; and expendable paper domes. Fuller did not regard himself as an inventor or an architect, however. All of his developments, in his view, were accidental or interim incidents in a strategy that aimed at a radical solution of world problems by finding the means to do more with less.",
  "Comprehensive and anticipatory design initiative alone, he held—exclusive of politics and political theory—can solve the problems of human shelter, nutrition, transportation, and pollution; and it can solve these with a fraction of the materials now inefficiently used. Moreover, energy, ever more available, directed by cumulative information stored in computers, is capable of synthesizing raw materials, of machining and packaging commodities, and of supplying the physical needs of the total global population.",
  "Fuller was a research professor at Southern Illinois University (Carbondale) from 1959 to 1968. In 1968 he was named university professor, in 1972 distinguished university professor, and in 1975 university professor emeritus. Queen Elizabeth II awarded Fuller the Royal Gold Medal for Architecture. He also received the 1968 Gold Medal Award of the National Institute of Arts and Letters.",
  "Fuller—architect, engineer, inventor, philosopher, author, cartographer, geometrician, futurist, teacher, and poet—established a reputation as one of the most original thinkers of the second half of the 20th century. He conceived of man as a passenger in a cosmic spaceship—a passenger whose only wealth consists in energy and information. Energy has two phases—associative (as atomic and molecule structures) and dissociative (as radiation)—and, according to the first law of thermodynamics , the energy of the universe cannot be decreased. Information, on the other hand, is negatively entropic; as knowledge, technology, “know-how,” it constantly increases. Research engenders research, and each technological advance multiplies the productive wealth of the world community. Consequently, “Spaceship Earth” is a regenerative system whose energy is progressively turned to human advantage and whose wealth increases by geometric increments.",
  "Fuller’s book Nine Chains to the Moon (1938) is an outline of his general technological strategy for maximizing the social applications of energy resources. He further developed this and other themes in such works as No More Secondhand God (1962), Utopia or Oblivion (1969), Operating Manual for Spaceship Earth (1969), Earth, Inc. (1973), and Critical Path (1981).",
  "Appraisals of Fuller’s life and work include Robert W. Marks, The Dymaxion World of Buckminster Fuller (1960, reissued 1973), which contains a detailed explanation of Fuller’s Energetic-Synergetic geometry and technical descriptions of Fuller’s inventions and structures prior to 1960; John McHale, R. Buckminster Fuller (1962), an evaluation of Fuller’s architectural achievements; Sidney Rosen, Wizard of the Dome (1969); Hugh Kenner, Bucky (1973), a biography with emphasis on his thought; Donald W. Robertson, Mind’s Eye of Richard Buckminster Fuller (1974, reprinted 1983); Alden Hatch, Buckminster Fuller: At Home in the Universe (1974), a biography stressing his life; Amy C. Edmondson, A Fuller Explanation: The Synergetic Geometry of R. Buckminster Fuller (1987), an explication of his geometric philosophy; Lloyd Steven Seiden, Buckminster Fuller’s Universe (1989), a comprehensive biography; and Martin Pawley, Buckminster Fuller (1990), a general introduction."
]