[
  " Action painting , direct, instinctual, and highly dynamic kind of art that involves the spontaneous application of vigorous, sweeping brushstrokes and the chance effects of dripping and spilling paint onto the canvas. The term was coined by the American art critic Harold Rosenberg to characterize the work of a group of American Abstract Expressionists who utilized the method from about 1950. Action painting is distinguished from the carefully preconceived work of the “abstract imagists” and “colour-field” painters, which constitutes the other major direction implicit in Abstract Expressionism and resembles Action painting only in its absolute devotion to unfettered personal expression free of all traditional aesthetic and social values.",
  "The works of the Action painters Jackson Pollock, Willem de Kooning, Franz Kline , Bradley Walker Tomlin , and Jack Tworkov reflect the influence of the “automatic” techniques developed in Europe in the 1920s and ’30s by the Surrealists. While Surrealist automatism , which consisted of scribblings recorded without the artist’s conscious control, was primarily designed to awaken unconscious associations in the viewer, the automatic approach of the Action painters was primarily conceived as a means of giving the artist’s instinctive creative forces free play and of revealing these forces directly to the viewer. In Action painting the act of painting itself, being the moment of the artist’s creative interaction with his materials, was as significant as the finished work.",
  "It is generally recognized that Jackson Pollock’s abstract drip paintings, executed from 1947, opened the way to the bolder, gestural techniques that characterize Action painting. The vigorous brushstrokes of de Kooning’s “Woman” series, begun in the early 1950s, successfully evolved a richly emotive expressive style. Action painting was of major importance throughout the 1950s in Abstract Expressionism, the most-influential art movement at the time in the United States. By the end of the decade, however, leadership of the movement had shifted to the colour-field and abstract imagist painters, whose followers in the 1960s rebelled against the irrationality of the Action painters. See also  Tachism ."
]