[
  "  gear , machine component consisting of a toothed wheel attached to a rotating shaft. Gears operate in pairs to transmit and modify rotary motion and torque (turning force) without slip, the teeth of one gear engaging the teeth on a mating gear. If the teeth on a pair of mating gears are arranged on circles, i.e., if the gears are toothed wheels, the ratios of the rotary speeds and torques of the shafts are constant. If the teeth are arranged on noncircular bodies the speed and torque ratios vary.",
  "Most gears are circular. To transmit motion smoothly and with a nonvarying speed ratio at every instant, the contacting surfaces of gear teeth must be carefully shaped to a specific profile. If the smaller of a gear pair (the pinion) is on the driving shaft, the pair acts to reduce speed and to amplify torque; if the pinion is on the driven shaft the pair acts as a speed increaser and a torque reducer. If the driven gear has twice as many teeth as the pinion, for example, the torque of the driven gear is twice the pinion torque, whereas the pinion speed is twice the speed of the driven gear.",
  "The shafts that gears connect must be relatively close, but they may have practically any spatial relationship with respect to one another; they may be parallel or nonparallel and intersecting or nonintersecting. For each of these arrangements of the shafts, gears having appropriate capabilities can be made. Parallel shafts can be connected by gears with teeth that are straight lengthwise and parallel to the shaft axes (spur gears) or by gears with twisted, screwlike teeth (helical gears). Intersecting shafts are connected by gears with tapered teeth arranged on truncated cones (bevel gears). Nonparallel, nonintersecting shafts are usually connected by a worm and gear. The worm resembles a screw, and the gear resembles a quarter section of a long nut that has been bent around a cylinder. The commonest angle between nonparallel shafts, either intersecting or nonintersecting, is a right angle (90°).",
  "Because it is basically a screw, a worm gear may have only one thread (tooth), whereas to maintain continuous contact with parallel shaft gears (spur and helical), the pinion must have at least five teeth. For this reason, to obtain a large speed ratio in a single gear pair, a worm and gear are well suited. If the shafts must be parallel, it may be necessary to use several gear pairs in series (a train) to obtain a large ratio. See also  differential gear ."
]