[
  " gender , in language, a phenomenon in which the words of a certain part of speech, usually nouns, require the agreement, or concord, through grammatical marking (or inflection), of various other words related to them in a sentence. In languages that exhibit gender, two or more classes of nouns control variation in words of other parts of speech (typically pronouns and adjectives and sometimes verbs). These other words maintain constant meaning but vary in form according to the class of the word that controls them in a given situation.",
  "Among modern Indo-European languages such as French, Spanish, and Italian, nouns are classified into two genders, masculine and feminine. Russian and German nouns are grouped into three genders, the third being neuter. While nouns referring to masculine or feminine beings almost always take the logical gender in these languages, for most other nouns the gender is arbitrary.",
  "In the following examples from French, the indefinite article and the adjective display a change in form depending on whether the noun that they modify is masculine ( poème, “poem”) or feminine ( pièce, “play”): un poème intéressant, “an interesting poem,” but une pièce intéressante, “an interesting play.”",
  "Swahili and many other languages have a gender system in which the relationship between the logical category of an object and its grammatical gender is specified to a much greater degree. Gender classes in such languages may include animate beings, inanimate objects, plants, animals, tools, and objects of a particular shape.",
  "English does not have “grammatical gender”; its way of expressing relationships that have to do with the sex or animateness of entities is based on real-world awareness (“natural gender”), in which males are “he,” females are “she,” and inanimates are “it.” Imaginative usage may interfere with this pattern, of course, as when a ship or country is referred to as “she.”"
]