[
  " gin , flavoured, distilled, colourless to pale yellow liquor made from purified spirits usually obtained from a grain mash and having the juniper berry as its principal flavouring ingredient. It includes both the malty-flavoured and full-bodied Netherlands types and the drier types, characterized by distinct botanical flavouring, produced in Britain and the United States.",
  "The name of the beverage comes from the French name for the juniper berry, genièvre , altered by the Dutch to genever and shortened by the English to gin . Its origin is attributed to Franciscus Sylvius, a 17th-century professor of medicine at the University of Leiden in Holland, who distilled the juniper berry with spirits to produce an inexpensive medicine having the diuretic properties of juniper-berry oil. The beverage became popular and was introduced to England by soldiers returning from the Low Countries. In the 18th century excessive consumption of the inexpensive beverage presented a social problem, as depicted in William Hogarth ’s engraving “Gin Lane.”",
  "Netherlands gins, known as Hollands, geneva, genever, or Schiedam, for a distilling centre near Rotterdam, are made from a mash containing barley malt, fermented to make beer. The beer is distilled, producing spirits called malt wine, with 50–55 percent alcohol content by volume. This product is distilled again with juniper berries and other botanicals, producing a final product having alcoholic content of about 35 percent. English and American gins are distilled from malt wine purified to produce an almost neutral spirit, without flavour or aroma, having alcohol content of 90–94 percent by volume. This is reduced with distilled water, combined with the flavouring agents, and distilled and reduced again, producing a final product of 40–47 percent alcoholic content (80–94 U.S. proof). The dry gins have more added flavouring ingredients than Dutch types. Each producer employs a secret formula, including, in addition to the juniper berries, combinations of such botanicals as orris, angelica, and licorice roots, lemon and orange peels, cassia bark, caraway, coriander, cardamom, anise, and fennel.",
  "United States producers sometimes age their gins, imparting pale-golden colour. Dutch gins may have similar colour, resulting from the addition of caramel colouring. Old Tom is a slightly sweetened gin, and various fruit-flavoured gins are made by adding the appropriate flavourings to finished gin. Sloe gin is not a true gin but a sweet liqueur, flavoured with sloe berries, the small, sour fruit of the blackthorn.",
  "Dutch gins, too distinctive in taste to combine well with other beverages, are usually served unmixed or with water. The drier types, sometimes called London dry, may be served unmixed or may be combined with other ingredients to make such cocktails as the martini and gimlet and such long drinks as the Tom Collins and the gin and tonic."
]