[
  "    Golden Gate Bridge ,    suspension bridge spanning the Golden Gate in California to link San Francisco with Marin county to the north. Upon its completion in 1937, it was the tallest and longest suspension bridge in the world. The Golden Gate Bridge came to be recognized as a symbol of the power and progress of the United States, and it set a precedent for suspension-bridge design around the world. Although other bridges have since surpassed it in size, it remains incomparable in the magnificence of its setting and is said to be the most photographed bridge in the world. It carries both U.S. Route 101 and California State Route 1 (Pacific Coast Highway) across the strait and features a pedestrian walkway.",
  "  ",
  "The bridge’s orange vermilion color, suggested by consulting architect Irving Morrow, has a dual function, both fitting in with the surrounding natural scenery and being clearly visible to ships in fog. At night the bridge is floodlit and shines with a golden luminescence that reflects off the waters of the bay and creates a magical effect.",
  "Its construction, under the supervision of chief engineer Joseph B. Strauss , began in January 1933 and involved many challenges. The strait has rapidly running tides, frequent storms, and fogs that made construction difficult. During one such fog on August 14, 1933, a cargo vessel collided with the access trestle, causing serious damage. Workers also had to contend with the problem of blasting rock under deep water to plant earthquake-proof foundations. A movable safety net, innovated by Strauss, saved a total of 19 men from falling to their deaths during construction. However, the safety net failed on February 17, 1937, when it gave way under the weight of a scaffolding collapse; of the 13 men who were on the scaffolding, one jumped clear, two survived the fall into the water, and 10 were killed. One other worker fell to his death during the construction, for a total of 11 worker deaths over four years.",
  "The bridge opened to vehicular traffic on May 28, 1937, under budget and ahead of schedule. The main span, 1,280 metres (4,200 feet) long, is suspended from two cables hung from towers 227 metres (746 feet) high; at midpoint the roadway is 81 metres (265 feet) above mean high water. Until the completion of the Verrazzano-Narrows Bridge in New York City in 1964, it had the longest main span in the world."
]