[
  " T.H. Green , in full Thomas Hill Green , (born April 7, 1836, Birkin, Yorkshire, England—died March 26, 1882, Oxford, Oxfordshire), English educator, political theorist, and Idealist philosopher of the so-called Neo-Kantian school. Through his teaching, Green exerted great influence on philosophy in late 19th-century England. Most of his life centred at Oxford, where he was educated, elected a fellow in 1860, served as a lecturer, and in 1878 was appointed professor of moral philosophy. His lectures provided the basis for his most significant works, Prolegomena to Ethics (1883) and Lectures on the Principles of Political Obligation, published in the collected Works, 3 vol. (1885–88).",
  "Green’s metaphysics begins with the question of man’s relation to nature. Man, he said, is self-conscious. The simplest mental act involves consciousness of changes and of distinctions between the self and the object observed. To know, Green asserted, is to be aware of relations between objects. Above man—who can know only a small portion of such relations—is God. This “principle which renders all relations possible and is itself determined by none of them” is an eternal self-consciousness.",
  "Green based his ethics on the spiritual nature of man. He maintained that man’s determination to act upon his reflections is an “act of will” and is not externally determined by God or any other factor. According to Green, freedom is not the supposed ability to do anything desired but is the power to identify one’s self with the good that reason reveals as one’s own true good.",
  "Green’s political philosophy enlarged upon his ethical system. Ideally, political institutions embody the community’s moral ideas and help develop the character of individual citizens. Although existing institutions do not fully realize the common ideal, the analysis that exposes their deficiencies also indicates the path of true development. His original view of personal self-realization also contained the notion of political obligation, for citizens intent upon realizing themselves will act as if by duty to improve the institutions of the state. Because the state represents the “general will” and is not a timeless entity, citizens have the moral right to rebel against it in the state’s own interest when the general will becomes subverted.",
  "Green’s influence on English philosophy was complemented by his social influence—in part through his efforts to bring the universities into closer touch with practical and political affairs and in part through his attempt to reformulate political liberalism so that it laid more stress on the need for positive actions by the state than on the negative rights of the individual. His address “Liberal Legislation and Freedom of Contract” (1881) gave early expression to ideas central to the modern “welfare state.”",
  "J.H. Muirhead, The Service of the State: Four Lectures on the Political Teaching of T.H. Green (1908); W.D. Lamont, Introduction  to Green’s Moral Philosophy (1934); J. Pucelle, La Nature et l’esprit dans la philosophie de T.H. Green, 2 vol. (1960–65); M. Richter, The Politics of Conscience: T.H. Green and His Age (1964)."
]