[
  " guitar , plucked stringed musical instrument that probably originated in Spain early in the 16th century, deriving from the guitarra latina , a late-medieval instrument with a waisted body and four strings. The early guitar was narrower and deeper than the modern guitar, with a less pronounced waist. It was closely related to the  vihuela  , the guitar-shaped instrument played in Spain in place of the lute .",
  "The guitar originally had four courses of strings, three double, the top course single, that ran from a violin-like pegbox to a tension bridge glued to the soundboard, or belly; the bridge thus sustained the direct pull of the strings. In the belly was a circular sound hole, often ornamented with a carved wooden rose. The 16th-century guitar was tuned C–F–A–D′, the tuning of the centre four courses of the lute and of the vihuela .",
  "  From the 16th to the 19th century several changes occurred in the instrument. A fifth course of strings was added before 1600; by the late 18th century a sixth course was added. Before 1800 the double courses were replaced by single strings tuned E–A–D–G–B–E′, still the standard tuning.",
  "The violin-type pegbox was replaced about 1600 by a flat, slightly reflexed head with rear tuning pegs; in the 19th century, metal screws were substituted for the tuning pegs. The early tied-on gut frets were replaced by built-on ivory or metal frets in the 18th century. The fingerboard was originally flush with and ended at the belly, and several metal or ivory frets were placed directly on the belly. In the 19th century the fingerboard was raised slightly above the level of the belly and was extended across it to the edge of the sound hole.",
  "In the 19th century the guitar’s body also underwent changes that resulted in increased sonority. It became broader and shallower, with an extremely thin soundboard. Internally, the transverse bars reinforcing the soundboard were replaced by radial bars that fanned out below the sound hole. The neck, formerly set into a wood block, was formed into a brace, or shoe, that projected a short distance inside the body and was glued to the back; this gave extra stability against the pull of the strings.",
  "  The 19th-century innovations were largely the work of Antonio Torres. The instrument that resulted was the classical guitar, which is strung with three gut and three metal-spun silk strings. Nylon or other plastic was later used in place of gut.",
  "  Among variant forms of the guitar are the 12-stringed, or double-course, guitar, and the Mexican jarana and the South American charango , both small five-course guitars. Lyre-shaped guitars were fashionable in 19th-century drawing rooms. Other forms of the guitar include the metal-strung guitar played with a plectrum in folk and popular music; the cello guitar, with a violin-type bridge and tailpiece; the Hawaiian, or steel, guitar, in which the strings are stopped by the pressure of a metal bar, producing a sweet, gliding tone; and the electric guitar, in which the instrument’s sound and tone depend almost entirely on the electronic detection and amplification of its vibrating strings.",
  "Guitar music from the 16th to 18th century was notated either in tablature (showing the position of the fingers on the frets and the strings to be plucked) or in a system of alphabetical chord symbols. Jazz-guitar tablature shows chord symbols on a grid representing strings and frets.",
  "The guitar grew in popularity during the 17th century as the lute and vihuela declined. It remained an amateur’s instrument from the 17th to early 19th century. A few virtuoso guitarists, however, became known in Europe, among them Gaspar Sanz (flourished 1674), Robert de Visée ( c. 1650–1725), Fernando Sor (1778–1839), and Joseph Kaspar Mertz (1806–56). Modern classical-guitar technique owes much to the Spaniard Francisco Tárrega (1852–1909), whose transcriptions of works by Bach , Mozart , and other composers formed the basis of the concert repertory.",
  "In the 20th century, Andrés Segovia gave the guitar further prominence as a concert instrument, and composers such as Heitor Villa-Lobos and Manuel de Falla wrote serious works for it; others (e.g., Pierre Boulez ) scored for the guitar in chamber ensembles .",
  "The guitar is widely played in the folk and popular music of many countries. In jazz ensembles it is part of the rhythm section and is occasionally played as a solo instrument. In popular music the guitar is usually amplified, and ensembles frequently include more than one instrument, a “lead” guitar for solos, another for rhythm, and a “bass” guitar to play bass lines."
]