[
  "  climate change , periodic modification of Earth ’s climate brought about as a result of changes in the atmosphere as well as interactions between the atmosphere and various other geologic, chemical, biological, and geographic factors within the Earth system.",
  "    The atmosphere is a dynamic fluid that is continually in motion. Both its physical properties and its rate and direction of motion are influenced by a variety of factors, including solar radiation , the geographic position of continents , ocean currents , the location and orientation of mountain ranges, atmospheric chemistry , and vegetation growing on the land surface. All these factors change through time. Some factors, such as the distribution of heat within the oceans , atmospheric chemistry, and surface vegetation, change at very short timescales. Others, such as the position of continents and the location and height of mountain ranges, change over very long timescales. Therefore, climate, which results from the physical properties and motion of the atmosphere, varies at every conceivable timescale.",
  "Climate is often defined loosely as the average weather at a particular place, incorporating such features as temperature , precipitation , humidity , and windiness . A more specific definition would state that climate is the mean state and variability of these features over some extended time period. Both definitions acknowledge that the weather is always changing, owing to instabilities in the atmosphere . And as weather varies from day to day, so too does climate vary, from daily day-and-night cycles up to periods of geologic time hundreds of millions of years long. In a very real sense, climate variation is a redundant expression—climate is always varying. No two years are exactly alike, nor are any two decades, any two centuries, or any two millennia.",
  "This article addresses the concept of climatic variation and change within the set of integrated natural features and processes known as the Earth system. The nature of the evidence for climate change is explained, as are the principal mechanisms that have caused climate change throughout the history of Earth. Finally, a detailed description is given of climate change over many different timescales, ranging from a typical human life span to all of geologic time. For a detailed description of the development of Earth’s atmosphere, see the article atmosphere, evolution of . For full treatment of the most critical issue of climate change in the contemporary world, see  global warming .",
  "    The atmosphere is influenced by and linked to other features of Earth , including oceans , ice masses ( glaciers and sea ice ), land surfaces, and vegetation. Together, they make up an integrated Earth system, in which all components interact with and influence one another in often complex ways. For instance, climate influences the distribution of vegetation on Earth’s surface (e.g., deserts exist in arid regions, forests in humid regions), but vegetation in turn influences climate by reflecting radiant energy back into the atmosphere, transferring water (and latent heat ) from soil to the atmosphere, and influencing the horizontal movement of air across the land surface.",
  "Earth scientists and atmospheric scientists are still seeking a full understanding of the complex feedbacks and interactions among the various components of the Earth system. This effort is being facilitated by the development of an interdisciplinary science called Earth system science. Earth system science is composed of a wide range of disciplines, including climatology (the study of the atmosphere), geology (the study of Earth’s surface and underground processes), ecology (the study of how Earth’s organisms relate to one another and their environment), oceanography (the study of Earth’s oceans), glaciology (the study of Earth’s ice masses), and even the social sciences (the study of human behaviour in its social and cultural aspects).",
  "A full understanding of the Earth system requires knowledge of how the system and its components have changed through time . The pursuit of this understanding has led to development of Earth system history, an interdisciplinary science that includes not only the contributions of Earth system scientists but also paleontologists (who study the life of past geologic periods), paleoclimatologists (who study past climates ), paleoecologists (who study past environments and ecosystems ), paleoceanographers (who study the history of the oceans), and other scientists concerned with Earth history. Because different components of the Earth system change at different rates and are relevant at different timescales, Earth system history is a diverse and complex science. Students of Earth system history are not just concerned with documenting what has happened; they also view the past as a series of experiments in which solar radiation , ocean currents , continental configurations, atmospheric chemistry, and other important features have varied. These experiments provide opportunities to learn the relative influences of and interactions between various components of the Earth system. Studies of Earth system history also specify the full array of states the system has experienced in the past and those the system is capable of experiencing in the future.",
  "Undoubtedly, people have always been aware of climatic variation at the relatively short timescales of seasons, years, and decades. Biblical scripture and other early documents refer to droughts , floods , periods of severe cold, and other climatic events. Nevertheless, a full appreciation of the nature and magnitude of climatic change did not come about until the late 18th and early 19th centuries, a time when the widespread recognition of the deep antiquity of Earth occurred. Naturalists of this time, including Scottish geologist Charles Lyell , Swiss-born naturalist and geologist Louis Agassiz , English naturalist Charles Darwin , American botanist Asa Gray , and Welsh naturalist Alfred Russel Wallace , came to recognize geologic and biogeographic evidence that made sense only in the light of past climates radically different from those prevailing today.",
  " Encyclopædia Britannica  Geologists and paleontologists in the 19th and early 20th centuries uncovered evidence of massive climatic changes taking place before the Pleistocene —that is, before some 2.6 million years ago. For example, red beds indicated aridity in regions that are now humid (e.g., England and New England ), whereas fossils of coal -swamp plants and reef corals indicated that tropical climates once occurred at present-day high latitudes in both Europe and North America . Since the late 20th century the development of advanced technologies for dating rocks, together with geochemical techniques and other analytical tools, have revolutionized the understanding of early Earth system history.",
  "  The occurrence of multiple epochs in recent Earth history during which continental glaciers , developed at high latitudes, penetrated into northern Europe and eastern North America was recognized by scientists by the late 19th century. Scottish geologist James Croll proposed that recurring variations in orbital eccentricity (the deviation of Earth’s orbit from a perfectly circular path) were responsible for alternating glacial and interglacial periods. Croll’s controversial idea was taken up by Serbian mathematician and astronomer Milutin Milankovitch in the early 20th century. Milankovitch proposed that the mechanism that brought about periods of glaciation was driven by cyclic changes in eccentricity as well as two other orbital parameters: precession (a change in the directional focus of Earth’s axis of rotation) and axial tilt (a change in the inclination of Earth’s axis with respect to the plane of its orbit around the Sun ). Orbital variation is now recognized as an important driver of climatic variation throughout Earth’s history ( see below  Orbital [Milankovitch] variations ).",
  "All historical sciences share a problem: As they probe farther back in time, they become more reliant on fragmentary and indirect evidence. Earth system history is no exception. High-quality instrumental records spanning the past century exist for most parts of the world, but the records become sparse in the 19th century, and few records predate the late 18th century. Other historical documents, including ship’s logs, diaries, court and church records, and tax rolls, can sometimes be used. Within strict geographic contexts, these sources can provide information on frosts , droughts , floods , sea ice , the dates of monsoons , and other climatic features—in some cases up to several hundred years ago.",
  "Fortunately, climatic change also leaves a variety of signatures in the natural world. Climate influences the growth of trees and corals , the abundance and geographic distribution of plant and animal species, the chemistry of oceans and lakes , the accumulation of ice in cold regions, and the erosion and deposition of materials on Earth’s surface. Paleoclimatologists study the traces of these effects, devising clever and subtle ways to obtain information about past climates. Most of the evidence of past climatic change is circumstantial, so paleoclimatology involves a great deal of investigative work. Wherever possible, paleoclimatologists try to use multiple lines of evidence to cross-check their conclusions. They are frequently confronted with conflicting evidence, but this, as in other sciences, usually leads to an enhanced understanding of the Earth system and its complex history. New sources of data, analytical tools, and instruments are becoming available, and the field is moving quickly. Revolutionary changes in the understanding of Earth’s climate history have occurred since the 1990s, and coming decades will bring many new insights and interpretations.",
  "Ongoing climatic changes are being monitored by networks of sensors in space, on the land surface, and both on and below the surface of the world’s oceans. Climatic changes of the past 200–300 years, especially since the early 1900s, are documented by instrumental records and other archives. These written documents and records provide information about climate change in some locations for the past few hundred years. Some very rare records date back over 1,000 years. Researchers studying climatic changes predating the instrumental record rely increasingly on natural archives, which are biological or geologic processes that record some aspect of past climate. These natural archives, often referred to as proxy evidence, are extraordinarily diverse; they include, but are not limited to, fossil records of past plant and animal distributions, sedimentary and geochemical indicators of former conditions of oceans and continents, and land surface features characteristic of past climates. Paleoclimatologists study these natural archives by collecting cores, or cylindrical samples, of sediments from lakes, bogs , and oceans; by studying surface features and geological strata; by examining tree ring patterns from cores or sections of living and dead trees; by drilling into marine corals and cave stalagmites ; by drilling into the ice sheets of Antarctica and Greenland and the high-elevation glaciers of the Plateau of Tibet , the Andes , and other montane regions; and by a wide variety of other means. Techniques for extracting paleoclimatic information are continually being developed and refined, and new kinds of natural archives are being recognized and exploited.",
  "It is much easier to document the evidence of climate variability and past climate change than it is to determine their underlying mechanisms. Climate is influenced by a multitude of factors that operate at timescales ranging from hours to hundreds of millions of years. Many of the causes of climate change are external to the Earth system. Others are part of the Earth system but external to the atmosphere. Still others involve interactions between the atmosphere and other components of the Earth system and are collectively described as feedbacks within the Earth system. Feedbacks are among the most recently discovered and challenging causal factors to study. Nevertheless, these factors are increasingly recognized as playing fundamental roles in climate variation. The most important mechanisms are described in this section.",
  "The luminosity, or brightness, of the Sun has been increasing steadily since its formation. This phenomenon is important to Earth’s climate, because the Sun provides the energy to drive atmospheric circulation and constitutes the input for Earth’s heat budget. Low solar luminosity during Precambrian time underlies the faint young Sun paradox, described in the section Climates of early Earth .",
  "  Radiative energy from the Sun is variable at very small timescales, owing to solar storms and other disturbances, but variations in solar activity, particularly the frequency of sunspots , are also documented at decadal to millennial timescales and probably occur at longer timescales as well. The “ Maunder minimum ,” a period of drastically reduced sunspot activity between 1645 and 1715, has been suggested as a contributing factor to the Little Ice Age . ( See below  Climatic variation and change since the emergence of civilization .)",
  "  Volcanic activity can influence climate in a number of ways at different timescales. Individual volcanic eruptions can release large quantities of sulfur dioxide and other aerosols into the stratosphere , reducing atmospheric transparency and thus the amount of solar radiation reaching Earth’s surface and troposphere . A recent example is the 1991 eruption in the Philippines of Mount Pinatubo , which had measurable influences on atmospheric circulation and heat budgets. The 1815 eruption of Mount Tambora on the island of Sumbawa had more dramatic consequences, as the spring and summer of the following year (1816, known as “the year without a summer”) were unusually cold over much of the world. New England and Europe experienced snowfalls and frosts throughout the summer of 1816.",
  "Volcanoes and related phenomena, such as ocean rifting and subduction, release carbon dioxide into both the oceans and the atmosphere. Emissions are low; even a massive volcanic eruption such as Mount Pinatubo releases only a fraction of the carbon dioxide emitted by fossil-fuel combustion in a year. At geologic timescales, however, release of this greenhouse gas can have important effects. Variations in carbon dioxide release by volcanoes and ocean rifts over millions of years can alter the chemistry of the atmosphere. Such changeability in carbon dioxide concentrations probably accounts for much of the climatic variation that has taken place during the Phanerozoic Eon . ( See below  Phanerozoic climates .)",
  "  Tectonic movements of Earth’s crust have had profound effects on climate at timescales of millions to tens of millions of years. These movements have changed the shape, size, position, and elevation of the continental masses as well as the bathymetry of the oceans. Topographic and bathymetric changes in turn have had strong effects on the circulation of both the atmosphere and the oceans . For example, the uplift of the Tibetan Plateau during the Cenozoic Era affected atmospheric circulation patterns, creating the South Asian monsoon and influencing climate over much of the rest of Asia and neighbouring regions.",
  "Tectonic activity also influences atmospheric chemistry, particularly carbon dioxide concentrations. Carbon dioxide is emitted from volcanoes and vents in rift zones and subduction zones . Variations in the rate of spreading in rift zones and the degree of volcanic activity near plate margins have influenced atmospheric carbon dioxide concentrations throughout Earth’s history. Even the chemical weathering of rock constitutes an important sink for carbon dioxide. (A carbon sink is any process that removes carbon dioxide from the atmosphere by the chemical conversion of CO 2 to organic or inorganic carbon compounds.) Carbonic acid, formed from carbon dioxide and water , is a reactant in dissolution of silicates and other minerals. Weathering rates are related to the mass, elevation, and exposure of bedrock . Tectonic uplift can increase all these factors and thus lead to increased weathering and carbon dioxide absorption. For example, the chemical weathering of the rising Tibetan Plateau may have played an important role in depleting the atmosphere of carbon dioxide during a global cooling period in the late Cenozoic Era. ( See below  Cenozoic climates .)",
  " The orbital geometry of Earth is affected in predictable ways by the gravitational influences of other planets in the solar system. Three primary features of Earth’s orbit are affected, each in a cyclic, or regularly recurring, manner. First, the shape of Earth’s orbit around the Sun , varies from nearly circular to elliptical (eccentric), with periodicities of 100,000 and 413,000 years. Second, the tilt of Earth’s axis with respect to the Sun, which is primarily responsible for Earth’s seasonal climates, varies between 22.1° and 24.5° from the plane of Earth’s rotation around the Sun. This variation occurs on a cycle of 41,000 years. In general, the greater the tilt, the greater the solar radiation received by hemispheres in summer and the less received in winter. The third cyclic change to Earth’s orbital geometry results from two combined phenomena: (1) Earth’s axis of rotation wobbles, changing the direction of the axis with respect to the Sun, and (2) the orientation of Earth’s orbital ellipse rotates slowly. These two processes create a 26,000-year cycle, called precession of the equinoxes , in which the position of Earth at the equinoxes and solstices changes. Today Earth is closest to the Sun (perihelion) near the December solstice, whereas 9,000 years ago perihelion occurred near the June solstice.",
  "These orbital variations cause changes in the latitudinal and seasonal distribution of solar radiation, which in turn drive a number of climate variations. Orbital variations play major roles in pacing glacial-interglacial and monsoonal patterns. Their influences have been identified in climatic changes over much of the Phanerozoic. For example, cyclothems —which are interbedded marine, fluvial, and coal beds characteristic of the Pennsylvanian Subperiod (323.2 million to 298.9 million years ago)—appear to represent Milankovitch-driven changes in mean sea level.",
  "  Greenhouse gases are gas molecules that have the property of absorbing infrared radiation (net heat energy) emitted from Earth’s surface and reradiating it back to Earth’s surface, thus contributing to the phenomenon known as the greenhouse effect . Carbon dioxide , methane , and water vapour are the most important greenhouse gases, and they have a profound effect on the energy budget of the Earth system despite making up only a fraction of all atmospheric gases. Concentrations of greenhouse gases have varied substantially during Earth’s history, and these variations have driven substantial climate changes at a wide range of timescales. In general, greenhouse gas concentrations have been particularly high during warm periods and low during cold phases. A number of processes influence greenhouse gas concentrations. Some, such as tectonic activities, operate at timescales of millions of years, whereas others, such as vegetation, soil, wetland, and ocean sources and sinks, operate at timescales of hundreds to thousands of years. Human activities—especially fossil-fuel combustion since the Industrial Revolution —are responsible for steady increases in atmospheric concentrations of various greenhouse gases, especially carbon dioxide, methane, ozone , and chlorofluorocarbons (CFCs).",
  "    Perhaps the most intensively discussed and researched topic in climate variability is the role of interactions and feedbacks among the various components of the Earth system. The feedbacks involve different components that operate at different rates and timescales. Ice sheets, sea ice , terrestrial vegetation, ocean temperatures, weathering rates, ocean circulation, and greenhouse gas concentrations are all influenced either directly or indirectly by the atmosphere ; however, they also all feed back into the atmosphere, thereby influencing it in important ways. For example, different forms and densities of vegetation on the land surface influence the albedo , or reflectivity, of Earth’s surface, thus affecting the overall radiation budget at local to regional scales. At the same time, the transfer of water molecules from soil to the atmosphere is mediated by vegetation, both directly (from transpiration through plant stomata ) and indirectly (from shading and temperature influences on direct evaporation from soil). This regulation of latent heat flux by vegetation can influence climate at local to global scales. As a result, changes in vegetation, which are partially controlled by climate, can in turn influence the climate system. Vegetation also influences greenhouse gas concentrations; living plants constitute an important sink for atmospheric carbon dioxide, whereas they act as sources of carbon dioxide when they are burned by wildfires or undergo decomposition. These and other feedbacks among the various components of the Earth system are critical for both understanding past climate changes and predicting future ones.",
  "  Recognition of global climate change as an environmental issue has drawn attention to the climatic impact of human activities. Most of this attention has focused on carbon dioxide emission via fossil-fuel combustion and deforestation . Human activities also yield releases of other greenhouse gases , such as methane (from rice cultivation, livestock, landfills, and other sources) and chlorofluorocarbons (from industrial sources). There is little doubt among climatologists that these greenhouse gases affect the radiation budget of Earth ; the nature and magnitude of the climatic response are a subject of intense research activity. Paleoclimate records from tree rings, coral , and ice cores indicate a clear warming trend spanning the entire 20th century and the first decade of the 21st century. In fact, the 20th century was the warmest of the past 10 centuries, and the decade 2011–20 was the warmest decade since the beginning of modern instrumental record keeping. Many climatologists have pointed to this warming pattern as clear evidence of human-induced climate change resulting from the production of greenhouse gases.",
  "  A second type of human impact, the conversion of vegetation by deforestation , afforestation, and agriculture, is receiving mounting attention as a further source of climate change. It is becoming increasingly clear that human impacts on vegetation cover can have local, regional, and even global effects on climate, due to changes in the sensible and latent heat flux to the atmosphere and the distribution of energy within the climate system. The extent to which these factors contribute to recent and ongoing climate change is an important, emerging area of study.",
  "Regardless of their locations on the planet, all humans experience climate variability and change within their lifetimes. The most familiar and predictable phenomena are the seasonal cycles, to which people adjust their clothing, outdoor activities, thermostats, and agricultural practices. However, no two summers or winters are exactly alike in the same place; some are warmer, wetter, or stormier than others. This interannual variation in climate is partly responsible for year-to-year variations in fuel prices, crop yields, road maintenance budgets, and wildfire hazards. Single-year, precipitation-driven floods can cause severe economic damage, such as those of the upper Mississippi River drainage basin during the summer of 1993, and loss of life, such as those that devastated much of Bangladesh in the summer of 1998. Similar damage and loss of life can also occur as the result of wildfires, severe storms, hurricanes , heat waves , and other climate-related events.",
  "  Climate variation and change may also occur over longer periods, such as decades. Some locations experience multiple years of drought , floods, or other harsh conditions. Such decadal variation of climate poses challenges to human activities and planning. For example, multiyear droughts can disrupt water supplies, induce crop failures, and cause economic and social dislocation, as in the case of the Dust Bowl droughts in the midcontinent of North America during the 1930s. Multiyear droughts may even cause widespread starvation, as in the Sahel drought that occurred in northern Africa during the 1970s and ’80s.",
  "  Every place on Earth experiences seasonal variation in climate (though the shift can be slight in some tropical regions). This cyclic variation is driven by seasonal changes in the supply of solar radiation to Earth’s atmosphere and surface. Earth’s orbit around the Sun is elliptical; it is closer to the Sun ( 147 million km [about 91 million miles]) near the winter solstice and farther from the Sun (152 million km [about 94 million miles]) near the summer solstice in the Northern Hemisphere. Furthermore, Earth’s axis of rotation occurs at an oblique angle (23.5°) with respect to its orbit. Thus, each hemisphere is tilted away from the Sun during its winter period and toward the Sun in its summer period. When a hemisphere is tilted away from the Sun, it receives less solar radiation than the opposite hemisphere, which at that time is pointed toward the Sun. Thus, despite the closer proximity of the Sun at the winter solstice, the Northern Hemisphere receives less solar radiation during the winter than it does during the summer. Also as a consequence of the tilt, when the Northern Hemisphere experiences winter, the Southern Hemisphere experiences summer.",
  "Earth’s climate system is driven by solar radiation; seasonal differences in climate ultimately result from the seasonal changes in Earth’s orbit . The circulation of air in the atmosphere and water in the oceans responds to seasonal variations of available energy from the Sun. Specific seasonal changes in climate occurring at any given location on Earth’s surface largely result from the transfer of energy from atmospheric and oceanic circulation. Differences in surface heating taking place between summer and winter cause storm tracks and pressure centres to shift position and strength. These heating differences also drive seasonal changes in cloudiness, precipitation, and wind .",
  "Seasonal responses of the biosphere (especially vegetation) and cryosphere ( glaciers , sea ice , snowfields) also feed into atmospheric circulation and climate. Leaf fall by deciduous trees as they go into winter dormancy increases the albedo (reflectivity) of Earth’s surface and may lead to greater local and regional cooling. Similarly, snow accumulation also increases the albedo of land surfaces and often amplifies winter’s effects.",
  "Interannual climate variations, including droughts, floods, and other events, are caused by a complex array of factors and Earth system interactions. One important feature that plays a role in these variations is the periodic change of atmospheric and oceanic circulation patterns in the tropical Pacific region, collectively known as El Niño –Southern Oscillation (ENSO) variation. Although its primary climatic effects are concentrated in the tropical Pacific, ENSO has cascading effects that often extend to the Atlantic Ocean region, the interior of Europe and Asia , and the polar regions. These effects, called teleconnections, occur because alterations in low-latitude atmospheric circulation patterns in the Pacific region influence atmospheric circulation in adjacent and downstream systems. As a result, storm tracks are diverted and atmospheric pressure ridges (areas of high pressure) and troughs (areas of low pressure) are displaced from their usual patterns.",
  "As an example, El Niño events occur when the easterly trade winds in the tropical Pacific weaken or reverse direction. This shuts down the upwelling of deep, cold waters off the west coast of South America, warms the eastern Pacific, and reverses the atmospheric pressure gradient in the western Pacific. As a result, air at the surface moves eastward from Australia and Indonesia toward the central Pacific and the Americas. These changes produce high rainfall and flash floods along the normally arid coast of Peru and severe drought in the normally wet regions of northern Australia and Indonesia. Particularly severe El Niño events lead to monsoon failure in the Indian Ocean region, resulting in intense drought in India and East Africa. At the same time, the westerlies and storm tracks are displaced toward the Equator , providing California and the desert Southwest of the United States with wet, stormy winter weather and causing winter conditions in the Pacific Northwest , which are typically wet, to become warmer and drier. Displacement of the westerlies also results in drought in northern China and from northeastern Brazil through sections of Venezuela . Long-term records of ENSO variation from historical documents, tree rings, and reef corals indicate that El Niño events occur, on average, every two to seven years. However, the frequency and intensity of these events vary through time.",
  "  The North Atlantic Oscillation (NAO) is another example of an interannual oscillation that produces important climatic effects within the Earth system and can influence climate throughout the Northern Hemisphere. This phenomenon results from variation in the pressure gradient, or the difference in atmospheric pressure between the subtropical high , usually situated between the Azores and Gibraltar , and the Icelandic low , centred between Iceland and Greenland . When the pressure gradient is steep due to a strong subtropical high and a deep Icelandic low (positive phase), northern Europe and northern Asia experience warm, wet winters with frequent strong winter storms. At the same time, southern Europe is dry. The eastern United States also experiences warmer, less snowy winters during positive NAO phases, although the effect is not as great as in Europe. The pressure gradient is dampened when NAO is in a negative mode—that is, when a weaker pressure gradient exists from the presence of a weak subtropical high and Icelandic low. When this happens, the Mediterranean region receives abundant winter rainfall, while northern Europe is cold and dry. The eastern United States is typically colder and snowier during a negative NAO phase.",
  "The ENSO and NAO cycles are driven by feedbacks and interactions between the oceans and atmosphere. Interannual climate variation is driven by these and other cycles, interactions among cycles, and perturbations in the Earth system, such as those resulting from large injections of aerosols from volcanic eruptions. One example of a perturbation due to volcanism is the 1991 eruption of Mount Pinatubo in the Philippines , which led to a decrease in the average global temperature of approximately 0.5 °C (0.9 °F) the following summer.",
  "Climate varies on decadal timescales, with multiyear clusters of wet, dry, cool, or warm conditions. These multiyear clusters can have dramatic effects on human activities and welfare. For instance, a severe three-year drought in the late 16th century probably contributed to the destruction of Sir Walter Raleigh’s “Lost Colony” at Roanoke Island in what is now North Carolina, and a subsequent seven-year drought (1606–12) led to high mortality at the Jamestown Colony in Virginia . Also, some scholars have implicated persistent and severe droughts as the main reason for the collapse of the Maya civilization in Mesoamerica between 750 and 950 ce ; however, discoveries in the early 21st century suggest that war-related trade disruptions played a role, possibly interacting with famines and other drought-related stresses.",
  "Although decadal-scale climate variation is well documented, the causes are not entirely clear. Much decadal variation in climate is related to interannual variations. For example, the frequency and magnitude of ENSO change through time. The early 1990s were characterized by repeated El Niño events, and several such clusters have been identified as having taken place during the 20th century. The steepness of the NAO gradient also changes at decadal timescales; it has been particularly steep since the 1970s.",
  "Recent research has revealed that decadal-scale variations in climate result from interactions between the ocean and the atmosphere . One such variation is the Pacific Decadal Oscillation (PDO), also referred to as the Pacific Decadal Variability (PDV), which involves changing sea surface temperatures (SSTs) in the North Pacific Ocean. The SSTs influence the strength and position of the Aleutian Low , which in turn strongly affects precipitation patterns along the Pacific Coast of North America . PDO variation consists of an alternation between “cool-phase” periods, when coastal Alaska is relatively dry and the Pacific Northwest relatively wet (e.g., 1947–76), and “warm-phase” periods, characterized by relatively high precipitation in coastal Alaska and low precipitation in the Pacific Northwest (e.g., 1925–46, 1977–98). Tree ring and coral records, which span at least the last four centuries, document PDO variation.",
  "A similar oscillation, the Atlantic Multidecadal Oscillation (AMO), occurs in the North Atlantic and strongly influences precipitation patterns in eastern and central North America. A warm-phase AMO (relatively warm North Atlantic SSTs) is associated with relatively high rainfall in Florida and low rainfall in much of the Ohio Valley. However, the AMO interacts with the PDO, and both interact with interannual variations, such as ENSO and NAO, in complex ways . Such interactions may lead to the amplification of droughts, floods, or other climatic anomalies. For example, severe droughts over much of the conterminous United States in the first few years of the 21st century were associated with warm-phase AMO combined with cool-phase PDO. The mechanisms underlying decadal variations, such as PDO and AMO, are poorly understood, but they are probably related to ocean-atmosphere interactions with larger time constants than interannual variations. Decadal climatic variations are the subject of intense study by climatologists and paleoclimatologists.",
  "Human societies have experienced climate change since the development of agriculture some 10,000 years ago. These climate changes have often had profound effects on human cultures and societies. They include annual and decadal climate fluctuations such as those described above, as well as large-magnitude changes that occur over centennial to multimillennial timescales. Such changes are believed to have influenced and even stimulated the initial cultivation and domestication of crop plants, as well as the domestication and pastoralization of animals. Human societies have changed adaptively in response to climate variations, although evidence abounds that certain societies and civilizations have collapsed in the face of rapid and severe climatic changes.",
  "Historical records as well as proxy records (particularly tree rings, corals , and ice cores ) indicate that climate has changed during the past 1,000 years at centennial timescales; that is, no two centuries have been exactly alike. During the past 150 years, the Earth system has emerged from a period called the Little Ice Age , which was characterized in the North Atlantic region and elsewhere by relatively cool temperatures. The 20th century in particular saw a substantial pattern of warming in many regions. Some of this warming may be attributable to the transition from the Little Ice Age or other natural causes. However, many climate scientists believe that much of the 20th-century warming, especially in the later decades, resulted from atmospheric accumulation of greenhouse gases (especially carbon dioxide, CO 2 ).",
  "The Little Ice Age is best known in Europe and the North Atlantic region, which experienced relatively cool conditions between the early 14th and mid-19th centuries. This was not a period of uniformly cool climate, since interannual and decadal variability brought many warm years. Furthermore, the coldest periods did not always coincide among regions; some regions experienced relatively warm conditions at the same time others were subjected to severely cold conditions. Alpine glaciers advanced far below their previous (and present) limits, obliterating farms, churches, and villages in Switzerland , France , and elsewhere. Frequent cold winters and cool, wet summers ruined wine harvests and led to crop failures and famines over much of northern and central Europe. The North Atlantic cod fisheries declined as ocean temperatures fell in the 17th century. The Norse colonies on the coast of Greenland were cut off from the rest of Norse civilization during the early 15th century as pack ice and storminess increased in the North Atlantic. The western colony of Greenland collapsed through starvation, and the eastern colony was abandoned. In addition, Iceland became increasingly isolated from Scandinavia .",
  "The Little Ice Age was preceded by a period of relatively mild conditions in northern and central Europe. This interval, known as the Medieval Warm Period , occurred from approximately ad 1000 to the first half of the 13th century. Mild summers and winters led to good harvests in much of Europe. Wheat cultivation and vineyards flourished at far higher latitudes and elevations than today. Norse colonies in Iceland and Greenland prospered, and Norse parties fished, hunted, and explored the coast of Labrador and Newfoundland. The Medieval Warm Period is well documented in much of the North Atlantic region, including ice cores from Greenland. Like the Little Ice Age, this time was neither a climatically uniform period nor a period of uniformly warm temperatures everywhere in the world. Other regions of the globe lack evidence for high temperatures during this period.",
  "Much scientific attention continues to be devoted to a series of severe droughts that occurred between the 11th and 14th centuries. These droughts, each spanning several decades, are well documented in tree-ring records across western North America and in the peatland records of the Great Lakes region. The records appear to be related to ocean temperature anomalies in the Pacific and Atlantic basins, but they are still inadequately understood. The information suggests that much of the United States is susceptible to persistent droughts that would be devastating for water resources and agriculture.",
  "The climatic changes of the past thousand years are superimposed upon variations and trends at both millennial timescales and greater. Numerous indicators from eastern North America and Europe show trends of increased cooling and increased effective moisture during the past 3,000 years. For example, in the Great Lakes – St. Lawrence regions along the U.S.-Canadian border, water levels of the lakes rose, peatlands developed and expanded, moisture-loving trees such as beech and hemlock expanded their ranges westward, and populations of boreal trees, such as spruce and tamarack , increased and expanded southward. These patterns all indicate a trend of increased effective moisture, which may indicate increased precipitation , decreased evapotranspiration due to cooling, or both. The patterns do not necessarily indicate a monolithic cooling event; more complex climatic changes probably occurred. For example, beech expanded northward and spruce southward during the past 3,000 years in both eastern North America and western Europe. The beech expansions may indicate milder winters or longer growing seasons, whereas the spruce expansions appear related to cooler, moister summers. Paleoclimatologists are applying a variety of approaches and proxies to help identify such changes in seasonal temperature and moisture during the Holocene Epoch .",
  "Just as the Little Ice Age was not associated with cool conditions everywhere, so the cooling and moistening trend of the past 3,000 years was not universal. Some regions became warmer and drier during the same time period. For example, northern Mexico and the Yucatan experienced decreasing moisture in the past 3,000 years. Heterogeneity of this type is characteristic of climatic change, which involves changing patterns of atmospheric circulation. As circulation patterns change, the transport of heat and moisture in the atmosphere also changes. This fact explains the apparent paradox of opposing temperature and moisture trends in different regions.",
  "The trends of the past 3,000 years are just the latest in a series of climatic changes that occurred over the past 11,700 years or so—the interglacial period referred to as the Holocene Epoch. At the start of the Holocene, remnants of continental glaciers from the last glaciation still covered much of eastern and central Canada and parts of Scandinavia . These ice sheets largely disappeared by 6,000 years ago. Their absence— along with increasing sea surface temperatures, rising sea levels (as glacial meltwater flowed into the world’s oceans), and especially changes in the radiation budget of Earth’s surface owing to Milankovitch variations (changes in the seasons resulting from periodic adjustments of Earth’s orbit around the Sun)—affected atmospheric circulation. The diverse changes of the past 10,000 years across the globe are difficult to summarize in capsule, but some general highlights and large-scale patterns are worthy of note. These include the presence of early to mid-Holocene thermal maxima in various locations, variation in ENSO patterns, and an early to mid-Holocene amplification of the Indian Ocean  monsoon .",
  "Many parts of the globe experienced higher temperatures than today some time during the early to mid-Holocene. In some cases the increased temperatures were accompanied by decreased moisture availability. Although the thermal maximum has been referred to in North America and elsewhere as a single widespread event (variously referred to as the “Altithermal,” “Xerothermic Interval,” “Climatic Optimum,” or “Thermal Optimum”), it is now recognized that the periods of maximum temperatures varied among regions. For example, northwestern Canada experienced its highest temperatures several thousand years earlier than central or eastern North America. Similar heterogeneity is seen in moisture records. For instance, the record of the prairie-forest boundary in the Midwestern region of the United States shows eastward expansion of prairie in Iowa and Illinois 6,000 years ago (indicating increasingly dry conditions), whereas Minnesota ’s forests expanded westward into prairie regions at the same time (indicating increasing moisture). The Atacama Desert , located primarily in present-day Chile and Bolivia , on the western side of South America , is one of the driest places on Earth today, but it was much wetter during the early Holocene when many other regions were at their driest.",
  "The primary driver of changes in temperature and moisture during the Holocene was orbital variation, which slowly changed the latitudinal and seasonal distribution of solar radiation on Earth’s surface and atmosphere. However, the heterogeneity of these changes was caused by changing patterns of atmospheric circulation and ocean currents .",
  "Because of the global importance of ENSO variation today, Holocene variation in ENSO patterns and intensity is under serious study by paleoclimatologists. The record is still fragmentary, but evidence from fossil corals, tree rings, lake records, climate modeling, and other approaches is accumulating that suggests that (1) ENSO variation was relatively weak in the early Holocene, (2) ENSO has undergone centennial to millennial variations in strength during the past 11,700 years, and (3) ENSO patterns and strength similar to those currently in place developed within the past 5,000 years. This evidence is particularly clear when comparing ENSO variation over the past 3,000 years to today’s patterns. The causes of long-term ENSO variation are still being explored, but changes in solar radiation owing to Milankovitch variations are strongly implicated by modeling studies.",
  "Much of Africa , the Middle East, and the Indian subcontinent are under the strong influence of an annual climatic cycle known as the Indian Ocean monsoon . The climate of this region is highly seasonal, alternating between clear skies with dry air (winter) and cloudy skies with abundant rainfall (summer). Monsoon intensity, like other aspects of climate, is subject to interannual, decadal, and centennial variations, at least some of which are related to ENSO and other cycles. Abundant evidence exists for large variations in monsoon intensity during the Holocene Epoch. Paleontological and paleoecological studies show that large portions of the region experienced much greater precipitation during the early Holocene (11,700–6,000 years ago) than today. Lake and wetland sediments dating to this period have been found under the sands of parts of the Sahara Desert . These sediments contain fossils of elephants , crocodiles , hippopotamuses , and giraffes , together with pollen evidence of forest and woodland vegetation. In arid and semiarid parts of Africa, Arabia, and India , large and deep freshwater lakes occurred in basins that are now dry or are occupied by shallow, saline lakes. Civilizations based on plant cultivation and grazing animals, such as the Harappan civilization of northwestern India and adjacent Pakistan , flourished in these regions, which have since become arid.",
  "These and similar lines of evidence, together with paleontological and geochemical data from marine sediments and climate-modeling studies, indicate that the Indian Ocean monsoon was greatly amplified during the early Holocene, supplying abundant moisture far inland into the African and Asian continents. This amplification was driven by high solar radiation in summer, which was approximately 7 percent higher 11,700 years ago than today and resulted from orbital forcing (changes in Earth’s eccentricity, precession, and axial tilt). High summer insolation resulted in warmer summer air temperatures and lower surface pressure over continental regions and, hence, increased inflow of moisture-laden air from the Indian Ocean to the continental interiors. Modeling studies indicate that the monsoonal flow was further amplified by feedbacks involving the atmosphere, vegetation, and soils. Increased moisture led to wetter soils and lusher vegetation, which in turn led to increased precipitation and greater penetration of moist air into continental interiors. Decreasing summer insolation during the past 4,000–6,000 years led to the weakening of the Indian Ocean monsoon.",
  "  The history of humanity—from the initial appearance of genus  Homo  over 2,000,000 years ago to the advent and expansion of the modern human species (  Homo sapiens  ) beginning some 150,000 years ago—is integrally linked to climate variation and change. Homo sapiens has experienced nearly two full glacial-interglacial cycles, but its global geographical expansion, massive population increase, cultural diversification, and worldwide ecological domination began only during the last glacial period and accelerated during the last glacial-interglacial transition. The first bipedal apes appeared in a time of climatic transition and variation, and  Homo erectus  , an extinct species possibly ancestral to modern humans, originated during the colder Pleistocene Epoch and survived both the transition period and multiple glacial-interglacial cycles. Thus, it can be said that climate variation has been the midwife of humanity and its various cultures and civilizations.",
  "With glacial ice restricted to high latitudes and altitudes, Earth 125,000 years ago was in an interglacial period similar to the one occurring today. During the past 125,000 years, however, the Earth system went through an entire glacial-interglacial cycle, only the most recent of many taking place over the last million years. The most recent period of cooling and glaciation began approximately 120,000 years ago. Significant ice sheets developed and persisted over much of Canada and northern Eurasia.",
  "After the initial development of glacial conditions, the Earth system alternated between two modes, one of cold temperatures and growing glaciers and the other of relatively warm temperatures (although much cooler than today) and retreating glaciers. These Dansgaard-Oeschger (DO) cycles, recorded in both ice cores and marine sediments , occurred approximately every 1,500 years. A lower-frequency cycle, called the Bond cycle , is superimposed on the pattern of DO cycles; Bond cycles occurred every 1,400–2,200 years. Each Bond cycle is characterized by unusually cold conditions that take place during the cold phase of a DO cycle, the subsequent Heinrich event (which is a brief dry and cold phase), and the rapid warming phase that follows each Heinrich event. During each Heinrich event, massive fleets of icebergs were released into the North Atlantic, carrying rocks picked up by the glaciers far out to sea. Heinrich events are marked in marine sediments by conspicuous layers of iceberg-transported rock fragments.",
  "Many of the transitions in the DO and Bond cycles were rapid and abrupt, and they are being studied intensely by paleoclimatologists and Earth system scientists to understand the driving mechanisms of such dramatic climatic variations. These cycles now appear to result from interactions between the atmosphere , oceans , ice sheets, and continental rivers that influence thermohaline circulation (the pattern of ocean currents driven by differences in water density, salinity, and temperature, rather than wind ). Thermohaline circulation, in turn, controls ocean heat transport, such as the Gulf Stream .",
  "During the past 25,000 years, the Earth system has undergone a series of dramatic transitions. The most recent glacial period peaked 21,500 years ago during the Last Glacial Maximum, or LGM. At that time, the northern third of North America was covered by the Laurentide Ice Sheet , which extended as far south as Des Moines , Iowa ; Cincinnati , Ohio ; and New York City . The Cordilleran Ice Sheet covered much of western Canada as well as northern Washington , Idaho , and Montana in the United States . In Europe the Scandinavian Ice Sheet sat atop the British Isles, Scandinavia, northeastern Europe, and north-central Siberia . Montane glaciers were extensive in other regions, even at low latitudes in Africa and South America . Global sea level was 125 metres ( 410 feet) below modern levels, because of the long-term net transfer of water from the oceans to the ice sheets. Temperatures near Earth’s surface in unglaciated regions were about 5 °C (9 °F) cooler than today. Many Northern Hemisphere plant and animal species inhabited areas far south of their present ranges. For example, jack pine and white spruce trees grew in northwestern Georgia , 1,000 km (600 miles) south of their modern range limits in the Great Lakes region of North America.",
  "  The continental ice sheets began to melt back about 20,000 years ago. Drilling and dating of submerged fossil coral reefs provide a clear record of increasing sea levels as the ice melted. The most rapid melting began 15,000 years ago. For example, the southern boundary of the Laurentide Ice Sheet in North America was north of the Great Lakes and St. Lawrence regions by 10,000 years ago, and it had completely disappeared by 6,000 years ago.",
  "The warming trend was punctuated by transient cooling events, most notably the Younger Dryas climate interval of 12,900–11,600 years ago. The climatic regimes that developed during the deglaciation period in many areas, including much of North America, have no modern analog (i.e., no regions exist with comparable seasonal regimes of temperature and moisture). For example, in the interior of North America, climates were much more continental (that is, characterized by warm summers and cold winters) than they are today. Also, paleontological studies indicate assemblages of plant, insect , and vertebrate species that do not occur anywhere today. Spruce trees grew with temperate hardwoods ( ash , hornbeam , oak , and elm ) in the upper Mississippi River and Ohio River regions. In Alaska , birch and poplar grew in woodlands, and there were very few of the spruce trees that dominate the present-day Alaskan landscape. Boreal and temperate mammals, whose geographic ranges are widely separated today, coexisted in central North America and Russia during this period of deglaciation. These unparalleled climatic conditions probably resulted from the combination of a unique orbital pattern that increased summer insolation and reduced winter insolation in the Northern Hemisphere and the continued presence of Northern Hemisphere ice sheets, which themselves altered atmospheric circulation patterns.",
  "The first known examples of animal domestication occurred in western Asia between 11,000 and 9,500 years ago when goats and sheep were first herded, whereas examples of plant domestication date to 9,000 years ago when wheat , lentils , rye , and barley were first cultivated. This phase of technological increase occurred during a time of climatic transition that followed the last glacial period. A number of scientists have suggested that, although climate change imposed stresses on hunter-gatherer-forager societies by causing rapid shifts in resources, it also provided opportunities as new plant and animal resources appeared.",
  "The glacial period that peaked 21,500 years ago was only the most recent of five glacial periods in the last 450,000 years. In fact, the Earth system has alternated between glacial and interglacial regimes for more than two million years, a period of time known as the Pleistocene. The duration and severity of the glacial periods increased during this period, with a particularly sharp change occurring between 900,000 and 600,000 years ago. Earth is currently within the most recent interglacial period, which started 11,700 years ago and is commonly known as the Holocene Epoch .",
  "The continental glaciations of the Pleistocene left signatures on the landscape in the form of glacial deposits and landforms; however, the best knowledge of the magnitude and timing of the various glacial and interglacial periods comes from oxygen  isotope records in ocean sediments. These records provide both a direct measure of sea level and an indirect measure of global ice volume. Water molecules composed of a lighter isotope of oxygen, 16 O, are evaporated more readily than molecules bearing a heavier isotope, 18 O. Glacial periods are characterized by high 18 O concentrations and represent a net transfer of water, especially with 16 O, from the oceans to the ice sheets. Oxygen isotope records indicate that interglacial periods have typically lasted 10,000–15,000 years, and maximum glacial periods were of similar length. Most of the past 500,000 years—approximately 80 percent—have been spent within various intermediate glacial states that were warmer than glacial maxima but cooler than interglacials. During these intermediate times, substantial glaciers occurred over much of Canada and probably covered Scandinavia as well. These intermediate states were not constant; they were characterized by continual, millennial-scale climate variation. There has been no average or typical state for global climate during Pleistocene and Holocene times; the Earth system has been in continual flux between interglacial and glacial patterns.",
  "    The cycling of the Earth system between glacial and interglacial modes has been ultimately driven by orbital variations. However, orbital forcing is by itself insufficient to explain all of this variation, and Earth system scientists are focusing their attention on the interactions and feedbacks between the myriad components of the Earth system. For example, the initial development of a continental ice sheet increases albedo over a portion of Earth, reducing surface absorption of sunlight and leading to further cooling. Similarly, changes in terrestrial vegetation, such as the replacement of forests by tundra , feed back into the atmosphere via changes in both albedo and latent heat flux from evapotranspiration. Forests—particularly those of tropical and temperate areas, with their large leaf area—release great amounts of water vapour and latent heat through transpiration . Tundra plants, which are much smaller, possess tiny leaves designed to slow water loss; they release only a small fraction of the water vapour that forests do.",
  "The discovery in ice core records that atmospheric concentrations of two potent greenhouse gases , carbon dioxide and methane , have decreased during past glacial periods and peaked during interglacials indicates important feedback processes in the Earth system. Reduction of greenhouse gas concentrations during the transition to a glacial phase would reinforce and amplify cooling already under way. The reverse is true for transition to interglacial periods. The glacial carbon sink remains a topic of considerable research activity. A full understanding of glacial-interglacial carbon dynamics requires knowledge of the complex interplay among ocean chemistry and circulation, ecology of marine and terrestrial organisms, ice sheet dynamics, and atmospheric chemistry and circulation.",
  " The Earth system has undergone a general cooling trend for the past 50 million years, culminating in the development of permanent ice sheets in the Northern Hemisphere about 2.75 million years ago. These ice sheets expanded and contracted in a regular rhythm, with each glacial maximum separated from adjacent ones by 41,000 years (based on the cycle of axial tilt). As the ice sheets waxed and waned, global climate drifted steadily toward cooler conditions characterized by increasingly severe glaciations and increasingly cool interglacial phases. Beginning around 900,000 years ago, the glacial-interglacial cycles shifted frequency. Ever since, the glacial peaks have been 100,000 years apart, and the Earth system has spent more time in cool phases than before. The 41,000-year periodicity has continued, with smaller fluctuations superimposed on the 100,000-year cycle. In addition, a smaller, 23,000-year cycle has occurred through both the 41,000-year and 100,000-year cycles.",
  "The 23,000-year and 41,000-year cycles are driven ultimately by two components of Earth’s orbital geometry: the equinoctial precession cycle (23,000 years) and the axial-tilt cycle (41,000 years). Although the third parameter of Earth’s orbit, eccentricity, varies on a 100,000-year cycle, its magnitude is insufficient to explain the 100,000-year cycles of glacial and interglacial periods of the past 900,000 years. The origin of the periodicity present in Earth’s eccentricity is an important question in current paleoclimate research.",
  "The Earth system has undergone dramatic changes throughout its 4.5-billion-year history. These have included climatic changes diverse in mechanisms, magnitudes, rates, and consequences. Many of these past changes are obscure and controversial, and some have been discovered only recently. Nevertheless, the history of life has been strongly influenced by these changes, some of which radically altered the course of evolution. Life itself is implicated as a causative agent of some of these changes, as the processes of photosynthesis and respiration have largely shaped the chemistry of Earth’s atmosphere , oceans , and sediments.",
  "The Cenozoic Era —encompassing the past 66 million years, the time that has elapsed since the mass extinction event marking the end of the Cretaceous Period —has a broad range of climatic variation characterized by alternating intervals of global warming and cooling. Earth has experienced both extreme warmth and extreme cold during this period. These changes have been driven by tectonic forces, which have altered the positions and elevations of the continents as well as ocean passages and bathymetry . Feedbacks between different components of the Earth system (atmosphere, biosphere, lithosphere, cryosphere, and oceans in the hydrosphere ) are being increasingly recognized as influences of global and regional climate. In particular, atmospheric concentrations of carbon dioxide have varied substantially during the Cenozoic for reasons that are poorly understood, though its fluctuation must have involved feedbacks between Earth’s spheres.",
  "Orbital forcing is also evident in the Cenozoic, although, when compared on such a vast era-level timescale, orbital variations can be seen as oscillations against a slowly changing backdrop of lower-frequency climatic trends. Descriptions of the orbital variations have evolved according to the growing understanding of tectonic and biogeochemical changes. A pattern emerging from recent paleoclimatologic studies suggests that the climatic effects of eccentricity, precession, and axial tilt have been amplified during cool phases of the Cenozoic, whereas they have been dampened during warm phases.",
  "The meteor impact that occurred at or very close to the end of the Cretaceous came at a time of global warming, which continued into the early Cenozoic. Tropical and subtropical flora and fauna occurred at high latitudes until at least 40 million years ago, and geochemical records of marine sediments have indicated the presence of warm oceans. The interval of maximum temperature occurred during the late Paleocene and early Eocene epochs (59.2 million to 41.2 million years ago). The highest global temperatures of the Cenozoic occurred during the Paleocene-Eocene Thermal Maximum (PETM), a short interval lasting approximately 100,000 years. Although the underlying causes are unclear, the onset of the PETM about 56 million years ago was rapid, occurring within a few thousand years, and ecological consequences were large, with widespread extinctions in both marine and terrestrial ecosystems. Sea surface and continental air temperatures increased by more than 5 °C (9 °F) during the transition into the PETM. Sea surface temperatures in the high-latitude Arctic may have been as warm as 23 °C (73 °F), comparable to modern subtropical and warm-temperate seas. Following the PETM, global temperatures declined to pre-PETM levels, but they gradually increased to near-PETM levels over the next few million years during a period known as the Eocene Optimum. This temperature maximum was followed by a steady decline in global temperatures toward the Eocene - Oligocene boundary, which occurred about 33.9 million years ago. These changes are well-represented in marine sediments and in paleontological records from the continents, where vegetation zones moved Equator-ward. Mechanisms underlying the cooling trend are under study, but it is most likely that tectonic movements played an important role. This period saw the gradual opening of the sea passage between Tasmania and Antarctica , followed by the opening of the Drake Passage between South America and Antarctica. The latter, which isolated Antarctica within a cold polar sea, produced global effects on atmospheric and oceanic circulation. Recent evidence suggests that decreasing atmospheric concentrations of carbon dioxide during this period may have initiated a steady and irreversible cooling trend over the next few million years.",
  "A continental ice sheet developed in Antarctica during the Oligocene Epoch, persisting until a rapid warming event took place 27 million years ago. The late Oligocene and early to mid- Miocene epochs (28.4 million to 13.8 million years ago) were relatively warm, though not nearly as warm as the Eocene. Cooling resumed 15 million years ago, and the Antarctic Ice Sheet expanded again to cover much of the continent. The cooling trend continued through the late Miocene and accelerated into the early Pliocene Epoch , 5.3 million years ago. During this period the Northern Hemisphere remained ice-free, and paleobotanical studies show cool-temperate Pliocene floras at high latitudes on Greenland and the Arctic Archipelago. The Northern Hemisphere glaciation, which began 3.2 million years ago, was driven by tectonic events, such as the closing of the Panama seaway and the uplift of the Andes , the Tibetan Plateau, and western parts of North America . These tectonic events led to changes in the circulation of the oceans and the atmosphere, which in turn fostered the development of persistent ice at high northern latitudes. Small-magnitude variations in carbon dioxide concentrations, which had been relatively low since at least the mid-Oligocene (27.8 million years ago), are also thought to have contributed to this glaciation.",
  "The Phanerozoic Eon (541 million years ago to the present), which includes the entire span of complex, multicellular life on Earth, has witnessed an extraordinary array of climatic states and transitions. The sheer antiquity of many of these regimes and events renders them difficult to understand in detail. However, a number of periods and transitions are well known, owing to good geological records and intense study by scientists. Furthermore, a coherent pattern of low-frequency climatic variation is emerging, in which the Earth system alternates between warm (“greenhouse”) phases and cool (“icehouse”) phases. The warm phases are characterized by high temperatures, high sea levels, and an absence of continental glaciers . Cool phases in turn are marked by low temperatures, low sea levels, and the presence of continental ice sheets, at least at high latitudes. Superimposed on these alternations are higher-frequency variations, where cool periods are embedded within greenhouse phases and warm periods are embedded within icehouse phases. For example, glaciers developed for a brief period (between 1 million and 10 million years) during the late Ordovician and early Silurian , in the middle of the early Paleozoic greenhouse phase (541 million to about 359 million years ago). Similarly, warm periods with glacial retreat occurred within the late Cenozoic cool period during the late Oligocene and early Miocene epochs.",
  "The Earth system has been in an icehouse phase for the past 30 million to 35 million years, ever since the development of ice sheets on Antarctica. The previous major icehouse phase occurred between about 359 million and about 252 million years ago, during the Carboniferous and Permian periods of the late Paleozoic Era. Glacial sediments dating to this period have been identified in much of Africa as well as in the Arabian Peninsula, South America, Australia, India, and Antarctica. At the time, all these regions were part of Gondwana , a high-latitude supercontinent in the Southern Hemisphere. The glaciers atop Gondwana extended to at least 45° S latitude, similar to the latitude reached by Northern Hemisphere ice sheets during the Pleistocene. Some late Paleozoic glaciers extended even further Equator-ward—to 35° S. One of the most striking features of this time period are cyclothems , repeating sedimentary beds of alternating sandstone , shale , coal , and limestone . The great coal deposits of North America’s Appalachian region, the American Midwest , and northern Europe are interbedded in these cyclothems, which may represent repeated transgressions (producing limestone) and retreats (producing shales and coals) of ocean shorelines in response to orbital variations.",
  "The two most prominent warm phases in Earth history occurred during the Mesozoic and early Cenozoic eras (approximately 252 million to 35 million years ago) and the early and mid-Paleozoic (approximately 500 million to about 359 million years ago). Climates of each of these greenhouse periods were distinct; continental positions and ocean bathymetry were very different, and terrestrial vegetation was absent from the continents until relatively late in the Paleozoic warm period. Both of these periods experienced substantial long-term climate variation and change; increasing evidence indicates brief glacial episodes during the mid-Mesozoic.",
  "Understanding the mechanisms underlying icehouse-greenhouse dynamics is an important area of research, involving an interchange between geologic records and the modeling of the Earth system and its components. Two processes have been implicated as drivers of Phanerozoic climate change. First, tectonic forces caused changes in the positions and elevations of continents and the bathymetry of oceans and seas. Second, variations in greenhouse gases were also important drivers of climate, though at these long timescales they were largely controlled by tectonic processes, in which sinks and sources of greenhouse gases varied.",
  "The pre-Phanerozoic interval, also known as Precambrian time , comprises some 88 percent of the time elapsed since the origin of Earth. The pre-Phanerozoic is a poorly understood phase of Earth system history. Much of the sedimentary record of the atmosphere, oceans, biota, and crust of the early Earth has been obliterated by erosion , metamorphosis, and subduction. However, a number of pre-Phanerozoic records have been found in various parts of the world, mainly from the later portions of the period. Pre-Phanerozoic Earth system history is an extremely active area of research, in part because of its importance in understanding the origin and early evolution of life on Earth. Furthermore, the chemical composition of Earth’s atmosphere and oceans largely developed during this period, with living organisms playing an active role. Geologists, paleontologists, microbiologists, planetary geologists, atmospheric scientists, and geochemists are focusing intense efforts on understanding this period. Three areas of particular interest and debate are the “faint young Sun paradox,” the role of organisms in shaping Earth’s atmosphere, and the possibility that Earth went through one or more “snowball” phases of global glaciation.",
  "Astrophysical studies indicate that the luminosity of the Sun was much lower during Earth’s early history than it has been in the Phanerozoic. In fact, radiative output was low enough to suggest that all surface water on Earth should have been frozen solid during its early history, but evidence shows that it was not. The solution to this “faint young Sun paradox” appears to lie in the presence of unusually high concentrations of greenhouse gases at the time, particularly methane and carbon dioxide. As solar luminosity gradually increased through time, concentrations of greenhouse gases would have to have been much higher than today. This circumstance would have caused Earth to heat up beyond life-sustaining levels. Therefore, greenhouse gas concentrations must have decreased proportionally with increasing solar radiation, implying a feedback mechanism to regulate greenhouse gases. One of these mechanisms might have been rock weathering , which is temperature-dependent and serves as an important sink for, rather than source of, carbon dioxide by removing sizable amounts of this gas from the atmosphere. Scientists are also looking to biological processes (many of which also serve as carbon dioxide sinks) as complementary or alternative regulating mechanisms of greenhouse gases on the young Earth.",
  "The evolution by photosynthetic bacteria of a new photosynthetic pathway, substituting water (H 2 O) for hydrogen sulfide (H 2 S) as a reducing agent for carbon dioxide, had dramatic consequences for Earth system geochemistry. Molecular oxygen (O 2 ) is given off as a by-product of photosynthesis using the H 2 O pathway, which is energetically more efficient than the more primitive H 2 S pathway. Using H 2 O as a reducing agent in this process led to the large-scale deposition of banded-iron formations , or BIFs, a source of 90 percent of present-day iron ores. Oxygen present in ancient oceans oxidized dissolved iron, which precipitated out of solution onto the ocean floors. This deposition process, in which oxygen was used up as fast as it was produced, continued for millions of years until most of the iron dissolved in the oceans was precipitated. By approximately 2 billion years ago, oxygen was able to accumulate in dissolved form in seawater and to outgas to the atmosphere. Although oxygen does not have greenhouse gas properties, it plays important indirect roles in Earth’s climate , particularly in phases of the carbon cycle . Scientists are studying the role of oxygen and other contributions of early life to the development of the Earth system.",
  "Geochemical and sedimentary evidence indicates that Earth experienced as many as four extreme cooling events between 750 million and 580 million years ago. Geologists have proposed that Earth’s oceans and land surfaces were covered by ice from the poles to the Equator during these events. This “Snowball Earth” hypothesis is a subject of intense study and discussion. Two important questions arise from this hypothesis. First, how, once frozen, could Earth thaw? Second, how could life survive periods of global freezing? A proposed solution to the first question involves the outgassing of massive amounts of carbon dioxide by volcanoes , which could have warmed the planetary surface rapidly, especially given that major carbon dioxide sinks (rock weathering and photosynthesis) would have been dampened by a frozen Earth. A possible answer to the second question may lie in the existence of present-day life-forms within hot springs and deep-sea vents, which would have persisted long ago despite the frozen state of Earth’s surface.",
  "A counter-premise known as the “Slushball Earth” hypothesis contends that Earth was not completely frozen over. Rather, in addition to massive ice sheets covering the continents, parts of the planet (especially ocean areas near the Equator) could have been draped only by a thin, watery layer of ice amid areas of open sea. Under this scenario, photosynthetic organisms in low-ice or ice-free regions could continue to capture sunlight efficiently and survive these periods of extreme cold.",
  "An important new area of research, abrupt climate change, has developed since the 1980s. This research has been inspired by the discovery, in the ice core records of Greenland and Antarctica , of evidence for abrupt shifts in regional and global climates of the past. These events, which have also been documented in ocean and continental records, involve sudden shifts of Earth ’s climate system from one equilibrium state to another. Such shifts are of considerable scientific concern because they can reveal something about the controls and sensitivity of the climate system. In particular, they point out nonlinearities, the so-called “tipping points,” where small, gradual changes in one component of the system can lead to a large change in the entire system. Such nonlinearities arise from the complex feedbacks between components of the Earth system. For example, during the Younger Dryas event ( see below ) a gradual increase in the release of fresh water to the North Atlantic Ocean led to an abrupt shutdown of the thermohaline circulation in the Atlantic basin. Abrupt climate shifts are of great societal concern, for any such shifts in the future might be so rapid and radical as to outstrip the capacity of agricultural, ecological, industrial, and economic systems to respond and adapt. Climate scientists are working with social scientists, ecologists, and economists to assess society’s vulnerability to such “climate surprises.”",
  " The Younger Dryas event (12,900 to 11,600 years ago) is the most intensely studied and best-understood example of abrupt climate change. The event took place during the last deglaciation, a period of global warming when the Earth system was in transition from a glacial mode to an interglacial one. The Younger Dryas was marked by a sharp drop in temperatures in the North Atlantic region; cooling in northern Europe and eastern North America is estimated at 4 to 8 °C (7.2 to 14.4 °F). Terrestrial and marine records indicate that the Younger Dryas had detectable effects of lesser magnitude over most other regions of Earth. The termination of the Younger Dryas was very rapid, occurring within a decade. The Younger Dryas resulted from an abrupt shutdown of the thermohaline circulation in the North Atlantic, which is critical for the transport of heat from equatorial regions northward (today the Gulf Stream is a part of that circulation). The cause of the shutdown of the thermohaline circulation is under study; an influx of large volumes of freshwater from melting glaciers into the North Atlantic has been implicated, although other factors probably played a role.",
  "Paleoclimatologists are devoting increasing attention to identifying and studying other abrupt changes. The Dansgaard-Oeschger cycles of the last glacial period are now recognized as representing alternation between two climate states, with rapid transitions from one state to the other. A 200-year-long cooling event in the Northern Hemisphere approximately 8,200 years ago resulted from the rapid draining of glacial Lake Agassiz into the North Atlantic via the Great Lakes and St. Lawrence drainage. This event, characterized as a miniature version of the Younger Dryas, had ecological impacts in Europe and North America that included a rapid decline of hemlock populations in New England forests. In addition, evidence of another such transition, marked by a rapid drop in the water levels of lakes and bogs in eastern North America, occurred 5,200 years ago. It is recorded in ice cores from glaciers at high altitudes in tropical regions as well as tree-ring, lake-level, and peatland samples from temperate regions.",
  "Abrupt climatic changes occurring before the Pleistocene have also been documented. A transient thermal maximum has been documented near the Paleocene-Eocene boundary (56 million years ago), and evidence of rapid cooling events are observed near the boundaries between both the Eocene and Oligocene epochs (33.9 million years ago) and the Oligocene and Miocene epochs (23 million years ago). All three of these events had global ecological, climatic, and biogeochemical consequences. Geochemical evidence indicates that the warm event occurring at the Paleocene-Eocene boundary was associated with a rapid increase in atmospheric carbon dioxide concentrations, possibly resulting from the massive outgassing and oxidation of methane hydrates (a compound whose chemical structure traps methane within a lattice of ice) from the ocean floor. The two cooling events appear to have resulted from a transient series of positive feedbacks among the atmosphere, oceans, ice sheets, and biosphere, similar to those observed in the Pleistocene. Other abrupt changes, such as the Paleocene-Eocene Thermal Maximum, are recorded at various points in the Phanerozoic.",
  "Abrupt climate changes can evidently be caused by a variety of processes. Rapid changes in an external factor can push the climate system into a new mode. Outgassing of methane hydrates and the sudden influx of glacial meltwater into the ocean are examples of such external forcing. Alternatively, gradual changes in external factors can lead to the crossing of a threshold; the climate system is unable to return to the former equilibrium and passes rapidly to a new one. Such nonlinear system behaviour is a potential concern as human activities, such as fossil-fuel combustion and land-use change, alter important components of Earth’s climate system.",
  "Humans and other species have survived countless climatic changes in the past, and humans are a notably adaptable species. Adjustment to climatic changes, whether it is biological (as in the case of other species) or cultural (for humans), is easiest and least catastrophic when the changes are gradual and can be anticipated to large extent. Rapid changes are more difficult to adapt to and incur more disruption and risk. Abrupt changes, especially unanticipated climate surprises, put human cultures and societies, as well as both the populations of other species and the ecosystems they inhabit, at considerable risk of severe disruption. Such changes may well be within humanity’s capacity to adapt, but not without paying severe penalties in the form of economic, ecological, agricultural, human health, and other disruptions. Knowledge of past climate variability provides guidelines on the natural variability and sensitivity of the Earth system. This knowledge also helps identify the risks associated with altering the Earth system with greenhouse gas emissions and regional to global-scale changes in land cover.",
  "Overviews of Earth’s climate system combined with a general treatment of climate variation since the Pleistocene Epoch are provided in William F. Ruddiman , Earth’s Climate: Past and Future , 2nd ed. (2008); Tjeerd H. van Andel , New Views on an Old Planet: A History of Global Change , 2nd ed. (1994); and Richard B. Alley , The Two-Mile Time Machine: Ice Cores, Abrupt Climate Change, and Our Future (2000). The impacts of recent climate variation and change upon society are considered in César N. Caviedes , El Niño in History: Storming Through the Ages (2001); Brian Fagan , Floods, Famines, and Emperors: El Niño and the Fate of Civilizations (1999); and Mike Davis , Late Victorian Holocausts: El Niño Famines and the Making of the Third World (2001). A discussion of the cultural and historical effects of the Medieval Warm Period and Little Ice Age is provided in Brian Fagan , The Little Ice Age: How Climate Made History, 1300–1850 (2000).",
  "More advanced treatments of recent climate variation include Vera Markgraf (ed.), Interhemispheric Climate Linkages (2001); Neil Roberts , The Holocene: An Environmental History , 2nd ed. (1998); H.E. Wright, Jr., et al. (eds.), Global Climates Since the Last Glacial Maximum (1993); Jean M. Grove , Little Ice Ages: Ancient and Modern , 2nd ed. (2004); Anson Mackay et al. (eds.), Global Change in the Holocene (2005); and The National Research Council , Surface Temperature Reconstructions for the Last 2,000 Years (2006). Past climate variation within the context of future climate change is presented in the Intergovernmental Panel on Climate Change: Working Group I , Climate Change 2007: The Physical Science Basis: Summary for Policymakers: Fourth Assessment Report (2007). A general review of abrupt climate change is provided in John D. Cox , Climate Crash: Abrupt Climate Change and What It Means for Our Future (2007); and a more technical treatment can be found in The National Research Council , Abrupt Climate Change: Inevitable Surprises (2002).",
  "The development of early life and its effects on Earth’s oceans and atmosphere are discussed in Andrew H. Knoll , Life on a Young Planet: The First Three Billion Years of Evolution on Earth (2005). Pre-Pleistocene climates are summarized in Thomas J. Crowley and Gerald R. North , Paleoclimatology (1991); and Lawrence A. Frakes , Jane E. Francis and Jozef I. Syktus , Climate Modes of the Phanerozoic: The History of Earth’s Climate over the Past 600 Million Years (1992). Methods of pre-Pleistocene climate investigation are thoroughly discussed in Judith Totman Parrish , Interpreting Pre-Quaternary Climate from the Geologic Record (1998). A highly readable narrative that considers the 19th-century and early to mid-20th-century development of ideas surrounding the orbital forcing of climate is provided in John Imbrie and Katherine Palmer Imbrie , Ice Ages: Solving the Mystery (1979, reissued 1986)."
]