[
  " Banks of the Seine in Autumn  aerial perspective , also called atmospheric perspective , method of creating the illusion of depth, or recession, in a painting or drawing by modulating colour to simulate changes effected by the atmosphere on the colours of things seen at a distance. Although the use of aerial perspective has been known since antiquity, Leonardo da Vinci first used the term aerial perspective in his Treatise on Painting , in which he wrote: “Colours become weaker in proportion to their distance from the person who is looking at them.” It was later discovered that the presence in the atmosphere of moisture and of tiny particles of dust and similar material causes a scattering of light as it passes through them, the degree of scattering being dependent on the wavelength , which corresponds to the colour, of the light. Because light of short wavelength—blue light—is scattered most, the colours of all distant dark objects tend toward blue; for example, distant mountains have a bluish cast. Light of long wavelength—red light—is scattered least; thus, distant bright objects appear redder because some of the blue is scattered and lost from the light by which they are seen.",
  " Landscape with the Flight into Egypt  The intervening atmosphere between a viewer and, for example, distant mountains, creates other visual effects that can be mimicked by landscape painters. The atmosphere causes distant forms to have less distinct edges and outlines than forms near the viewer, and interior detail is similarly softened or blurred. Distant objects appear somewhat lighter than objects of similar tone lying closer at hand, and in general contrasts between light and shade appear less extreme at great distances. All these effects are more apparent at the base of a mountain than at its peak, since the density of the intervening atmosphere is greater at lower elevations.",
  "Examples of aerial perspective have been found in ancient Greco-Roman wall paintings. The techniques were lost from European art during the “Dark” and Middle Ages and were rediscovered by Flemish painters of the 15th century (such as Joachim Patinir ), after which they became a standard element in the European painter’s technical vocabulary . The 19th-century British landscape painter J.M.W. Turner made perhaps the boldest and most ambitious use of aerial perspective among Western artists. Aerial perspective was used with great sophistication and pictorial effectiveness by Chinese landscape painters from about the 8th century on."
]