[
  "  heart , organ that serves as a pump to circulate the blood . It may be a straight tube, as in spiders and annelid worms, or a somewhat more elaborate structure with one or more receiving chambers (atria) and a main pumping chamber (ventricle), as in mollusks. In fishes the heart is a folded tube, with three or four enlarged areas that correspond to the chambers in the mammalian heart. In animals with lungs —amphibians, reptiles, birds, and mammals—the heart shows various stages of evolution from a single to a double pump that circulates blood (1) to the lungs and (2) to the body as a whole.",
  "In humans and other mammals and in birds, the heart is a four-chambered double pump that is the centre of the circulatory system . In humans it is situated between the two lungs and slightly to the left of centre, behind the breastbone; it rests on the diaphragm , the muscular partition between the chest and the abdominal cavity.",
  "The heart consists of several layers of a tough muscular wall, the myocardium. A thin layer of tissue, the pericardium, covers the outside, and another layer, the endocardium, lines the inside. The heart cavity is divided down the middle into a right and a left heart, which in turn are subdivided into two chambers. The upper chamber is called an atrium (or auricle), and the lower chamber is called a ventricle . The two atria act as receiving chambers for blood entering the heart; the more muscular ventricles pump the blood out of the heart.",
  "    The heart, although a single organ, can be considered as two pumps that propel blood through two different circuits. The right atrium receives venous blood from the head, chest, and arms via the large vein called the superior vena cava and receives blood from the abdomen, pelvic region, and legs via the inferior vena cava. Blood then passes through the tricuspid valve to the right ventricle, which propels it through the pulmonary artery to the lungs. In the lungs venous blood comes in contact with inhaled air, picks up oxygen, and loses carbon dioxide. Oxygenated blood is returned to the left atrium through the pulmonary veins. Valves in the heart allow blood to flow in one direction only and help maintain the pressure required to pump the blood.",
  "The low-pressure circuit from the heart (right atrium and right ventricle), through the lungs, and back to the heart (left atrium) constitutes the pulmonary circulation. Passage of blood through the left atrium, bicuspid valve, left ventricle, aorta , tissues of the body, and back to the right atrium constitutes the systemic circulation. Blood pressure is greatest in the left ventricle and in the aorta and its arterial branches. Pressure is reduced in the capillaries (vessels of minute diameter) and is reduced further in the veins returning blood to the right atrium.",
  "    The pumping of the heart, or the heartbeat, is caused by alternating contractions and relaxations of the myocardium. These contractions are stimulated by electrical impulses from a natural pacemaker, the sinoatrial, or S-A, node located in the muscle of the right atrium. An impulse from the S-A node causes the two atria to contract, forcing blood into the ventricles. Contraction of the ventricles is controlled by impulses from the atrioventricular, or A-V, node located at the junction of the two atria. Following contraction, the ventricles relax, and pressure within them falls. Blood again flows into the atria, and an impulse from the S-A starts the cycle over again. This process is called the cardiac cycle. The period of relaxation is called diastole. The period of contraction is called systole. Diastole is the longer of the two phases so that the heart can rest between contractions. In general, the rate of heartbeat varies inversely with the size of the animal. In elephants it averages 25 beats per minute, in canaries about 1,000. In humans the rate diminishes progressively from birth (when it averages 130) to adolescence but increases slightly in old age; the average adult rate is 70 beats at rest. The rate increases temporarily during exercise , emotional excitement, and fever and decreases during sleep . Rhythmic pulsation felt on the chest, coinciding with heartbeat, is called the apex beat. It is caused by pressure exerted on the chest wall at the outset of systole by the rounded and hardened ventricular wall.",
  "  The rhythmic noises accompanying heartbeat are called heart sounds. Normally, two distinct sounds are heard through the stethoscope : a low, slightly prolonged “lub” (first sound) occurring at the beginning of ventricular contraction, or systole, and produced by closure of the mitral and tricuspid valves, and a sharper, higher-pitched “dup” (second sound), caused by closure of aortic and pulmonary valves at the end of systole. Occasionally audible in normal hearts is a third soft, low-pitched sound coinciding with early diastole and thought to be produced by vibrations of the ventricular wall. A fourth sound, also occurring during diastole, is revealed by graphic methods but is usually inaudible in normal subjects; it is believed to be the result of atrial contraction and the impact of blood, expelled from the atria, against the ventricular wall.",
  "Heart “murmurs” may be readily heard by a physician as soft swishing or hissing sounds that follow the normal sounds of heart action. Murmurs may indicate that blood is leaking through an imperfectly closed valve and may signal the presence of a serious heart problem. Coronary heart disease , in which an inadequate supply of oxygen-rich blood is delivered to the myocardium owing to the narrowing or blockage of a coronary artery by fatty plaques, is a leading cause of death worldwide."
]