[
  " Japanese performing arts , the varied and technically complex dance and theatre arts of Japan . Among the most important of these are Noh theatre or dance drama , Kabuki , and Bunraku .",
  "From prehistoric times, dances have served as an intermediary between humans and the gods in Japan. Kagura dances dedicated to native deities and performed at the imperial court or in villages before local Shintō shrines are in essence a symbolic reenactment of the propitiatory dance that lured the sun goddess Amaterasu from the cave in ancient myth. Although kagura dance has been influenced by later more sophisticated dance forms, it is still performed much as it was 1,500 years ago, to religious chants accompanied by drums , brass gongs , and flutes . At the same time, villagers had their rice-planting dances, performed either at New Year’s as a prayer for good planting or during the planting season in early summer. These lively dances were later, in the 14th century, brought to the cities and performed as court entertainment and called dengaku (“field music”).",
  "A massive influx into Japan of Chinese and Korean arts and culture occurred between the 6th and the 10th centuries. A Korean performer, Mimaji (Mimashi in Japanese), is credited with having brought the Buddhist gigaku processional dance play to the Japanese court in 612. Mimashi established an official school to train Japanese dancers and musicians in gigaku. Other Korean and Chinese performers from Paekche and Koguryŏ were invited in following years.  Gigaku masks cover the entire head (as do Korean folk masks today). Carved of wood and painted with lacquer, the 223 masks that remain (most in the Shōsō Repository in Nara ) date back to as early as the 7th century. They are superb examples of the art of mask making, strong-featured and beautifully conceived. From a description of a 13th-century performance, gigaku apparently consisted of a succession of scenes enacted as characters passed by. Masks characterized an Aryan-featured dignitary called Baramon (or Brahman, indicating Indian origin), a fierce wrestler, a Buddhist monk, a princess of the state of Wu in China , a bully, a wistful old man, and others. Some scenes were serious, others were earthy slapstick.",
  " bugaku Bugaku   Bugaku court dances introduced from Korea also were patronized by the court. They supplanted gigaku as official court entertainment, and gigaku disappeared as a performing art by the 12th century. It was the custom to have performers of bugaku enter from dressing rooms to the right and the left of the raised platform stage: “right” dances, costumed in orange or red, were those from India , Central Asia, or China proper; “left” dances, costumed in blue-green, were those from Korea and Manchuria. Bugaku is usually performed by groups of four, six, or eight male dancers who move in deliberate, stately steps, repeating movements in the four cardinal directions. Musical accompaniment is by drums, bells, flute, lute, and shō (panpipe). A composition consists of three sections: introduction, development, or “scattering,” and speeding up ( jo-ha-kyū ). Japanese performers and courtiers created new compositions within the old style in the 10th and 11th centuries. Still, bugaku represents a remarkable preservation of ancient Chinese, Indian, and Korean music and dance that have long since disappeared in their countries of origin. Bugaku has been performed by musicians attached to the imperial court and to major Shintō shrines from the 7th century without break to the present day.",
  "Juggling, acrobatics, ropedancing, buffoonery, and puppetry—the “hundred entertainments” of China and called sangaku , “variety arts,” in Japan—became widely popular as well. During the Heian period (794–1185) professional troupes, ostensibly attached to temples and shrines to draw crowds for festival days, combined these lively stage arts, now called sarugaku (literally, monkey or mimic music), with dancing to drums from dengaku and began to perform short plays consisting of alternate sections of dialogue, mimicry, singing, and dancing. Sometime in the 14th century a sarugaku actor from Nara named Kan’ami incorporated in his plays a chanted dance ( kuse-mai or kōwaka-mai ), for the first time creating the possibility of dramatic dance that could carry forward a story. This fusion of dance, drama, and song, which soon came to be known as sarugaku-no-nō , or simply Noh ( nō ), marked a revolutionary advance in Japanese theatrical art. Kan’ami’s son, Zeami , refined the style of performance, composed 50 or more of the finest Noh plays in the repertoire, and wrote fundamental treatises on the art of acting and dramaturgy.",
  "When Zeami was 11, the military ruler of Japan, the shogun Ashikaga Yoshimitsu, saw him perform, became enamoured of the boy’s beauty, and took him into his residence in Kyōto as a companion. For most of his life, Zeami benefited from the patronage and the refined audiences that stemmed from this circumstance. The sarugaku troupe that Kan’ami and, later, Zeami headed was one of four in Nara; the others soon adopted the changes in performing style and the plays created by father and son.",
  "The borrowings of Noh from other arts are many. The exquisite masks for which Noh theatre is famous have a quality of serenity, a neutrality of expression that places them in a rank perhaps unmatched in the world. Yet, historically there is no doubt that they are derived from earlier bugaku and gigaku masks and hence are related, if distantly, to the masks of Korea, China, and India. One evidence of the special development of Noh masks is that they are smaller than previous masks; they cover only the face proper. From bugaku music, Zeami took the three-part structure of the Noh drama. A normal Noh program consists of five plays, which are grouped into three dramatic units: the introduction, the development, and the conclusion. The first play, a “god” play, constitutes the introduction; the second drama, or “warrior” play, is the introduction of the development section; the third, or “woman,” play is the development of the development; the fourth, or “living person,” play is the conclusion of the development; and the fifth, or “demon,” play is the conclusion. Drums and flute were taken over from earlier musical forms, and Noh chanting grew out of Buddhist prayer chants. The songs’ poetic metre of alternating phrases of seven and five syllables had come from China six centuries earlier and was the standard Japanese poetic form. On the other hand, the Noh stage represents an advance on the simple square platform of bugaku. A sharply peaked roof over the stage is supported by four pillars—to help the performer orient himself as he looks out through tiny eye holes in the mask—and a long ramp, hashigakari , emphasizes the entrance of major characters.",
  "Typical of a number of Noh plays that are dramatizations of Chinese history and legends is the 15th-century Yōkihi by Komparu Zenchiku, based on the 9th-century narrative poem Chang hen ge (“The Song of Everlasting Sorrow”) by Bai Juyi. The original describes Emperor Xuanzong ’s love for his concubine Yang Guifei (Yōkihi in Japanese). The Noh play emphasizes the Buddhist sentiment of the evanescence of mortal life and the inevitability of pain and sadness. Every Noh play contains Chinese poems, quoted verbatim or paraphrased so as to appeal to the educated spectator. It was a first principle of dramatic writing, said Zeami, to base a play on a well-known incident in which the central character was familiar to the audience. Zeami’s plays emphasized the quality of restrained beauty ( yūgen ), a concept derived in part from Zen Buddhism. Later plays, especially those by Kanze Kojirō Nobumitsu (1435–1516), such as Momijigari ( The Maple Viewing ) and Ataka ( The Ataka Barrier ), emphasize action and spectacle ( fūryū ).",
  " kyōgen kyōgen  On the usual Noh program, each play was followed by a kyōgen farce comedy, performed not by the chief ( shite ) or supporting ( waki ) actors of Noh but by kyōgen actors, who also acted the roles of villagers or fishermen in Noh plays. The antecedents of kyōgen cannot be described with certainty, but it is probable that kyōgen ’s short sketches of master-servant quarrels, husband-wife arguments, animal fables, and scenes of rustic life derive from early sangaku entertainments. A few kyōgen plays are accompanied by the drums and flute of Noh. The ritual play Okina , performed as an auspicious prayer for longevity at the beginning of a Noh- kyōgen program, is in both repertoires, and some suggest that the kyōgen version is the older. The style of kyōgen music ( koutai ) is distinct from that of Noh music; it is derived directly from popular songs. Kyōgen plays with music are, however, a rarity. The usual play is a straight dialogue drama, making it perhaps the oldest developed form of nonmusical play in East Asia. Dialogue is composed in colloquial language of the 15th century, in short phrases suitable for comedy. Movement is highly stylized, again for comic effect. Masks may be worn for the roles of animals and demons, but most roles are played unmasked. Kyōgen texts do not seem to have been committed to writing until the 16th century, suggesting that actors traditionally ad-libbed their parts. Today kyōgen actors commit lines to memory.",
  "Noh and kyōgen were dance and theatre forms that had come to express the gravity and decorum of a rigidly formal samurai ruling class by the end of the Azuchi-Momoyama period (1574–1600). Artistically severe and highly disciplined, Noh was imbued with the sternly pessimistic philosophy of Buddhism. In content, Noh plays taught the folly of worldly power and position, that time destroys all living things. The heroes of play after play pray for the divine intercession of Amida ( Amitābha ) in order that they, tormented ghosts of dead warriors and court ladies, may break free of earthly attachments and achieve Buddhist salvation. In contrast to this, commoners of the cities in the late 16th century began to perform their own dances and plays that were up-to-date, lively, exciting, and at times morally licentious. They were intended to appeal to literate townsmen, well-to-do wives of merchants, workers, and the fops, wits, and dandies of the burgeoning cities.",
  "During the Tokugawa period (1603–1867) Noh was assiduously cultivated by samurai as a refined accomplishment. Commoners were forbidden by law to study Noh and were excluded from performances except on special “subscription” occasions, when any person, high or low in rank, could see Noh performed outdoors in a large enclosure. Noh became the exclusive theatre art of the warrior class, while bugaku continued as the chief performing art of the imperial court.",
  "The earliest important urban entertainments of the commoner in Japan were secularized forms of Buddhist dance plays ( ennen ) and folk dances ( yayako odori and kaka odori ) that came to be called fūryū (“drifting on the wind”) dances. They were enormously popular.",
  "  In 1603 several kinds of urban dances were arranged by a young woman named Okuni into a new dance, called Kabuki. Other troupes of female prostitute-performers adopted the sensuous and popular style of Okuni’s Kabuki dance. A scroll of the period shows Okuni as a young, fashionably dressed samurai, indolently leaning on a sword, dallying with a teahouse girl. Around her neck hangs a Christian crucifix, not as a religious article but as an exotic decoration recently introduced by “southern barbarian” Portuguese merchants. Other pictures of the time show young women playing the three-stringed samisen as they recline sensuously on tiger skins, dancing girls circling about them. Audiences of monks, warriors, young lovers, and townsmen gaze raptly at this appealing and even bizarre sight. The original sensuous appeal of women’s Kabuki continued long after women were banned from the stage in 1629. From about Okuni’s time until 1652, troupes of boy prostitutes performed graceful Kabuki dances to samisen music to attract customers. The appearance of professional women and boy performers in Kabuki was a phenomenon of urban society. In the past, men alone had performed gigaku , bugaku , Noh, and kyōgen . Court nobles and samurai lords had always been able to take mistresses in any number they wished; now the commoner and townsman could, with his new wealth, purchase the favour of a newly risen class of women whose role was to cater to their desires. In the same way, taking young boys as sexual companions, which was common practice among the Buddhist clergy and the warrior class (e.g., Zeami’s relationship with the shogun Yoshimitsu), became a feature of Japanese urban life.",
  "In 1653, when the authorities required Kabuki to be performed by adult males, Kabuki began to develop as a serious art. During the Genroku era (1688–1703) most of Kabuki’s essential characteristics were established. Large commercial theatre buildings holding several thousand spectators were constructed in the three major cities—Edo ( Tokyo ), Kyōto, and Ōsaka . The stage, which previously had been simply a copy of the Noh stage, became wider and deeper and was equipped with a draw curtain to separate acts; and in the early 1700s a ramp ( hanamichi ) was constructed from the rear of the auditorium to the stage for actors’ entrances and exits. The idea of the rampway came from the Noh hashigakari , but, in typical Kabuki fashion, it was transformed into an infinitely more theatrical device. From the puppet theatre, Kabuki borrowed the use of fairly elaborate scenery, the revolving stage (100 years before its use in Europe), traps, and lifts. To the old Noh drums and flute were added the new samisen, a large drum, a dozen bells, cymbals, gongs, and two types of wooden clappers, making the resulting music flexible and varied.",
  "Noh and kyōgen plays were often performed as Kabuki in the early decades. A print from about 1670 shows Kabuki actors performing Sumidagawa ( The Sumida River ), with costumes and properties modeled closely on the Noh original. But it was not considered proper for “beggars of the riverbed,” as Kabuki actors were called, to stage the art which had become the exclusive privilege of the warrior class. By the Genroku period (1688–1704), new Kabuki dramatic styles had emerged. The actor Sakata Tōjūrō (1647–1709) developed a relatively realistic, gentle style of acting ( wagoto ) for erotic love stories in Kyōto, while in Edo a stylized, bravura style of acting ( aragoto ) was created at almost the same time by the actor Ichikawa Danjūrō I (1660–1704) for bombastic fighting plays. In the play Sukeroku yukari no Edo zakura ( Sukeroku: Flower of Edo ) written by Tsuuchi Jihei II in 1713, the two styles are blended most successfully. The hero, Sukeroku, is a swaggering young dandy and lover acted largely in the Edo style, while Sukeroku’s brother, Shimbei, is a meek, gently comic foil in the Kyōto style. Genroku-period Kabuki plays are lusty and active and contain much verbal and physical humour.",
  "Kabuki theatres were required to be built in special entertainment quarters (near licensed quarters for prostitution), along with puppet theatres. Puppets, imported from Korea centuries earlier, were fused with epic storytelling and the resulting narrated play accompanied by samisen music sometime before 1600. The earliest tales were about the princess Jōruri (hence, jōruri as another name for puppet plays). This and other legends were in the nature of Buddhist miracle stories, the obligatory scene being one in which Buddha sacrifices himself or otherwise brings to life one of the main characters. Simple doll puppets, held overhead by one man, animated these blood-and-thunder kojōruri (“old jōruri ”) puppet plays.",
  "A new style of puppet play was created in 1686 by the writer Chikamatsu Monzaemon (1653–1725) and the chanter Takemoto Gidayū at the Takemoto Puppet Theatre in Ōsaka, the city which became the home of puppet theatre in Japan. The chanter is responsible not only for narrating the play but for providing the voices of all the puppet characters as well; Gidayū’s expressive delivery style remains influential to this day. Chikamatsu went on to become Japan’s most famous playwright. Although he is best known for his puppet plays, he wrote Kabuki plays as well, most of them for Sakata Tōjūrō. From Tōjūrō, Chikamatsu learned the soft style of Kabuki performance and the situation that is so unique to early Kabuki, in which a comic lover visits a courtesan in the licensed quarter and quarrels with her. Between Sonezaki shinjū ( Love Suicides at Sonezaki ), written in 1703, and Shinjū ten no Amijima ( Love Suicides at Amijima ), written in 1721 three years before his death, Chikamatsu composed for the puppet theatre a dozen domestic tragedies handling the theme of lovers’ suicide. As early as 1678, Kabuki plays were dramatizing current city scandals, lovers’ suicides, murders, and tragic deaths. One of the most characteristic features of Kabuki was its contemporaneous dramatic subject matter; puppet drama was much changed when Chikamatsu brought this quality from Kabuki into his puppet plays.",
  "The puppet theatre underwent significant physical change when the puppet operators, samisen player, and chanter were made fully visible to the audience in 1705. In the 1720s and ’30s puppet plays gradually became more dramatic and less narrative under the influence of Kabuki. A revolutionary three-man puppet was created in which mouth, eyes, eyebrows, and fingers could move, encouraging writers to compose dramatic plays calling for complex emotional expression. A theatre manager and writer, Takeda Izumo II (1691–1756), collaborated with several other authors on all-day history plays, the so-called “Three Great Masterpieces” of puppet drama: Sugawara denju tenarai kagami (1746; The Secret of Sugawara’s Calligraphy ), Yoshitsune sembonzakura (1747; Yoshitsune and the Thousand Cherry Trees ), and Kanadehon chūshingura (1748; Chūshingura: The Treasury of Loyal Retainers ). The latter is the best-loved and most often performed drama ever written in Japan; it typifies mature puppet drama. It is based on actual events that occurred from 1701 to 1703: 46 retainers avenged the death of their lord by killing his enemy and were then sentenced to commit seppuku, or ritual suicide by disembowelment. (A 47th conspirator was not involved in the actual killing.) The major scenes of the suicides of the lord Hangan and his retainer Kampei are intensely emotional scenes of self-sacrifice. Such scenes normally occur as the final section of the third act in a five-act history play and are called sewa (“family”) scenes because, although the figures are samurai, tearful family separation is the emphasis of the scene. Ichinotani futaba gunki (1751; Chronicle of the Battle of Ichinotani ) contains a migawari (“child substitution”) scene, typical of puppet history plays, which is, if anything, even more tear-provoking: in response to the wishes of his lord Yoshitsune, General Kumagai slays his own son, so that the son’s head may be substituted for that of a prince who has been condemned to die. Although the puppet plays’ emotionalism and lack of humour were foreign to Kabuki, the serious dramas were so popular with audiences that they were adopted, with changes, to Kabuki. Today the best puppet plays are equally a part of the Kabuki and puppet theatre repertoires.",
  " c.  During the 19th century the most important Kabuki dramas were written in Edo, by Tsuruya Namboku IV and Kawatake Mokuami. They wrote all the standard types of Kabuki play— sewamono (domestic), jidaimono (history), and shosagoto (dance plays)—in large numbers; each wrote between 150 and 200 plays in his professional career. They spent their lives in the Kabuki theatre as writers. Although neither was formally educated, their plays reflect with great discernment the desperate social conditions that prevailed as the feudal system in Japan neared its collapse. Thieves, prostitutes, murderers, pimps, and ruthless masterless samurai are major figures in a new type of play, kizewamono, or gangster play, which Namboku created and Mokuami developed. They wrote for the talents of star actors: Namboku wrote for the finest onnagata (female impersonator) of his time, Iwai Hanshirō V, and Mokuami wrote for Ichikawa Danjūrō IX and a remarkable actor of gangster roles, Ichikawa Kodanji IV. Each was a master of Kabuki art, and between them they added new dimensions to Kabuki’s stylized form. Namboku created rhythmic dialogue composed in phrases of seven and five syllables; Mokuami used puppet-style music to heighten the pathos of certain scenes and wrote elaborately conceived major speeches which required exceptional elocutionary skill on the part of the actor.",
  "Noh, puppet theatre, and Kabuki were affected in differing degrees by the abolition of feudalism in 1867. At a stroke, the samurai class was eliminated and Noh lost its base of economic support. Important actors retired to the country to eke out a living as menial workers. For several years Noh was not performed at all, except that Umewaka Minoru, a minor actor, gave public performances in his home and elsewhere between 1868 and 1876. In 1881 a public stage was built in Shiba Park, Tokyo, for performances sponsored by the newly formed Noh Society and by its successor, the Noh Association. The most influential supporter of Noh during the Meiji period (1868–1912) was the aristocrat Iwakura Tomomi. The study of Noh came to be a highly regarded activity among the middle classes, and in time each of the five Noh schools (Kanze, Hōshō, Komparu, Kongō, and Kita) became financially stable, sponsoring its own performances and building its own theatres in the major cities.",
  "The end of feudal society forced Noh to seek and cultivate a new audience; the popular audience of Kabuki and the puppet theatre, however, continued with little change during the Meiji period. Kabuki audiences remained large and loyal, but audiences for puppet plays continued to decline as they had for the previous hundred years. There was a brief revival of interest in Ōsaka puppet drama in the 1870s under the impetus of the theatre manager Daizō, the fourth Bunrakuken, who called his theatre Bunraku-za (from the name of a troupe organized by Uemura Bunrakuken early in the century). The popular term for puppet drama, Bunraku, dates from this time. Learning to chant puppet texts became a vogue during the late Meiji period. In 1909 the Shōchiku theatrical combine supported performances at the Bunraku Puppet Theatre in Ōsaka, and by 1914 this was the only commercial puppet house remaining.",
  "  As they always had, Kabuki writers and actors of the Meiji period tried to place current events on the stage. Thus, the actor Onoe Kikugorō V began acting in a series of contemporary plays, dressed in daily kimono or Western clothes and with his hair cut Western fashion (the origin of zangirimono , or the so-called “cropped-hair plays”), in the late 19th century. Western influence also was seen in theatre construction, with the first European-style theatre built for Kabuki in Tokyo in 1878. Released from previous government restrictions, Kabuki artists created dance dramas from the Noh play The Maple Viewing and others, in which the elevated tone of the Noh original was purposely retained. Kabuki attendance was more than a million spectators yearly. But, in spite of prosperity and seeming adaptation to new conditions, by the early decades of the 20th century, new artistic creation in Kabuki reached an impasse, and thereafter Kabuki became restricted almost as much as Bunraku and Noh to a classic repertoire of plays.",
  "Scholars and artists, learning of Western drama, organized successive groups designed to reform Kabuki—that is, to eliminate excessive stylization and to press for a more realistic manner of performance. The actor Ichikawa Danjūrō IX acted in historically accurate (and reportedly dull) katsureki geki (“living history” plays) written by the journalist Fukuchi Ōchi. Three shin Kabuki (“new Kabuki” plays) written by the scholar Tsubouchi Shōyō were influenced by Shakespeare, whose plays Tsubouchi was then translating. In 1908 a young actor, Ichikawa Sadanji II, returned from a year’s study and observation in Europe. These and other influences produced few long-lasting changes in Kabuki, but they did set the stage for the creation of new kinds of drama that would depart radically from traditional forms.",
  "The first plays in Japan consciously based on Western models were those arranged and acted in by Kawakami Otojirō. Kawakami’s first plays were political and nationalistic in intent. After he and his wife Sada Yakko had performed in Europe and America (1899 and 1902), they introduced to Japan adaptations of Shakespeare , Maurice Maeterlinck , and Victorien Sardou . These shimpa , or “new school,” plays, however, were little more than crude melodramas. Yakko and other actresses performing in shimpa marked the first time women had appeared on the professional stage since Okuni’s time. One shimpa troupe continues to perform today, in a style that retains turn-of-the-century sentiment and mannerisms.",
  "In 1906 the Literary Society was established by Tsubouchi Shōyō to train young actors in Western realistic acting, thus beginning the serious study of Western drama. The first modern play ( shingeki ) to be staged in Japan in the Western realistic manner was Ibsen’s John Gabriel Borkman , directed by Osanai Kaoru in 1909 at his Free Theatre, which was modeled on the “free theatres” of Europe. Much to the detriment of shingeki ’s development, major European playwrights—George Bernard Shaw, Anton Chekhov, Leo Tolstoy, Gerhart Hauptmann, Maeterlinck—were chosen for production over aspiring Japanese authors by all the important early troupes: the Art Theatre (1913–19) founded by a Tsubouchi disciple, Shimamura Hōgetsu; the Stage Association; and the Tsukiji Little Theatre (1924–28). The members of shingeki troupes were earnest amateurs, strongly motivated by artistic and social ideals to create a theatre that reflected life in 20th-century Japan. The only early shingeki troupe to survive World War II was the Literary Theatre (1937).",
  "Following Japan’s surrender in 1945, Kabuki and Bunraku plays that the American occupation forces considered feudal, such as Kanjinchō ( The Subscription List ) and Chūshingura: The Treasury of Loyal Retainers, were banned briefly. Since then, Noh and Kabuki have greatly prospered, while Bunraku has become increasingly subsidized. Modern playwrights and performers, many of whom had been jailed or persecuted by Japanese authorities during World War II for liberal and leftist beliefs, were encouraged by the occupation forces. Important shingeki troupes founded in the immediate postwar years include the Actors’ Theatre (1944), directed by Senda Koreya, an expert on the works of Bertolt Brecht; The People’s Theatre, devoted to progressive social and political issues; and Theatre Four Seasons (1953), which specialized first in French drama and later in American musicals. The full range of Japanese modern life was examined in such shingeki plays as Kinoshita Junji’s nostalgic folk drama Yūzuru (1949; Twilight Crane ); Mishima Yukio’s psychological study of cruelty Sado koshaku fujin (1965; Madame de Sade ); Tanaka Chikao’s Maria no kubi (1959; The Head of Mary ), about the bombing of Hiroshima; the Social Realist play Kazanbaichi (1938; Land of Volcanic Ash ) by Kubo Sakae; and Inoue Hisashi’s comic tribute to popular theatre, Keshō (1983; “Makeup”).",
  " Shingeki ’s orthodox realism, its increasing commercialism, and its impotence during the struggle to block the 1960 passage of the United States–Japan Treaty of Mutual Cooperation and Security alienated younger theatre artists. In the 1960s, for both political and artistic reasons, director-authors Suzuki Tadashi, Terayama Shūji, Kara Jūrō, and Ohta Shōgo formed their own acting companies in order to create unique new theatrical works incorporating stylized acting, song, dance, and brilliant stage effects. They believed that it was necessary to turn back to traditional Japanese culture and arts in order to move forward toward a Japanese theatre unfettered by Western models. Social disjuncture and alienation were common themes of the absurdist plays Tomodachi (1967; Friends ), by Abe Kōbō, Betsuyaku Minoru’s Zo (1962; The Elephant ), and Satoh Makoto’s Atashi no Beatles (1967; My Beatles ).",
  "The most extreme rejection of both Western mimesis and traditional Japanese aesthetics is seen in butō (or ankoku butō , “dance of darkness”; usually Anglicized as Butoh), a postmodern movement begun by Hijikata Tatsumi and Ohno Kazuo in the 1950s in which formal dance technique is eschewed and primal sexuality and the grotesque are explored. The Butoh troupes Sankaijuku, Dairakudakan, and Byakko-sha, as well as individual dancers such as Tanaka Min, often toured Europe and the United States.",
  "In some ways the effects of modernization on the performing arts in 20th-century Japan was great. In the 1950s the country’s motion-picture industry was the second largest in the world, only to be displaced by television, which saturated every corner of Japan by the end of the 1960s. Yet attendance for live theatre did not decline. On the contrary, in the general affluence of Japanese society of the 1970s and ’80s, attendance continued to grow at almost every type of performance. Overall in Tokyo, some 3,000 live theatre productions were staged annually, and a boom in theatre building added scores of elegant new playing spaces for both traditional and avant-garde performance. Noh and Kabuki dance continued to be avidly studied by thousands of amateurs into the 21st century; three national theatres (built 1966–85) housed subsidized productions of Noh, Kabuki, and Bunraku; lavish theatre and dance festivals annually hosted local and foreign troupes; and international tours regularly introduced Japanese plays and dances to foreign audiences. Live theatre of all types flourished in Japan, each form appealing to its own sector of the overall audience.",
  "Overviews of Japanese performing arts are Benito Ortolani , The Japanese Theatre (1990); Kawatake Toshio ( Toshio Kawatake ), Japan on Stage: Japanese Concepts of Beauty as Shown in the Traditional Theatre (1990; originally published in Japanese, 1982), on the appeal of traditional performance to Japanese and non-Japanese audiences; Jacob Raz , Audience and Actors: A Study of Their Interaction in the Japanese Traditional Theatre (1983); and Yoshinobu Inoura and Kawatake Toshio , A History of Japanese Theater , 2 vol. (1971, reissued in 1 vol. as The Traditional Theater of Japan , 1981).",
  " Masataro Togi , Gagaku: Court Music and Dance (1971), provides an overview of this art form’s various styles and genres.",
  "Studies of the history and interpretation of Noh and kyōgen theatre are found in Monica Bethe and Karen Brazell , Nō as Performance (1978); Donald Keene and Kaneko Hiroshi ( Hiroshi Kaneko ), Nō: The Classical Theatre of Japan , rev. ed. (1973); Kunio Komparu ( Kunio Konparu ), The Noh Theater: Principles and Perspectives (1983; originally published in Japanese, 1980); Thomas Blenman Hare , Zeami’s Style: The Noh Plays of Zeami Motokiyo (1986); Rebecca Teele (compiler), Nō/Kyōgen Masks and Performance (1984), essays by Japanese artists and Western scholars; and J. Thomas Rimer and Yamazaki Masakazu (trans.), On the Art of the Nō Drama: The Major Treatises of Zeami (1984). Collections of plays, all translated from Japanese, include Karen Brazell (ed.), Twelve Plays of the Noh and Kyōgen Theaters (1988); Earle Ernst (ed.), Three Japanese Plays from the Traditional Theatre (1959, reprinted 1976); Donald Keene and Royall Tyler (eds.), Twenty Plays of the Nō Theatre (1970); Don Kenny (compiler), The Kyogen Book: An Anthology of Japanese Classical Comedies (1989); Richard N. McKinnon (compiler), Selected Plays of Kyōgen (1968); Nippon Gakujutsu Shinkōkai , Japanese Noh Drama, 3 vol. (1955–60); and Royall Tyler (ed. and trans.), Japanese Nō Dramas (1992).",
  "Historical and interpretive examinations of Kabuki include Earle Ernst , The Kabuki Theatre (1956, reissued 1974); Masakatsu Gunji and Chiaki Yoshida , Kabuki , trans. from Japanese (1969); Masakatsu Gunji , Buyo: The Classical Dance , trans. from Japanese (1970); and Samuel L. Leiter , Kabuki Encyclopedia (1979). Matazo Nakamura , Kabuki: Backstage, Onstage: An Actor’s Life (1990), is the autobiography of a young actor who entered Kabuki from the outside. Plays with stage directions, all translated from Japanese, include James R. Brandon (ed.), Chūshingura: Studies in Kabuki and the Puppet Theater (1982); James R. Brandon (trans.), Kabuki: Five Classic Plays (1975, reissued 1992); and Samuel L. Leiter (trans.), The Art of Kabuki: Famous Plays in Performance (1979).",
  "Works treating the history and interpretation of Bunraku include Barbara Adachi , The Voices and Hands of Bunraku (1978); Donald Keene and Kaneko Hiroshi ( Hiroshi Kaneko ), Bunraku: The Art of the Japanese Puppet Theatre , rev. ed. (1973); C.J. Dunn , The Early Japanese Puppet Drama (1966); A.C. Scott , The Puppet Theatre of Japan (1963, reissued 1973), a brief history of many puppet forms; and C. Andrew Gerstle , Circles of Fantasy: Convention in the Plays of Chikamatsu (1986). Shuzaburo Hironaga , The Bunraku Handbook (1976). Donald Keene (trans.), Chūshingura: The Treasury of Loyal Retainers , trans. from Japanese (1971, reissued 1981), and Major Plays of Chikamatsu , trans. from Japanese (1961, reissued 1990), are collections of play translations. Individual play translations are available in C. Andrew Gerstle , Kiyoshi Inobe , and William P. Malm , Theater as Music (1990), an examination of a Bunraku play; and in Izumo Takeda , Yoshitsune and the Thousand Cherry Trees , trans. from Japanese and ed. by Stanleigh H. Jones, Jr. (1993), one of the great plays in the puppet repertory.",
  "Modern theatre history and interpretation are explored in Ethan Hoffman et al., Butoh: Dance of the Dark Soul (1987); Susan Blakeley Klein , Ankoku Butō: The Premodern and Postmodern Influences on the Dance of Utter Darkness (1988); Toyotake Komiya , Japanese Music and Drama in the Meiji Era , trans. from Japanese (1956, reissued 1969); J. Thomas Rimer , Toward a Modern Japanese Theatre (1974); Tadashi Suzuki , The Way of Acting (1986; originally published in Japanese, 1984); and Jean Viala and Nourit Masson-Sekine , Butoh: Shades of Darkness (1988). Collections of modern plays translated from Japanese include Kōbō Abe , Friends (1969); David G. Goodman (trans.), After Apocalypse: Four Japanese Plays of Hiroshima and Nagasaki (1986); Kishida Kunio ( Kunio Kishida ), Five Plays (1989); David G. Goodman (ed. and trans.), Japanese Drama and Culture in the 1960’s: The Return of the Gods (1988); Yamazaki Masakazu ( Masakazu Yamazaki ), Mask and Sword (1980); Robert T. Rolf and John K. Gillespie (eds.), Alternative Japanese Drama: Ten Plays (1992); and Ted T. Takaya (ed. and trans.), Modern Japanese Drama: An Anthology (1979)."
]