[
  " Apollo Theater , theatre established in 1913 at 253 West 125th Street in the Harlem district of New York City. It has been a significant venue for African American popular music.",
  "The Apollo was the central theatre on Harlem’s main commercial street, and its position reflects its central role in Harlem’s culture. Designed by New York architect George Keister, the building was leased by Jules Hurtig and Harry Seamon and opened as Hurtig and Seamon’s New (Burlesque) Theater. After a few years it was purchased by a competitor and renamed the 125th Street Apollo Theater. The district surrounding the building was opened up during the 1910s to African Americans making the Great Migration out of the South, and in the 1920s Harlem was transformed into a Black residential and commercial area.",
  "The Apollo was again under new ownership in 1932; burlesque shows began to give way to musical revues, and the theatre’s new owners began to tailor shows to the area’s most recent residents. The building opened its doors to African Americans for the first time on January 26, 1934. That year the long-standing weekly talent show called Amateur Night at the Apollo was born, and one of its early winners was the young Ella Fitzgerald . These Wednesday night shows became legendary, not only for the individuals and groups discovered there (including Lena Horne , Sam Cooke , the Orioles , Marvin Gaye , James Brown , and many others) but also for the highly sophisticated and critical audience that attended. Many performers—including Brown, Moms Mabley , B.B. King , and Clyde McPhatter —recorded live albums at the theatre; these recordings document the Apollo’s trademark performer-audience dialogue.",
  "In addition to introducing a vast number of rising stars, the Apollo quickly became a vital stop for any Black entertainer, and virtually every major African American musical act performed there at least once—as did several white acts (notably Buddy Holly ), who often were booked because they were assumed to be Black. The management maintained a policy of alternating live stage shows with B movies (allegedly to clear the house). The Apollo was the pinnacle of the “chitlin circuit” of venues—including the Regal Theater in Chicago and the Howard Theater in Washington, D.C.—that catered to African American audiences. As a show of respect for its legacy, the building was left untouched during the riots of the 1960s. In 1977 the shows were discontinued, and the theatre was operated (unsuccessfully) as a movie theatre. A year later the building was closed. Purchased by investors in 1981, the Apollo received landmark status in 1983, was renovated, and was reopened to the public in 1985."
]