[
  " John Hersey , in full John Richard Hersey , (born June 17, 1914, Tientsin, China—died March 24, 1993, Key West, Fla., U.S.), American novelist and journalist noted for his documentary fiction about catastrophic events in World War II.",
  "Hersey lived in China, where his father was a secretary for the Young Men’s Christian Association and his mother was a missionary, until he was 10, at which time his family returned to the United States. He graduated from Yale University in 1936, and he served as a foreign correspondent in East Asia, Italy, and the Soviet Union for Time and Life magazines from 1937 to 1946. His early novel A Bell for Adano (1944), depicting the Allied occupation of a Sicilian town during World War II, won a Pulitzer Prize. Hersey’s next books demonstrated his gift for combining a reporter’s skill for relaying facts with imaginative fictionalization. Both The Wall (1950), about the Warsaw ghetto uprisings, and Hiroshima (1946), an objective account of the atomic bomb explosion in that city as experienced by survivors of the blast, are based on fact, but they are also personal stories of survival in Poland and Japan in World War II.",
  "Hersey’s later novels encompass a wide variety of subjects and range from treatments of contemporary political and social issues to moral parables set in the world of the future. These works interweave social criticism and their author’s moralistic aims with imaginative plots and premises. The novel The Call (1985) is largely the expression of its protagonist, an articulate missionary in China whose journals and letters make up much of the book. Blues (1987), a series of dialogues between characters identified only as Fisherman and Stranger, echoes Izaak Walton ’s The Compleat Angler (1653) in its exploration of the practice and philosophy of fishing.",
  "Among the critical works on John Hersey are Nancy L. Huse , The Survival Tales of John Hersey (1983); and David Sanders , John Hersey Revisited (1991)."
]