[
  "  human migration , the permanent change of residence by an individual or group; it excludes such movements as nomadism, migrant labour, commuting, and tourism, all of which are transitory in nature.",
  "A brief treatment of human migration follows. For further discussion, see  population: Migration .",
  "Migrations fall into several broad categories. First, internal and international migration may be distinguished. Within any country there are movements of individuals and families from one area to another (for example, from rural areas to the cities), and this is distinct from movements from one country to another. Second, migration may be voluntary or forced. Most voluntary migration, whether internal or external, is undertaken in search of better economic opportunities or housing. Forced migrations usually involve people who have been expelled by governments during war or other political upheavals or who have been forcibly transported as slaves or prisoners. Intermediate between these two categories are the voluntary migrations of refugees fleeing war, famine , or natural disasters.",
  "Human migrations within recorded history have transformed the entire aspect of lands and continents and the racial, ethnic, and linguistic composition of their populations. The map of Europe , for example, is the product of several major early migrations involving the Germanic peoples , the Slavs , and the Turks, among others. And in the course of 400 years—from the late 16th through the 20th century—the Americas , Australia , Oceania , the northern half of Asia, and parts of Africa were colonized by European migrants. The overseas migration of Europeans during this period totaled about 60 million people.",
  "  The largest migration in history was the so-called Great Atlantic Migration from Europe to North America , the first major wave of which began in the 1840s with mass movements from Ireland and Germany . In the 1880s a second and larger wave developed from eastern and southern Europe; between 1880 and 1910 some 17 million Europeans entered the United States. The total number of Europeans reaching the United States amounted to 37 million between 1820 and 1980.",
  "  From 1801 to 1914 about 7.5 million migrants moved from European to Asiatic Russia (i.e., Siberia ), and between World Wars I and II about 6 million more, not counting innumerable deportees to Soviet labour camps, voluntarily migrated there. Since World War II the largest voluntary migrations have involved groups from developing countries moving to the industrialized nations. Some 13 million migrants became permanent residents of western Europe from the 1960s through the ’80s, and more than 10 million permanent immigrants were admitted legally to the United States in that same period, with illegal immigration adding several millions more.",
  "Slave migrations and mass expulsions also have been part of human history for millennia. The largest slave migrations were probably those compelled by European slave traders operating in Africa from the 16th to the 19th century; perhaps 20 million slaves were consigned to the Americas, though substantial numbers died in the appalling conditions of the Atlantic passage . The largest mass expulsions have probably been those imposed by Nazi Germany, which deported 7–8 million persons during World War II (1939–45), and by the Soviet Union, which forcibly expelled 9–10 million ethnic Germans from eastern Europe into Germany in the closing year of the war and afterward. Some 14 million people fled in one direction or another during the partition of British India into India and Pakistan in the late 1940s. The largest migrations in the second half of the 20th century and the beginning of the 21st century have consisted of refugees fleeing war, such as the estimated 3–4 million people who fled Afghanistan in the 1980s and the 5–6 million who departed Syria in the 2010s.",
  "The dominant trend in internal migration during the 20th century was the movement from rural to urban areas. As a consequence, urban growth since World War II has been very rapid in much of the world, particularly in developing countries."
]