[
  "  hydrocarbon , any of a class of organic chemical compounds composed only of the elements carbon (C) and hydrogen (H). The carbon atoms join together to form the framework of the compound, and the hydrogen atoms attach to them in many different configurations. Hydrocarbons are the principal constituents of petroleum and natural gas . They serve as fuels and lubricants as well as raw materials for the production of plastics , fibres , rubbers , solvents, explosives , and industrial chemicals.",
  "Many hydrocarbons occur in nature. In addition to making up fossil fuels , they are present in trees and plants , as, for example, in the form of pigments called carotenes that occur in carrots and green leaves. More than 98 percent of natural crude rubber is a hydrocarbon polymer , a chainlike molecule consisting of many units linked together. The structures and chemistry of individual hydrocarbons depend in large part on the types of chemical bonds that link together the atoms of their constituent molecules.",
  "Nineteenth-century chemists classified hydrocarbons as either aliphatic or aromatic on the basis of their sources and properties. Aliphatic (from Greek aleiphar , “fat”) described hydrocarbons derived by chemical degradation of fats or oils. Aromatic hydrocarbons constituted a group of related substances obtained by chemical degradation of certain pleasant-smelling plant extracts. The terms aliphatic and aromatic are retained in modern terminology, but the compounds they describe are distinguished on the basis of structure rather than origin.",
  "Aliphatic hydrocarbons are divided into three main groups according to the types of bonds they contain: alkanes, alkenes, and alkynes. Alkanes have only single bonds, alkenes contain a carbon-carbon double bond, and alkynes contain a carbon-carbon triple bond. Aromatic hydrocarbons are those that are significantly more stable than their Lewis structures would suggest; i.e., they possess “special stability.” They are classified as either arenes, which contain a benzene ring as a structural unit, or nonbenzenoid aromatic hydrocarbons, which possess special stability but lack a benzene ring as a structural unit.",
  " ",
  "This classification of hydrocarbons serves as an aid in associating structural features with properties but does not require that a particular substance be assigned to a single class. Indeed, it is common for a molecule to incorporate structural units characteristic of two or more hydrocarbon families. A molecule that contains both a carbon-carbon triple bond and a benzene ring, for example, would exhibit some properties that are characteristic of alkynes and others that are characteristic of arenes.",
  "Alkanes are described as saturated hydrocarbons, while alkenes, alkynes, and aromatic hydrocarbons are said to be unsaturated.",
  "Alkanes, hydrocarbons in which all the bonds are single, have molecular formulas that satisfy the general expression C  n  H 2 n + 2 (where n is an integer). Carbon is s  p  3 hybridized (three electron pairs are involved in bonding, forming a tetrahedral complex), and each C—C and C—H bond is a sigma (σ) bond ( see  chemical bonding ). In order of increasing number of carbon atoms, methane (CH 4 ), ethane (C 2 H 6 ), and propane (C 3 H 8 ) are the first three members of the series.",
  " ",
  "Methane, ethane, and propane are the only alkanes uniquely defined by their molecular formula. For C 4 H 10 two different alkanes satisfy the rules of chemical bonding (namely, that carbon has four bonds and hydrogen has one in neutral molecules). One compound, called n -butane, where the prefix n - represents normal, has its four carbon atoms bonded in a continuous chain. The other, called isobutane, has a branched chain.",
  " ",
  "Different compounds that have the same molecular formula are called isomers . Isomers that differ in the order in which the atoms are connected are said to have different constitutions and are referred to as constitutional isomers. (An older name is structural isomers.) The compounds n -butane and isobutane are constitutional isomers and are the only ones possible for the formula C 4 H 10 . Because isomers are different compounds, they can have different physical and chemical properties. For example, n -butane has a higher boiling point (−0.5 °C [31.1 °F]) than isobutane (−11.7 °C [10.9 °F]).",
  "There is no simple arithmetic relationship between the number of carbon atoms in a formula and the number of isomers. Graph theory has been used to calculate the number of constitutionally isomeric alkanes possible for values of n in C  n  H 2 n + 2 from 1 through 400. The number of constitutional isomers increases sharply as the number of carbon atoms increases. There is probably no upper limit to the number of carbon atoms possible in hydrocarbons. The alkane CH 3 (CH 2 ) 388 CH 3 , in which 390 carbon atoms are bonded in a continuous chain, has been synthesized as an example of a so-called superlong alkane. Several thousand carbon atoms are joined together in molecules of hydrocarbon polymers such as polyethylene , polypropylene , and polystyrene .",
  "The need to give each compound a unique name requires a richer variety of terms than is available with descriptive prefixes such as n - and iso-. The naming of organic compounds is facilitated through the use of formal systems of nomenclature. Nomenclature in organic chemistry is of two types: common and systematic. Common names originate in many different ways but share the feature that there is no necessary connection between name and structure. The name that corresponds to a specific structure must simply be memorized, much like learning the name of a person. Systematic names, on the other hand, are keyed directly to molecular structure according to a generally agreed upon set of rules. The most widely used standards for organic nomenclature evolved from suggestions made by a group of chemists assembled for that purpose in Geneva in 1892 and have been revised on a regular basis by the International Union of Pure and Applied Chemistry (IUPAC). The IUPAC rules govern all classes of organic compounds but are ultimately based on alkane names. Compounds in other families are viewed as derived from alkanes by appending functional groups to, or otherwise modifying, the carbon skeleton.",
  "The IUPAC rules assign names to unbranched alkanes according to the number of their carbon atoms. Methane, ethane, and propane are retained for CH 4 , CH 3 CH 3 , and CH 3 CH 2 CH 3 , respectively. The n - prefix is not used for unbranched alkanes in systematic IUPAC nomenclature; therefore, CH 3 CH 2 CH 2 CH 3 is defined as butane, not n -butane. Beginning with five-carbon chains, the names of unbranched alkanes consist of a Latin or Greek stem corresponding to the number of carbons in the chain followed by the suffix -ane. A group of compounds such as the unbranched alkanes that differ from one another by successive introduction of CH 2 groups constitute a homologous series.",
  "Alkanes with branched chains are named on the basis of the name of the longest chain of carbon atoms in the molecule, called the parent. The alkane shown has seven carbons in its longest chain and is therefore named as a derivative of heptane, the unbranched alkane that contains seven carbon atoms. The position of the CH 3 (methyl) substituent on the seven-carbon chain is specified by a number (3-), called a locant, obtained by successively numbering the carbons in the parent chain starting at the end nearer the branch. The compound is therefore called 3-methylheptane.",
  " ",
  "When there are two or more identical substituents, replicating prefixes (di-, tri-, tetra-, etc.) are used, along with a separate locant for each substituent. Different substituents, such as ethyl (―CH 2 CH 3 ) and methyl (―CH 3 ) groups, are cited in alphabetical order. Replicating prefixes are ignored when alphabetizing. In alkanes, numbering begins at the end nearest the substituent that appears first on the chain so that the carbon to which it is attached has as low a number as possible.",
  " ",
  "Methyl and ethyl are examples of alkyl groups. An alkyl group is derived from an alkane by deleting one of its hydrogens, thereby leaving a potential point of attachment. Methyl is the only alkyl group derivable from methane and ethyl the only one from ethane. There are two C 3 H 7 and four C 4 H 9 alkyl groups. The IUPAC rules for naming alkanes and alkyl groups cover even very complex structures and are regularly updated. They are unambiguous in the sense that, although a single compound may have more than one correct IUPAC name, there is no possibility that two different compounds will have the same name.",
  "  Most organic molecules, including all alkanes, are not planar but are instead characterized by three-dimensional structures. Methane, for example, has the shape of a regular tetrahedron with carbon at the centre and a hydrogen atom at each corner. Each H―C―H angle in methane is 109.5°, and each C―H bond distance is 1.09 angstroms (Å; 1Å = 1 × 10 −10 metre). Higher alkanes such as butane have bonds that are tetrahedrally disposed on each carbon except that the resulting C―C―C and H―C―H angles are slightly larger and smaller, respectively, than the ideal value of 109.5° characteristic of a perfectly symmetrical tetrahedron. Carbon-carbon bond distances in alkanes are normally close to 1.53 angstroms.",
  "    An important aspect of the three-dimensional shape of alkanes and other organic molecules is their conformations, the nonidentical arrangements of atoms that are generated by rotation about single bonds. Of the infinite number of conformations possible for ethane—which are related by tiny increments of rotation of one CH 3 group with respect to the other—the eclipsed conformation is the least stable, and the staggered conformation is the most stable. The eclipsed conformation is said to suffer torsional strain because of repulsive forces between electron pairs in the C―H bonds of adjacent carbons. These repulsive forces are minimized in the staggered conformation since all C―H bonds are as far from one another as possible. Although rotation about the C―C bond of ethane is exceedingly rapid (millions of times per second at room temperature), at any instant most of the molecules exist in the staggered conformation.",
  "For butane, two different staggered conformations, called anti and gauche, are possible. Methyl is a larger substituent than hydrogen, and the greater separation between methyl groups in the anti conformation makes it slightly more stable than the gauche.",
  " ",
  "The three-dimensional structures of higher alkanes are governed by the tetrahedral disposition of the four bonds to each carbon atom, by the preference for staggered conformations, and by the greater stability of anti C―C―C―C arrangements over gauche.",
  "Countless organic compounds are known in which a sequence of carbon atoms, rather than being connected in a chain, closes to form a ring. Saturated hydrocarbons that contain one ring are referred to as cycloalkanes. With a general formula of C  n  H 2 n  ( n is an integer greater than 2), they have two fewer hydrogen atoms than an alkane with the same number of carbon atoms. Cyclopropane (C 3 H 6 ) is the smallest cycloalkane, whereas cyclohexane (C 6 H 12 ) is the most studied, best understood, and most important. It is customary to represent cycloalkane rings as polygons, with the understanding that each corner corresponds to a carbon atom to which is attached the requisite number of hydrogen atoms to bring its total number of bonds to four.",
  " ",
  "In naming cycloalkanes, alkyl groups attached to the ring are indicated explicitly and listed in alphabetical order, and the ring is numbered so as to give the lowest locant to the first-appearing substituent. If two different directions yield equivalent locants, the direction is chosen that gives the lower number to the substituent appearing first in the name.",
  " ",
  "The three carbon atoms of cyclopropane define the corners of an equilateral triangle, a geometry that requires the C―C―C angles to be 60°. This 60° angle is much smaller than the normal tetrahedral bond angle of 109.5° and imposes considerable strain (called angle strain) on cyclopropane. Cyclopropane is further destabilized by the torsional strain that results from having three eclipsed C―H bonds above the plane of the ring and three below.",
  "Cyclopropane is the only cycloalkane that is planar. Cyclobutane (C 4 H 8 ) and higher cycloalkanes adopt nonplanar conformations in order to minimize the eclipsing of bonds on adjacent atoms. The angle strain in cyclobutane is less than in cyclopropane, whereas cyclopentane and higher cycloalkanes are virtually free of angle strain. With the exception of cyclopropane, all cycloalkanes undergo rapid internal motion involving interconversion of nonplanar “puckered” conformations.",
  " ",
  "Many of the most important principles of conformational analysis have been developed by examining cyclohexane. Three conformations of cyclohexane, designated as chair, boat, and skew (or twist), are essentially free of angle strain. Of these three the chair is the most stable, mainly because it has a staggered arrangement of all its bonds. The boat and skew conformations lack perfect staggering of bonds and are destabilized by torsional strain. The boat conformation is further destabilized by the mutual crowding of hydrogen atoms at carbons one and four. The shape of the boat brings its two “flagpole” hydrogen atoms to within 1.80 angstroms of each other, far closer than the 2.20-angstrom distance at which repulsive forces between hydrogen atoms become significant. At room temperature, 999 of every 1,000 cyclohexane molecules exist in the chair form (the other being skew).",
  " ",
  "There are two orientations of carbon-hydrogen bonds in the chair conformation of cyclohexane. Six bonds are parallel to a vertical axis passing through the centre of the ring and are called axial (a) bonds. The directions of these six axial bonds alternate up and down from one carbon to the next around the ring; thus, the axial hydrogens at carbons one, three, and five lie on one side of the ring and those at carbons two, four, and six on the other. The remaining six bonds are referred to as equatorial (e) because they lie in a region corresponding to the approximate “equator” of the molecule. The shortest distances between nonbonded atoms are those involving axial hydrogens on the same side of the molecule.",
  "A rapid process of chair-chair interconversion (called ring-flipping) interconverts the six axial and six equatorial hydrogen atoms in cyclohexane. Chair-chair interconversion is a complicated process brought about by successive conformational changes within the molecule. It is different from simple whole-molecule motions, such as spinning and tumbling, and because it is a conformational change only, it does not require any bonds to be broken.",
  " ",
  "Chair-chair interconversion is especially important in substituted derivatives of cyclohexane. Any substituent is more stable when it occupies an equatorial rather than an axial site on the ring, since equatorial substituents are less crowded than axial ones. In methylcyclohexane, the chair conformation in which the large methyl group is equatorial is the most stable and, therefore, the most populated of all possible conformations. At any instant, almost all the methylcyclohexane molecules in a given sample exist in chair conformations, and about 95 percent of these have the methyl group in an equatorial orientation.",
  " ",
  "The highly branched tert -butyl group (CH 3 ) 3 C― ( tert -butyl) is even more spatially demanding than the methyl group, and more than 99.99 percent of tert -butylcyclohexane molecules adopt chair conformations in which the (CH 3 ) 3 C― group is equatorial.",
  "Conformational analysis of six-membered rings, especially the greater stability of chair conformations with equatorial substituents, not only is important in the area of hydrocarbons but also is essential to an understanding of the properties of biologically important molecules, especially steroids and carbohydrates . Odd Hassel of Norway and Derek H.R. Barton of England shared the Nobel Prize for Chemistry in 1969 for their important discoveries in this area. Hassel’s studies dealt with structure, while Barton showed how conformational effects influence chemical reactivity.",
  "The most stable structures of cycloalkanes and compounds based on them have been determined by a number of experimental techniques, including X-ray diffraction and electron diffraction analyses and infrared, nuclear magnetic resonance , and microwave spectroscopies. These experimental techniques have been joined by advances in computational methods such as molecular mechanics, whereby the total strain energies of various conformations are calculated and compared ( see also  chemical bonding: Computational approaches to molecular structure ). The structure with the lowest total energy is the most stable and corresponds to the best combination of bond distances, bond angles, and conformation. One benefit of such calculations is that unstable conformations, which are difficult to study experimentally, can be examined. The quality of molecular mechanics calculations is such that it is claimed that many structural features of hydrocarbons can be computed more accurately than they can be measured.",
  "The conformations of rings with 7–12 carbons have been special targets for study by molecular mechanics. Unlike cyclohexane, in which one conformation (the chair) is much more stable than any other, cycloalkanes with 7–12 carbons are generally populated by several conformations of similar energy. Rings with more than 12 carbons are sufficiently flexible to adopt conformations that are essentially strain-free.",
  "Polycyclic hydrocarbons are hydrocarbons that contain more than one ring. They are classified as bicyclic, tricyclic, tetracyclic, and so forth, according to the number of formal bond disconnections necessary to produce a noncyclic carbon chain. Examples include trans -decalin and adamantane—both of which are present in small amounts in petroleum —and cubane, a compound synthesized for the purpose of studying the effects of strain on chemical reactivity.",
  " ",
  "Certain substituted derivatives of cycloalkanes exhibit a type of isomerism called stereoisomerism in which two substances have the same molecular formula and the same constitution but differ in the arrangement of their atoms in space. Methyl groups in 1,2-dimethylcyclopropane, for example, may be on the same ( cis ) or opposite ( trans ) sides of the plane defined by the ring. The resulting two substances are different compounds, each having its own properties such as boiling point (abbreviated bp here):",
  " ",
  " Cis - trans isomers belong to a class of stereoisomers known as diastereomers and are often referred to as geometric isomers, although this is an obsolete term. Cis - trans stereoisomers normally cannot be interconverted at room temperature, because to do so requires the breaking and reforming of chemical bonds.",
  "Alkanes and cycloalkanes are nonpolar substances. Attractive forces between alkane molecules are dictated by London forces (or dispersion forces, arising from electron fluctuations in molecules; see  chemical bonding: Intermolecular forces ) and are weak. Thus, alkanes have relatively low boiling points compared with polar molecules of comparable molecular weight. The boiling points of alkanes increase with increasing number of carbons. This is because the intermolecular attractive forces, although individually weak, become cumulatively more significant as the number of atoms and electrons in the molecule increases.",
  "For a given number of carbon atoms, an unbranched alkane has a higher boiling point than any of its branched-chain isomers. This effect is evident upon comparing the boiling points (bp) of selected C 8 H 18 isomers. An unbranched alkane has a more extended shape, thereby increasing the number of intermolecular attractive forces that must be broken in order to go from the liquid state to the gaseous state. On the other hand, the relatively compact ellipsoidal shape of 2,2,3,3-tetramethylbutane permits it to pack into a crystal lattice more effectively than octane and so raises its melting point (mp).",
  " ",
  "In general, solid alkanes do not often have high melting points. Unbranched alkanes tend toward a maximum in that the melting point of CH 3 (CH 2 ) 98 CH 3 (115 °C [239 °F]) is not much different from that of CH 3 (CH 2 ) 148 CH 3 (123 °C [253 °F]).",
  "The viscosity of liquid alkanes increases with the number of carbons. Increased intermolecular attractive forces, as well as an increase in the extent to which nearby molecules become entangled when they have an extended shape, cause unbranched alkanes to be more viscous than their branched-chain isomers.",
  "The densities of liquid hydrocarbons are all less than that of water , which is quite polar and possesses strong intermolecular attractive forces. All hydrocarbons are insoluble in water and, being less dense than water, float on its surface. Hydrocarbons are, however, usually soluble in one another as well as in organic solvents such as diethyl ether (CH 3 CH 2 OCH 2 CH 3 ).",
  "The most abundant sources of alkanes are natural gas and petroleum deposits, formed over a period of millions of years by the decay of organic matter in the absence of oxygen . Natural gas contains 60–80 percent methane , 5–9 percent ethane , 3–18 percent propane , and 2–14 percent higher hydrocarbons. Petroleum is a complex liquid mixture of hundreds of substances—including 150 or more hydrocarbons, approximately half of which are saturated.",
  "Approximately two billion tons of methane are produced annually by the bacteria that live in termites and in the digestive systems of plant-eating animals . Smaller quantities of alkanes also can be found in a variety of natural materials. The so-called aggregation pheromone whereby Blaberus craniifer  cockroaches attract others of the same species is a 1:1 mixture of the volatile but relatively high-boiling liquid alkanes undecane, CH 3 (CH 2 ) 9 CH 3 , and tetradecane, CH 3 (CH 2 ) 12 CH 3 . Hentriacontane, CH 3 (CH 2 ) 29 CH 3 , is a solid alkane present to the extent of 8–9 percent in beeswax , where its stability and impermeability to water contribute to the role it plays as a structural component.",
  "With the exception of the alkanes that are readily available from petroleum, alkanes are synthesized in the laboratory and in industry by the hydrogenation of alkenes. Only a few methods are available in which a carbon-carbon bond-forming operation gives an alkane directly, and these tend to be suitable only for syntheses carried out on a small scale.",
  "As is true for all hydrocarbons, alkanes burn in air to produce carbon dioxide (CO 2 ) and water (H 2 O) and release heat . The combustion of 2,2,4-trimethylpentane is expressed by the following chemical equation:",
  " ",
  "The fact that all hydrocarbon combustions are exothermic is responsible for their widespread use as fuels. Grades of gasoline are rated by comparing their tendency toward preignition or knocking to reference blends of heptane and 2,2,4-trimethylpentane and assigning octane numbers . Pure heptane (assigned an octane number of 0) has poor ignition characteristics, whereas 2,2,4-trimethylpentane (assigned an octane number of 100) resists knocking even in high-compression engines.",
  "As a class, alkanes are relatively unreactive substances and undergo only a few reactions. An industrial process known as isomerization employs an aluminum chloride (AlCl 3 ) catalyst to convert unbranched alkanes to their branched-chain isomers. In one such application, butane is isomerized to 2-methylpropane for use as a starting material in the preparation of 2,2,4-trimethylpentane (isooctane), which is a component of high-octane gasoline.",
  " ",
  "The halogens chlorine (Cl 2 ) and bromine (Br 2 ) react with alkanes and cycloalkanes by replacing one or more hydrogens with a halogen. Although the reactions are exothermic, a source of energy such as ultraviolet light or high temperature is required to initiate the reaction, as, for example, in the chlorination of cyclobutane.",
  " ",
  "The chlorinated derivatives of methane (CH 3 Cl, CH 2 Cl 2 , CHCl 3 , and CCl 4 ) are useful industrially and are prepared by various methods, including the reaction of methane with chlorine at temperatures on the order of 450 °C (840 °F).",
  "The most important industrial organic chemical reaction in terms of its scale and economic impact is the dehydrogenation of ethane (obtained from natural gas) to form ethylene and hydrogen ( see below  Alkenes and alkynes: Natural occurrence and Synthesis ). The hydrogen produced is employed in the Haber-Bosch process for the preparation of ammonia from nitrogen .",
  " ",
  "The higher alkanes present in petroleum also yield ethylene under similar conditions by reactions that involve both dehydrogenation and the breaking of carbon-carbon bonds. The conversion of high-molecular-weight alkanes to lower ones is called cracking .",
  "Alkenes (also called olefins ) and alkynes (also called acetylenes ) belong to the class of unsaturated aliphatic hydrocarbons. Alkenes are hydrocarbons that contain a carbon-carbon double bond, whereas alkynes have a carbon-carbon triple bond. Alkenes are characterized by the general molecular formula C  n  H 2 n  , alkynes by C  n  H 2 n − 2 . Ethene (C 2 H 4 ) is the simplest alkene and ethyne (C 2 H 2 ) the simplest alkyne.",
  " ",
  "Ethylene is a planar molecule with a carbon-carbon double bond length (1.34 angstroms) that is significantly shorter than the corresponding single bond length (1.53 angstroms) in ethane. Acetylene has a linear H―C≡C―H geometry, and its carbon-carbon bond distance (1.20 angstroms) is even shorter than that of ethylene.",
  "The generally accepted bonding model for alkenes views the double bond as being composed of a σ (sigma) component and a π (pi) component. In the case of ethylene, each carbon is s  p  2 hybridized, and each is bonded to two hydrogens and the other carbon by σ bonds. Additionally, each carbon has a half-filled p orbital, the axis of which is perpendicular to the plane of the σ bonds. Side-by-side overlap of these two p orbitals generates a π bond. The pair of electrons in the π bond are equally likely to be found in the regions of space immediately above and below the plane defined by the atoms. Most of the important reactions of alkenes involve the electrons in the π component of the double bond because these are the electrons that are farthest from the positively charged nuclei and therefore the most weakly held.",
  " ",
  "The triple bond of an alkyne consists of one σ and two π components linking two s  p hybridized carbons. In the case of acetylene, the molecule itself is linear with σ bonds between the two carbons and to each hydrogen. Each carbon has two p orbitals, the axes of which are perpendicular to each other. Overlap of two p orbitals, suitably aligned and on adjacent carbons, gives two π bonds.",
  " ",
  "Ethylene and acetylene are synonyms in the IUPAC nomenclature system for ethene and ethyne, respectively. Higher alkenes and alkynes are named by counting the number of carbons in the longest continuous chain that includes the double or triple bond and appending an -ene (alkene) or -yne (alkyne) suffix to the stem name of the unbranched alkane having that number of carbons. The chain is numbered in the direction that gives the lowest number to the first multiply bonded carbon, and adding it as a prefix to the name. Once the chain is numbered with respect to the multiple bond, substituents attached to the parent chain are listed in alphabetical order and their positions identified by number.",
  " ",
  "Compounds that contain two double bonds are classified as dienes, those with three as trienes, and so forth. Dienes are named by replacing the -ane suffix of the corresponding alkane by -adiene and identifying the positions of the double bonds by numerical locants. Dienes are classified as cumulated, conjugated, or isolated according to whether the double bonds constitute a C=C=C unit, a C=C―C=C unit, or a C=C―(CXY)  n  ―C=C unit, respectively.",
  " ",
  "Double bonds can be incorporated into rings of all sizes, resulting in cycloalkenes. In naming substituted derivatives of cycloalkenes, numbering begins at and continues through the double bond.",
  " ",
  "Unlike rotation about carbon-carbon single bonds, which is exceedingly rapid, rotation about carbon-carbon double bonds does not occur under normal circumstances. Stereoisomerism is therefore possible in those alkenes in which neither carbon atom bears two identical substituents. In most cases, the names of stereoisomeric alkenes are distinguished by cis - trans notation. (An alternative method, based on the Cahn-Ingold-Prelog system and using E and Z prefixes, is also used.) Cycloalkenes in which the ring has eight or more carbons are capable of existing as cis or trans stereoisomers. trans -Cycloalkenes are too unstable to isolate when the ring has seven or fewer carbons.",
  " ",
  "Because the C―C≡C―C unit of an alkyne is linear, cycloalkynes are possible only when the number of carbon atoms in the ring is large enough to confer the flexibility necessary to accommodate this geometry. Cyclooctyne (C 8 H 12 ) is the smallest cycloalkyne capable of being isolated and stored as a stable compound.",
  " Ethylene is formed in small amounts as a plant hormone . The biosynthesis of ethylene involves an enzyme -catalyzed decomposition of a novel amino acid , and, once formed, ethylene stimulates the ripening of fruits.",
  " ",
  "Alkenes are abundant in the essential oils of trees and other plants. (Essential oils are responsible for the characteristic odour, or “essence,” of the plant from which they are obtained.) Myrcene and limonene , for example, are alkenes found in bayberry and lime oil, respectively. Oil of turpentine , obtained by distilling the exudate from pine trees, is a mixture of hydrocarbons rich in α- pinene . α-Pinene is used as a paint thinner as well as a starting material for the preparation of synthetic camphor , drugs , and other chemicals.",
  " ",
  "Other naturally occurring hydrocarbons with double bonds include plant pigments such as lycopene , which is responsible for the red colour of ripe tomatoes and watermelon . Lycopene is a polyene (meaning many double bonds) that belongs to a family of 40-carbon hydrocarbons known as carotenes .",
  " ",
  "The sequence of alternating single and double bonds in lycopene is an example of a conjugated system . The degree of conjugation affects the light-absorption properties of unsaturated compounds. Simple alkenes absorb ultraviolet light and appear colourless. The wavelength of the light absorbed by unsaturated compounds becomes longer as the number of double bonds in conjugation with one another increases, with the result that polyenes containing regions of extended conjugation absorb visible light and appear yellow to red.",
  "The hydrocarbon fraction of natural rubber (roughly 98 percent) is made up of a collection of polymer molecules, each of which contains approximately 20,000 C 5 H 8 structural units joined together in a regular repeating pattern.",
  " ",
  "Natural products that contain carbon-carbon triple bonds, while numerous in plants and fungi , are far less abundant than those that contain double bonds and are much less frequently encountered.",
  "The lower alkenes (through four-carbon alkenes) are produced commercially by cracking and dehydrogenation of the hydrocarbons present in natural gas and petroleum ( see above  Alkanes: Chemical reactions ). The annual global production of ethylene averages around 75 million metric tons. Analogous processes yield approximately 2 million metric tons per year of 1,3-butadiene (CH 2 =CHCH=CH 2 ). Approximately one-half of the ethylene is used to prepare polyethylene . Most of the remainder is utilized to make ethylene oxide (for the manufacture of ethylene glycol antifreeze and other products), vinyl chloride (for polymerization to polyvinyl chloride ), and styrene (for polymerization to polystyrene ). The principal application of propylene is in the preparation of polypropylene. 1,3-Butadiene is a starting material in the manufacture of synthetic rubber ( see below  Polymerization ).",
  "Higher alkenes and cycloalkenes are normally prepared by reactions in which a double bond is introduced into a saturated precursor by elimination (i.e., a reaction in which atoms or ions are lost from a molecule).",
  " ",
  "Examples include the dehydration of alcohols    and the dehydrohalogenation (loss of a hydrogen atom and a halogen atom) of alkyl halides.",
  " ",
  "These usually are laboratory rather than commercial methods. Alkenes also can be prepared by partial hydrogenation of alkynes ( see below  Chemical properties ).",
  "Acetylene is prepared industrially by cracking and dehydrogenation of hydrocarbons as described for ethylene ( see above  Alkanes: Chemical reactions ). Temperatures of about 800 °C (1,500 °F) produce ethylene; temperatures of roughly 1,150 °C (2,100 °F) yield acetylene. Acetylene, relative to ethylene, is an unimportant industrial chemical. Most of the compounds capable of being derived from acetylene are prepared more economically from ethylene, which is a less expensive starting material. Higher alkynes can be made from acetylene ( see below  Chemical properties ) or by double elimination of a dihaloalkane (i.e., removal of both halogen atoms from a disubstituted alkane).",
  " ",
  "The physical properties of alkenes and alkynes are generally similar to those of alkanes or cycloalkanes with equal numbers of carbon atoms. Alkynes have higher boiling points than alkanes or alkenes, because the electric field of an alkyne, with its increased number of weakly held π electrons , is more easily distorted, producing stronger attractive forces between molecules.",
  "Alkenes react with a much richer variety of compounds than alkanes. The characteristic reaction of alkanes is substitution ; that of alkenes and alkynes is addition to the double or triple bond. Hydrogenation is the addition of molecular hydrogen (H 2 ) to a multiple bond, which converts alkenes to alkanes. The reaction occurs at a convenient rate only in the presence of certain finely divided metal catalysts, such as nickel (Ni), platinum (Pt), palladium (Pd), or rhodium (Rh).",
  " ",
  "Hydrogenation is used to prepare alkanes and cycloalkanes and also to change the physical properties of highly unsaturated vegetable oils to increase their shelf life. In such processes the liquid oils are converted to fats of a more solid consistency. Butter substitutes such as margarine are prepared by partial hydrogenation of soybean oil.",
  "Significant progress has been made in developing catalysts for enantioselective hydrogenation. An enantioselective hydrogenation is a hydrogenation in which one enantiomer of a chiral molecule (a molecule that can exist in two structural forms, or enantiomers) is formed in greater amounts than the other. This normally involves converting one of the carbons of the double bond to a stereogenic centre.",
  "Typical catalysts for enantioselective hydrogenation are based on enantiomerically homogeneous ligands bonded to rhodium . Enantioselectivities exceeding 90 percent of a single enantiomer are commonplace in enantioselective hydrogenations, a major application of which is in the synthesis of enantiomerically pure drugs.",
  "The halogens bromine and chlorine add to alkenes to yield dihaloalkanes. Addition is rapid even at room temperature and requires no catalyst. The most important application of this reaction is the addition of chlorine to ethylene to give 1,2-dichloroethane, from which vinyl chloride is prepared.",
  " ",
  "Compounds of the type HX, where X is a halogen or other electronegative group, also add to alkenes; the hydrogen atom of HX becomes bonded to one of the carbon atoms of the C=C unit, and the X atom becomes bonded to the other.",
  " ",
  "If HX is a strong acid, such as hydrochloric (HCl) or hydrobromic (HBr) acid, the reaction occurs rapidly; otherwise, an acid catalyst is required. One source of industrial ethanol, for example, is the reaction of ethylene with water in the presence of phosphoric acid .",
  "When the two carbon atoms of a double bond are not equivalent, the H of the HX compound adds to the carbon that has the greater number of directly attached hydrogen atoms, and X adds to the one with the fewer. (This generalization is called the Markovnikov rule , named after Russian chemist Vladimir Markovnikov , who proposed the rule in 1869.) Thus, when sulfuric acid (H 2 SO 4 ) adds to propylene, the product is isopropyl hydrogen sulfate, not n -propyl hydrogen sulfate (CH 3 CH 2 CH 2 OSO 3 H). This is the first step in the industrial preparation of isopropyl alcohol , which is formed when isopropyl hydrogen sulfate is heated with water.",
  "The term regioselective describes the preference for a reaction that occurs in one direction rather than another, as in the addition of sulfuric acid to propylene. A regiospecific reaction is one that is 100 percent regioselective. The Markovnikov rule expresses the regioselectivity to be expected in the addition of unsymmetrical reagents (such as HX) to unsymmetrical alkenes (such as H 2 C=CHR).",
  " Boron hydrides, compounds of the type R 2 BH, add to alkenes to give organoboranes (hydroboration), which can be oxidized to alcohols with hydrogen peroxide (H 2 O 2 ) (oxidation). The net result is the same as if H and ―OH add to the double bond with a regioselectivity opposite to the Markovnikov rule. The hydroboration-oxidation sequence is one of a large number of boron-based synthetic methods developed by American chemist Herbert C. Brown .",
  "Vicinal diols, compounds with ―OH groups on adjacent carbons, are formed when alkenes react with certain oxidizing agents, especially potassium permanganate (KMnO 4 ) or osmium tetroxide (OsO 4 ). The most widely used methods employ catalytic amounts of OsO 4 in the presence of oxidizing agents such as tert -butyl hydroperoxide [(CH 3 ) 3 COOH].",
  "Alkenes are the customary starting materials from which epoxides , compounds containing a three-membered ring consisting of one oxygen atom and two carbon atoms, are made. The simplest epoxide, ethylene oxide (oxirane), is obtained by passing a mixture of ethylene and air (or oxygen) over a heated silver catalyst. Epoxides are useful intermediates for a number of transformations. Ethylene oxide, for example, is converted to ethylene glycol , which is used in the synthesis of polyester fibres and films and as the main component of automobile antifreeze. On a laboratory scale, epoxides are normally prepared by the reaction of an alkene and a peroxy acid.",
  " ",
  "Conjugated dienes undergo a novel and useful reaction known as the Diels-Alder cycloaddition. In this reaction, a conjugated diene reacts with an alkene to form a compound that contains a cyclohexene ring. The unusual feature of the Diels-Alder cycloaddition is that two carbon-carbon bonds are formed in a single operation by a reaction that does not require catalysts of any kind. The German chemists Otto Diels and Kurt Alder received the Nobel Prize for Chemistry in 1950 for discovering and demonstrating the synthetic value of this reaction.",
  " ",
  "Alkynes undergo addition with many of the same substances that react with alkenes. Hydrogenation of alkynes can be controlled so as to yield either an alkene or an alkane. Two molecules of H 2 add to the triple bond to give an alkane under the usual conditions of catalytic hydrogenation.",
  " ",
  "Special, less active (poisoned) catalysts have been developed that permit the reaction to be halted at the alkene stage, and the procedure is used as a method for the synthesis of alkenes. When stereoisomeric alkenes are possible reaction products, the cis isomer is formed almost exclusively.",
  "Alkynes react with Br 2 or Cl 2 by first adding one molecule of the halogen to give a dihaloalkene and then a second to yield a tetrahaloalkane.",
  " ",
  "Compounds of the type HX, where X is an electronegative atom or group, also add to alkynes. When acetylene (HC≡CH) reacts with HCl, the product is vinyl chloride (CH 2 =CHCl), and, when HCN adds to acetylene, the product is acrylonitrile (CH 2 =CHCN). Both vinyl chloride and acrylonitrile are valuable starting materials for the production of useful polymers ( see below  Polymerization ), but neither is prepared in significant quantities from acetylene, because each is available at lower cost from an alkene (vinyl chloride from ethylene and acrylonitrile from propylene).",
  "Hydration of alkynes is unusual in that the initial product, called an enol and characterized by an H―O―C=C― group, is unstable under the conditions of its formation and is converted to an isomer that contains a carbonyl group .",
  "Although they are very weak acids, acetylene and terminal alkynes are much more acidic than alkenes and alkanes. A hydrogen attached to a triply bonded carbon can be removed by a very strong base such as sodium amide (NaNH 2 ) in liquid ammonia as the solvent.",
  " ",
  "The sodium salt of the alkyne formed in this reaction is not normally isolated but is treated directly with an alkyl halide. The ensuing reaction proceeds with carbon-carbon bond formation and is used to prepare higher alkynes.",
  " ",
  "A single alkene molecule, called a monomer , can add to the double bond of another to give a product, called a dimer, having twice the molecular weight. In the presence of an acid catalyst, the monomer 2-methylpropene (C 4 H 8 ), for example, is converted to a mixture of C 8 H 16 alkenes (dimers) suitable for subsequent conversion to 2,2,4-trimethylpentane (isooctane).",
  " ",
  "If the process is repeated, trimers, and eventually polymers—substances composed of a great many monomer units—are obtained.",
  "Approximately one-half of the ethylene produced each year is used to prepare the polymer polyethylene . Polyethylene is a mixture of polymer chains of different lengths, where n , the number of monomer units, is on the order of 1,000–5,000.",
  " ",
  "The distinguishing characteristic of polyethylene is its resistance to attack by most substances. Its resemblance to an alkane in this respect is not surprising, because the polymer chain is nearly void of functional groups . Its ends may have catalyst molecules attached or may terminate in a double bond by loss of a hydrogen atom at the next-to-last carbon. The properties of a particular sample of polyethylene depend mainly on the catalyst used and the conditions under which polymerization occurs. A chain may be continuous, or it may sprout occasional branches of shorter chains. The more nearly continuous the chain, the greater is the density of the polymer.",
  "Low-density polyethylene (LDPE) is obtained under conditions of free- radical polymerization, whereby polymerization is initiated by oxygen or peroxides under high pressure at roughly 200 °C (392 °F). Polyethylene, especially low-density polyethylene, is thermoplastic (softens and flows on heating) and can be extruded into sheets or films and molded into various shapes.",
  "High-density polyethylene (HDPE) is obtained under conditions of coordination polymerization initiated by a mixture of titanium tetrachloride (TiCl 4 ) and triethylaluminum [(CH 3 CH 2 ) 3 Al]. Coordination polymerization was discovered by German chemist Karl Ziegler . Ziegler and Italian chemist Giulio Natta pioneered the development of Ziegler-Natta catalysts , for which they shared the 1963 Nobel Prize for Chemistry. The original Ziegler-Natta titanium tetrachloride-triethylaluminum catalyst has been joined by a variety of others. In addition to its application in the preparation of high-density polyethylene, coordination polymerization is the method by which ethylene oligomers, called linear α- olefins , and stereoregular polymers, especially polypropylene , are prepared.",
  "Vinyl compounds, which are substituted derivatives of ethylene, can also be polymerized according to the following reaction:",
  " ",
  "Polymerization of vinyl chloride (where X is Cl) gives polyvinyl chloride , or PVC, more than 27 million metric tons of which is used globally each year to produce pipes, floor tiles, siding for houses, gutters, and downspouts. Polymerization of styrene , X = C 6 H 5 (a phenyl group derived from benzene ; see below  Aromatic hydrocarbons ), yields polystyrene, a durable polymer used to make luggage, refrigerator casings, and television cabinets and which can be foamed and used as a lightweight packaging and insulating material. If X = CH 3 , the product is polypropylene, which is used to make films, molded articles, and fibres. Acrylonitrile, X = CN, gives polyacrylonitrile for use in carpet fibres and clothing.",
  "Diene polymers have an important application as rubber substitutes. Natural rubber ( see above  Natural occurrence ) is a polymer of 2-methyl-1,3-butadiene (commonly called isoprene ). Coordination polymerization conditions have been developed that convert isoprene to a polymer with properties identical to that of natural rubber.",
  " ",
  "The largest portion of the synthetic rubber industry centres on styrene-butadiene rubber (SBR), which is a copolymer of styrene and 1,3-butadiene. Its major application is in automobile tires.",
  " ",
  "Alkyne polymerization is not nearly as developed nor as useful a procedure as alkene polymerization. The dimer of acetylene, vinylacetylene, is the starting material for the preparation of 2-chloro-1,3-butadiene, which in turn is polymerized to give the elastomer neoprene . Neoprene was the first commercially successful rubber substitute.",
  " ",
  "   Benzene (C 6 H 6 ), the simplest aromatic hydrocarbon, was first isolated in 1825 by English chemist Michael Faraday from the oily residues left from illuminating gas. In 1834 it was prepared from benzoic acid (C 6 H 5 CO 2 H), a compound obtained by chemical degradation of gum benzoin, the fragrant balsam exuded by a tree that grows on the island of Java, Indonesia. Similarly, the hydrocarbon toluene (C 6 H 5 CH 3 ) received its name from tolu balsam, a substance isolated from a Central American tree and used in perfumery. Thus benzene, toluene, and related hydrocarbons, while not particularly pleasant-smelling themselves, were classified as aromatic because they were obtained from fragrant substances. Joseph Loschmidt , an Austrian chemist, recognized in 1861 that most aromatic substances have formulas that can be derived from benzene by replacing one or more hydrogens by other atoms or groups. The term aromatic thus came to mean any compound structurally derived from benzene. Use of the term expanded with time to include properties, especially that of special stability, and eventually aromaticity came to be defined in terms of stability alone. The modern definition states that a compound is aromatic if it is significantly more stable than would be predicted on the basis of the most stable Lewis structural formula written for it. (This special stability is related to the number of electrons contained in a cyclic conjugated system ; see below  Arenes: Structure and bonding .) All compounds that contain a benzene ring possess special stability and are classified as benzenoid aromatic compounds. Certain other compounds lack a benzene ring yet satisfy the criterion of special stability and are classified as nonbenzenoid aromatic compounds.",
  "These compounds are hydrocarbons that contain a benzene ring as a structural unit. In addition to benzene, other examples include toluene and naphthalene .",
  " ",
  "( Hydrogen atoms connected to the benzene ring are shown for completeness in the above structural formulas. The more usual custom, which will be followed hereafter, omits them.)",
  "In 1865 the German chemist August Kekule von Stradonitz suggested the cyclic structure for benzene shown above. Kekule’s structure, while consistent with the molecular formula and the fact that all of the hydrogen atoms of benzene are equivalent, needed to be modified to accommodate the observation that disubstitution of the ring at adjacent carbons did not produce isomers. Two isomeric products, as shown below, would be expected depending on the placement of the double bonds within the hexagon, but only one 1,2-disubstituted product was formed. In 1872 Kekule revised his proposal by assuming that two such isomers would interconvert so rapidly as to be inseparable from one another.",
  " ",
  "The next major advance in understanding was due largely to the American chemist Linus Pauling , who brought the concept of resonance —which had been introduced in the 1920s—to the question of structure and bonding in benzene. According to the resonance model, benzene does not exist as a pair of rapidly interconverting conjugated trienes but has a single structure that cannot be represented by formulations with localized electrons. The six π electrons (two for the π component of each double bond) are considered to be delocalized over the entire ring, meaning that each π electron is shared by all six carbon atoms rather than by two. Resonance between the two Kekule formulas is symbolized by an arrow of the type ↔ to distinguish it from an interconversion process. The true structure of benzene is described as a hybrid of the two Kekule forms and is often simplified to a hexagon with an inscribed circle to represent the six delocalized π electrons. It is commonly said that a resonance hybrid is more stable than any of the contributing structures, which means, in the case of benzene, that each π electron, because it feels the attractive force of six carbons (delocalized), is more strongly held than if it were associated with only two of them (localized double bonds).",
  " ",
  " p  The orbital hybridization model of bonding in benzene is based on a σ bond framework of six s  p  2 hybridized carbons. The six π electrons circulate above and below the plane of the ring in a region formed by the overlap of the p orbitals contributed by the six carbons. (For a further discussion of hybridization and the bonding in benzene, see  chemical bonding .)",
  "Benzene is a planar molecule with six C―C bond distances of equal length. The observed bond distance (1.40 angstroms) is midway between the s  p  2 - s  p  2 single-bond distance (1.46 angstroms) and s  p  2 - s  p  2 double-bond distance (1.34 angstroms) seen in conjugated dienes and is consistent with the bond order of 1.5 predicted by resonance theory. (Bond order is an index of bond strength. A bond order of 1 indicates that a single σ bond exists between two atoms, and a bond order of 2 indicates the presence of one σ and one π bond between two atoms. Fractional bond orders are possible for resonance structures, as in the case of benzene.) Benzene is a regular hexagon; all bond angles are 120°.",
  "The special stability of benzene is evident in several ways. Benzene and its derivatives are much less reactive than expected. Arenes are unsaturated but resemble saturated hydrocarbons (i.e., alkanes) in their low reactivity more than they resemble unsaturated ones (alkenes and alkynes; see below  Reactions ). Thermodynamic estimates indicate that benzene is 30–36 kilocalories per mole more stable than expected for a localized conjugated triene structure.",
  "A number of monosubstituted derivatives of benzene have common names of long standing that have been absorbed into the IUPAC system. Examples include toluene (C 6 H 5 CH 3 ) and styrene (C 6 H 5 CH=CH 2 ). Disubstituted derivatives of benzene may have their substituents in a 1,2 ( ortho , or o ), 1,3 ( meta , or m ), or 1,4 ( para , or p ) relationship (where the numbers indicate the carbons to which the substituents are bonded) and may be named using either numerical locants or the ortho , meta , para notation.",
  " ",
  "Two groups that contain benzene rings, C 6 H 5 ―(phenyl) and C 6 H 5 CH 2 ―(benzyl), have special names, as in these examples:",
  " ",
  "Arenes in which two or more benzene rings share a common side are called polycyclic aromatic compounds. Each such assembly has a unique name, as the examples of naphthalene , anthracene , and phenanthrene illustrate.",
  " ",
  "Certain polycyclic aromatic hydrocarbons are known to be carcinogenic and enter the environment when organic matter is burned. Benzo[a]pyrene, for example, is present in tobacco smoke and chimney soot and is formed when meat is cooked on barbecue grills.",
  " ",
  "All arenes are either liquids or solids at room temperature; none are gases. Aromatic hydrocarbons are insoluble in water. Benzene was once widely used as a solvent, but evidence of its carcinogenic properties prompted its replacement by less hazardous solvents.",
  "For a period of approximately 100 years encompassing the last half of the 19th century and the first half of the 20th century, coal was the main starting material for the large-scale production of aromatic compounds . When soft coal is heated in the absence of air, substances are formed that are volatile at the high temperatures employed (500–1,000 °C [930–1,800 °F], depending on the process), which when condensed give the material known as coal tar . Distillation of coal tar gives a number of fractions, the lowest boiling of which contains benzene, toluene, and other low-molecular-weight aromatic compounds. The higher-boiling fractions are sources of aromatic compounds of higher molecular weight. Beginning with the second half of the 20th century, petroleum replaced coal as the principal source of aromatic hydrocarbons. The stability of the benzene ring makes possible processes, known generally as catalytic reforming, in which alkanes are converted to arenes by a combination of isomerization and dehydrogenation events.",
  " ",
  "The arenes formed by catalytic reforming are used to boost the octane rating of gasoline and as starting materials for the synthesis of a variety of plastics, fibres, dyes, agricultural chemicals, and drugs.",
  "Like other hydrocarbons, arenes undergo combustion to form carbon dioxide and water , and like other unsaturated hydrocarbons, arenes undergo catalytic hydrogenation .",
  " ",
  "However, many species that react with alkenes by addition react with arenes by replacing one of the hydrogens on the ring ( substitution ). This behaviour is most pronounced with species known as electrophiles (electron seekers), and the characteristic reaction of an arene is electrophilic aromatic substitution. Representative electrophilic aromatic substitutions, shown with benzene as the arene, include nitration, halogenation, sulfonation , alkylation , and acylation.",
  " ",
  "Alkylation and acylation reactions of aromatic compounds that are catalyzed by aluminum chloride (AlCl 3 ) are referred to as Friedel-Crafts reactions after French chemist and mineralogist Charles Friedel and American chemist James M. Crafts, who discovered this reaction at the Sorbonne in 1877. Further substitution is possible, and under certain circumstances all six hydrogen atoms of benzene are capable of being replaced. The products of electrophilic aromatic substitution in benzene and its derivatives are employed in subsequent transformations to give a variety of useful products.",
  "The benzene ring is relatively resistant toward oxidation with the exception of its combustion. Arenes that bear alkyl side chains, when treated with strong oxidizing agents, undergo oxidation of the side chain while the ring remains intact.",
  " ",
  "Under conditions of biological oxidation by the cytochrome P-450 enzyme system in the liver , benzene and polycyclic aromatic hydrocarbons undergo epoxidation of their ring. The epoxides that form react with deoxyribonucleic acid ( DNA ), and it is believed that this process is responsible for the carcinogenic properties of polycyclic aromatic hydrocarbons.",
  "Once it became clear that the special stability of benzene and related compounds was associated with the cyclic nature of its conjugated system of double bonds, organic chemists attempted to synthesize both larger and smaller analogs. The earliest targets were cyclobutadiene (C 4 H 4 ) and cyclooctatetraene (C 8 H 8 ).",
  " ",
  "Of the two, cyclooctatetraene proved more accessible. It was first prepared in 1911 by chemical degradation of the alkaloid pseudopelletierine by the German chemist Richard Willstätter . (Willstätter was awarded the 1915 Nobel Prize for Chemistry for his work on the structure of chlorophyll .) A more direct synthesis from acetylene was developed in the 1940s. While cyclooctatetraene is a stable substance, thermochemical measurements show that it does not possess the special stability required to be classified as an aromatic hydrocarbon. Structural studies reveal that, unlike benzene in which all of the ring bonds are of equal length (1.40 angstroms), cyclooctatetraene has four short (1.33 angstroms) and four long (1.46 angstroms) carbon-carbon distances consistent with a pattern of alternating single and double bonds. Cyclooctatetraene, moreover, has a nonplanar tub-shaped structure, which, because it is not planar, does not permit the eight π electrons to be delocalized over all the carbon atoms. Classifying cyclooctatetraene as an aliphatic hydrocarbon is also consistent with numerous observations concerning its chemical reactivity, which is characterized by a tendency to undergo alkenelike addition rather than arenelike substitution.",
  "Cyclobutadiene resisted attempts at chemical synthesis until the 1950s when evidence for its intermediacy in certain reactions was obtained. The high reactivity of cyclobutadiene was interpreted as evidence against its aromaticity. Subsequent low-temperature spectroscopic studies revealed that cyclobutadiene has a rectangular structure with alternating single and double bonds unlike the square shape required for an electron-delocalized aromatic molecule.",
  "Insight into the requirements for aromaticity were provided by German physicist Erich Hückel in 1931. Limiting his analysis to planar, monocyclic, completely conjugated polyenes, Hückel calculated that compounds of this type are aromatic if they contain 4 n + 2 π electrons, where n is a whole number. According to the Hückel rule, 2, 6, 10, 14 . . . π electrons ( n = 0, 1, 2, 3 . . . ) confer aromaticity to this class of compounds, but 4, 8, 12, 16 . . . π electrons do not. Benzene, which has 6 π electrons, is aromatic, but cyclobutadiene, which has 4, and cyclooctatraene, which has 8, are nonaromatic.",
  "Monocyclic, completely conjugated polyenes (the hydrocarbons treated by the Hückel rule) are referred to as annulenes, and individual annulenes are differentiated by a numerical prefix equal to the number of π electrons. Beyond benzene, [10]-annulene is the first hydrocarbon to satisfy the Hückel rule. A structure in which all of the double bonds are cis , however, would be a regular 10-sided polygon requiring bond angles of 144° (instead of the 120° angles required for s  p  2 hybridized carbon) and would suffer considerable angle strain. The destabilization owing to angle strain apparently exceeds the stabilization associated with aromaticity and makes all- cis -cyclodecapentaene a highly reactive substance. An isomer in which two of the double bonds are trans should, in principle, be free of angle strain. It is destabilized, however, by a repulsive force between two hydrogen atoms that are forced together in the interior of the ring, and for this reason it is relatively reactive.",
  " ",
  "[18]-Annulene is predicted to be aromatic by the Hückel rule (4 n + 2 = 18 when n = 4). The structure shown has a shape that makes it free of angle strain and is large enough so that repulsive forces between hydrogen atoms in the interior are minimal. Thermochemical measurements indicate a resonance energy of roughly 100 kilocalories per mole, and structural studies reveal that the molecule is planar with all its bond distances falling in the range 1.37–1.43 angstroms. In terms of its chemical reactivity, however, [18]-annulene resembles an alkene more than it resembles benzene.",
  " ",
  "The Hückel rule is not designed to apply to polycyclic compounds. Nevertheless, a similar dependence on the number of π electrons is apparent. The bicyclic hydrocarbon azulene has the same number of π electrons (10) as naphthalene and, like naphthalene, is aromatic. Pentalene and heptalene, analogs with 8 and 12 π electrons, respectively, are not aromatic. Both are relatively unstable, highly reactive substances.",
  " ",
  "The concept of “special stability” in aromatic hydrocarbons is covered in Peter J. Garratt , Aromaticity , 2nd ed. (1986). Industrial organic chemicals and the processes by which they are prepared are described in H. Harry Szmant , Organic Building Blocks of the Chemical Industry (1989). Stanley R. Sandler and Wolf Karo , Polymer Syntheses , 2nd ed., vol. 1 (1992), presents information on techniques of hydrocarbon polymerization."
]