[
  " hydrogen cyanide , also called formonitrile (HCN) , a highly volatile, colourless, and extremely poisonous liquid (boiling point 26° C [79° F], freezing point -14° C [7° F]). A solution of hydrogen cyanide in water is called hydrocyanic acid, or prussic acid. It was discovered in 1782 by a Swedish chemist, Carl Wilhelm Scheele , who prepared it from the pigment Prussian blue. Hydrogen cyanide and its compounds are used for many chemical processes, including fumigation, the case hardening of iron and steel, electroplating , and the concentration of ores. It also is employed in the preparation of acrylonitrile, which is used in the production of acrylic fibres, synthetic rubber, and plastics.",
  "Hydrogen cyanide is highly toxic because it inhibits cellular oxidative processes. An adult human can withstand 50–60 parts of hydrogen cyanide per million parts of air for an hour without serious consequences, but exposure to concentrations of 200–500 parts per million of air for 30 minutes is usually fatal. A method of inflicting capital punishment consists of administering a fatal dose of hydrogen cyanide gas.",
  "Hydrogen cyanide may be isolated in small quantities from plants, where it occurs in combination with sugars. Large quantities of hydrogen cyanide for laboratory and commercial use are synthesized by three principal methods: (1) treatment of sodium cyanide with sulfuric acid; (2) catalytic oxidation of a methane–ammonia mixture; and (3) decomposition of formamide (HCONH 2 ).",
  "Hydrogen cyanide is an excellent solvent for many salts, but it is not widely used as a solvent because of its toxicity. In pure form, hydrogen cyanide is a stable compound, but it polymerizes readily in the presence of basic substances, such as ammonia or sodium cyanide. The salts are used in the extraction of ores, in electrolytic processes, and in the treatment of steel. Among the important reactions with organic compounds are those with aldehydes and ketones, forming cyanohydrins, which serve as intermediates in many organic syntheses, and with ethylene oxide, forming an intermediate product that is converted to acrylonitrile (CH 2 =CHCN)."
]