[
  " Puck  sphere of influence , in international politics, the claim by a state to exclusive or predominant control over a foreign area or territory. The term may refer to a political claim to exclusive control, which other nations may or may not recognize as a matter of fact, or it may refer to a legal agreement by which another state or states pledge themselves to refrain from interference within the sphere of influence.",
  "It is in the latter, legal significance that the term first gained currency in the 1880s when the colonial expansion of the European powers in Africa and Asia was nearing its completion. The last stage of that expansion was characterized by the endeavour of all major colonial powers to carry on the mutual competition for colonies peacefully through agreed-upon procedures. Agreements on spheres of influence served this purpose. Thus, the agreement between Great Britain and Germany in May 1885, the first to make use of the term, provided for “a separation and definition of their respective spheres of influence in the territories on the Gulf of Guinea.” This agreement was followed by many of a similar nature, of which article VII of the agreement between Great Britain and Germany of July 1, 1890 , concerning East Africa, may be regarded as typical. Its text is as follows:",
  "The two Powers engage that neither will interfere with any sphere of influence assigned to the other by Articles I to IV. One Power will not in the sphere of the other make acquisitions, conclude Treaties, accept sovereign rights or Protectorates, nor hinder the extension of influence of the other. It is understood that no Companies nor individuals subject to one Power can exercise sovereign rights in a sphere assigned to the other, except with the assent of the latter.",
  "When colonial expansion came to a close after World War I , spheres of influence in the legal sense lost much of their importance.",
  "Spheres of influence in the loose or nonlegal sense of the term date to the beginning of recorded history. As a tool of great power or imperial control, the assertion of spheres of influence can bring order to peripheral areas but can contribute to conflicts when rival powers seek exclusive influence in the same area or when secondary or client states resist subordination. In antiquity, conflicts between Rome and Carthage for exclusive influence in peripheral areas of the western Mediterranean led to the Punic Wars , beginning in the 3rd century bce . More recently, the Monroe Doctrine (1823) effectively asserted a U.S. sphere of influence in the “New World” by excluding further European colonization in the Americas, presaging later U.S. interventions in the internal affairs of smaller neighbours. In the aftermath of World War II, the Soviet Union created a sphere of influence as a political fact in the territories of the nations of eastern Europe."
]