[
  " Final Fantasy , video game created in January 1987 by Japanese game manufacturer SquareSoft (now Square Enix, Inc.). The first installment of the long-running role-playing game (RPG) series was playable on the Nintendo Entertainment System. The game spawned numerous sequels on a variety of platforms, ranging from Nintendo’s console to the Sony PlayStation consoles, Microsoft’s Xbox, and Windows OS-based PCs.",
  " Final Fantasy is strongly rooted in the fantasy tradition, and the game includes many magical and fantastical elements. The game and its successors also embrace the world of technology, and, consequently, the distinctive Final Fantasy universe has frequently been situated within the corresponding “steampunk” genre. In general, there is a recognizable cast of core characters or character types, such as mages (magicians) and knights, each with unique abilities. These abilities, along with an assortment of weapons and items, are used in the characteristic menu- and turn-based combat system throughout the game. As the hero and his accompanying party defeat enemies, they gain experience points and “gil” (the game world’s currency), allowing them to gain new powers and buy better equipment.",
  "One of the most important elements of Final Fantasy is the narrative. The complex plot that governs the game play is representative of the entire franchise: it focuses on good and evil, and the hero must surmount a range of obstacles to defeat the primary villain. In subsequent games in the series, the plot and character development became increasingly intricate and central to the gaming experience.",
  "From its start as a Nintendo game available only in Japan, the series grew into an international phenomenon with a significant fan following and a robust community on the Internet. Final Fantasy ’s place in the annals of video game history has been secured by its status as a classic among RPG enthusiasts and by the sheer number of its sequels, which run into double digits."
]