[
  " Friends , popular American television sitcom that aired on the National Broadcasting Company (NBC) network from 1994 to 2004. It won six Emmy Awards, including outstanding comedy series, and from its second season until the end of its run maintained a top five or better Nielsen rating, hitting number one in its eighth season.",
  " Friends was created by David Crane and Marta Kauffman and is about a group of six young adults who are either roommates or neighbours in New York City’s Greenwich Village. Much of the show takes place in the friends’ apartments as they visit one another. The program revolves around the characters’ individual and collective search for sex, commitment, and meaning. The friends consist of three men and three women, whose varied personalities and shortcomings allow for both broad audience identification and abundant comedic moments. At the beginning of the show, Monica Geller (played by Courteney Cox) is a chef who often changes jobs and boyfriends in her search for the perfect match. Her brother, Ross (David Schwimmer), is a paleontologist and divorcé (three times over by the end of the series) with a child. He has a long-standing crush on Rachel Green (Jennifer Aniston), a fashion-minded woman who grew up in a wealthy family but works (for a time) as a barista at Central Perk, a café and popular meeting spot for the group. Eventually she lands a job with Ralph Lauren. Phoebe Buffay (Lisa Kudrow) is a ditsy masseuse and would-be musician with a quirky outlook on life. Joey Tribbiani (Matt LeBlanc) is a mostly struggling actor and buffoon who often confides in Chandler Bing (Matthew Perry), a well-off statistics and data analyst who has terrible luck with women and in time develops an eye for Monica. Throughout the series, the friends live together or apart in different combinations.",
  "As the show progressed, each character became a household name and each cast member a celebrity; they moved on to careers of varying success in motion pictures and television. The cast was renowned for its closeness and ensemble approach to their work on the series. The finale of Friends was watched by more than 52 million people. Joey (2004–06), a spin-off starring LeBlanc, was much less successful. The Friends theme song, “I’ll Be There for You,” performed by the Rembrandts, was a minor pop hit in its own right. In 2021 the cast returned for Friends: The Reunion , a TV special in which they discussed the show."
]