[
  " Juniperus chinensis  juniper , (genus Juniperus ), genus of about 60 to 70 species of aromatic evergreen trees or shrubs of the cypress family (Cupressaceae), distributed throughout the Northern Hemisphere. A number of species are cultivated as ornamentals and are useful for their timber.",
  " Juniperus virginiana  The juvenile leaves of a juniper are needlelike. Mature leaves are awl-shaped, spreading, and arranged in pairs or in whorls of three. Some species have small scalelike leaves, often bearing an oil gland, which are pressed closely to the rounded or four-angled branchlets. Male and female reproductive structures usually are borne on separate plants. The reddish brown or bluish cones are fleshy and berrylike and often have a grayish waxy covering. They mature in one to three seasons and contain 1 to 12 seeds, usually 3.",
  " Galls produced by junipers as a reaction to fungal infection are known as cedar apples. This fungus, cedar apple rust , completes its life cycle on members of the apple subfamily of the flowering plant family Rosaceae , which contains numerous species of trees and shrubs commercially valuable as fruit and ornamental plants. The growth of junipers around apple orchards and plantings of related genera is thus discouraged to avoid disfigurement or loss of these important cultivated plants.",
  "Common juniper ( Juniperus communis ), a sprawling shrub, is widely distributed on rocky soils throughout the Northern Hemisphere. Many ornamental cultivars have been developed.",
  "Another important ornamental and timber tree is the eastern red cedar ( J. virginiana ) of eastern North America. This species is an invader of glades, pastures, prairies, and other open grassy areas in parts of its range; thus, it is considered a troublesome weed by some botanists and land managers.",
  "The savin ( J. sabina ) of central Europe, Chinese juniper ( J. chinensis ) of eastern Asia, and creeping juniper ( J. horizontalis ) of eastern North America are other popular ornamental species with many horticultural varieties.",
  "The wood of incense, or Spanish, juniper ( J. thurifera ), of Spain and Portugal, and of Phoenician juniper ( J. phoenicea ) of the Mediterranean region sometimes is burned as incense.",
  "The berrylike cones of common juniper are used to flavour foods and alcoholic beverages—particularly gin , which is named after Juniperus through the French genièvre . Juniper “berries” have a fragrant spicy aroma and a slightly bittersweet flavour. Used with venison , they remove the gamey taste. They are also used to season sauces and stuffings, in pickling meats, and to flavour liqueurs and bitters .",
  "Oil of juniper, distilled from the wood and leaves of several species, is used in perfumes and in medicines such as diuretics .",
  "The fragrant wood of some species is made into cabinets, fence posts, and pencils. Eastern red cedar is especially common for the lining of linen closets and for cedar chests, as it repels moths and other pests."
]