[
  "  Pittsburgh Penguins , American professional ice hockey team based in Pittsburgh , Pennsylvania. The Penguins have won the Stanley Cup five times (1991, 1992, 2009, 2016, and 2017).",
  "Founded during the 1967 National Hockey League (NHL) expansion, the Penguins took their name from the igloolike appearance of Mellon Arena, where the team played from its inception through the 2009–10 season. After finding moderate success in the 1970s and then struggling throughout the early 1980s, the Penguins drafted Mario Lemieux in 1984, who was an instant offensive force on the ice and would become one of the greatest players in the history of the game. As the club drafted and traded for other standout players, the Penguins became a regular presence in the playoffs in the late 1980s. After the addition of right wing Jaromir Jagr , they won both the 1991 and 1992 Stanley Cup championships.",
  "In 1993 team captain Lemieux was diagnosed with Hodgkin disease ; however, he overcame the disease and not only returned to the team after a year off but also led the league in goals during the 1995–96 season. Following Lemieux’s initial retirement in 1997, Jagr became team captain and won the league scoring title four years in a row (from 1997–98 to 2000–01).",
  "The Penguins franchise struggled financially, and the team filed for bankruptcy in 1998. The following year Lemieux converted years of unpaid salary to equity and became a part owner of the team. In 2000 he left retirement and became the first player-owner in the history of the NHL before retiring again midway through the 2005–06 season.",
  "In 2005 a new Penguins era began with the drafting of Sidney Crosby , who in 2006–07 was the NHL’s leading scorer and, at age 19, became the youngest team captain in NHL history. In the 2007–08 season Crosby and second-year star Evgeni Malkin led the Penguins to the Stanley Cup finals, which they lost to the Detroit Red Wings . The following season Malkin led the NHL in points while Crosby finished third. That year the Penguins finished fourth in the Atlantic Division but advanced again to the Stanley Cup finals, this time defeating the Red Wings in seven games.",
  "In the six seasons after the 2009 Stanley Cup win, Pittsburgh remained one of the best teams in the NHL, running off a franchise record three straight seasons with at least 100 points (a team receives two points for a victory, one for an overtime loss, and none for a regulation loss) between 2009–10 and 2011–12 and winning three division titles. However, the team failed to advance past the conference finals over that span, losing to a lower-seeded team in five of the six postseasons. The team broke through in 2015–16, ending the regular season on a hot streak that carried over into the postseason, during which the Penguins captured another Stanley Cup title (over the San Jose Sharks in six games). The Penguins tallied the second most points in the NHL (111) in 2016–17, and in the postseason the team won seven-game series in both the second round and Eastern Conference finals to return to the Stanley Cup finals, where they faced the Nashville Predators . The Penguins then defeated the Predators in six games, becoming the first NHL team to win consecutive Stanley Cups since 1998. Pittsburgh returned to the playoffs in 2018 but lost in the second round, and in 2019 the team was swept in its first-round series. The next two NHL seasons were shortened due to the COVID-19 pandemic. The Penguins failed to advance past the qualifying round of the 2019–20 playoffs, and the following year the team lost in the first round of the postseason."
]