[
  " raster graphics , also called bitmap graphics , a type of digital image that uses tiny rectangular pixels, or picture elements, arranged in a grid formation to represent an image. Because the format can support a wide range of colours and depict subtle graduated tones, it is well suited for displaying continuous-tone images such as photographs or shaded drawings, along with other detailed images.",
  "Raster graphics have origins in television technology, with images constructed much like the pictures on a television screen. A raster graphic is made up of a collection of tiny, uniformly sized pixels, which are arranged in a two-dimensional grid made up of columns and rows. Each pixel contains one or more bits of information, depending on the degree of detail in the image. For example, a black-and-white image contains only one bit per pixel (a binary bit can be in one of two states; thus, a single bit can represent white or black); an image with shading and colour commonly contains 24 bits of information per pixel—with 2 24 , or more than 16 million, possible states per pixel. Known as “truecolor,” 24-bit colour can realistically depict colour images. The number of bits stored in each pixel is known as the colour depth. The number of pixels in a display, called resolution, affects how much detail can be depicted in an image. Resolution is often expressed as the number of pixels in a column times the number of pixels in a row (for example, 800 × 600).",
  "Detailed images often result in large file sizes, although file size can be managed through data compression . Compression can be either lossy (meaning that some data is discarded) or lossless (no data is lost). Popular raster file formats include GIF (graphics interchange format) and JPEG (joint photographic experts group), which are lossy formats, and BMP (Windows bitmap) and TIFF (tagged image file format), which are lossless.",
  "Although raster graphics saw some use in the 1970s and ’80s, it was mostly limited to expensive graphics workstations (i.e., high-end computers that were specially optimized for working with graphics). As the graphics capability of personal computers improved in the 1990s, raster graphics became widely used. Images produced from optical scanners and digital cameras are raster graphics, as are most images on the Internet . A commonly used graphics program for working with raster images is Adobe Photoshop ."
]