[
  "  Milan Kundera , (born April 1, 1929, Brno, Czechoslovakia [now in Czech Republic]), Czech novelist, short-story writer, playwright, essayist, and poet whose works combine erotic comedy with political criticism and philosophical speculation.",
  "The son of a noted concert pianist and musicologist, Ludvik Kundera, the young Kundera studied music but gradually turned to writing, and he began teaching literature at the Academy of Music and Dramatic Arts in Prague in 1952. He published several collections of poetry in the 1950s, including Poslední máj (1955; “The Last May”), an homage to the Communist resistance leader Julius Fučík, and Monology (1957; “Monologues”), a volume of love poems that, because of their ironic tone and eroticism, were later condemned by the Czech political authorities. During his early career he moved in and out of the Communist Party: he joined in 1948, was expelled in 1950, and was readmitted in 1956, remaining a member until 1970. According to an article published in 2008 in a Czech magazine, Kundera in 1950, after his expulsion from the party, informed police in Prague of the presence of a Western intelligence agent, who was then arrested and imprisoned for 14 years. Kundera denied the article’s claims, which were based on a researcher’s discovery of a police report on the arrest.",
  "Several volumes of short stories and a highly successful one-act play, Majitelé klíčů (1962; “The Owners of the Keys”), were followed by his first novel and one of his greatest works, Žert (1967; The Joke ), a comic, ironic view of the private lives and destinies of various Czechs during the years of Stalinism; translated into several languages, it achieved great international acclaim. His second novel, Život je jinde (1969; Life Is Elsewhere ), about a hapless, romantic-minded hero who thoroughly embraces the Communist takeover of 1948, was forbidden Czech publication. Kundera had participated in the brief but heady liberalization of Czechoslovakia in 1967–68, and after the Soviet occupation of the country he refused to admit his political errors and consequently was attacked by the authorities, who banned all his works, fired him from his teaching positions, and ousted him from the Communist Party.",
  "In 1975 Kundera was allowed to emigrate (with his wife, Věra Hrabánková) from Czechoslovakia to teach at the University of Rennes (1975–78) in France; in 1979 the Czech government stripped him of his citizenship. In the 1970s and ’80s his novels, including Valčík na rozloučenou (1976; “Farewell Waltz”; Eng. trans. The Farewell Party ), Kniha smíchu a zapomnění (1979; The Book of Laughter and Forgetting ), and Nesnesitelná lehkost bytí (1984;  The Unbearable Lightness of Being  ), were published in France and elsewhere abroad but until 1989 were banned in his homeland. The Book of Laughter and Forgetting, one of his most successful works, is a series of wittily ironic meditations on the modern state’s tendency to deny and obliterate human memory and historical truth. Nesmrtelnost (1990; Immortality ) explores the nature of artistic creation. Kundera began writing in French with La Lenteur (1994; Slowness ), followed by L’Identité (1997; Identity ); La ignorancia (2000; Ignorance ), a story about Czech émigrés written in French but first published in Spanish; and La fête de l’insignifiance (2013; The Festival of Insignificance ), about a group of Parisian friends.",
  "Kundera’s wide-ranging reflections appear in L’Art du roman (1986; The Art of the Novel ), Les Testaments trahis (1993; Testaments Betrayed ), Le Rideau (2005; The Curtain ), and Une Rencontre (2009; Encounter )."
]