[
  " landscape architecture , the development and decorative planting of gardens, yards, grounds, parks, and other planned green outdoor spaces. Landscape gardening is used to enhance nature and to create a natural setting for buildings, towns, and cities. It is one of the decorative arts and is allied to architecture, city planning, and horticulture.",
  "A brief treatment of landscape architecture follows. For full treatment, see  garden and landscape design .",
  "Landscape architects begin with the natural terrain and enhance, re-create, or alter existing landforms. “Garden” generally connotes a smaller, more intensively cultivated area, frequently created around a domestic building or other small structure. “Landscape” denotes a larger area such as a park, urban area, campus, or roadside.",
  "Trees, bushes, shrubs, hedges, flowers, grasses, water (lakes, streams, ponds, and cascades), and rocks are used to alter or create a pleasing natural setting. Such artificial devices as decks, terraces, plazas, pavement, fences, gazebos, and fountains are also used. The importance of man-made components relative to natural components varies according to the designer, the purpose of the particular site, and the prevailing culture and fashion.",
  "Garden and landscape designs can vary conceptually between classical/symmetrical and natural/romantic, formality and informality, utility and pleasure, and private and public. An enclosed patio garden with tubs, baskets of plants, and paving contrasts with the large “natural” garden popular in 18th-century England, where man-made elements were less visible.",
  "A garden or landscape’s aesthetic aspects include form, plants, colour, scent, size, climate, and function. Gardens need continual maintenance in order to keep weeds and other unwanted natural phenomena from asserting themselves. Gardens change with the seasons and climate and with their plants’ cycle of growth and decay.",
  "Historically, gardens have been designed more for private than for public pleasure. The ancient Egyptians, Greeks, and Romans each evolved their own characteristic garden designs. Hadrian’s Villa, near Tivoli, Italy, contains a vast pleasure garden that had great influence on subsequent designs. The Italian Renaissance developed formal gardens in which the outdoor landscape was considered an extension of a building. The 16th-century Villa d’Este at Tivoli is a remarkable example.",
  "In the 17th century André le Nôtre, influenced by the Italian Renaissance, created for Louis XIV of France gardens at Versailles in which symmetry, vistas, and grandiose fountains predominated. Such a design was much copied and perhaps matched human dominance over natural landscape. These classical gardens are beautiful but immaculate, formal, hard, elaborate, and logical, with straight lines, circles, trees, and hedges tamed into geometric shapes and with compartmentalized beds for flowers. They are extensions of contemporary architecture.",
  "In 18th-century England the Earl of Burlington and the landscape gardeners William Kent, Lancelot “Capability” Brown, and Humphrey Repton brought about a change whereby a “natural” philosophy of garden design began to recommend the irregular and informal. Late in the century artificial ruins and grottoes were cultivated as picturesque accessories. Famous examples include the gardens at Rousham, Stowe, and Stourhead. In the 19th century in the United States the leading figure in garden and landscape design was Frederick Law Olmsted .",
  "  In the East a completely separate tradition of landscape gardening evolved, starting in China and spreading via Korea to Japan. The Oriental attitude to the garden was closely linked to religious traditions. The garden was designed to induce a certain state of mind and enhance a distinctive perception. Nature predominated over man-made symmetry. Rocks were especially important and in Japanese gardens were religious symbols. The scale tended to be smaller than in Western gardens, with emphasis on tiny details. Water, trees, and bridges were vital elements. The Japanese tea garden was supposed to induce a suitable mood in the person approaching a teahouse to participate in the tea ceremony. Oriental landscape gardening, particularly Japanese, has exerted considerable influence on modern Western designs."
]