[
  "  dark energy , repulsive force that is the dominant component (69.4 percent) of the universe . The remaining portion of the universe consists of ordinary matter and dark matter . Dark energy, in contrast to both forms of matter, is relatively uniform in time and space and is gravitationally repulsive, not attractive, within the volume it occupies. The nature of dark energy is still not well understood.",
  "A kind of cosmic repulsive force was first hypothesized by Albert Einstein in 1917 and was represented by a term, the “cosmological constant,” that Einstein reluctantly introduced into his theory of general relativity in order to counteract the attractive force of gravity and account for a universe that was assumed to be static (neither expanding nor contracting). After the discovery in the 1920s by American astronomer Edwin Hubble that the universe is not static but is in fact expanding, Einstein referred to the addition of this constant as his “greatest blunder.” However, the measured amount of matter in the mass-energy budget of the universe was improbably low, and thus some unknown “missing component,” much like the cosmological constant , was required to make up the deficit. Direct evidence for the existence of this component, which was dubbed dark energy, was first presented in 1998.",
  "Dark energy is detected by its effect on the rate at which the universe expands and its effect on the rate at which large-scale structures such as galaxies and clusters of galaxies form through gravitational instabilities. The measurement of the expansion rate requires the use of telescopes to measure the distance (or light travel time) of objects seen at different size scales (or redshifts ) in the history of the universe. These efforts are generally limited by the difficulty in accurately measuring astronomical distances. Since dark energy works against gravity, more dark energy accelerates the universe’s expansion and retards the formation of large-scale structure. One technique for measuring the expansion rate is to observe the apparent brightness of objects of known luminosity like Type Ia supernovas . Dark energy was discovered in 1998 with this method by two international teams that included American astronomers Adam Riess (the author of this article) and Saul Perlmutter and Australian astronomer Brian Schmidt . The two teams used eight telescopes including those of the Keck Observatory and the MMT Observatory . Type Ia supernovas that exploded when the universe was only two-thirds of its present size were fainter and thus farther away than they would be in a universe without dark energy. This implied the expansion rate of the universe is faster now than it was in the past, a result of the current dominance of dark energy. (Dark energy was negligible in the early universe.)",
  "  Studying the effect of dark energy on large-scale structure involves measuring subtle distortions in the shapes of galaxies arising from the bending of space by intervening matter, a phenomenon known as “weak lensing.” At some point in the last few billion years, dark energy became dominant in the universe and thus prevented more galaxies and clusters of galaxies from forming. This change in the structure of the universe is revealed by weak lensing. Another measure comes from counting the number of clusters of galaxies in the universe to measure the volume of space and the rate at which that volume is increasing. The goals of most observational studies of dark energy are to measure its equation of state (the ratio of its pressure to its energy density), variations in its properties, and the degree to which dark energy provides a complete description of gravitational physics.",
  "  In cosmological theory, dark energy is a general class of components in the stress-energy tensor of the field equations in Einstein ’s theory of general relativity . In this theory, there is a direct correspondence between the matter-energy of the universe (expressed in the tensor) and the shape of space-time . Both the matter (or energy) density (a positive quantity) and the internal pressure contribute to a component’s gravitational field. While familiar components of the stress-energy tensor such as matter and radiation provide attractive gravity by bending space-time, dark energy causes repulsive gravity through negative internal pressure. If the ratio of the pressure to the energy density is less than −1/3, a possibility for a component with negative pressure, that component will be gravitationally self-repulsive. If such a component dominates the universe, it will accelerate the universe’s expansion.",
  "The simplest and oldest explanation for dark energy is that it is an energy density inherent to empty space, or a “vacuum energy.” Mathematically, vacuum energy is equivalent to Einstein’s cosmological constant. Despite the rejection of the cosmological constant by Einstein and others, the modern understanding of the vacuum, based on quantum field theory , is that vacuum energy arises naturally from the totality of quantum fluctuations (i.e., virtual particle-antiparticle pairs that come into existence and then annihilate each other shortly thereafter) in empty space. However, the observed density of the cosmological vacuum energy density is ~10 −10 ergs per cubic centimetre; the value predicted from quantum field theory is ~10 110 ergs per cubic centimetre. This discrepancy of 10 120 was known even before the discovery of the far weaker dark energy. While a fundamental solution to this problem has not yet been found, probabilistic solutions have been posited, motivated by string theory and the possible existence of a large number of disconnected universes. In this paradigm the unexpectedly low value of the constant is understood as a result of an even greater number of opportunities (i.e., universes) for the occurrence of different values of the constant and the random selection of a value small enough to allow for the formation of galaxies (and thus stars and life).",
  "Another popular theory for dark energy is that it is a transient vacuum energy resulting from the potential energy of a dynamical field. Known as “quintessence,” this form of dark energy would vary in space and time, thus providing a possible way to distinguish it from a cosmological constant. It is also similar in mechanism (though vastly different in scale) to the scalar field energy invoked in the inflationary theory of the big bang .",
  "Another possible explanation for dark energy is topological defects in the fabric of the universe. In the case of intrinsic defects in space-time (e.g., cosmic strings or walls), the production of new defects as the universe expands is mathematically similar to a cosmological constant, although the value of the equation of state for the defects depends on whether the defects are strings (one-dimensional) or walls (two-dimensional).",
  "There have also been attempts to modify gravity to explain both cosmological and local observations without the need for dark energy. These attempts invoke departures from general relativity on scales of the entire observable universe.",
  "A major challenge to understanding accelerated expansion with or without dark energy is to explain the relatively recent occurrence (in the past few billion years) of near-equality between the density of dark energy and dark matter even though they must have evolved differently. (For cosmic structures to have formed in the early universe, dark energy must have been an insignificant component.) This problem is known as the “coincidence problem” or the “fine-tuning problem.” Understanding the nature of dark energy and its many related problems is one of the most formidable challenges in modern physics."
]