[
  "  Large Hadron Collider (LHC) , the world’s most powerful particle accelerator . The Large Hadron Collider (LHC) was constructed by the European Organization for Nuclear Research ( CERN ) in the same 27-km (17-mile) tunnel that housed its Large Electron-Positron Collider (LEP). The tunnel is circular and is located 50–175 metres (165–575 feet) belowground on the border between France and Switzerland. The LHC ran its first test operation on September 10, 2008. An electrical problem in a cooling system on September 18 resulted in a temperature increase of about 100 °C (180 °F) in the magnets, which are meant to operate at temperatures near absolute zero (−273.15 °C, or −459.67 °F). Early estimates that the LHC would be quickly fixed soon turned out to be overly optimistic. It restarted on November 20, 2009. Shortly thereafter, on November 30, it supplanted the Fermi National Accelerator Laboratory ’s Tevatron as the most powerful particle accelerator when it boosted protons to energies of 1.18 teraelectron volts (TeV; 1 × 10 12  electron volts ). In March 2010 scientists at CERN announced that a problem with the design of superconducting wire in the LHC required that the collider run only at half-energy (7 TeV). The LHC was shut down in February 2013 to fix the problem and was restarted in April 2015 to run at its full energy of 13 TeV. A second long shutdown, during which the LHC’s equipment would be upgraded, began in December 2018 and ended in July 2022.",
  "The heart of the LHC is a ring that runs through the circumference of the LEP tunnel; the ring is only a few centimetres in diameter, evacuated to a higher degree than deep space and cooled to within two degrees of absolute zero . In this ring, two counterrotating beams of heavy ions or protons are accelerated to speeds within one-millionth of a percent of the speed of light . (Protons belong to a category of heavy subatomic particles known as hadrons , which accounts for the name of this particle accelerator.) At four points on the ring, the beams can intersect and a small proportion of particles crash into each other. At maximum power, collisions between protons will take place at a combined energy of up to 13 TeV, about seven times greater than has been achieved previously. At each collision point are huge magnets weighing tens of thousands of tons and banks of detectors to collect the particles produced by the collisions.",
  "The project took a quarter of a century to realize; planning began in 1984, and the final go-ahead was granted in 1994. Thousands of scientists and engineers from dozens of countries were involved in designing, planning, and building the LHC, and the cost for materials and manpower was nearly $5 billion; this does not include the cost of running experiments and computers.",
  "One goal of the LHC project is to understand the fundamental structure of matter by re-creating the extreme conditions that occurred in the first few moments of the universe according to the big-bang model . For decades physicists have used the so-called standard model for fundamental particles, which has worked well but has weaknesses. First, and most important, it does not explain why some particles have mass . In the 1960s British physicist Peter Higgs postulated a particle that had interacted with other particles at the beginning of time to provide them with their mass. The Higgs boson had never been observed—it should be produced only by collisions in an energy range not available for experiments before the LHC. After a year of observing collisions at the LHC, scientists there announced in 2012 that they had detected an interesting signal that was likely from a Higgs boson with a mass of about 126 gigaelectron volts (billion electron volts ). Further data definitively confirm those observations as that of the Higgs boson. Second, the standard model requires some arbitrary assumptions, which some physicists have suggested may be resolved by postulating a further class of supersymmetric particles; these might be produced by the extreme energies of the LHC. Finally, examination of asymmetries between particles and their antiparticles may provide a clue to another mystery: the imbalance between matter and antimatter in the universe."
]