[
  " intergalactic medium , material found between galaxies and that mostly consists of hot, tenuous hydrogen gas.",
  "At one time it was thought that large amounts of mass might exist in the form of gas clouds in the spaces between galaxies. One by one, however, the forms that this intergalactic gas might take were eliminated by direct observational searches until the only possible form that might have escaped early detection was a very hot plasma . Thus, there was considerable excitement and speculation when astronomers found evidence in the early 1970s for a seemingly uniform and isotropic background of hard X radiation ( photons with energies greater than 10 6  electron volts ). There also was a diffuse background of soft X rays, but this had a patchy distribution and was definitely of galactic origin—hot gas produced by many supernova explosions inside the Milky Way Galaxy . The hard X-ray background, in contrast, seemed to be extragalactic, and a uniform plasma at a temperature of roughly 10 8 kelvins (K) was a possible source. The launch in 1978 of an imaging X-ray telescope aboard the Einstein Observatory (the HEAO 2 satellite), however, showed that a large fraction of the seemingly diffuse background of hard X rays, perhaps all of it, could be accounted for by a superposition of previously unresolved point sources—i.e., quasars . Subsequent research demonstrated that the shape of the X-ray spectrum of these objects at low redshifts does not match that of the diffuse background. The residual background has since been found to be from active galactic nuclei at higher redshifts.",
  "Very hot gas that emits X rays at tens to hundreds of millions of kelvins does indeed reside in the spaces between galaxies in rich clusters, and the amount of this gas seems comparable to that contained in the visible stars of the galaxies; however, because rich clusters are fairly rare in the universe, the total amount of such gas is small compared to the total mass contained in the stars of all galaxies. Moreover, an emission line of iron can frequently be detected in the X-ray spectrum, indicating that the intracluster gas has undergone nuclear processing inside stars and is not of primordial origin.",
  "About 70 percent of the X-ray clusters show surface brightnesses that are smooth and single-peaked, indicative of distributions of hot gas that rest in quasi-hydrostatic equilibrium in the gravitational potentials of the clusters. Analysis of the data in the better-resolved systems allows astronomers to estimate the total amount of gravitating mass needed to offset the expansive pressure (proportional to the density times the temperature) of the X-ray-emitting gas. These estimates agree with the conclusions from optical measurements of the motions of the member galaxies that galaxy clusters contain about 10 times more dark matter than luminous matter.",
  "About half of the X-ray clusters with single-peaked distributions have bright galaxies at the centres of the emission. The high central densities of the gas imply radiative cooling times of only 10 9 years or so. As the gas cools, the central galaxy draws the material inward at inferred rates that often exceed 100 solar masses per year. The ultimate fate of the accreted gas in the “cooling flow” remains unclear.",
  "Another exciting discovery has been the detection of large clouds of atomic hydrogen gas in intergalactic space unassociated with any known galaxies. These clouds show themselves as unusual absorption lines in the Lyman-alpha transition of atomic hydrogen when they lie as foreground objects to distant quasars. In a few cases they can be mapped by radio techniques at the spin-flip transition of atomic hydrogen (redshifted from the rest wavelength of 21 cm ). From the latter studies, some astronomers have inferred that the clouds exist in highly flattened forms (“pancakes”) and may contain up to 10 14 solar masses of gas. In one interpretation these structures are the precursors to large clusters of galaxies."
]