[
  " Diagnostic and Statistical Manual of Mental Disorders (DSM) , publication of the American Psychiatric Association detailing diagnostic criteria for hundreds of psychiatric disorders. The manual is the standard resource of the mental health industry in the United States and is widely used by mental health professionals throughout the world. In its five editions, the DSM has closely reflected the evolution of the mental health profession. Partly for this reason, the DSM was frequently criticized for its alleged “medicalization” of behaviours deemed undesirable. For example, the DSM initially classified homosexuality as a mental disorder.",
  "The first and second editions, DSM-I (1952) and DSM-II (1968), catalogued approximately 100 mental health disorders. The manuals were distributed mainly to large mental hospitals and mental health institutes and were intended to assist these facilities in collecting public health statistics. The introduction of the DSM-III in 1980 signaled the rapid developments occurring in the study of mental health. Under the guidance of American psychiatrist Robert Spitzer, the DSM-III initiated the classification of mental illnesses by patterns of symptoms rather than by etiology and avoided recommending treatments. This purely diagnostic emphasis facilitated the manual’s wide acceptance by many mental health professionals, including psychiatrists, psychologists, social workers, and nurses, as well as those working within the court and prison systems.",
  "Subsequent editions continued to expand the manual by incorporating current clinical research. The 1994 edition, DSM-IV , detailed nearly 300 disorders and was updated in a “text revision” called the DSM-IV-TR in 2000. DSM-5 , unveiled in 2013, included the addition of newly recognized disorders, such as hoarding disorder and skin-picking disorder, as well as revisions to diagnostic criteria for existing conditions. The work was heavily criticized, however, for lowering the diagnostic threshold for mental disorders by adopting broader diagnostic criteria and for being based largely on subjective criteria rather than biological factors implicated in mental illness. A text revision of the DSM-5 , called the DSM-5-TR , was published in 2022."
]