[
  "   air pollution ,  release into the atmosphere of various gases , finely divided solids, or finely dispersed liquid aerosols at rates that exceed the natural capacity of the environment to dissipate and dilute or absorb them. These substances may reach concentrations in the air that cause undesirable health, economic, or aesthetic effects.",
  "Clean, dry air consists primarily of nitrogen and oxygen —78 percent and 21 percent respectively, by volume. The remaining 1 percent is a mixture of other gases, mostly argon (0.9 percent), along with trace (very small) amounts of carbon dioxide , methane , hydrogen , helium , and more. Water vapour is also a normal, though quite variable, component of the atmosphere, normally ranging from 0.01 to 4 percent by volume; under very humid conditions the moisture content of air may be as high as 5 percent.",
  "There are six major air pollutants that have been designated by the U.S. Environmental Protection Agency (EPA) as “criteria” pollutants— criteria meaning that the concentrations of these pollutants in the atmosphere are useful as indicators of overall air quality. The are summarized in the table.",
  "The gaseous criteria air pollutants of primary concern in urban settings include sulfur dioxide , nitrogen dioxide, and carbon monoxide ; these are emitted directly into the air from fossil fuels such as fuel oil , gasoline , and natural gas that are burned in power plants, automobiles, and other combustion sources. Ozone (a key component of smog ) is also a gaseous pollutant; it forms in the atmosphere via complex chemical reactions occurring between nitrogen dioxide and various volatile organic compounds (e.g., gasoline vapours).",
  "Airborne suspensions of extremely small solid or liquid particles called “particulates” (e.g., soot, dust, smokes, fumes, mists), especially those less than 10 micrometres (μm; millionths of a metre) in size, are significant air pollutants because of their very harmful effects on human health. They are emitted by various industrial processes, coal- or oil-burning power plants, residential heating systems, and automobiles. Lead fumes (airborne particulates less than 0.5 μm in size) are particularly toxic and are an important pollutant of many diesel fuels .",
  "Except for lead, criteria pollutants are emitted in industrialized countries at very high rates, typically measured in millions of tons per year. All except ozone are discharged directly into the atmosphere from a wide variety of sources. They are regulated primarily by establishing ambient air quality standards, which are maximum acceptable concentrations of each criteria pollutant in the atmosphere, regardless of its origin. The six criteria pollutants are described in turn below.",
  "Very small fragments of solid materials or liquid droplets suspended in air are called particulates. Except for airborne lead, which is treated as a separate category, they are characterized on the basis of size and phase (i.e., solid or liquid) rather than by chemical composition. For example, solid particulates between roughly 1 and 100 μm in diameter are called dust particles, whereas airborne solids less than 1 μm in diameter are called fumes.",
  "The particulates of most concern with regard to their effects on human health are solids less than 10 μm in diameter, because they can be inhaled deep into the lungs and become trapped in the lower respiratory system. Certain particulates, such as asbestos fibres, are known carcinogens ( cancer -causing agents), and many carbonaceous particulates—e.g., soot—are suspected of being carcinogenic. Major sources of particulate emissions include fossil-fuel power plants, manufacturing processes, fossil-fuel residential heating systems, and gasoline -powered vehicles.",
  "   Carbon monoxide is an odourless, invisible gas formed as a result of incomplete combustion. It is the most abundant of the criteria pollutants. Gasoline -powered highway vehicles are the primary source, although residential heating systems and certain industrial processes also emit significant amounts of this gas. Power plants emit relatively little carbon monoxide because they are carefully designed and operated to maximize combustion efficiency. Exposure to carbon monoxide can be acutely harmful since it readily displaces oxygen in the bloodstream, leading to asphyxiation at high enough concentrations and exposure times.",
  "A colourless gas with a sharp, choking odour, sulfur dioxide is formed during the combustion of coal or oil that contains sulfur as an impurity. Most sulfur dioxide emissions come from power-generating plants; very little comes from mobile sources. This pungent gas can cause eye and throat irritation and harm lung tissue when inhaled.",
  "Sulfur dioxide also reacts with oxygen and water vapour in the air, forming a mist of sulfuric acid that reaches the ground as a component of acid rain . Acid rain is believed to have harmed or destroyed fish and plant life in many thousands of lakes and streams in parts of Europe, the northeastern United States, southeastern Canada, and parts of China. It also causes corrosion of metals and deterioration of the exposed surfaces of buildings and public monuments.",
  " 2 x 2 x  Of the several forms of nitrogen oxides, nitrogen dioxide—a pungent, irritating gas—is of most concern. It is known to cause pulmonary edema , an accumulation of excessive fluid in the lungs. Nitrogen dioxide also reacts in the atmosphere to form nitric acid , contributing to the problem of acid rain. In addition, nitrogen dioxide plays a role in the formation of photochemical smog , a reddish brown haze that often is seen in many urban areas and that is created by sunlight-promoted reactions in the lower atmosphere.",
  "Nitrogen oxides are formed when combustion temperatures are high enough to cause molecular nitrogen in the air to react with oxygen . Stationary sources such as coal-burning power plants are major contributors of this pollutant, although gasoline engines and other mobile sources are also significant.",
  " Juglans regia  A key component of photochemical smog, ozone is formed by a complex reaction between nitrogen dioxide and hydrocarbons in the presence of sunlight. It is considered to be a criteria pollutant in the troposphere —the lowermost layer of the atmosphere—but not in the upper atmosphere, where it occurs naturally and serves to block harmful ultraviolet rays from the Sun. Because nitrogen dioxide and hydrocarbons are emitted in significant quantities by motor vehicles, photochemical smog is common in cities such as Los Angeles , where sunshine is ample and highway traffic is heavy. Certain geographic features, such as mountains that impede air movement, and weather conditions, such as temperature inversions in the troposphere, contribute to the trapping of air pollutants and the formation of photochemical smog.",
  "Inhaled lead particulates in the form of fumes and dusts are particularly harmful to children, in whom even slightly elevated levels of lead in the blood can cause learning disabilities, seizures, or even death ( see  lead poisoning ). Sources of airborne lead particulates include oil refining , smelting , and other industrial activities. In the past, combustion of gasoline containing a lead-based antiknock additive called tetraethyl lead was a major source of lead particulates. In many countries there is now a complete ban on the use of lead in gasoline. In the United States, lead concentrations in outdoor air decreased more than 90 percent after the use of leaded gasoline was restricted in the mid-1970s and then completely banned in 1996.",
  "Hundreds of specific substances are considered hazardous when present in trace amounts in the air. These pollutants are called air toxics. Many of them cause genetic mutations or cancer ; some cause other types of health problems, such as adverse effects on brain tissue or fetal development. Although the total emissions and the number of sources of air toxics are small compared with those for criteria pollutants, these pollutants can pose an immediate health risk to exposed individuals and can cause other environmental problems.",
  "Most air toxics are organic chemicals , comprising molecules that contain carbon , hydrogen , and other atoms. Many are volatile organic compounds (VOCs), organic compounds that readily evaporate. VOCs include pure hydrocarbons , partially oxidized hydrocarbons, and organic compounds containing chlorine , sulfur , or nitrogen . They are widely used as fuels (e.g., propane and gasoline ), as paint thinners and solvents, and in the production of plastics . In addition to contributing to air toxicity and urban smog, some VOC emissions act as greenhouse gases and, in so doing, contribute to global warming . Some other air toxics are metals or compounds of metals—for example, mercury , arsenic , and cadmium .",
  "In many countries, standards have been set to control industrial emissions of several air toxics. The first hazardous air pollutants regulated in the United States (outside the workplace environment) were arsenic , asbestos , benzene , beryllium , coke oven emissions, mercury, radionuclides (radioactive isotopes), and vinyl chloride . In 1990 this short list was expanded to include 189 substances as part of the significant amendments to the Clean Air Act of 1970. By the end of the 1990s, specific emission control standards were required in the United States for “major sources”—those that release more than 10 tons per year of any of these materials or more than 25 tons per year of any combination of them. Important are summarized in the table.",
  "  Air toxics may be released in sudden and catastrophic accidents rather than steadily and gradually from many sources. For example, in the Bhopal disaster of 1984, an accidental release of methyl isocyanate at a Union Carbide  pesticide factory in Bhopal, Madhya Pradesh state, India, immediately killed at least 3,000 people, eventually caused the deaths of an estimated 15,000 to 25,000 people over the following quarter-century, and injured hundreds of thousands more. The risk of accidental release of very hazardous substances into the air is generally higher for people living in industrialized urban areas. Hundreds of such incidents occur each year, though none has been as severe as the Bhopal event.",
  "  Other than in cases of occupational exposure or accidental release, health threats from air toxics are greatest for people who live near large industrial facilities or in congested and polluted urban areas. Most major sources of air toxics are so-called point sources—that is, they have a specific location. Point sources include chemical plants, steel mills, oil refineries, and municipal waste incinerators. Hazardous air pollutants may be released when equipment leaks or when material is transferred, or they may be emitted from smokestacks. Municipal waste incinerators, for example, can emit hazardous levels of dioxins , formaldehyde , and other organic substances, as well as metals such as arsenic, beryllium, lead, and mercury. Nevertheless, proper combustion along with appropriate air pollution control devices can reduce emissions of these substances to acceptable levels.",
  "Hazardous air pollutants also come from “area” sources, which are many smaller sources that release pollutants into the outdoor air in a defined area. Such sources include commercial dry-cleaning facilities, gasoline stations, small metal-plating operations, and woodstoves. Emission of air toxics from area sources are also regulated under some circumstances.",
  "Small area sources account for about 25 percent of all emissions of air toxics. Major point sources account for another 20 percent. The rest—more than half of hazardous air-pollutant emissions—come from motor vehicles. For example, benzene , a component of gasoline, is released as unburned fuel or as fuel vapours, and formaldehyde is one of the by-products of incomplete combustion. Newer cars, however, have emission control devices that significantly reduce the release of air toxics.",
  "   Global warming is recognized by almost all atmospheric scientists as a significant environmental problem caused by an increase in levels of certain trace gases in the atmosphere since the beginning of the Industrial Revolution in the mid-18th century. These gases, collectively called greenhouse gases , include carbon dioxide , organic chemicals called chlorofluorocarbons (CFCs), methane , nitrous oxide , ozone , and many others. Carbon dioxide, although not the most potent of the greenhouse gases, is the most important because of the huge volumes emitted into the air by combustion of fossil fuels (e.g., gasoline, oil, coal).",
  "Carbon dioxide is considered a normal component of the atmosphere, and before the Industrial Revolution the average levels of this gas were about 280 parts per million (ppm). By 2020 the levels of carbon dioxide had reached 417 ppm, and they continue to increase at a rate of almost 3 ppm per year. Many scientists think that carbon dioxide should be regulated as a pollutant—a position taken by the EPA in 2009 in a ruling that such regulations could be promulgated. International cooperation and agreements, such as the Paris Agreement of 2015, would be necessary to reduce carbon dioxide emissions worldwide.",
  "Local air quality typically varies over time because of the effect of weather patterns. For example, air pollutants are diluted and dispersed in a horizontal direction by prevailing winds , and they are dispersed in a vertical direction by atmospheric instability. Unstable atmospheric conditions occur when air masses move naturally in a vertical direction, thereby mixing and dispersing pollutants. When there is little or no vertical movement of air (stable conditions), pollutants can accumulate near the ground and cause temporary but acute episodes of air pollution. With regard to air quality, unstable atmospheric conditions are preferable to stable conditions.",
  "  The degree of atmospheric instability depends on the temperature gradient (i.e., the rate at which air temperature changes with altitude). In the troposphere (the lowest layer of the atmosphere, where most weather occurs), air temperatures normally decrease as altitude increases; the faster the rate of decrease, the more unstable the atmosphere. Under certain conditions, however, a temporary “ temperature inversion ” may occur, during which time the air temperature increases with increasing altitude, and the atmosphere is very stable. Temperature inversions prevent the upward mixing and dispersion of pollutants and are the major cause of air pollution episodes. Certain geographic conditions exacerbate the effect of inversions. For example, Los Angeles, situated on a plain on the Pacific coast of California and surrounded by mountains that block horizontal air motion, is particularly susceptible to the stagnation effects of inversions—hence the infamous Los Angeles smog . On the opposite coast of North America, another metropolis, New York City, produces greater quantities of pollutants than does Los Angeles but has been spared major air pollution disasters—only because of favourable climatic and geographic circumstances. During the mid-20th century, governmental efforts to reduce air pollution increased substantially after several major inversions, such as the Great Smog of London , a weeklong air pollution episode in London in 1952 that was directly blamed for more than 4,000 deaths.",
  "Because some air pollutants persist in the atmosphere and are carried long distances by winds , air pollution transcends local, regional, and continental boundaries, and it also may have an effect on global climate and weather . For example, acid rain has gained worldwide attention since the 1970s as a regional and even continental problem. Acid rain occurs when sulfur dioxide and nitrogen oxides from the burning of fossil fuels combine with water vapour in the atmosphere, forming sulfuric acid and nitric acid mists. The resulting acidic precipitation is damaging to water, forest, and soil resources. It has caused the disappearance of fish from many lakes in the Adirondack Mountains of North America, the widespread death of forests in mountains of Europe, and damage to tree growth in the United States and Canada. Acid rain can also corrode building materials and be hazardous to human health. These problems are not contained by political boundaries. Emissions from the burning of fossil fuels in the middle sections of the United States and Canada are precipitated as acid rain in the eastern regions of those countries, and acid rain in Norway comes largely from industrial areas in Great Britain and continental Europe. The international scope of the problem has led to the signing of international agreements on the limitation of sulfur and nitrogen oxide emissions.",
  "  Another global problem caused by air pollution is the ozone depletion in the stratosphere . At ground level (i.e., in the troposphere ), ozone is a pollutant, but at altitudes above 12 km (7 miles) it plays a crucial role in absorbing and thereby blocking ultraviolet radiation (UV) from the Sun before it reaches the ground. Exposure to UV radiation has been linked to skin cancer and other health problems. In 1985 it was discovered that a large “ozone hole,” an ozone-depleted region, is present every year between August and November over the continent of Antarctica . The size of this hole is increased by the presence in the atmosphere of chlorofluorocarbons (CFCs); these emanate from aerosol spray cans, refrigerators, industrial solvents, and other sources and are transported to Antarctica by atmospheric circulation. It had already been demonstrated in the mid-1970s that CFCs posed a threat to the global ozonosphere , and in 1978 the use of CFCs as propellants in aerosol cans was banned in the United States. Their use was subsequently restricted in several other countries. In 1987 representatives from more than 45 countries signed the Montreal Protocol , agreeing to place severe limitations on the production of CFCs. The efficacy of this legislation and global effort can be seen in the ozone layer’s continued recovery; in 2019 scientists recorded the smallest ozone hole above Antarctica since 1982.",
  "  One of the most significant effects of air pollution is on climate change , particularly global warming . As a result of the growing worldwide consumption of fossil fuels, carbon dioxide levels in the atmosphere have increased steadily since 1900, and the rate of increase is accelerating. It has been estimated that if carbon dioxide levels are not reduced, average global air temperatures may rise another 4 °C (7.2 °F) by the end of the 21st century. Such a warming trend might cause melting of the polar ice caps, rising of the sea level, and flooding of the coastal areas of the world. Changes in precipitation patterns caused by global warming might have adverse effects on agriculture and forest ecosystems, and higher temperatures and humidity might increase the incidence of disease in humans and animals in some parts of the world. Implementation of international agreements on reducing greenhouse gases are required to protect global air quality and to mitigate the effects of global warming.",
  "Health risks related to indoor air pollution have become an issue of concern because people generally spend most of their time indoors at home and at work. The problem has been exacerbated by well-meaning efforts to lower air-exchange rates in buildings in order to conserve energy; these efforts unfortunately allow contaminants to accumulate indoors. Indoor air pollutants include various combustion products from stoves, kerosene space heaters, and fireplaces, as well as volatile organic compounds (VOCs) from household products (e.g., paints, cleaning agents, and pesticides). Formaldehyde off-gassing from building products (especially particleboard and plywood) and from dry-cleaned textiles can accumulate in indoor air. Bacteria , viruses , molds , animal dander, dust mites , and pollen are biological contaminants that can cause disease and other health problems, especially if they build up in and are spread by central heating or cooling systems. Environmental tobacco smoke, also called secondhand smoke, is an indoor air pollutant in many homes, despite widespread knowledge about the harmful effects of smoking . Secondhand smoke contains many carcinogenic compounds as well as strong irritants. In some geographic regions, naturally occurring radon , a radioactive gas, can seep from the ground into buildings and accumulate to harmful levels. Exposure to all indoor air pollutants can be reduced by appropriate building construction and maintenance methods, limitations on pollutant sources, and provision of adequate ventilation.",
  " See also  air pollution control ."
]