[
  "  Tim Burton , byname of Timothy William Burton , (born August 25, 1958, Burbank, California, U.S.), American director known for his original, quirky style that frequently drew on elements of the fantastic and the macabre.",
  "  (Read Martin Scorsese’s Britannica essay on film preservation.)  ",
  " Edward Scissorhands Edward Scissorhands  Ed Wood Ed Wood   Burton, who became interested in drawing and filmmaking while quite young, attended the California Institute of the Arts and later worked as an animator at Disney Productions. After making a series of short films, including the horror-movie homage Frankenweenie (1984), Burton directed his first feature film, Pee-Wee’s Big Adventure , in 1985. A box-office success, the family movie centred on a man-child (played by Paul Reubens) looking for his stolen bicycle. With the dark comedy Beetlejuice (1988), Burton established himself as an unconventional filmmaker. He turned to more mainstream fare with the big-budget Batman (1989) and its sequel Batman Returns (1992). Both films were major hits. Burton was also responsible for the concept and general design of the stop-motion animation film The Nightmare Before Christmas (1993), which was directed by Henry Selick.",
  " Sleepy Hollow Sleepy Hollow   Edward Scissorhands (1990) marked Burton’s first collaboration with actor Johnny Depp . The two subsequently worked on such movies as Ed Wood (1994), a biopic about a cross-dressing filmmaker who was called the worst director ever;  Sleepy Hollow  (1999), which was based on Washington Irving ’s story “The Legend of Sleepy Hollow”; and Charlie and the Chocolate Factory (2005), an adaptation of Roald Dahl ’s children’s book of the same name.",
  "  In 2001 Burton’s remake of the science-fiction classic  The Planet of the Apes  (1968) was released. During its filming, he had begun a romantic relationship with one of its stars, Helena Bonham Carter , and the two became longtime partners. After directing Big Fish (2003), he made Corpse Bride (2005), which was nominated for an Academy Award for best animated feature. The film featured voice work by Depp and Bonham Carter, both of whom subsequently reteamed with Burton on Sweeney Todd: The Demon Barber of Fleet Street (2007), based on Stephen Sondheim ’s musical; Alice in Wonderland (2010), a special-effects-enhanced adaptation of the Lewis Carroll  story ; and Dark Shadows (2012), a comedic interpretation of a cult-favourite soap opera from the 1960s.",
  "A feature-length stop-motion remake of Frankenweenie , directed by Burton, was released in 2012. Big Eyes (2014) told the true story of painter Margaret Keane, whose husband took credit for her work during the early part of her career. Burton next directed the adventure fantasy Miss Peregrine’s Home for Peculiar Children (2016), a film adaptation of the first book in a popular young adult series by Ransom Riggs. In 2019 he received mixed reviews for Dumbo , a live-action remake of the 1941 Disney  classic . Burton then turned to television, directing several episodes of Wednesday (2022– ), a comedy-horror series inspired by the TV show The Addams Family (1964–66)."
]