[
  "  laser , a device that stimulates atoms or molecules to emit light at particular wavelengths and amplifies that light, typically producing a very narrow beam of radiation . The emission generally covers an extremely limited range of visible, infrared , or ultraviolet wavelengths. Many different types of lasers have been developed, with highly varied characteristics. Laser is an acronym for “light amplification by the stimulated emission of radiation.”",
  "The laser is an outgrowth of a suggestion made by Albert Einstein in 1916 that under the proper circumstances atoms could release excess energy as light—either spontaneously or when stimulated by light. German physicist Rudolf Walther Ladenburg first observed stimulated emission in 1928, although at the time it seemed to have no practical use.",
  "In 1951 Charles H. Townes , then at Columbia University in New York City, thought of a way to generate stimulated emission at microwave frequencies. At the end of 1953, he demonstrated a working device that focused “excited” ( see below  Energy levels and stimulated emissions ) ammonia molecules in a resonant microwave cavity, where they emitted a pure microwave frequency. Townes named the device a maser, for “microwave amplification by the stimulated emission of radiation.” Aleksandr Mikhaylovich Prokhorov and Nikolay Gennadiyevich Basov of the P.N. Lebedev Physical Institute in Moscow independently described the theory of maser operation. For their work all three shared the 1964 Nobel Prize for Physics.",
  "An intense burst of maser research followed in the mid-1950s, but masers found only a limited range of applications as low-noise microwave amplifiers and atomic clocks. In 1957 Townes proposed to his brother-in-law and former postdoctoral student at Columbia University, Arthur L. Schawlow (then at Bell Laboratories), that they try to extend maser action to the much shorter wavelengths of infrared or visible light. Townes also had discussions with a graduate student at Columbia University, Gordon Gould , who quickly developed his own laser ideas. Townes and Schawlow published their ideas for an “optical maser” in a seminal paper in the December 15, 1958, issue of Physical Review . Meanwhile, Gould coined the word laser and wrote a patent application. Whether Townes or Gould should be credited as the “inventor” of the laser thus became a matter of intense debate and led to years of litigation. Eventually, Gould received a series of four patents starting in 1977 that earned him millions of dollars in royalties.",
  "  The Townes-Schawlow proposal led several groups to try building a laser. The Gould proposal became the basis of a classified military contract. Success came first to Theodore H. Maiman , who took a different approach at Hughes Research Laboratories in Malibu, California. He fired bright pulses from a photographer’s flash lamp to excite chromium atoms in a crystal of synthetic ruby , a material he chose because he had studied carefully how it absorbed and emitted light and calculated that it should work as a laser. On May 16, 1960, he produced red pulses from a ruby rod about the size of a fingertip. In December 1960 Ali Javan, William Bennett, Jr., and Donald Herriott at Bell Labs built the first gas laser, which generated a continuous infrared beam from a mixture of helium and neon . In 1962 Robert N. Hall and coworkers at the General Electric Research and Development Center in Schenectady, New York, made the first semiconductor laser.",
  "While lasers quickly caught the public imagination, perhaps for their similarity to the “heat rays” of science fiction , practical applications took years to develop. A young physicist named Irnee D’Haenens, while working with Maiman on the ruby laser, joked that the device was “a solution looking for a problem,” and the line lingered in the laser community for many years. Townes and Schawlow had expected laser beams to be used in basic research and to send signals through air or space. Gould envisioned more powerful beams capable of cutting and drilling many materials. A key early success came in late 1963 when two researchers at the University of Michigan , Emmett Leith and Juris Upatnieks, used lasers to make the first three-dimensional holograms ( see  holography ).",
  " Helium-neon lasers were the first lasers with broad commercial applications. Because they could be adjusted to generate a visible red beam instead of an infrared beam, they found immediate use projecting straight lines for alignment, surveying, construction, and irrigation. Soon eye surgeons were using pulses from ruby lasers to weld detached retinas back in place without cutting into the eye. The first large-scale application for lasers was the laser scanner for automated checkout in supermarkets, which was developed in the mid-1970s and became common a few years later. Compact disc audio players and laser printers for personal computers soon followed.",
  "Lasers have become standard tools in diverse applications. Laser pointers highlight presentation points in lecture halls, and laser target designators guide smart bombs to their targets. Lasers weld razor blades, write patterns on objects on production lines without touching them, remove unwanted hair, and bleach tattoos. Laser rangefinders in space probes profiled the surfaces of Mars and the asteroid Eros in unprecedented detail. In the laboratory, lasers have helped physicists to cool atoms to within a tiny fraction of a degree of absolute zero .",
  "Laser emission is shaped by the rules of quantum mechanics , which limit atoms and molecules to having discrete amounts of stored energy that depend on the nature of the atom or molecule. The lowest energy level for an individual atom occurs when its electron s are all in the nearest possible orbits to its nucleus ( see  electronic configuration ). This condition is called the ground state. When one or more of an atom’s electrons have absorbed energy, they can move to outer orbits, and the atom is then referred to as being “excited.” Excited states are generally not stable; as electrons drop from higher-energy to lower-energy levels, they emit the extra energy as light.",
  "Einstein recognized that this emission could be produced in two ways. Usually, discrete packets of light known as photons are emitted spontaneously, without outside intervention. Alternatively, a passing photon could stimulate an atom or molecule to emit light—if the passing photon’s energy exactly matched the energy that an electron would release spontaneously when dropping to a lower-energy configuration. Which process dominates depends on the ratio of lower-energy to higher-energy configurations. Ordinarily, lower-energy configurations predominate. This means that a spontaneously emitted photon is more likely to be absorbed and raise an electron from a lower-energy configuration to a higher-energy configuration than to stimulate a higher-energy configuration to drop to a lower-energy configuration by emitting a second photon. As long as lower-energy states are more common, stimulated emission will die out.",
  "However, if higher-energy configurations predominate (a condition known as population inversion ), spontaneously emitted photons are more likely to stimulate further emissions, generating a cascade of photons. Heat alone does not produce a population inversion; some process must selectively excite the atoms or molecules. Typically, this is done by illuminating the laser material with bright light or by passing an electric current through it.",
  "  The simplest conceivable system, such as the ammonia maser built by Townes, has only two energy levels. More useful laser systems involve three or four energy levels. In a three-level laser, the material is first excited to a short-lived high-energy state that spontaneously drops to a somewhat lower-energy state with an unusually long lifetime, called a metastable state . The metastable state is important because it traps and holds the excitation energy, building up a population inversion that can be further stimulated to emit radiation, dropping the species back to the ground state. The ruby laser developed by Theodore Maiman is an example of a three-level laser.",
  "  Unfortunately, the three-level laser works only if the ground state is depopulated. As atoms or molecules emit light, they accumulate in the ground state, where they can absorb the stimulated emission and shut down laser action, so most three-level lasers can only generate pulses. This difficulty is overcome in the four-level laser, where an extra transition state is located between metastable and ground states. This allows many four-level lasers to emit a steady beam for days on end.",
  "  Population inversions can be produced in a gas, liquid, or solid, but most laser media are gases or solids. Typically, laser gases are contained in cylindrical tubes and excited by an electric current or external light source, which is said to “pump” the laser. Similarly, solid-state lasers may use semiconductors or transparent crystals with small concentrations of light-emitting atoms.",
  "  An optical resonator is needed to build up the light energy in the beam. The resonator is formed by placing a pair of mirrors facing each other so that light emitted along the line between the mirrors is reflected back and forth. When a population inversion is created in the medium, light reflected back and forth increases in intensity with each pass through the laser medium. Other light leaks around the mirrors without being amplified. In an actual laser cavity, one or both mirrors transmit a fraction of the incident light. The fraction of light transmitted—that is, the laser beam—depends on the type of laser. If the laser generates a continuous beam, the amount of light added by stimulated emission on each round trip between the mirrors equals the light emerging in the beam plus losses within the optical resonator.",
  "The combination of laser medium and resonant cavity forms what often is called simply a laser but technically is a laser oscillator. Oscillation determines many laser properties, and it means that the device generates light internally. Without mirrors and a resonant cavity, a laser would just be an optical amplifier, which can amplify light from an external source but not generate a beam internally. Elias Snitzer, a researcher at American Optical, demonstrated the first optical amplifier in 1961, but such devices were little used until the spread of communications based on fibre optics .",
  "Laser light generally differs from other light in being focused in a narrow beam, limited to a narrow range of wavelengths (often called “monochromatic”), and consisting of waves that are in phase with each other. These properties arise from interactions between the process of stimulated emission, the resonant cavity, and the laser medium.",
  "Stimulated emission produces a second photon identical to the one that stimulated the emission, so the new photon has the same phase, wavelength, and direction—that is, the two are coherent with respect to each other, with peaks and valleys in phase. Both the original and the new photon can then stimulate the emission of other identical photons. Passing the light back and forth through a resonant cavity enhances this uniformity, with the degree of coherence and the narrowness of the beam depending on the laser design.",
  "Although a visible laser produces what looks like a point of light on the opposite wall of a room, the alignment, or collimation, of the beam is not perfect. The extent of beam spreading depends on both the distance between the laser mirrors and diffraction , which scatters light at the edge of an aperture. Diffraction is proportional to the laser wavelength divided by the size of the emitting aperture; the larger the aperture is, the more slowly the beam spreads. A red helium-neon laser emits from a one-millimetre aperture at a wavelength of 0.633 micrometre, generating a beam that diverges at an angle of about 0.057 degree, or one milliradian. Such a small angle of divergence will produce a one-metre spot at a distance of one kilometre. In contrast, a typical flashlight beam produces a similar one-metre spot within a few metres. Not all lasers produce tight beams, however. Semiconductor lasers emit light near one micrometre wavelength from an aperture of comparable size, so their divergence is 20 degrees or more, and external optics are needed to focus their beams.",
  "The output wavelength depends on the laser material, the process of stimulated emission, and the optics of the laser resonator. For each transition between energy levels, a material can support stimulated emission over a limited range of wavelengths; the extent of that range varies with the nature of the material and the transition. The probability of stimulated emission varies with wavelength, and the process concentrates emission at wavelengths where that probability is the highest.",
  "Resonant cavities support laser oscillation at wavelengths that meet a resonant condition—an integral number N of wavelengths λ must equal the distance light travels during a round trip between the mirrors. If the cavity length is L and the refractive index of the material in the laser cavity is n , the round-trip distance 2 L must equal N λ/ n , or 2 L = N λ/ n . Each resonance is called a longitudinal mode. Except in semiconductor lasers, cavities are thousands of wavelengths long, so the wavelengths of adjacent modes are closely spaced—and usually the laser simultaneously emits light on two or more wavelengths within 0.1 percent of each other. These beams are monochromatic for most practical applications; other optics can be added to limit laser oscillation to a single longitudinal mode and an even narrower range of wavelengths. The best laboratory lasers emit a range of wavelengths that differ by less than 0.0000001 percent.",
  "The narrower the range of wavelengths, the more coherent the beam—meaning the more precisely every light wave in the beam is in exact synchronization with every other one. This is measured by a quantity called coherence length. If the centre of the range of wavelengths emitted is λ and the range of wavelengths emitted is Δλ, this coherence length equals λ 2 /2Δλ. Typical coherence lengths range from millimetres to metres. Such long coherence lengths are essential, for instance, to record holograms of three-dimensional objects.",
  "Lasers can generate pulsed or continuous beams, with average powers ranging from microwatts to over a million watts in the most powerful experimental lasers. A laser is called continuous-wave if its output is nominally constant over an interval of seconds or longer; one example is the steady red beam from a laser pointer. Pulsed lasers concentrate their output energy into brief high-power bursts. These lasers can fire single pulses or a series of pulses at regular intervals. Instantaneous power can be extremely high at the peak of a very short pulse. Laboratory lasers have generated peak power exceeding 10 15 watts for intervals of about 10 −12 second.",
  "Pulses can be compressed to extremely short duration, about 5 femtoseconds (5 × 10 −15 second) in laboratory experiments, in order to “freeze” the action during events that occur very rapidly, such as stages in chemical reactions . Laser pulses also can be focused to concentrate high powers on small spots, much as a magnifier focuses sunlight onto a small spot to ignite a piece of paper.",
  "Crystals, glasses, semiconductors, gases, liquids, beams of high-energy electrons, and even gelatin doped with suitable materials can generate laser beams. In nature, hot gases near bright stars can generate strong stimulated emission at microwave frequencies, although these gas clouds lack resonant cavities, so they do not produce beams.",
  "In crystal and glass lasers, such as Maiman’s first ruby laser, light from an external source excites atoms, known as dopants , that have been added to a host material at low concentrations. Important examples include glasses and crystals doped with the rare-earth element  neodymium and glasses doped with erbium or ytterbium , which can be drawn into fibres for use as fibre-optic lasers or amplifiers. Titanium atoms doped into synthetic sapphire can generate stimulated emission across an exceptionally broad range and are used in wavelength-tunable lasers.",
  "Many different gases can function as laser media. The common helium-neon laser contains a small amount of neon and a much larger amount of helium . The helium atoms capture energy from electrons passing through the gas and transfer it to the neon atoms, which emit light. The best-known helium-neon lasers emit red light, but they also can be made to emit yellow, orange, green, or infrared light; typical powers are in the milliwatt range. Argon and krypton atoms that have been stripped of one or two electrons can generate milliwatts to watts of laser light at visible and ultraviolet wavelengths. The most powerful commercial gas laser is the carbon-dioxide laser, which can generate kilowatts of continuous power.",
  "The most widely used lasers today are semiconductor diode lasers, which emit visible or infrared light when an electric current passes through them. The emission occurs at the interface ( see   p - n junction ) between two regions doped with different materials. The  p - n junction can act as a laser medium, generating stimulated emission and providing lasing action if it is inside a suitable cavity. Conventional edge-emitting semiconductor lasers have mirrors on opposite edges of the p - n junction, so light oscillates in the junction plane. Vertical-cavity surface-emitting lasers (VCSELs) have mirrors above and below the p - n junction, so light resonates perpendicular to the junction. The wavelength depends on the semiconductor compound.",
  "A few other types of lasers are used in research. In dye lasers the laser medium is a liquid containing organic dye molecules that can emit light over a range of wavelengths; adjusting the laser cavity changes, or tunes, the output wavelength. Chemical lasers are gas lasers in which a chemical reaction generates the excited molecules that produce stimulated emission. In free-electron lasers stimulated emission comes from electrons passing through a magnetic field that periodically varies in direction and intensity, causing the electrons to accelerate and release light energy. Because the electrons do not transition between well-defined energy levels, some specialists question whether a free-electron laser should be called a laser, but the label has stuck. Depending on the energy of the electron beam and variations in the magnetic field, free-electron lasers can be tuned across a wide range of wavelengths. Both free-electron and chemical lasers can emit high powers.",
  "Lasers deliver coherent, monochromatic, well-controlled, and precisely directed light beams. Although lasers make poor choices for general-purpose illumination, they are ideal for concentrating light in space, time, or particular wavelengths. For example, many people were first introduced to lasers by concerts in the early 1970s that incorporated laser light shows, in which moving laser beams of different colours projected changing patterns on planetarium domes, concert-hall ceilings, or outdoor clouds.",
  "Most laser applications fall into one of a few broad categories: (1) transmission and processing of information, (2) precise delivery of energy, and (3) alignment, measurement, and imaging. These categories cover diverse applications, from pinpoint energy delivery for delicate surgery to heavy-duty welding and from the mundane alignment of suspended ceilings to laboratory measurements of atomic properties.",
  "  The ability to focus laser beams onto very small spots and to switch them on and off billions of times per second makes lasers important tools in telecommunications and information processing . In laser supermarket scanners, a rotating mirror scans a red beam while clerks move packages across the beam. Optical sensors detect light reflected from striped bar codes on packages, decode the symbol, and relay the information to a computer so that it can add the price to the bill.",
  "    Tiny, inexpensive semiconductor lasers read data from a growing variety of optical compact disc formats to play music, display video recordings, and read computer software. Audio compact discs, using infrared lasers, were introduced around 1980; CD-ROM s (compact disc read-only memory) for computer data soon followed. Newer optical drives use more powerful lasers to record data on light-sensitive discs called CD-R (recordable) or CD-RW (read/write), which can be played in ordinary CD-ROM drives. DVDs (digital video, or versatile, discs) work similarly, but they use a shorter-wavelength red laser to read smaller spots, so the discs can hold enough information to play a digitized motion picture. A new generation of discs called Blu-ray uses blue-light lasers to read and store data at an even higher density.",
  "  Fibre-optic communication systems that transmit signals more than a few kilometres also use semiconductor laser beams. The optical signals are sent at infrared wavelengths of 1.3 to 1.6 micrometres, where glass fibres are most transparent. This technology has become the backbone of the global telecommunications network , and most telephone calls traveling beyond the confines of a single town go part of the way through optical fibres.",
  "Laser energy can be focused in space and concentrated in time so that it heats, burns away, or vaporizes many materials. Although the total energy in a laser beam may be small, the concentrated power on small spots or during short intervals can be enormous. Although lasers cost much more than mechanical drills or blades, their different properties allow them to perform otherwise difficult tasks. A laser beam does not deform flexible materials as a mechanical drill would, so it can drill holes in materials such as soft rubber nipples for baby bottles . Likewise, laser beams can drill or cut into extremely hard materials without dulling bits or blades. For example, lasers have drilled holes in diamond dies used for drawing wire.",
  "  Surgical removal of tissue with a laser is a physical process similar to industrial laser drilling. Carbon-dioxide lasers burn away tissue because their infrared beams are strongly absorbed by the water that makes up the bulk of living cells. A laser beam cauterizes the cuts, stopping bleeding in blood-rich tissues such as the female reproductive tract or the gums. Laser wavelengths near one micrometre can penetrate the eye , welding a detached retina back into place, or cutting internal membranes that often grow cloudy after cataract  surgery . Less-intense laser pulses can destroy abnormal blood vessels that spread across the retina in patients suffering from diabetes, delaying the blindness often associated with the disease. Ophthalmologists surgically correct visual defects by removing tissue from the cornea , reshaping the transparent outer layer of the eye with intense ultraviolet pulses.",
  "Through the use of optical fibres similar to the tiny strands of glass that carry information in telephone systems, laser light can be delivered to places within the body that the beams could not otherwise reach. One important example involves threading a fibre through the urethra and into the kidney so that the end of the fibre can deliver intense laser pulses to kidney stones . The laser energy splits the stones into fragments small enough to pass through the urethra without requiring surgical incisions. Fibres also can be inserted through small incisions to deliver laser energy to precise spots in the knee joint during arthroscopic surgery.",
  "Another medical application for lasers is in the treatment of skin conditions. Pulsed lasers can bleach certain types of tattoos as well as dark-red birthmarks called portwine stains. Cosmetic laser treatments include removing unwanted body hair and wrinkles.",
  "  Scientists have shown that lasers can concentrate extremely high powers in either pulses or continuous beams. Major applications for these high-power levels are fusion research, nuclear weapons testing, and missile defense.",
  "Extremely high temperatures and pressures are needed to force atomic nuclei to fuse together, releasing energy. In the 1960s physicists at the Lawrence Livermore National Laboratory in California calculated that intense laser pulses could produce those conditions by heating and compressing tiny pellets containing mixtures of hydrogen isotopes . They suggested using these “microimplosions” both to generate energy for civilian use and to simulate the implosion of a hydrogen bomb, which involves similar processes. Since then, Livermore has built a series of lasers to test and refine these theories, primarily for the U.S. government’s nuclear weapons program.",
  "Military laser weapon research also dates back to the 1960s, but it attracted little attention until President Ronald Reagan launched the Strategic Defense Initiative in 1983. High-energy lasers offer a way to deliver destructive energy to targets at the speed of light, which is very attractive for fast-moving targets such as nuclear missiles. Military researchers have tested high-energy lasers for use as weapons on land, at sea, in the air, and in space, although no high-energy lasers have been placed in orbit. Experiments have shown that massive lasers can generate high powers; however, tests have also shown that the atmosphere distorts such powerful beams, causing them to spread out and miss their targets. These problems and the end of the Cold War slowed research on laser weapons, though interest continues in laser weapons to defend against smaller-scale missile attacks.",
  "Surveyors and construction workers use laser beams to draw straight lines through the air. The beam itself is not visible in the air except where scattered by dust or haze, but it projects a bright point on a distant object. Surveyors bounce the beam off a mirror to measure direction and angle. The beam can set an angle for grading irrigated land, and a rotating beam can define a smooth plane for construction workers installing walls or ceilings.",
  "  Pulsed laser radar can measure distance in the same manner as microwave radar by timing how long it takes a laser pulse to bounce back from a distant object. For instance, in 1969 laser radar precisely measured the distance from the Earth to the Moon, and in the 1970s military laser range finders were developed to measure the distance to battlefield targets accurately. Laser range finding is now widely used for remote sensing. Instruments flown on aircraft can profile the layers of foliage in a forest, and the Mars Global Surveyor ( see  Mars: Spacecraft exploration ) used a laser altimeter to map elevations on the Martian surface.",
  "The coherence of laser light is crucial for interferometry ( see  optical interferometer) and holography , which depend on interactions between light waves to make extremely precise measurements and to record three-dimensional images. The result of adding light waves together depends on their relative phases. If the peaks of one align with the valleys of the other, they will interfere destructively to cancel each other out; if their peaks align, they will interfere constructively to produce a bright spot. This effect can be used for measurement by splitting a beam into two identical halves that follow different paths. Changing one path just half a wavelength from the other will shift the two out of phase, producing a dark spot. This technique has proved invaluable for precise measurements of very small distances.",
  "  Holograms are made by splitting a laser beam into two identical halves, using one beam to illuminate an object. This object beam then is combined with the other half—the reference beam—in the plane of a photographic plate, producing a random-looking pattern of light and dark zones that record the wave front of light from the object. Later, when laser light illuminates that pattern from the same angle as the reference beam, it is scattered to reconstruct an identical wave front of light, which appears to the viewer as a three-dimensional image of the object. Holograms now can be mass-produced by an embossing process, as used on credit cards, and do not have to be viewed in laser light.",
  "The ability to control laser wavelength and pulse duration precisely has proved invaluable for fundamental research in physics and other sciences. Lasers have been particularly important in spectroscopy , the study of the light absorbed and emitted when atoms and molecules make transitions between energy levels, which can reveal the inner workings of atoms. Lasers can concentrate much more power into a narrow range of wavelengths than other light sources, which makes them invaluable in analyzing fine spectroscopic details.",
  "For example, simultaneously illuminating samples with laser beams coming from opposite directions can cancel the effects of the random motions of atoms or molecules in a gas. This technique has greatly improved the precision of the measurement of the Rydberg constant , which is critical in calculations of atomic properties, and it earned Arthur Schawlow a share of the 1981 Nobel Prize for Physics. Nicolaas Bloembergen shared the prize for developing other types of high-precision laser spectroscopy.",
  "Since that early work, laser spectroscopy has expanded considerably. Laser pulses have been used to take snapshots of chemical reactions as they occur, on time scales faster than atomic vibrations in a molecule. These techniques have given chemists new ways to understand chemical physics, and they earned Ahmed Zewail the 1999 Nobel Prize for Chemistry. Thanks to his work, the Nobel Committee wrote, “we have reached the end of the road: no chemical reactions take place faster than this.”",
  "Physicists also have used the subtle forces exerted by laser beams to slow and trap atoms, molecules, and small particles. Arthur Ashkin, a researcher at Bell Labs , showed that a tightly focused horizontal laser beam could trap atoms in the zone with highest light intensity, a technique called “optical tweezers” now used in a variety of research. Other research has shown that laser illumination can slow the motion of atoms if its wavelength is tuned to a point slightly off the wavelength of peak absorption. The atoms repeatedly absorb photons from the beam and then emit photons in random directions. The photon momentum slows the motion toward the laser beam. Placing the atoms at the junction of six laser beams aimed at right angles to each other slows their momentum in all directions, producing a clump of atoms less than 0.001 degree above absolute zero . Adding a magnetic field improves confinement and can reduce their temperature to less than one-millionth degree above absolute zero. These techniques have led to the creation of a new state of matter , called a Bose-Einstein condensate , and they earned Steven Chu , Claude Cohen-Tannoudji , and William D. Phillips the 1997 Nobel Prize for Physics.",
  " James P. Harbison and Robert E. Nahory , Lasers: Harnessing the Atom’s Light (1998, reissued 2001), contains a nontechnical explanation of laser principles, a bit of history, and some applications. Jeff Hecht , Understanding Lasers: An Entry-Level Guide , 2nd ed. (1994), is particularly suitable for hobbyists. C. Breck Hitz , J.J. Ewing , and Jeff Hecht (eds.), Introduction to Laser Technology , 3rd ed. (2001), is an excellent introductory textbook.",
  " Joan Lisa Bromberg , The Laser in America, 1950–1970 (1991), shows the wide-ranging academic, industrial, and government research that led to the development of the laser and its applications and also presents an evenhanded account of the dispute over conceptual credit for the invention of the laser. Theodore H. Maiman , The Laser Odyssey (2000), is a firsthand account by the builder of the first laser. Charles H. Townes , How the Laser Happened: Adventures of a Scientist (1999, reissued 2002), presents the author’s claims to have invented the laser in addition to the maser. Nick Taylor , Laser: The Inventor, the Nobel Laureate, and the Thirty-Year Patent War (2000), takes Gordon Gould’s side in the dispute over the invention of the laser."
]