[
  "  wave , propagation of disturbances from place to place in a regular and organized way. Most familiar are surface waves that travel on water , but sound , light , and the motion of subatomic particles all exhibit wavelike properties. In the simplest waves, the disturbance oscillates periodically ( see  periodic motion ) with a fixed frequency and wavelength . Mechanical waves, such as sound, require a medium through which to travel, while electromagnetic waves ( see  electromagnetic radiation ) do not require a medium and can be propagated through a vacuum. Propagation of a wave through a medium depends on the medium’s properties. See also  seismic wave .",
  "Waves come in two kinds, longitudinal and transverse. Transverse waves are like those on water, with the surface going up and down, and longitudinal waves are like of those of sound, consisting of alternating compressions and rarefactions in a medium. The high point of a transverse wave is a called the crest, and the low point is called the trough. For longitudinal waves, the compressions and rarefactions are analogous to the crests and troughs of transverse waves. The distance between successive crests or troughs is called the wavelength. The height of a wave is the amplitude. How many crests or troughs pass a specific point during a unit of time is called the frequency. The velocity of a wave can be expressed as the wavelength multiplied by the frequency.",
  "Waves can travel immense distances even though the oscillation at one point is very small. For example, a thunderclap can be heard kilometres away, yet the sound carried manifests itself at any point only as minute compressions and rarefactions of the air.",
  "Waves display several basic phenomena. In reflection, a wave encounters an obstacle and is reflected back. In refraction, a wave bends when it enters a medium through which it has a different speed. In diffraction, waves bend when they pass around small obstacles and spread out when they pass through small openings. In interference, when two waves meet, they can interfere constructively, creating a wave with larger amplitude than the original waves, or destructively, creating a wave with a smaller (or even zero) amplitude.",
  "When waves hit a boundary and are reflected, the angle of incidence equals the angle of reflection. The angle of incidence is the angle between the direction of motion of the wave and a line drawn perpendicular to the reflecting boundary.",
  "  The speed of a wave depends on the properties of the medium through which it travels. For example, sound travels much faster through water than through air. When a wave enters at an angle a medium through which its speed would be slower, the wave is bent toward the perpendicular. When a wave enters at an angle a medium in which its speed would be increased, the opposite effect happens. With light, this change can be expressed by using Snell’s law of refraction. ",
  "  When a wave encounters a small obstacle or a small opening (that is, small compared with the wavelength of the wave), the wave can bend around the obstacle or pass through the opening and then spread out. This bending or spreading out is called diffraction.",
  "  The waves from two or more centres of disturbance may reinforce each other in some directions and cancel in others. This phenomenon is called the interference of waves. It is easy to see how this may happen. Consider two sources producing waves of the same wavelength and in phase; that is, at their origin the crests of the waves occur at the same time. If a point P is equidistant from both sources, the crests arrive at P simultaneously and reinforce each other. Similarly, the troughs arrive simultaneously and become deeper. The same situation occurs if the distances to point P are unequal but differ by one or more full wavelengths. If, however, the distances differ by half a wavelength or by an odd number of half wavelengths, then the crests of one wave will coincide with the troughs of the other and the intensity of the resultant wave is decreased. When two such waves are of equal intensity, they will cancel each other completely. Intermediate situations arise in those directions in which the distances traveled by the two waves differ by some other fraction of a wavelength, the waves tending either to reinforce or to cancel each other.",
  "  When the source of a wave moves relative to an observer, the observer notices a change in the frequency of the wave. This change is called the Doppler effect , after its discoverer, Austrian physicist Christian Doppler .",
  "Consider a source emitting a wave such as light or sound of frequency ν moving away from an observer at velocity v . The successive crests of the light waves will reach the observer at longer intervals than if the observer were at rest, and calculation shows that the observer will receive them with a frequency ν(1− v / c ), where c is the velocity of the wave. The frequency of the wave will appear to the observer slightly lower than it would if the source were at rest. If the source is approaching, the frequency will be higher.",
  "In sound this effect is an everyday experience; when a blowing horn is passed on the highway, the observer may notice that the pitch of the note seems to change. The Doppler effect for light waves is evident in spectroscopy . A shift to higher frequencies is called a blueshift, and a shift to lower frequencies is called a redshift. The redshifted light from other galaxies is evidence of the expansion of the universe.",
  "If a wave is confined to a closed space, it undergoes both reflection and interference. For example, consider a tube of length l. A disturbance anywhere in the air in the tube will be reflected from both ends and produce in general a series of waves traveling in both directions along the tube. From the geometry of the situation and the finite constant value of acoustic velocity, these must be periodic waves with frequencies fixed by the boundary conditions at the end of the tube. The allowed frequencies of the waves in the tube satisfy sin k  l = 0; i.e., the allowed frequencies are ν = n  v /2 l , where n is any integer and v is the acoustic velocity in the tube. These are the frequencies of harmonic waves that can exist in the tube and still satisfy the boundary conditions at the ends. They are called the characteristic frequencies or normal modes of vibration of the air column. The fundamental frequency ( n = 1) is ν = v /2 l .",
  "The higher frequencies, called harmonics or overtones, are multiples of the fundamental. It is customary to refer to the fundamental as the first harmonic; n = 2 gives the second harmonic or first overtone, and so on. Approximately the same set of characteristic frequencies hold for a cylindrical tube open at both ends, though the boundary conditions are different.",
  "There are positions in the tube at which the displacement of the air is zero at all times. This cannot take place in a progressive wave; thus, the wave disturbance corresponding to a normal mode is known as a standing wave. The positions of continuous zero displacement are known as nodes, while the positions for which there is maximum displacement are called antinodes. The distance between successive nodes is equal to a half wavelength of the particular mode."
]