[
  " authigenic sediment , deep-sea sediment that has been formed in place on the seafloor. The most significant authigenic sediments in modern ocean basins are metal -rich sediments and manganese nodules. Metal-rich sediments include those enriched by iron , manganese, copper , chromium , and lead . These sediments are common at spreading centres, indicating that processes at the centres are responsible for their formation—specifically, hydrothermal circulation is the controlling factor.",
  "Deep-sea drill cores have revealed the presence of metal-rich sediments on top of ancient oceanic crust away from ridge crests. It can be inferred from this that the processes controlling their formation existed in the past, but with variations. Which type of enriched sediment is deposited depends on the degree of mixing between the hydrothermal water deep in the crust at a spreading centre and the cold seawater percolating down into the crust. Little mixing produces sulfides , liberal mixing yields manganese-rich crustal material, and intermediate conditions give rise to sediments enriched in iron and manganese.",
  "Manganese nodules are pebbles or stones about the size of walnuts that are built of onionlike layers of manganese and iron oxides. Minor constituents include copper, nickel , and cobalt , making the nodules a potential ore of these valuable elements. Mining of manganese nodules has been the subject of study and experimentation since the 1950s. The nodules grow very slowly, about 1 to 4 mm (0.04 to 0.15 inch) per million years. They are found in areas of slow sedimentation , usually 5 mm (0.2 inch) per thousand years or less. The North and South Pacific hold the greatest concentration of manganese nodules; in some places, the nodules cover 90 percent of the surface of the ocean floor. Coverages this high also are found in the southernmost South Atlantic. The Indian Ocean floor is largely devoid of manganese nodules. Because seawater is supersaturated in manganese, the direct precipitation of the element onto an available surface is the most likely mode of nodule formation.",
  "Two significant mysteries surround manganese nodules. Drilling and coring in the sediment column has shown that nodules are vastly more abundant at the seafloor than below it and that the rate of growth of nodules is 10 times slower than the lowest known sedimentation rates. If such is the case, the nodules should be quickly buried and should be common in the sediment below the seafloor. Current theories for explaining these observations propose that bottom currents keep areas of nodule growth free of sediment deposition and that burrowing organisms nudge and roll the nodules in the process of feeding, thereby keeping them at the surface of the seafloor. Observations in the deep sea support both explanations."
]