[
  "  Americans with Disabilities Act (ADA) , U.S. legislation that provided civil rights protections to individuals with physical and mental disabilities and guaranteed them equal opportunity in public accommodations, employment, transportation, state and local government services, and telecommunications. The act, which defined disability as a “physical or mental impairment that substantially limits one or more of the major life activities,” was signed into law by Pres. George H.W. Bush on July 26, 1990, with widespread bipartisan support.",
  "The ADA’s employment provisions applied to all employers with 15 or more employees; those with 25 or more were given until the middle of 1992 to comply, while those with 15–24 employees had until mid-1994 to come into compliance. The public-accommodations provisions—which required that necessary changes be made to afford access by persons with disabilities to all public facilities, including restaurants, theatres, day-care centres, parks, institutional buildings, and hotels—generally went into effect early in 1992.",
  "The passage of the ADA resulted in myriad discrimination lawsuits, many of which went before the U.S. Supreme Court . For resolution of these cases, the court was required to interpret the broad antidiscrimination provisions of the law in a variety of specific contexts while at the same time balancing such questions as states’ rights and the definition of disability. In Olmstead v. L.C. (1999), the court ruled that two developmentally disabled women being held in a large psychiatric institution run by the state of Georgia should be allowed to relocate to smaller group homes and that prohibiting them from doing so constituted segregation and discrimination. In Sutton v. United Airlines, Inc. (1999), the Supreme Court ruled that two women who had sued the airline for not hiring them as pilots because they did not meet vision standards could not claim discrimination under the ADA because their correctable vision impairments did not constitute a disability. The court further limited the definition of who is disabled in Vaughn L. Murphy v. United Parcel Service, Inc. , which was decided later in 1999. In that case the majority argued that a medically treatable condition (in this instance hypertension ) cannot be considered a disability. In a unanimous decision the court also ruled against an autoworker who claimed her carpal tunnel syndrome should have qualified her as disabled and afforded her different treatment by her employer in Toyota Motor Mfg. v. Williams (2001). The decision, written by Justice Sandra Day O’Connor , noted that “given large potential differences in the severity and duration of the effects of carpal tunnel syndrome, an individual’s carpal tunnel syndrome diagnosis, on its own, does not indicate whether the individual has a disability within the meaning of the ADA.”",
  "The Supreme Court grappled with issues of states’ rights in two notable ADA-related cases. In Alabama v. Garrett (2001), the majority ruled that state workers cannot sue a state for damages if that state violates the provisions of the ADA, but three years later, in Tennessee v. Lane (2004), the court decided in favour of two people with physical disabilities who alleged that the state of Tennessee did not provide accessible courtrooms for the use of both private citizens and state employees.",
  "  The ADA Amendments Act (ADAAA), which clarified and expanded several measures of the original law, was signed into law by Pres. George W. Bush in 2008 and went into effect at the beginning of 2009. The act rejected certain Supreme Court decisions that had altered the original intent of the law. For instance, the ADAAA went against the spirit of the court’s decision in Vaughn L. Murphy v. United Parcel Service, Inc. by declaring that mitigating measures such as medication cannot be taken into account when considering whether someone should be classified as disabled; the amendment, however, made corrective eyewear an exception to that ruling, thereby reaffirming the Sutton decision. In response to the Williams ruling, the ADAAA also made clearer the law’s stance on what it means for a disability to limit a “major life activity” by defining that term more broadly to include such basic functions as eating, sleeping, seeing, and learning."
]