[
  "  Curiosity , also called Mars Science Laboratory (MSL) ,  U.S. robotic vehicle, designed to explore the surface of Mars , which determined that Mars was once capable of supporting life . The rover was launched by an Atlas V rocket from Cape Canaveral, Florida, on November 26, 2011, and landed in Gale crater on Mars on August 6, 2012.",
  "   Curiosity is about 3 metres (10 feet) long and weighs about 900 kg (2,000 pounds), which makes it the longest and heaviest rover on Mars. (By contrast, the Mars Exploration Rovers , Spirit and Opportunity, are 1.6 metres [5.2 feet] long and weigh 174 kg [384 pounds].) Unlike previous rovers, Curiosity did not have its landing cushioned by air bags; rather, because of its large size, it was lowered to the surface by three tethers from the spacecraft’s body, called the sky crane.",
  "The landing sequence was highly intricate. After a parachute significantly slowed the vehicle and after its heat shield—which had protected the rover during its entry into the atmosphere—was discarded, the spacecraft was eased toward the planet’s surface by rockets that stabilized the vehicle, allowing it to hover and protecting it from horizontal winds. Curiosity had also shed its protective shell on the way to the planet’s surface, and its mobility system—wheels and suspension—had already been released while still in the air. Curiosity was therefore ready to rove immediately after it landed, unlike the Mars Exploration Rovers, which had to wait for their lander “petals” that enclosed the rovers to open. Once touchdown of Curiosity had occurred, onboard computers released the tethers. The sky crane then pitched away and crashed far from Curiosity.",
  "All told, there were 15 critical steps involved in the landing sequence, and all of them had to be executed flawlessly for the mission to succeed. This sequence took approximately seven minutes, an interval referred to in NASA circles as the “seven minutes of terror” because of fears that errors during this stage would compromise the entire mission and years of work.",
  "Curiosity does not rely on solar cells for its energy needs but rather draws its electric power from a thermoelectric power generator , with the heat source being the radioactive decay of plutonium and the heat sink being Mars’s atmosphere. This internal power supply will allow Curiosity to continue operating through the Martian winter. Curiosity’s mission is planned to last one Martian year (687 Earth days).",
  "Curiosity’s landing site, Gale crater, is at a low elevation; if Mars ever had surface water, it would have pooled there. Aeolis Mons (also called Mount Sharp), the crater’s central mountain, consists of many layers of sedimentary rock that were laid down over much of Mars’s geological history. In September 2012 Curiosity took pictures of water-transported gravel, meaning that at one time Gale crater was likely the floor of an ancient stream.",
  "Curiosity found that early Mars could have supported life. It also found traces of organic molecules preserved in rock layers 3.5 billion years old and that the amount of methane in the Martian atmosphere varies with the seasons. As of 2020, Curiosity had traveled 21.8 km (13.5 miles) in Gale crater.",
  "  Curiosity carries several experiments that probe the Martian environment. A neutron -beam generator provided by the Russian Federal Space Agency can detect water ice down to two metres (six feet) below the surface. The Spanish Center for Astrobiology supplied Curiosity’s weather station. The largest experiment, the Sample Analysis at Mars, consists of a mass spectrometer , a gas chromatograph , and a laser spectrometer that search for carbon -containing compounds. Curiosity also has several cameras, one of which takes high-definition video at a rate of 10 frames per second."
]