[
  " library science , the principles and practices of library operation and administration, and their study. Libraries have existed since ancient times, but only in the second half of the 19th century did library science emerge as a separate field of study. With the knowledge explosion in the 20th century, it was gradually subsumed under the more general field of information science ( q.v. ).",
  "By the second half of the 19th century, Western countries had experienced such a proliferation of books of all sorts that the nature of the librarian’s work was radically altered; being well-read was no longer a sufficient characteristic for the post. The librarian needed some means of easy and rapid identification as well as strong organizational and administrative skills, and the necessity for specialized training soon became clear. One of the earliest pioneers in library training in the United States was Melvil Dewey ( q.v. ), who established the first training program for librarians in 1887. These training programs in the United States evolved into graduate programs in library education accredited by the American Library Association (ALA; founded 1876).",
  "In the 20th century, advances in the means of collecting, organizing, and retrieving information changed the focus of libraries, enabling a great variety of institutions and organizations, as well as individuals, to conduct their own searches for information without the involvement of a library or library staff. As a result, universities began to offer combined graduate programs in library science and information science. These programs usually provide a master’s degree and may provide more advanced degrees, including doctorates. Particulars of admission and course requirements vary from school to school. In the United States and Canada, the appropriateness of graduate programs in library and information science in preparing students to become professional librarians is still ensured by accreditation by the ALA. Increasingly, however, graduates of these programs are finding themselves qualified for a variety of professional positions in other parts of the information industry.",
  "In many countries the furtherance of librarianship and library systems is promoted by national and regional library associations. The Chicago-based ALA, for example, in addition to its promotion of library service and librarianship, has an extensive publishing program and holds annual national conferences. Professional associations of a similar nature exist throughout the world."
]