[
  " Brave New World , novel by Aldous Huxley , published in 1932. The book presents a nightmarish vision of a future society.",
  " Brave New World is set in 2540 ce , which the novel identifies as the year AF 632. AF stands for “after Ford,” as Henry Ford ’s assembly line is revered as god-like; this era began when Ford introduced his Model T . The novel examines a futuristic society, called the World State, that revolves around science and efficiency. In this society, emotions and individuality are conditioned out of children at a young age, and there are no lasting relationships because “every one belongs to every one else” (a common World State dictum). Huxley begins the novel by thoroughly explaining the scientific and compartmentalized nature of this society, beginning at the Central London Hatchery and Conditioning Centre, where children are created outside the womb and cloned in order to increase the population. The reader is then introduced to the class system of this world, where citizens are sorted as embryos to be of a certain class. The embryos, which exist within tubes and incubators , are provided with differing amounts of chemicals and hormones in order to condition them into predetermined classes. Embryos destined for the higher classes get chemicals to perfect them both physically and mentally, whereas those of the lower classes are altered to be imperfect in those respects. These classes, in order from highest to lowest, are Alpha, Beta, Gamma, Delta, and Epsilon. The Alphas are bred to be leaders, and the Epsilons are bred to be menial labourers.",
  "Bernard Marx, an Alpha, is one of the main characters of the story. He and his love interest, Lenina Crowne, travel to a “savage reservation,” where Marx’s boss (the Director) supposedly lost a female companion some years ago. When the two arrive, they see people living there engaging in unfamiliar rituals. They also stumble upon a woman (Linda) and her son (John, also referred to as the Savage) who Marx correctly assumes to be the lost family mentioned by the Director. The Director had recently been threatening to send Marx away for his antisocial behavior, so Marx decides to bring the two home with him.",
  "Marx presents Linda and John to the Director, and John, the son the Director never knew he had, calls the Director “father.” This provokes the Director’s resignation, as procreation between persons is outlawed, and his crime has been exposed. John is kept in the “brave new world,” as he calls it, as a sort of experiment. Linda, however, is sent to a hospital because of her addiction to “soma,” a drug used by citizens to feel calmer. She eventually dies because of it, which causes John to go on an anti-soma rampage in the hallway of the hospital.",
  "John becomes angrier and angrier with this society, until eventually he runs away to a lighthouse to live in isolation. He is able to evade tourists and reporters for a while, but eventually they find him and gawk as he engages in self-flagellation. The intensity of the crowd increases when John whips not only himself but a woman as well. Crowds descend from helicopters to witness the spectacle. Another woman appears (who is implied to be Lenina), and John attempts to whip her too. John is soon overcome with passion, and, after coming under the influence of soma, he falls asleep. The next morning, appalled at his complicity in the system, he hangs himself.",
  " Brave New World was written between World War I and World War II , the height of an era of technological optimism in the West. Huxley picked up on such optimism and created the dystopian world of his novel so as to criticize it. Much of the anxiety that drives Brave New World can be traced to a widespread belief in technology as a futuristic remedy for problems caused by disease and war. Unlike his fellow citizens, Huxley felt that such a reliance was naive, and he decided to challenge these ideas by imagining them taken to their extremes. Huxley’s life was surrounded by science, something that likely helped him to produce the science-heavy Brave New World . His grandfather ( Thomas Henry Huxley ) was a prominent biologist and an early advocate of Darwin ’s theory of evolution , and his brothers also became scientists. Aldous too had hoped to pursue a career in the sciences, but a disease left him partially blind as an adolescent and thus unable to continue on his scientific path.",
  "After Brave New World ’s publication, Huxley was accused of plagiarizing the novel My by Yevgeny Zamyatin , written in 1920 and published in English as We in the United States in 1924. Huxley denied having read the book, and the similarities between the novels can be seen as an expression of common fears surrounding the rapid advancement of technology and of the shared opinions of many tech-skeptics during the early 20th century. Following Brave New World came more dystopian novels, including, most prominently, George Orwell ’s  Nineteen Eighty-four  (1949).",
  "The clearest literary influence on Brave New World can be intuited from the title, which comes from a line in William Shakespeare’s  The Tempest  , a play preoccupied with what it means to build a new society. John is himself an echo of the play’s character Caliban , who is described as a “savage.” Huxley also signals the Bard of Avon’s influence through John’s education on the reservation, where the curriculum consists primarily of the works of Shakespeare. Some critics considered Brave New World to be, ultimately, a futuristic parody of The Tempest .",
  "The reception of Brave New World at its publication was primarily negative. Many were offended by the nature of Huxley’s future, and very few understood the novel’s philosophical implications. Many schools and libraries all over the world banned the novel, and even today it remains on lists of censored books. Parents and teachers argue that the novel’s themes of promiscuity, self-harm, and overall negativity are not suitable for children. Others, however, are still influenced by the novel’s take on dystopia, which forces the reader to ponder: In a perfect world with no poverty, sickness, or sadness, what is society missing? This question and the answers provided by Huxley in Brave New World are, perhaps, the reason the novel continues to resonate."
]