[
  " The Color Purple , novel by Alice Walker , published in 1982. It won a Pulitzer Prize in 1983. A feminist work about an abused and uneducated African American woman’s struggle for empowerment, The Color Purple was praised for the depth of its female characters and for its eloquent use of Black English Vernacular.",
  " The Color Purple documents the traumas and gradual triumph of Celie, an African American teenager raised in rural isolation in Georgia , as she comes to resist the paralyzing self-concept forced on her by others. Celie narrates her life through painfully honest letters to God. These are prompted when her abusive father, Alphonso, warns her not to tell anybody but God after he rapes her and she becomes pregnant for a second time at the age of 14. After she gives birth, Alphonso takes the child away, as he did with her first baby, leaving Celie to believe that both have been killed. When the widowed Mr.__ (also called Albert) proposes marriage to Celie’s younger sister, Nettie, Alphonso pushes him to take Celie instead, forcing her into an abusive marriage. Soon thereafter Nettie flees Alphonso and briefly lives with Celie. However, Albert’s continued interest in Nettie results in her leaving.",
  "Celie subsequently begins to build relationships with other black women, especially those engaging forcefully with oppression. Of note is the defiant Sofia, who marries Albert’s son Harpo after becoming pregnant. Unable to control her, Harpo seeks advice, and Celie suggests that he beat Sofia. However, when Harpo strikes her, Sofia fights back. Upon learning that Celie encouraged Harpo’s abuse, she confronts a guilty Celie, who admits to being jealous of Sofia’s refusal to back down, and the two women become friends. More significant, however, is Celie’s relationship with Shug Avery, a glamorous and independent singer who is also Albert’s sometime mistress. Celie tends to an ailing Shug, and the two women grow close, eventually becoming lovers.",
  "During this time Celie discovers that Albert has been hiding letters that Nettie has sent her. Celie begins reading them and learns that Nettie has befriended a minister, Samuel, and his wife, Corrine, and that the couple’s adopted children, Adam and Olivia, are actually Celie’s. Nettie joins the family on a mission in Liberia, where Corrine later dies. The letters also reveal that Alphonso is actually Celie’s stepfather and that her biological father was lynched. Questioning her faith, Celie begins addressing her letters to Nettie. However, Shug later encourages Celie to change her beliefs about God. An emboldened Celie then decides to leave Albert and go to Memphis with Shug. Once there, Celie comes into her own and creates a successful business selling tailored pants. Her happiness, however, is tempered somewhat by Shug’s affairs, though Celie continues to love her. Following Alphonso’s death, Celie inherits his house, where she eventually settles. During this time she develops a friendship with Albert, who is apologetic about his earlier treatment of her. After some 30 years apart, Celie is then reunited with Nettie, who has married Samuel. Celie also meets her long-lost children.",
  " The Color Purple movingly depicts the growing up and self-realization of Celie, who overcomes oppression and abuse to find fulfillment and independence. The novel also addresses gender equality . Walker’s best-known work, The Color Purple received widespread critical acclaim, though it was not without critics, many of whom objected to its explicit language and sexual content.",
  " The Color Purple The Color Purple  The Color Purple The Color Purple   In 1985 Steven Spielberg directed an acclaimed film adaptation of the book; it featured Whoopi Goldberg (Celie), Danny Glover (Albert), and Oprah Winfrey (Sofia). The Color Purple was also adapted for the theatre, and the first Broadway production premiered in 2005."
]