[
  " Heart of Darkness , novella by Joseph Conrad that was first published in 1899 in Blackwood’s Edinburgh Magazine and then in Conrad’s Youth: and Two Other Stories (1902). Heart of Darkness examines the horrors of Western colonialism , depicting it as a phenomenon that tarnishes not only the lands and peoples it exploits but also those in the West who advance it. Although garnering an initially lacklustre reception, Conrad’s semiautobiographical tale has gone on to become one of the most widely analyzed works of English literature. Critics have not always treated Heart of Darkness favourably, rebuking its dehumanizing representation of colonized peoples and its dismissive treatment of women. Nonetheless, Heart of Darkness has endured, and today it stands as a Modernist masterpiece directly engaged with postcolonial realities.",
  " Heart of Darkness tells a story within a story. The novella begins with a group of passengers aboard a boat floating on the River Thames. One of them, Charlie Marlow, relates to his fellow seafarers an experience of his that took place on another river altogether—the Congo River in Africa. Marlow’s story begins in what he calls the “sepulchral city,” somewhere in Europe. There “the Company”—an unnamed organization running a colonial enterprise in the Belgian Congo —appoints him captain of a river steamer. He sets out for Africa optimistic of what he will find.",
  "But his expectations are quickly soured. From the moment he arrives, he is exposed to the evil of imperialism, witnessing the violence it inflicts upon the African people it exploits. As he proceeds, he begins to hear tell of a man named Kurtz—a colonial agent who is supposedly unmatched in his ability to procure ivory from the continent’s interior. According to rumour Kurtz has fallen ill (and perhaps mad as well), thereby jeopardizing the Company’s entire venture in the Congo.",
  "Marlow is given command of his steamer and a crew of Europeans and Africans to man it, the latter of whom Conrad shamelessly stereotypes as “cannibals.” As he penetrates deeper into the jungle, it becomes clear that his surroundings are impacting him psychologically: his journey is not only into a geographical “heart of darkness” but into his own psychic interior—and perhaps into the darkened psychic interior of Western civilization as well.",
  "After encountering many obstacles along the way, Marlow’s steamer finally makes it to Kurtz. Kurtz has taken command over a tribe of natives who he now employs to conduct raids on the surrounding regions. The man is clearly ill, physically and psychologically. Marlow has to threaten him to go along with them, so intent is Kurtz on executing his “immense plans.” As the steamer turns back the way it came, Marlow’s crew fires upon the group of indigenous people previously under Kurtz’s sway, which includes a queen-figure described by Conrad with much eroticism and as exoticism.",
  "Kurtz dies on the journey back up the river but not before revealing to Marlow the terrifying glimpse of human evil he’d been exposed to. “The horror! The horror!” he tells Marlow before dying. Marlow almost dies as well, but he makes it back to the sepulchral city to recuperate. He is disdainful of the petty tribulations of Western civilization that seem to occupy everyone around him. As he heals, he is visited by various characters from Kurtz’s former life—the life he led before finding the dark interior of himself in Africa.",
  "A year after his return to Europe, Marlow pays Kurtz’s partner a visit. She is represented—as several of Heart of Darkness ’s female characters are—as naively sheltered from the awfulness of the world, a state that Marlow hopes to preserve. When she asks about Kurtz’s final words, Marlow lies: “your name,” he tells her. Marlow’s story ends there. Heart of Darkness itself ends as the narrator, one of Marlow’s audience, sees a mass of brooding clouds gathering on the horizon—what seems to him to be “heart of an immense darkness.”",
  " Heart of Darkness was published in 1902 as a novella in Youth: And Two Other Stories , a collection which included two other stories by Conrad. But the text first appeared in 1899 in Blackwood’s Edinburgh Magazine , a literary monthly on its thousandth issue, to which its editor invited Conrad to contribute. Conrad was hesitant to do so, perhaps for good reason—although Heart of Darkness received acclaim among his own literary circle, the story failed to secure any kind of popular success. That remained the case even when it was published in 1902; Heart of Darkness received the least attention out of the three stories included, and the collection was eponymously named after another one of the stories altogether. Conrad didn’t live long enough to see it become a popular success.",
  " Heart of Darkness first began garnering academic attention in the 1940 and ’50s, at a time when literary studies were dominated by a psychologically oriented approach to the interpretation of literature. Heart of Darkness was, accordingly, understood as a universalist exploration of human interiority—of its corruptibility, its inaccessibility, and the darkness inherent to it. There was something lacking in these critiques, of course: any kind of examination of the novella’s message about colonialism or its use of Africa and its people as an indistinct backdrop against which to explore the complexities of the white psyche.",
  "That changed in the 1970s when Chinua Achebe , the Nigerian author of  Things Fall Apart  , levelled an excoriating critique against Heart of Darkness for the way it dehumanized African people. Achebe’s critique opened the doors for further postcolonial analyses of the work, was followed by those from other academic perspectives: feminist readings, for example, revealed a similar kind of effacement done unto its female subjects. Although Heart of Darkness has remained on many syllabi since the 1970s, it now occupies a much more controversial position in the Western canon: as a story that, while levelling critiques against colonialism that were novel for its time, and which was formative for the emergence of modernism in literature, is still deeply and inexcusably entrenched in the white male perspective.",
  "On the most superficial level, Heart of Darkness can be understood through its semiautobiographical relationship to Conrad’s real life. Much like his protagonist Marlow, Conrad’s career as a merchant marine also took him up the Congo River. And much like Marlow, Conrad was profoundly affected by the human depravity he witnessed on his boat tour of European colonialism in Africa.",
  "But it’s overly reductive to boil Heart of Darkness down to the commonalities it shares with Conrad’s own experiences. It would be useful to examine its elements crucial to the emergence of modernism: for example, Conrad’s use of multiple narrators; his couching of one narrative within another; the story’s achronological unfolding; and as would become increasingly clear as the 20th century progressed, his almost post-structuralist distrust in the stability of language. At the same time, his story pays homage to the Victorian tales he grew up on, evident in the popular heroism so central to his story’s narrative. In that sense, Heart of Darkness straddles the boundary between a waning Victorian sensibility and a waxing Modernist one.",
  "One of the most resoundingly Modernist elements of Conrad’s work lies in this kind of early post-structuralist treatment of language—his insistence on the inherent inability of words to express the real, in all of its horrific truth. Marlow’s journey is full of encounters with things that are “unspeakable,” with words that are uninterpretable, and with a world that is eminently “inscrutable.” In this way, language fails time and time again to do what it is meant to do—to communicate. It’s a phenomenon best summed up when Marlow tells his audience that “it is impossible to convey the life-sensation of any given epoch of one’s existence—that which makes its truth, its meaning—its subtle and penetrating essence… We live, as we dream—alone.” Kurtz—as “eloquent” as he may be—can’t even adequately communicate the terrifying darkness he observed around him.“The horror! The horror!” is all he can say. Some critics have surmised that part of Heart of Darkness ’s mass appeal comes from this ambiguity of language—from the free rein it gives its readers to interpret. Others posit this as a great weakness of the text, viewing Conrad’s inability to name things as an unseemly quality in a writer who’s supposed to be one of the greats. Perhaps this is itself a testament to the Heart of Darkness ’s breadth of interpretability.",
  "Examining Heart of Darkness from a postcolonial perspective has given way to more derisive critiques. As Achebe put it, Conrad was a “thoroughgoing racist,” one who dehumanized Africans in order to use them as a backdrop against which to explore the white man’s interiority. Achebe is right: although Conrad rebukes the evils of colonialism, he does little to dismantle the racism that undergirds such a system, instead positing the indigenous people of Africa as little more than part of the natural environment. This work has been held up as one of the West’s most insightful books on the evils of European imperialism in Africa, and yet it fails to assign any particularity to African people themselves.",
  "Feminist discourse has offered similar critiques, that Conrad has flattened his female characters similar to the way he’s done so with his African ones. Women are deployed not as multidimensional beings, but as signifiers undistinguished from the field of other signifiers that make up the text. They are shells emptied of all particularity and meaning, such that Conrad can fill them with the significance he sees fit: the African queen becomes the embodiment of darkened nature and an eroticized symbol of its atavistic allure; Kurtz’s Intended, meanwhile, is just a signifier for the illusory reality of society that Marlow is trying to protect against the invading darkness of human nature. Neither woman is interiorized, and neither is named—a rhetorical strategy that seems less about Conrad illustrating the failures of language than it does about him privileging his masculine voice above any possible feminine ones.",
  "Much contemporary analysis—the aforementioned postcolonial and feminist critiques included—is centred not on text itself, but on other commentaries of the text, thereby elucidating the way that discussions in academia might unwittingly perpetuate some of the work’s more problematic elements. Thus, Heart of Darkness is occupying an ever-changing position in the literary canon: no longer as an elucidatory text that reveals the depths of human depravity, but as an artifact that is the product of such depravity and which reproduces it in its own right. The question then becomes: Does the Heart of Darkness still belong in the West’s literary canon? And if so, will it always?"
]