[
  " It’s a Wonderful Life , American dramatic film, released in 1946, that is widely considered one of the most inspirational and beloved movies in American cinema. The film, which was produced and directed by Frank Capra , has become synonymous with Christmas , when it is frequently televised.",
  " It’s a Wonderful Life It’s a Wonderful Life  The film opens on Christmas Eve as George Bailey (played by James Stewart ) is contemplating suicide. Prayers for George are heard in heaven, and Clarence Oddbody (Henry Travers), a second-class angel who has yet to earn his wings, is tasked with saving him. First, however, he is shown highlights of George’s life in the small town of Bedford Falls. Through a number of acts beginning in childhood, George is revealed as selfless and kindhearted. After the death of his father, George sets aside his dreams of traveling the world in order to run his family’s savings and loan business. His decision earns the enmity of greedy banker Mr. Potter ( Lionel Barrymore ), who is determined to close the business.",
  "As the years pass, George marries Mary (Donna Reed) and has children. One Christmas Eve, Uncle Billy (Thomas Mitchell) unknowingly gives the company’s bank deposit to the ever-scheming Mr. Potter, who secretly keeps the money. The bank examiner quickly discovers that the deposit is missing, and George faces financial disaster and arrest. Distraught, he gets drunk and heads to a bridge in order to kill himself. At this point Clarence appears and shows George what life would be like for his loved ones and neighbours had he never lived. The experience renews George’s passion for life, and his trials and hardships in turn spark an outpouring of love and benevolence in the small community. After returning home, he is visited by family and friends, who donate money to cover the missing deposit—proving that George is “the richest man in town.” As they sing “Auld Lang Syne,” a bell on the Christmas tree rings, indicating that Clarence has earned his wings.",
  "Made in the immediate aftermath of World War II , Capra’s film initially failed to connect with audiences that were used to his prewar movies known for their snappy dialogue and light comedic touches. Postwar moviegoers were in the mood for joviality, so despite being a critical success, the film was a box-office disappointment. It was only after It’s a Wonderful Life temporarily fell out of copyright and was broadcast routinely on television at Christmastime that the film built a widespread following. George Bailey, Mr. Potter, and Clarence are among the most well-known characters in film history, and names and dialogue from the film have become common references in popular culture."
]