[
  " Chlamydia trachomatis  Henrietta Lacks , née Loretta Pleasant , (born August 1, 1920, Roanoke, Virginia, U.S.—died October 4, 1951, Baltimore, Maryland), American woman whose cervical cancer cells were the source of the HeLa cell line, research on which contributed to numerous important scientific advances.",
  "After her mother died in childbirth in 1924, her father moved with his 10 children to Clover, Virginia , where he divided them among relatives to be raised. Henrietta was thus raised by her grandfather, who was also looking after another grandchild, Henrietta’s cousin David, known as Day. Henrietta and Day were married on April 10, 1941. Encouraged by a cousin, Day soon moved north to Maryland to work at Bethlehem Steel ’s Sparrows Point steel mill, which was booming with the demand generated by World War II . Soon thereafter Henrietta and the couple’s children joined Day at Turner Station, Maryland, a community outside Baltimore where many of the African American steelworkers lived.",
  "Before her fifth pregnancy, Henrietta had sensed a “knot” inside her, and worrisome bleeding and evidence of a lump on her cervix several months after giving birth finally sent Henrietta to her doctor. She was referred to the gynecology department at Johns Hopkins Hospital in Baltimore, where in February 1951 a biopsy indicated the presence of a cervical tumour that had been undetected by doctors both at the birth of her son on September 19, 1950, and at a follow-up examination six weeks later.",
  "After further tests, Henrietta received the first of several radium treatments, the standard of care for the day, which involved stitching small glass tubes of the radioactive metal secured in fabric pouches—called Brack plaques—to the cervix. While performing the procedure, the surgeon extracted two small tissue samples: one from Henrietta’s tumour and one from healthy cervical tissue close by. The samples from Henrietta’s cervix were among many extracted for physician George Gey, the head of tissue culture research at Johns Hopkins, who was searching for an “immortal” cell line for use in cancer research. Unlike previous samples, Henrietta’s cancerous cells—called HeLa, from He nrietta La cks—not only survived but also multiplied at an extraordinary rate. Henrietta herself was unaware that any sample had been taken; at that time it was not uncommon to study patients and their tissues without their knowledge or consent ( see  Tuskegee syphilis study ).",
  "While her cells thrived, Henrietta declined. By September the cancer had spread throughout her body, and early the following month Henrietta died. However, the HeLa cells, famed for their longevity, continued to thrive in culture long after Henrietta’s death. HeLa became a ubiquitous study material, contributing to the development of drugs for numerous ailments, including polio , Parkinson disease , and leukemia . In spite of this, until the 1970s Henrietta’s role was unknown even to her family. In the 21st century Henrietta’s case was an important component in the debate surrounding informed consent from patients for the extraction and use of cells in research. In 2013 the National Institutes of Health (NIH) granted the Lacks family control over how data on the HeLa cell genome would be used (the genome of a HeLa cell line had been sequenced in full earlier that year). Two members of the Lacks family formed part of the NIH’s HeLa Genome Data Access working group, which reviewed researchers’ applications for access to the HeLa sequence information."
]