[
  " Nashville Predators , American professional ice hockey team based in Nashville that plays in the Western Conference of the National Hockey League (NHL) and has won one conference championship (2017).",
  "The Predators began play in 1998 as one of the four expansion teams (along with the Atlanta Thrashers , the Columbus Blue Jackets , and the Minnesota Wild ) that joined the NHL between 1998 and 2000. The team had a losing record in each of its first five seasons, finishing no higher than third place in its division during this period. Nashville made its initial playoff appearance in 2003–04 (a first-round loss to the Detroit Red Wings ), and the team ran off three consecutive second-place divisional finishes between 2005–06 and 2007–08, losing in the first round on each occasion. After missing the playoffs in 2008–09, the Predators returned to the postseason the following year behind the play of centre Jason Arnott and defenseman Shea Weber only to lose their opening series to the eventual champion Chicago Blackhawks . In 2010–11 the Predators defeated the Anaheim Ducks in the initial round of the postseason to notch the franchise’s first playoff series win. Nashville then lost in the second round of the postseason, a result it repeated the following year.",
  "After two seasons outside playoff qualification, the Predators returned to the postseason in 2014–15. Two seasons later, with the team now starring newly acquired defenseman P.K. Subban, the Predators went on the team’s most successful postseason run since its founding, running off three consecutive series upsets to advance to the Stanley Cup finals for the first time in franchise history, where the team lost a six-game series to the Pittsburgh Penguins . Nashville set a franchise record with 53 wins in 2017–18, winning the Presidents’ Trophy for having the best record in the NHL during the regular season. However, the team was eliminated in the second round of the playoffs by the Winnipeg Jets . Nashville won another division title in 2018–19 but again disappointed in the postseason with a first-round loss. The next two seasons were shortened because of the COVID-19 pandemic, and in 2020–21 the Predators again lost in the opening round of the playoffs."
]