[
  " Focus on the Family , American Christian ministry devoted to promoting conservative political and religious principles through a variety of media outlets. Headquarters are in Colorado Springs, Colorado. The ministry seeks to “spread the Gospel of Jesus Christ through a practical outreach to homes” and aims to support Christian heterosexual marriages and families.",
  "Focus on the Family was founded as a radio program in 1977 in Arcadia, California, by the American evangelical Christian and psychologist James Dobson. The organization grew to include daily and weekly radio broadcasts and launched a print magazine (1983), Adventures in Odyssey children’s radio drama (1987), a syndicated newspaper column authored by Dobson (1992), a website (1997), and subsidiary ministries in countries throughout the world. Dobson retired as president of the group in 2003 but continued as chairman of the board of directors until 2009.",
  "Though much of the work of Focus on the Family is uncontroversial, its conservative political stances are often the subject of heated debate. In 2006 it aired a series of anti-abortion television advertisements featuring fetal ultrasound footage. Its “Letter from 2012 in Obama’s America,” issued in October 2008 during the U.S. presidential campaign , predicted the ruin of civil society under an administration led by the Democratic candidate, Barack Obama . The organization also produced an anti-abortion television commercial featuring Heisman Trophy -winning quarterback Tim Tebow that aired during the 2010 Super Bowl . Perhaps the most controversial of the group’s stances, however, is its opposition to homosexuality in general and to same-sex marriage in particular.",
  "In the early 21st century, radio broadcasts produced by Focus on the Family were heard on more than 5,000 stations in more than 150 languages, with an estimated global audience of more than 200 million. The group is funded through its media activities, including book sales and radio programs, as well as through private donations. Its radio show was inducted into the Radio Hall of Fame in 2008."
]