[
  " Patient Protection and Affordable Care Act (PPACA) , also called Affordable Care Act (ACA) or Obamacare , in the United States, health care reform legislation signed into law by U.S. Pres. Barack Obama in March 2010, which included provisions that required most individuals to secure health insurance or pay fines, made coverage easier and less costly to obtain, cracked down on abusive insurance practices, and attempted to rein in the rising costs of health care. The Patient Protection and Affordable Care Act (PPACA), also called the Affordable Care Act (ACA) or “Obamacare,” was widely considered the most far-reaching health care reform act since the passage of Medicare , the U.S. government program guaranteeing health insurance for the elderly, in 1965.",
  "A centrepiece of Obama’s campaign for the presidency was reform of the U.S. health care system—one that left some 45 million people uninsured. In February 2009, just one month after his inauguration, Obama addressed a joint session of the U.S. Congress , imploring them that the time was right for overhauling health care:",
  "[W]e must also address the crushing cost of health care. This is a cost that now causes a bankruptcy in America every thirty seconds. By the end of the year, it could cause 1.5 million Americans to lose their homes. In the last eight years, premiums have grown four times faster than wages. And in each of these years, one million more Americans have lost their health insurance. It is one of the major reasons why small businesses close their doors and corporations ship jobs overseas. And it’s one of the largest and fastest-growing parts of our budget.",
  "In June details began to emerge, with Obama favouring a so-called “public option,” a government insurance program that would compete with private businesses. The pharmaceutical industry, which had helped to scuttle Pres. Bill Clinton ’s health care reform attempt in 1993–94, said that it would support reform. In August, as members of Congress went home to their districts and held town hall meetings, strident opposition to the efforts began to emerge. Decrying the reform as “socialized medicine” and “Obamacare” (a term that Obama himself later embraced), protestors heckled supporters of health care reform—mostly directing their anger at Democrats, particularly Arlen Specter , a Republican-turned-Democrat supporter of the legislation, whose town hall meeting on August 11 with more than 1,000 people almost erupted into physical violence. Among the grievances cited by opponents was that the bill would amount to a government takeover of the health care industry and, falsely, result in the alleged creation of “death panels” that would withhold care of critically ill people.",
  "On September 9 Obama went before another joint session of Congress to outline his reform measures, discussing the stakes and arguing that it should be a bipartisan effort:",
  "I am not the first president to take up this cause, but I am determined to be the last. It has now been nearly a century since Theodore Roosevelt first called for health care reform. And ever since, nearly every President and Congress, whether Democrat or Republican, has attempted to meet this challenge in some way.",
  "Legislation was soon introduced, and it became clear that the Democrats in the House of Representatives favoured more sweeping reform than those in the Senate . Although the Democrats had, in theory, a filibuster-proof majority (60 votes) in the Senate, aided by independents Joseph Lieberman of Connecticut and Bernie Sanders of Vermont, Lieberman’s vote for a public option as well as the votes of conservative Democratic senators could not be assured. Thus, Senate majority leader Harry Reid attempted to craft a bill that could gain the support of his caucus as well as some moderate Republican senators, such as Olympia Snowe and Susan Collins of Maine.",
  "On November 7 the House of Representatives passed its version of the health care bill, the Affordable Health Care for America Act, by a slim margin of 220–215. Thirty-nine Democrats voted against the legislation, and one Republican, Anh (“Joseph”) Cao of Louisiana , backed the measure. Aiding passage was a compromise on abortion language, because some conservative pro-life Democrats, including Bart Stupak of Michigan , threatened to withhold support unless language were added restricting coverage of abortion in any health insurance plan that received federal subsidies.",
  "The Senate then proceeded with its debate on health care, with the hope of passing legislation before Christmas . The public option, included in the House version, was jettisoned in early December, as it became clear that such a provision would not pass the Senate. Abortion once again threatened to derail the process. An amendment similar to Stupak’s in the House, proposed by Democratic Sen. Ben Nelson and Republican Sen. Orrin Hatch , was voted down in the Senate 54–45, and it was unclear if Nelson would support passage without the amendment or without tougher language on abortion. Nevertheless, on December 24, with all Democrats uniting, the Senate passed its version of the legislation 60–39, which would provide health care to more than 30 million uninsured Americans.",
  "  The fate of the legislation, however, was not certain, as there were considerable differences between the Senate and House versions that would have to be reconciled. Complicating matters was the election to the Senate of Scott Brown of Massachusetts , who filled the seat that had been temporarily occupied by Democrat Paul Kirk following the death of Ted Kennedy . The election of Brown, who had campaigned actively against the health bill, deprived the Democrats of their filibuster -proof majority and made prospects for final passage uncertain.",
  "In March 2010, just as the historic measure teetered on the brink of defeat, Obama and Democratic leaders—notably Senate Majority Leader Harry Reid and Speaker of the House Nancy Pelosi —mounted a last-ditch campaign followed by legislative maneuvering. Faced with the prospect of defeat of health care reform, the Democrats eventually settled on a strategy whereby the House of Representatives would pass the Senate version of the bill, thereby making it law, and then immediately pass a bill amending (“fixing”) the legislation that it would send to the Senate. Abortion once again threatened to derail the legislation, since Stupak and a group of pro-life Democrats objected to the Senate language on abortion, but Obama intervened by pledging to issue an executive order clarifying that federal money could not be used to provide abortions. Stupak and 218 other Democrats gave final approval to the Senate version of the bill on March 21 in an atmosphere that was often heated both inside and outside the House chamber; all Republicans, including Cao, opposed the Senate bill. The package of “fixes” then passed the House 220–211 and was subsequently approved by the Senate and again by the House, because provisions related to student loans were stripped as a rules violation. The Affordable Care Act was signed into law by Obama on March 23, along with the fixes bill on March 30.",
  "Following the 2010 midterm elections, the Republicans—who had pledged during the campaign to repeal the health care bill—gained control of the House of Representatives. In one of their first acts, the House Republicans, with three Democrats, voted in January 2011 to repeal the legislation, 245–189. The following month, however, the repeal failed in the Democrat-controlled Senate on a party-line vote.",
  "The Affordable Care Act was also challenged by the attorneys general in more than a dozen states who filed suit, charging that the reform, in particular the individual mandate (the requirement that most Americans carry health insurance by 2014 or pay a penalty), was unconstitutional. Although a number of lawsuits were dismissed, some federal judges ruled beginning in late 2010 that Congress had, by enacting the individual mandate (due to take effect in 2014), exceeded the authority granted it by the commerce clause and the general welfare clause. None of these judges, however, halted the implementation of the law while the administration appealed. In March 2012 the U.S. Supreme Court heard challenges to the Affordable Care Act in the Affordable Care Act cases . In its ruling, issued in June 2012, the court held (5–4) that the individual mandate was constitutional under Congress’s taxing power and that the law’s expansion of Medicaid —the national health-insurance program for the poor, jointly funded by the federal government and the states—was constitutional as long as states that refused to expand their Medicaid rolls did not lose federal Medicaid funding for existing beneficiaries.",
  "While many provisions of the new law took effect in 2010, some would not take full effect for several years. Provisions entering into force in 2010 included:",
  "Several additional changes were slated to phase in starting in 2014, including:",
  "To finance the health care overhaul, several new fees and taxes would be levied. An excise tax would be imposed on the most expensive employer-sponsored health insurance plans. Beginning in 2013, the Medicare payroll tax would be increased for high-salaried employees, who also would have to pay a new tax on unearned income, including stock dividends and capital gains.",
  "The Affordable Care Act imposed limitations on the use of federal money. Under the reform law, federal funds could not be used for abortions except in cases of rape or incest or when the mother’s life was endangered. Additionally, illegal immigrants would not be able to buy insurance from subsidized exchanges even if they paid the full cost themselves.",
  "According to the Congressional Budget Office (CBO), the legislation would extend coverage to some 32 million additional Americans by 2019, leaving only about 6 percent of legal residents uninsured. The CBO estimated that the plan would cost $938 billion over the next 10 years but would reduce the budget deficit by $143 billion in that period and by another $1.2 trillion over the following decade.",
  "The federal health insurance exchange, which operated through a Web site called HealthCare.gov, was officially opened on October 1, 2013. However, severe technical problems with the site prevented many users from enrolling in health insurance plans during the first two months of the first open enrollment period, which ended on March 31, 2014; a special enrollment period, ending on April 19, 2014, was added for those who had been unable to complete their applications because of last-minute site failures on March 31. In May the Obama administration announced that more than eight million people had purchased health insurance on the federal and state exchanges.",
  "In July 2014 the Court of Appeals for the District of Columbia Circuit ruled in Halbig v. Burwell that the federal government could not subsidize individual health insurance policies purchased on the federal exchange, because a provision of the Affordable Care Act that determined the amount of such subsidies referred only to exchanges “established by the State.” Because most people who used the federal exchange would have been unable to afford and thus to purchase health insurance without the subsidies, the decision, had it been upheld by the Supreme Court , threatened to deprive millions of people of their insurance coverage. Only hours later, however, the Court of Appeals for the Fourth Circuit, in  King v. Burwell  , reached the opposite conclusion, holding that the federal subsidies were permissible because the relevant language of the Affordable Care Act was ambiguous. The Fourth Circuit’s decision was eventually affirmed by the Supreme Court on June 25, 2015.",
  "By 2016, the last full year of Obama’s second term, nearly 20 million formerly uninsured Americans had acquired health care coverage through the new exchanges or through the expansion of Medicaid in participating states, and the rate of increase in premiums for employer-based health insurance was considerably lower than it had been during the decade preceding implementation of the Affordable Care Act. Notwithstanding those successes, Republicans in Congress repeatedly condemned the law throughout Obama’s presidency, voting more than 50 times in the House of Representatives to repeal or amend it after the party won control of the chamber in 2010. In 2014 the Republicans also gained a majority in the Senate, and in 2016 Republican Donald J. Trump was elected president of the United States , giving the party control of both the executive and legislative branches of the federal government. Trump, who had long derided Obamacare as an expensive failure, had campaigned on a pledge to replace it with a plan that would provide all Americans with better coverage at lower premiums. Accordingly, in his first executive order (13765), Trump directed all relevant executive departments and agencies “to minimize the unwarranted economic and regulatory burdens” of the Affordable Care Act pending its repeal. Because he had not worked out a detailed alternative to the law, however, he was forced to rely on Republicans in the House to draft a bill.",
  "That task proved to be politically difficult, as it soon became apparent that changes of the sort that Republicans were contemplating—including elimination of the individual mandate, cuts in Medicaid funding, and reductions in advanced tax credits to offset insurance premiums—would disrupt the exchanges and cause several million Americans to lose their health insurance. Divisions between moderate and more-conservative Republicans in the House, and the angry feedback of constituents who now supported some form of the Affordable Care Act, prevented passage of a replacement bill until May 2017. During the next four months, similar divisions doomed several versions of a Senate bill, three of which were dramatically voted down in July; a final version was withdrawn in September.",
  "Sharply critical of Congress for having failed to replace the Affordable Care Act, Trump signed an executive order in October (13813) that permitted the sale of cheaper health insurance policies with fewer benefits than those that had been required under the law. He also announced that his administration would immediately end federal cost-sharing subsidies for low- and middle-income Americans. In December 2017 Republicans in Congress adopted—and Trump signed into law—a comprehensive tax bill that, in one of its provisions, effectively repealed the individual mandate by reducing the penalty for failing to carry health insurance to $0 beginning in 2019. In Texas v. United States , a suit brought by several Republican-led states and two individuals, a U.S. district court held in December 2018 that the individual mandate was unconstitutional (because it could no longer be enforced as a tax) and was not “severable” from other provisions of the Affordable Care Act. On those grounds, it declared the entire act unconstitutional. The ruling, which was widely criticized, was partly upheld in December 2019 by the Court of Appeals for the Fifth Circuit, which found the individual mandate to be unconstitutional but remanded the case for further consideration of the severability question. In March 2020 the Supreme Court granted two petitions for review of the Fifth Circuit’s decision, which it consolidated as California v. Texas . In a 7–2 decision issued in June 2021, the Court declined to rule on the questions of the constitutionality of the individual mandate and the mandate’s severability from the Affordable Care Act, instead holding that the parties challenging the law lacked standing to sue.",
  "In January 2021 newly elected Democratic Pres. Joe Biden signed an executive order (14009) that revoked Trump’s orders 13765 and 13813; created a new open enrollment period for Obamacare, to last from February 15 to May 15 (the period was later extended to August 15); and mandated reviews of departmental and agency actions under the Trump administration that were inconsistent with Biden’s policy “to protect and strengthen Medicaid and the ACA.”",
  " See also  The Provisions of the Landmark 2010 U.S. Health Care Reform Legislation: Year in Review 2010 ."
]