[
  "  invention , the act of bringing ideas or objects together in a novel way to create something that did not exist before.",
  " Homo erectus  Ever since the first prehistoric stone tools, humans have lived in a world shaped by invention. Indeed, the brain appears to be a natural inventor. As part of the act of perception, humans assemble, arrange, and manipulate incoming sensory information so as to build a dynamic, constantly updated model of the outside world. The survival value of such a model lies in the fact that it functions as a template against which to match new experiences, so as to rapidly identify anything anomalous that might be life-threatening. Such a model would also make it possible to predict danger. The predictive act would involve the construction of hypothetical models of the way the world might be at some future point. Such models could include elements that might, for whatever reason, be assembled into novel submodels (inventive ideas).",
  " bce  One of the earliest and most literal examples of this model-building paradigm in action was the ancient Mesopotamian invention of writing . As early as 8000 bce tiny geometric clay models, used to represent sheep and grain, were kept in clay envelopes, to be used as inventory tallies or else to represent goods during barter. Over time, the tokens were pressed onto the exterior of the wet envelope, which at some point was flattened into a tablet. By about 3100 bce the impressions had become abstract designs marked on the tablet with a cut reed stalk. These pictograms, known today as cuneiform , were the first writing. And they changed the world.",
  "Inventions almost always cause change. Paleolithic stone weapons made hunting possible and thereby triggered the emergence of permanent top-down command structures. The printing press , introduced by Johannes Gutenberg in the 15th century, once and for all curtailed the traditional authority of elders. The typewriter , brought onto the market by Christopher Latham Sholes in the 1870s, was instrumental in freeing women from housework and changing their social status for good (and also increasing the divorce rate).",
  "Inventors are often extremely observant. In the 1940s Swiss engineer George de Mestral saw tiny hooks on the burrs clinging to his hunting jacket and invented the hook-and-loop fastener system known as Velcro.",
  "Invention can be serendipitous. In the late 1800s a German medical scientist, Paul Ehrlich , spilled some new dye into a Petri dish containing bacilli, saw that the dye selectively stained and killed some of them, and invented chemotherapy. In the mid-1800s an American businessman, Charles Goodyear , dropped a rubber mixture containing sulfur on his hot stove and invented vulcanization .",
  "Inventors do it for money. Austrian chemist Auer von Welsbach , in developing the gas mantle in the 1880s, provided 30 extra years of profitability to the shareholders of gaslight companies (which at the time were threatened by the new electric light).",
  "Inventions are often unintended. In the early 1890s Edward Acheson , an American entrepreneur in the field of electric lighting, was seeking to invent artificial diamonds when an electrified mix of coke and clay produced the ultrahard abrasive Carborundum . In an attempt to develop artificial quinine in the mid-1800s, British chemist William Perkin ’s investigation of coal tar instead created the first artificial dye , tyrian purple—which later fell into Ehrlich’s Petri dish.",
  "  Inventors solve puzzles. In the course of investigating why suction pumps would lift water only about 9 metres (30 feet), Evangelista Torricelli identified air pressure and invented the barometer .",
  "Inventors are dogged. The American inventor Thomas Edison , who tested thousands of materials before he chose bamboo to make the carbon filament for his incandescent lightbulb , described his work as \"one percent inspiration and 99 percent perspiration.” At his laboratory in Menlo Park, New Jersey, Edison’s approach was to identify a potential gap in the market and fill it with an invention. His workers were told, “There’s a way to do it better. Find it.”",
  "The key to inventive success often requires being in the right place at the right time. Christopher Latham Sholes and Carlos Glidden took their invention to arms manufacturer Remington just when that company’s production lines were running down after the end of the American Civil War . A quick retool turned Remington into the world’s first typewriter manufacturer.",
  "An invention developed for one purpose will sometimes find use in entirely different circumstances. In medieval Afghanistan somebody invented a leather loop to hang on the side of a camel for use as a step when loading the animal. By 1066 the Normans had put the loop on each side of a horse and invented the stirrup . With their feet thus firmly anchored, at the Battle of Hastings that year Norman knights hit opposing English foot soldiers with their lances and the full weight of the horse without being unseated by the shock of the encounter. The Normans won the battle and took over England (and made English the French-Saxon mix it is today).",
  "One invention can inspire another. Gaslight distribution pipes gave Edison the idea for his electricity network. Perforated cards used to control the Jacquard loom led Herman Hollerith to invent punch cards for tabulator use in the 1890 U.S. census.",
  "Above all, invention appears primarily to involve a “1 + 1 = 3” process similar to the brain’s model-building activity, in which concepts or techniques are brought together for the first time and the outcome is more than the sum of the parts (e.g., spray + gasoline = carburetor ).",
  "The more often ideas come together, the more frequently invention occurs. The rate of invention increased sharply, each time, when the exchange of ideas became easier after the invention of the printing press, telecommunications , the computer , and above all the Internet . Today new fields such as data mining and nanotechnology offer would-be inventors (or semi-intelligent software programs) massive amounts of “1 + 1 = 3” opportunities. As a result, the rate of innovation seems poised to increase dramatically in the coming decades.",
  "It is going to become harder than ever to keep up with the secondary results of invention as the general public gains access to information and technology denied them for millennia and as billions of brains, each with its own natural inventive capabilities, innovate faster than social institutions can adapt. In some cases, as occurred during the global financial crisis of 2007–08 , institutions will face severe challenges from the introduction of technologies for which their old-fashioned infrastructures will be ill-prepared. It may be that the only safe way to deal with the potentially disruptive effects of an avalanche of invention, so as to develop the new social processes required to manage a permanent state of change, will be to do what the brain does: invent a comprehensive virtual world in which one can safely test innovative ideas before applying them.",
  "Notable inventors and their inventions are listed in the table."
]