[
  " gene doping , use of substances or techniques to manipulate cells or genes in order to improve athletic performance. Since the latter half of the 20th century, the manipulation of human genes has formed an important area of biomedical research, with much effort focused in particular on refining gene therapy for the treatment of diseases such as cystic fibrosis and anemia . In the early 21st century, however, members of the international sports community became concerned that athletes seeking to gain physical advantage in competition would abuse gene therapy and similar technologies. In 2003, although no athletes were known to have experimented with gene doping, the World Anti-Doping Agency, which regulates the use of substances in sports, added the transfer of cells, DNA , or RNA and the use of all other gene-altering agents, biological or pharmacological, to its list of prohibited substances and methods.",
  "One example of a gene therapy with potential for doping in sports is Repoxygen, which was originally developed for the treatment of anemia but was never tested on humans. Repoxygen consists of a segment of DNA designed to stimulate the synthesis of erythropoietin , a hormone normally produced and released by the kidneys that acts on bone marrow to augment the production of red blood cells (erythrocytes). The DNA is packaged in a viral delivery system, which enables the foreign DNA to be transferred to host cells, where it becomes integrated into the cells’ own DNA. The gene insert then instructs cells to synthesize erythropoietin. Increased numbers of red cells increase the oxygen-carrying capacity of blood , which in turn improves aerobic capacity.",
  "In addition to the erythropoietin gene, other genes have also been identified as possible targets for manipulation, including those that encode insulin-like growth factor 1, human growth hormone , phosphoenolpyruvate carboxykinase, and peroxisome proliferator-activated receptor-delta. Whereas gene therapies such as Repoxygen presumably can be detected through DNA sequencing of suspected abusers, other substances and techniques used to manipulate genes may not be easily distinguished from substances that occur naturally in the body."
]