[
  " Venn diagram , graphical method of representing categorical propositions and testing the validity of categorical syllogisms , devised by the English logician and philosopher John Venn (1834–1923). Long recognized for their pedagogical value, Venn diagrams have been a standard part of the curriculum of introductory logic since the mid-20th century.",
  "Venn introduced the diagrams that bear his name as a means of representing relations of inclusion and exclusion between classes, or sets. Venn diagrams consist of two or three intersecting circles, each representing a class and each labeled with an uppercase letter. Lowercase x ’s and shading are used to indicate the existence and nonexistence, respectively, of some (at least one) member of a given class.",
  "Two-circle Venn diagrams are used to represent categorical propositions, whose logical relations were first studied systematically by Aristotle . Such propositions consist of two terms, or class nouns, called the subject (S) and the predicate (P); the quantifier all, no, or some ; and the copula are or are not . The proposition “All S are P,” called the universal affirmative, is represented by shading the part of the circle labeled S that does not intersect the circle labeled P, indicating that there is nothing that is an S that is not also a P. “No S are P,” the universal negative, is represented by shading the intersection of S and P; “Some S are P,” the particular affirmative, is represented by placing an x in the intersection of S and P; and “Some S are not P,” the particular negative, is represented by placing an x in the part of S that does not intersect P.   ",
  "Three-circle diagrams, in which each circle intersects the other two, are used to represent categorical syllogisms, a form of deductive argument consisting of two categorical premises and a categorical conclusion. A common practice is to label the circles with capital (and, if necessary, also lowercase) letters corresponding to the subject term of the conclusion, the predicate term of the conclusion, and the middle term, which appears once in each premise. If, after both premises are diagrammed (the universal premise first, if both are not universal), the conclusion is also represented, the syllogism is valid; i.e., its conclusion follows necessarily from its premises. If not, it is invalid.",
  "Three examples of categorical syllogisms are the following.",
  "All Greeks are human. No humans are immortal. Therefore, no Greeks are immortal.",
  "Some mammals are carnivores. All mammals are animals. Therefore, some animals are carnivores.",
  "Some sages are not seers. No seers are soothsayers. Therefore, some sages are not soothsayers.",
  "To diagram the premises of the first syllogism, one shades the part of G (“Greeks”) that does not intersect H (“humans”) and the part of H that intersects I (“immortal”). Because the conclusion is represented by the shading in the intersection of G and I, the syllogism is valid.   ",
  "To diagram the second premise of the second example—which, because it is universal, must be diagrammed first—one shades the part of M (“mammals”) that does not intersect A (“animals”). To diagram the first premise, one places an x in the intersection of M and C. Importantly, the part of M that intersects C but does not intersect A is unavailable, because it was shaded in the diagramming of the first premise; thus, the x must be placed in the part of M that intersects both A and C. In the resulting diagram the conclusion is represented by the appearance of an x in the intersection of A and C, so the syllogism is valid.   ",
  "To diagram the universal premise in the third syllogism, one shades the part of Se (“seers”) that intersects So (“soothsayers”). To diagram the particular premise, one places an x in Sa (“sages”) on that part of the boundary of So that does not adjoin a shaded area, which by definition is empty. In this way one indicates that the Sa that is not an Se may or may not be an So (the sage that is not a seer may or may not be a soothsayer). Because there is no x that appears in Sa and not in So, the conclusion is not represented, and the syllogism is invalid.   ",
  "Venn’s Symbolic Logic (1866) contains his fullest development of the method of Venn diagrams. The bulk of that work, however, was devoted to defending the algebraic interpretation of propositional logic introduced by the English mathematician George Boole ."
]