[
  "  magnetic field , a vector field in the neighbourhood of a magnet , electric current , or changing electric field , in which magnetic forces are observable. Magnetic fields such as that of Earth cause magnetic compass needles and other permanent magnets to line up in the direction of the field. Magnetic fields force moving electrically charged particles in a circular or helical path. This force—exerted on electric currents in wires in a magnetic field—underlies the operation of electric motors . (For more information about magnetic fields, see  magnetism .",
  "Around a permanent magnet or a wire carrying a steady electric current in one direction, the magnetic field is stationary and referred to as a magnetostatic field. At any given point its magnitude and direction remain the same. Around an alternating current or a fluctuating direct current , the magnetic field is continuously changing its magnitude and direction.",
  "  Magnetic fields may be represented by continuous lines of force or magnetic flux that emerge from north-seeking magnetic poles and enter south-seeking magnetic poles. The density of the lines indicates the magnitude of the magnetic field. At the poles of a magnet, for example, where the magnetic field is strong, the field lines are crowded together, or more dense. Farther away, where the magnetic field is weak, they fan out, becoming less dense. A uniform magnetic field is represented by equally spaced parallel straight lines. The direction of the flux is the direction in which the north-seeking pole of a small magnet points. The lines of flux are continuous, forming closed loops. For a bar magnet, they emerge from the north-seeking pole, fan out and around, enter the magnet at the south-seeking pole, and continue through the magnet to the north pole, where they again emerge. The SI unit for magnetic flux is the weber. The number of webers is a measure of the total number of field lines that cross a given area.",
  "Magnetic fields may be represented mathematically by quantities called vectors that have direction as well as magnitude. Two different vectors are in use to represent a magnetic field: one called magnetic flux density, or magnetic induction, is symbolized by B ; the other, called the magnetic field strength, or magnetic field intensity, is symbolized by H . The magnetic field H might be thought of as the magnetic field produced by the flow of current in wires and the magnetic field B as the total magnetic field including also the contribution made by the magnetic properties of the materials in the field. When a current flows in a wire wrapped on a soft- iron cylinder, the magnetizing field H is quite weak, but the actual average magnetic field ( B ) within the iron may be thousands of times stronger because B is greatly enhanced by the alignment of the iron’s myriad tiny natural atomic magnets in the direction of the field. See also  magnetic permeability ."
]