[
  " marine biology , the science that deals with animals and plants that live in the sea. It also deals with airborne and terrestrial organisms that depend directly upon bodies of salt water for food and other necessities of life. In the broadest sense it attempts to describe all vital phenomena pertaining to the myriads of living things that dwell in the vast oceans of the world. Some of its specialized branches concern natural history, taxonomy, embryology, morphology, physiology, ecology, and geographical distribution. Marine biology is closely related to the science of oceanography because of the relationship of the physical features of the oceans to the living organisms that dwell in them. It aids in the understanding of marine geology through the study of those organisms that contribute their skeletal remains to the floors of the oceans or that elaborate the vast coral reefs of the tropic seas.",
  "A principal aim of marine biology is to discover how ocean phenomena control the distribution of organisms. Marine biologists study the way in which particular organisms are adapted to the various chemical and physical properties of the seawater, to the movements and currents of the ocean, to the availability of light at various depths, and to the solid surfaces that make up the seafloor. Special attention is given to determining the dynamics of marine ecosystems, particularly to the understanding of food chains and predator-prey relationships. Marine biological information on the distribution of fish and crustacean populations is of great importance to fisheries. Marine biology is also concerned with the effects of certain forms of pollution on the fish and plant life of the oceans, particularly the effects of pesticide and fertilizer runoff from land sources, accidental spills from oil tankers, and silting from coastline construction activities.",
  "During the second half of the 19th century, when the emphasis was on the collection, description, and cataloging of marine organisms, methods evolved for the capture and preservation of specimens for study. Marine biologists adapted traditional dredges and trawls to collect specimens from the ocean floor; and hoop nets were used to secure free-swimming animals. New instruments for collecting water samples and obtaining temperature information at any desired depth were developed.",
  "Late in the 19th century, the focus began to shift from collecting and cataloging to the systematic analysis of marine ecosystems and the ecological roles and behaviour of marine life. By the early 20th century, oceanographers had begun to intensively study fishing grounds and other localities of economic importance. This research combined studies of marine flora and fauna, ocean currents, water temperature, salinity, and oxygen levels, and other factors in an effort to understand the relationship between marine animals and their environment.",
  "Since World War II, direct observation of marine organisms in their natural habitats has been made possible by underwater cameras, television, improved diving equipment, and submersible craft, or submarines, that can descend to great depths. Underwater television provides the observer with a continuous picture of events that occur within the field of the submerged camera. The development of self-contained diving equipment made it possible for the investigator to inspect marine organisms in their natural habitat.",
  "Morphological and taxonomic studies of marine organisms are generally performed on preserved materials in connection with the work in museums and universities. Physiological and embryological investigations requiring the use of living material are generally pursued at biological stations. These are situated on the seacoast, thus facilitating the rapid transfer of specimens to the laboratory where they may be maintained in seawater provided by special circulating systems."
]