[
  "  recycling , recovery and reprocessing of waste materials for use in new products. The basic phases in recycling are the collection of waste materials, their processing or manufacture into new products, and the purchase of those products, which may then themselves be recycled. Typical materials that are recycled include iron and steel scrap, aluminum cans, glass bottles, paper , wood , and plastics . The materials reused in recycling serve as substitutes for raw materials obtained from such increasingly scarce natural resources as petroleum , natural gas , coal , mineral ores , and trees . Recycling can help reduce the quantities of solid waste deposited in landfills , which have become increasingly expensive. Recycling also reduces the pollution of air , water , and land resulting from waste disposal.",
  "  There are two broad types of recycling operations: internal and external. Internal recycling is the reuse in a manufacturing process of materials that are a waste product of that process. Internal recycling is common in the metals industry, for example. The manufacture of copper tubing results in a certain amount of waste in the form of tube ends and trimmings; this material is remelted and recast. Another form of internal recycling is seen in the distilling industry, in which, after the distillation, spent grain mash is dried and processed into an edible foodstuff for cattle.",
  "  External recycling is the reclaiming of materials from a product that has been worn out or rendered obsolete. An example of external recycling is the collection of old newspapers and magazines for repulping and their manufacture into new paper products. Aluminum cans and glass bottles are other examples of everyday objects that are externally recycled on a wide scale. These materials can be collected by any of three main methods: buy-back centres, which purchase waste materials that have been sorted and brought in by consumers; drop-off centres, where consumers can deposit waste materials but are not paid for them; and curbside collection, in which homes and businesses sort their waste materials and deposit them by the curb for collection by a central agency.",
  "  Society’s choice of whether and how much to recycle depends basically on economic factors. Conditions of affluence and the presence of cheap raw materials encourage human beings’ tendency to simply discard used materials. Recycling becomes economically attractive when the cost of reprocessing waste or recycled material is less than the cost of treating and disposing of the materials or of processing new raw materials.",
  "Ferrous products (i.e., iron and steel ) can be recycled by both internal and external methods. Some internal recycling methods are obvious. Metal cuttings or imperfect products are recycled by remelting, recasting, and redrawing entirely within the steel mill. The process is much cheaper than producing new metal from the basic ore. Most iron and steel manufacturers produce their own coke . By-products from the coke oven include many organic compounds , hydrogen sulfide , and ammonia . The organic compounds are purified and sold. The ammonia is sold as an aqueous solution or combined with sulfuric acid to form ammonium sulfate, which is subsequently dried and sold as fertilizer.",
  "In the ferrous metals industry there are also many applications of external recycling. Scrap steel makes up a significant percentage of the feed to electric arc and basic oxygen furnaces. The scrap comes from a variety of manufacturing operations that use steel as a basic material and from discarded or obsolete goods made from iron and steel. One of the largest sources of scrap steel is the reprocessing of old automobile bodies.",
  "Salvage operations on automobiles actually begin before they reach the reprocessor. Parts such as transmissions and electrical components can be rebuilt and resold, and the engine block is removed and melted down for recasting. After being crushed and flattened, the automobile body is shredded into small pieces by hammer mills. Ferrous metals are separated from the shredder residue by powerful magnets, while other materials are sorted out by hand or by jets of air. Only the plastics, textiles, and rubber from the residue are not reused. The same basic recovery procedures apply to washing machines, refrigerators, and other large, bulky steel or iron items. Lighter items such as steel cans are also recycled in large numbers.",
  "At present, manual sorting seems to be the only practical method of separating pieces of nonferrous scrap materials such as aluminum , copper , and lead .",
  "Secondary aluminum reprocessing is a large industry, involving the recycling of machine turnings, rejected castings, siding, and even aluminum covered with decorative plastic. The items are thrown into a reverberatory furnace (in which heat is radiated from the roof into the material treated) and melted while the impurities are burned off. The resulting material is cast into ingots and resold for drawing or forming operations. Beverage cans are another major source of recycled aluminum; in some countries, as many as two-thirds of all such cans are recycled.",
  "The primary source of used lead is discarded electric storage batteries . Battery plates may be smelted to produce antimonial lead (a lead-antimony alloy) for manufacture of new batteries or to produce pure lead and antimony as separate products.",
  "Though much used rubber was formerly burned, this practice has been greatly curtailed in most countries in order to prevent air pollution. Internal recycling is common in most rubber plants; the reprocessed product can be used wherever premium-grade rubber is not needed. External recycling has proved a problem over the years, as the cost of recycling old or worn-out tires has far exceeded the value of the reclaimed material. Shredded rubber can be used as an additive in asphalt pavements, and discarded tires may be used as components of swings and other assorted recreational climbing equipment in “tire playgrounds” for children.",
  "One of the most readily available materials for recycling is paper , which alone accounts for more than one-third by weight of all the material deposited in landfills in the United States. The stream of wastepaper consists principally of newspaper; office, copying, and writing paper; computer paper; coloured paper; paper tissues and towels; boxboard (used for cereal and other small boxes); corrugated cardboard; and kraft paper (used for paper bags). These papers must usually be sorted before recycling. Newsprint and cardboard can be repulped to make the same materials, while other types of scrap paper are recycled for use in low-quality papers such as boxboard, tissues, and towels. Paper intended for printing-grade products must be de-inked (often using caustic soda) after pulping; for some uses the stock is bleached before pressing into sheets. Smaller amounts of recycled paper are made into cellulose insulation and other building products.",
  " Bark , wood chips, and lignin from sawmills, pulp mills, and paper mills are returned to the soil as fertilizers and soil conditioners. The kraft process of papermaking produces a variety of liquid wastes that are sources of such valuable chemicals as turpentine , methyl alcohol , dimethyl sulfide, ethyl alcohol , and acetone . Sludges from pulp and paper manufacture and phosphate slime from fertilizer manufacture can be made into wallboard .",
  " Glass makes up about 6 percent by weight of the material in municipal waste streams. Glass is an easily salvageable material but one that is difficult to recover economically. Though enormous numbers of glass containers are used throughout the world, much of this glass is still not recycled, because the raw materials are so inexpensive that there is scant economic motive to reuse them. Even those glass containers that are returned by consumers in their original form sooner or later become damaged or broken.",
  "One problem in recycling glass is separating it from other refuse. Another problem is that waste glass must be separated by colour (i.e., clear, green, and brown) before it can be reused to make new glass containers. Despite these difficulties, anywhere from 35 to 90 percent of cullet (broken or refuse glass) is currently used in new-glass production, depending on the country.",
  " Plastics account for almost 10 percent by weight of the content of municipal garbage. Plastic containers and other household products are increasingly recycled, and, like paper, these must be sorted at the source before processing. Various thermoplastics may be remelted and reformed into new products.",
  "  Thermoplastics must be sorted by type before they can be remelted. Thermosetting plastics such as polyurethane and epoxy resins, by contrast, cannot be remelted; these are usually ground or shredded for use as fillers or insulating materials. So-called biodegradable plastics include starches that degrade upon exposure to sunlight (photodegradation), but a fine plastic residue remains, and the degradable additives preclude recycling of these products.",
  "Construction and demolition (C&D) debris (e.g., wood, brick, portland cement concrete, asphalt concrete and metals) can be reclaimed and reused to help reduce the volume taken up by such materials in landfills. Concrete debris consists mostly of sand and gravel that can be crushed and reused for road subbase gravel. Clean wood from C&D debris can be chipped and used as mulch, animal bedding, and fuel. Asphalt can be reused in cold-mix paving products and roofing shingles. Recovered wallboard can be used as cat litter. As landfill space becomes more expensive, more of these materials are being recycled.",
  "Domestic refuse (municipal solid waste) includes garbage and rubbish. Garbage contains highly decomposable food waste (e.g., kitchen scraps), while rubbish is the dry, nonputrescible component of refuse. Once glass, plastics, paper products, and metals have been removed from domestic refuse, what remains is essentially organic waste. This waste can be biologically decomposed and turned into humus , which is a useful soil conditioner, and kitchen scraps, when decomposed with leaves and grass in a compost mound, make an especially useful soil amendment. These practices help reduce the amount of material contributed by households to landfills.",
  "Treated wastewater (domestic sewage) can be reclaimed and reused for a variety of purposes, including golf course and landscape irrigation. With achievement of appropriate (secondary) treatment levels, it may be reused for the irrigation of certain agricultural crops. After very high levels of advanced (or tertiary) treatment and purification, it may even be used to supplement drinking water supplies. However, because of public resistance to the direct reuse of treated sewage for domestic purposes, recovered water must be recycled indirectly. This is done by injecting it into the ground or storing it in ponds and allowing it to seep into naturally occurring aquifers so that it is further purified as it slowly moves through the geologic strata. In some regions of the world where water supplies are inadequate because of recurring drought and rapidly expanding populations, the recycling and reuse of treated wastewater is a virtual necessity. See  wastewater treatment ."
]