[
  " materials processing , series of operations that transform industrial materials from a raw-material state into finished parts or products. Industrial materials are defined as those used in the manufacture of “hard” goods, such as more or less durable machines and equipment produced for industry and consumers, as contrasted with disposable “soft” goods, such as chemicals, foodstuffs, pharmaceuticals, and apparel.",
  "Materials processing by hand is as old as civilization. Mechanization began with the Industrial Revolution of the 18th century, and in the early 19th century the basic machines for forming, shaping, and cutting were developed, principally in England. Since then, materials-processing methods, techniques, and machinery have grown in variety and number.",
  "  The cycle of manufacturing processes that converts materials into parts and products starts immediately after the raw materials are either extracted from minerals or produced from basic chemicals or natural substances. Metallic raw materials are usually produced in two steps. First, the crude ore is processed to increase the concentration of the desired metal ; this is called beneficiation . Typical beneficiation processes include crushing, roasting, magnetic separation, flotation, and leaching . Second, additional processes such as smelting and alloying are used to produce the metal that is to be fabricated into parts that are eventually assembled into a product.",
  "In the case of ceramic materials, natural clay is mixed and blended with various silicates to produce the raw material. Plastic resins are produced by chemical methods in powder, pellet, putty, or liquid form. Synthetic rubber is also made by chemical techniques, being produced, as is natural rubber , in such forms as slabs, sheeting, crepe, and foam for fabricating into finished parts.",
  "The processes used to convert raw materials into finished products perform one or both of two major functions: first, they form the material into the desired shape, and, second, they alter or improve the properties of the material.",
  "Forming and shaping processes may be classified into two broad types—those performed on the material in a liquid state and those performed on the material in a solid or plastic condition. The processing of materials in liquid form is commonly known as casting when it involves metals, glass , and ceramics; it is called molding when applied to plastics and some other nonmetallic materials. Most casting and molding processes involve four major steps: (1) making an accurate pattern of the part, (2) making a mold from the pattern, (3) introducing the liquid into the mold, and (4) removing the hardened part from the mold. A finishing operation is sometimes needed.",
  "  Materials in their solid state are formed into desired shapes by the application of a force or pressure. The material to be processed can be in a relatively hard and stable condition and in such forms as bar, sheet, pellet, or powder, or it can be in a soft, plastic, or puttylike form. Solid materials can be shaped either hot or cold. Processing of metals in the solid state can be divided into two major stages: first, the raw material in the form of large ingots or billets is hot-worked, usually by rolling, forging, or extrusion, into smaller shapes and sizes; second, these shapes are processed into final parts and products by one or more smaller scale hot or cold forming processes.",
  "After the material is formed, it is usually further altered. In materials processing, a “removal” process is one that eliminates portions of a piece or body of material to achieve a desired shape. Although removal processes are applied to most types of materials, they are most widely used on metallic materials. Material can be removed from a workpiece by either mechanical or nonmechanical means.",
  "  There are a number of metal-cutting processes. In almost all of them, machining involves the forcing of a cutting tool against the material to be shaped. The tool, which is harder than the material to be cut, removes the unwanted material in the form of chips. Thus, the elements of machining are a cutting device, a means for holding and positioning the workpiece, and usually a lubricant (or cutting oil). There are four basic non-cutting removal processes: (1) In chemical milling the metal is removed by the etching reaction of chemical solutions on the metal; although usually applied to metals, it can also be used on plastics and glass. (2) Electrochemical machining uses the principle of metal plating in reverse, as the workpiece, instead of being built up by the plating process, is eaten away in a controlled manner by the action of the electrical current . (3) Electrical discharge machining and grinding erodes or cuts the metal by high-energy sparks or electrical discharges. And (4) laser machining cuts metallic or refractory materials with an intense beam of light from a laser .",
  "  Another further alteration may be “joining,” the process of permanently, sometimes only temporarily, bonding or attaching materials to each other. The term as used here includes welding , brazing , soldering , and adhesive and chemical bonding. In most joining processes, a bond between two pieces of material is produced by application of one or a combination of three kinds of energy: thermal , chemical , or mechanical . A bonding or filler material, the same as or different from the materials being joined, may or may not be used.",
  "The properties of materials can be further altered by hot or cold treatments, by mechanical operations, and by exposure to some forms of radiation . The property modification is usually brought about by a change in the microscopic structure of the material. Both heat-treating, involving temperatures above room temperature, and cold-treating, involving temperatures below room temperature, are included in this category. Thermal treatment is a process in which the temperature of the material is raised or lowered to alter the properties of the original material. Most thermal-treating processes are based on time-temperature cycles that include three steps: heating, holding at temperature, and cooling. Although some thermal treatments are applicable to most families of materials, they are most widely used on metals.",
  "Finally, “finishing” processes may be employed to modify the surfaces of materials in order to protect the material against deterioration by corrosion , oxidation, mechanical wear, or deformation; to provide special surface characteristics such as reflectivity, electrical conductivity or insulation, or bearing properties; or to give the material special decorative effects. There are two broad groups of finishing processes, those in which a coating, usually of a different material, is applied to the surface and those in which the surface of the material is changed by chemical action, heat, or mechanical force. The first group includes metallic coating, such as electroplating ; organic finishing, such as painting ; and porcelain enameling."
]