[
  " Media , ancient country of northwestern Iran, generally corresponding to the modern regions of Azerbaijan, Kurdistan, and parts of Kermanshah. Media first appears in the texts of the Assyrian king Shalmaneser III (858–824 bc ), in which peoples of the land of “Mada” are recorded. The inhabitants came to be known as Medes.",
  "Although Herodotus credits “Deioces son of Phraortes” (probably c. 715) with the creation of the Median kingdom and the founding of its capital city at Ecbatana (modern Hamadan), it was probably not before 625 bc that Cyaxares, grandson of Deioces, succeeded in uniting into a kingdom the many Iranian-speaking Median tribes. In 614 he captured Ashur, and in 612, in alliance with Nabopolassar of Babylon, his forces stormed Nineveh, putting an end to the Assyrian empire. The victors divided the Assyrian provinces among themselves, with the Median king taking over a large part of Iran, northern Assyria, and parts of Armenia.",
  "In many respects the internal organization of the Median empire probably resembled that of Assyria, but little is actually known. Few identifiable “Median” objects have been found, but the Medes apparently favoured rich ornamentation and also received a strong artistic influence from Assyria. Since no Median written documents of any kind have ever been uncovered, their spiritual and economic life is also a matter of conjecture.",
  "By the victory in 550 of the Persian chief Cyrus II the Great over his suzerain, Astyages of Media, the Medes were made subject to the Persians. In the new Achaemenian Empire they retained a prominent position; in honour and war they stood next to the Persians, and their court ceremonial was adopted by the new sovereigns, who in the summer months resided in Ecbatana.",
  "Alexander the Great occupied Media in 330, and in the partition of his empire, southern Media was given to the Macedonian commander Peithon and eventually passed to the Seleucids, but the north was left to Atropates, a former general of Darius III, who succeeded in founding an independent kingdom, named Atropatene, with its capital at Gazaca. In later times Atropatene came under the control of Parthia, Armenia, and Rome.",
  "Southern Media remained a province of the Seleucid empire for a century and a half, and Hellenism was introduced everywhere. About 152 bc , however, Media was taken by the Parthian king Mithradates I, and it remained subject to the Arsacids until about ad 226, when it passed, together with Atropatene, to the Sāsānians. By that time the Medes had lost their distinctive character and had been amalgamated into the one nation of the Iranians."
]