[
  " −9  membrane , in biology, the thin layer that forms the outer boundary of a living cell or of an internal cell compartment. The outer boundary is the plasma membrane, and the compartments enclosed by internal membranes are called organelles. Biological membranes have three primary functions: (1) they keep toxic substances out of the cell; (2) they contain receptors and channels that allow specific molecules, such as ions, nutrients, wastes, and metabolic products, that mediate cellular and extracellular activities to pass between organelles and between the cell and the outside environment; and (3) they separate vital but incompatible metabolic processes conducted within organelles.",
  "Membranes consist largely of a lipid bilayer, which is a double layer of phospholipid, cholesterol, and glycolipid molecules that contains chains of fatty acids and determines whether a membrane is formed into long flat sheets or round vesicles. Lipids give cell membranes a fluid character, with a consistency approaching that of a light oil. The fatty-acid chains allow many small, fat-soluble molecules, such as oxygen, to permeate the membrane, but they repel large, water-soluble molecules, such as sugar, and electrically charged ions, such as calcium.",
  "  Embedded in the lipid bilayer are large proteins, many of which transport ions and water-soluble molecules across the membrane. Some proteins in the plasma membrane form open pores, called membrane channels, which allow the free diffusion of ions into and out of the cell. Others bind to specific molecules on one side of a membrane and transport the molecules to the other side. Sometimes one protein simultaneously transports two types of molecules in opposite directions. Most plasma membranes are about 50 percent protein by weight, while the membranes of some metabolically active organelles are 75 percent protein. Attached to proteins on the outside of the plasma membrane are long carbohydrate molecules.",
  "  ",
  "Many cellular functions, including the uptake and conversion of nutrients, synthesis of new molecules, production of energy, and regulation of metabolic sequences, take place in the membranous organelles. The nucleus, containing the genetic material of the cell, is surrounded by a double membrane with large pores that permit the exchange of materials between the nucleus and cytoplasm. The outer nuclear membrane is an extension of the membrane of the endoplasmic reticulum, which synthesizes the lipids for all cell membranes. Proteins are synthesized by ribosomes that are either attached to the endoplasmic reticulum or suspended freely in the cell contents. The mitochondria, the oxidizing and energy-storing units of the cell, have an outer membrane readily permeable to many substances, and a less-permeable inner membrane studded with transport proteins and energy-producing enzymes."
]