[
  " intellectual disability , also called developmental disability or mental retardation , any of several conditions characterized by subnormal intellectual functioning and impaired adaptive behaviour that are identified during the individual’s developmental years. Increasingly, sensitivity to the negative connotations of the label mentally retarded prompted the substitution of other terms, such as mentally challenged , developmentally disabled , and cognitively impaired , with the term intellectually disabled achieving wider currency in the 21st century.",
  "Intellectual disability is commonly identified through standardized intelligence tests , a tested intelligence quotient ( IQ ) of 70 being the usual upper borderline for those needing special care and training. It is classified according to categories that take into account an individual’s physical and social development. These categories correspond roughly to IQ scores. Those who have scores in the upper range of intellectual disability, roughly 53 to 70, comprise the majority of intellectually disabled persons; they are able to learn academic and prevocational skills with some special training. Those in the moderate range, roughly 36 to 52, are able to talk and care for their own basic needs, to learn functional academic skills, and to undertake semiskilled work under sheltered conditions. Those in the severe range, about 21 to 35, show slow motor development, limited communication skills, and possible physical handicaps but have the ability to talk and care for their basic needs, as well as to contribute to their own maintenance with supervision in work and living situations. Finally, those in the profound range, comprising the smallest number of intellectually disabled, demonstrate minimal responsiveness, secondary physical handicaps, poor motor development and communication skills, and the ability to perform only highly structured work activities. Institutionalization in this case is almost inevitable. Educators have coordinated IQ scores with potential learning capabilities: educable, 50–75; trainable, 25–50; and custodial, 0–25.",
  "Moderate to severe intellectual disability can be caused by a number of mishaps that may occur before, during, or after birth, including: genetic disorders, such as Down syndrome (leading to cretinism, for example); infectious diseases, such as meningitis ; metabolic disorders; physical malformations; poisoning from radiation, lead , or other toxic agents; injuries to the head; and malnutrition . Milder cases of progressive intellectual disability can sometimes be traced to economic and environmental deprivation early in childhood—conditions that are associated with poverty or famine.",
  "In the past, care and treatment of intellectually disabled persons was mainly custodial. More recently, however, efforts have been directed toward improved medical treatment of organic conditions, parent education, special schooling, vocational training, and sheltered workshops. Many intellectually disabled persons are capable of becoming productive and nearly independent members of society, although in most cases specialized training and continuing guidance are necessary.",
  "Residential care is often a necessity for the more severely intellectually disabled (who need constant attention) as well as for senior intellectually disabled persons. Psychologists believe the best kind of residential care is that which most closely resembles family life. Residential care facilities and group homes are typically located in apartments or individual houses.",
  "For many school-age children, special education is one of the most important keys to self-sufficiency. Mainstreaming—the integration of children from special education classes with those in the regular program—is an attempt to acquaint intellectually disabled children with normal school routines, an often laudable goal which can nevertheless create daunting educational challenges for teachers as well as for intellectually disabled and nonintellectually disabled children alike. Moreover, physical integration alone does not guarantee acceptance by peers. Social and psychological integration must also be considered."
]