[
  " mint , (genus Mentha ), genus of 25 species of fragrant herbs of the mint family ( Lamiaceae ). Native to Eurasia, North America, southern Africa, and Australia, mints are widely distributed throughout the temperate areas of the world and have naturalized in many places. A number of species, particularly peppermint and spearmint , are used as flavourings for foods (including candy and gum) and for liqueur and dentifrices. The essential oils of mints are used as scents in perfumery. Some species are commonly used in herbal medicine.",
  " Mentha piperita  Mints have square stems and opposite aromatic leaves . Many can spread vegetatively by stolons and can be aggressive in gardens. The small flowers are usually pale purple, pink, or white in colour and are arranged in clusters, either forming whorls or crowded together in a terminal spike. The flowers are not typical of other members of the family, having four rather than five united petals. The volatile oils are contained in resinous dots in the leaves and stems.",
  " Spearmint ( Mentha spicata ) grows to about 90 cm (3 feet) in height, with open spikes of pink or lilac flowers and stalkless leaves; it has the characteristic mint fragrance. Peppermint ( Mentha × piperita ), a hybrid between spearmint and water mint, has a heavy scent, stalked leaves, and reddish lilac flowers in dense spikes. Water mint ( M. aquatica ) commonly grows in ditches and has rounded flower spikes and stalked hairy leaves. Wild mint ( M. arvensis ), native in North America and Eurasia, reaches about 1 metre (about 3.3 feet) in height.",
  "Pennyroyal ( M. pulegium ) has small oval obtuse leaves and flowers in axillary whorls and is remarkable for its creeping habit and pungent odour. It has been used in folk medicine to induce perspiration and menstruation . The plant has also been used as an herbal abortifacient , though such preparations are unlikely to terminate a pregnancy . Pennyroyal can induce potentially lethal reactions such as vomiting, hemorrhages , and organ failure in people who ingest it. Pennyroyal oil in particular is highly toxic and should not be ingested.",
  "Other members of the family Lamiaceae are also known as mints: the bergamots , or bee balms (genus Monarda ), are sometimes called horsemint; members of the genus Pycnanthemum are called mountain mints; catnip ( Nepeta cataria ) is also known as catmint; dittany ( Cunila origanoides ) is called stonemint; and plants of the Australian genus Prostanthera are called mint bushes."
]