[
  " mint , in economics, a place where coins are made according to exact compositions, weights, dimensions, and tolerances, usually specified by law.",
  "The first state mint was probably established by the Lydians, an Anatolian people, in the 7th century bc . The Greeks of the Aegean Islands soon followed their example, and the art spread into Italy and other Mediterranean countries, as well as to Persia and India. The Romans, who probably began coining in the 4th century bc , laid the foundations of modern minting.",
  "Coining originated independently in China in the 7th century bc and spread into Japan and Korea.",
  "In medieval Europe, mints proliferated as commerce revived, and every feudal authority—kings, counts, bishops, and free cities—exercised the mint privilege; there were more than 50 mints in 13th-century France alone. The result was a wide variation in coinage that often handicapped commerce.",
  "In the 16th century, mints were set up by the Spaniards in South America and Mexico to coin the gold and silver mined there.",
  "Most modern countries operate only one mint. In Great Britain, however, the mint at Llantrisant, Wales, produces the vast bulk of coinage, while the London mint at Tower Hill is largely an administrative centre. These mints are under the direction of the Royal Mint, a government agency that reports to a minister in the Treasury.",
  "There have been eight coinage mints in operation at various times in the United States. Of these, only four were active in the late 20th century. The mint in Philadelphia, Pa., was founded in 1792 and still produces the majority of the coins used in daily circulation in the United States. The mint in Denver, Colo., founded in 1906, also produces general coinage. The mint in San Francisco, Calif., founded in 1854, discontinued making general coinage in 1955; but it was reestablished in 1965 to make proof sets of coins for collectors. The mint at West Point, N.Y., is now used primarily for gold minting. These mints are under the direction of the U.S. Mint, which is a branch of the Department of the Treasury.",
  "Countries in which the demand for coins is not sufficient to make a national mint economically feasible have their coins struck in foreign mints. The British mint has struck coins for other countries since the 16th century. Many mints perform functions other than minting, notably refining precious metals and manufacturing medals and seals.",
  "For treatment of the technology of minting coins, see  coin: Techniques of production.  "
]