[
  " mirror , any polished surface that diverts a ray of light according to the law of reflection.",
  "The typical mirror is a sheet of glass that is coated on its back with aluminum or silver that produces images by reflection. The mirrors used in Greco-Roman antiquity and throughout the European Middle Ages were simply slightly convex disks of metal, either bronze, tin, or silver, that reflected light off their highly polished surfaces. A method of backing a plate of flat glass with a thin sheet of reflecting metal came into widespread production in Venice during the 16th century; an amalgam of tin and mercury was the metal used. The chemical process of coating a glass surface with metallic silver was discovered by Justus von Liebig in 1835, and this advance inaugurated the modern techniques of mirror making. Present-day mirrors are made by sputtering a thin layer of molten aluminum or silver onto the back of a plate of glass in a vacuum. In mirrors used in telescopes and other optical instruments, the aluminum is evaporated onto the front surface of the glass rather than on the back, in order to eliminate faint reflections from the glass itself.",
  "When light falls on a body some of the light may be reflected, some absorbed, and some transmitted through the body. In order for a smooth surface to act as a mirror, it must reflect as much of the light as possible and must transmit and absorb as little as possible. In order to reflect light rays without scattering or diffusing them, a mirror’s surface must be perfectly smooth or its irregularities must be smaller than the wavelength of the light being reflected. (The wavelengths of visible light are on the order of 5 × 10 −5 cm.) Mirrors may have plane or curved surfaces. A curved mirror is concave or convex depending on whether the reflecting surface faces toward the centre of curvature or away from it. Curved mirrors in ordinary usage have surfaces that are spherical, cylindrical, paraboloidal, ellipsoidal, and hyperboloidal. Spherical mirrors produce images that are magnified or reduced—exemplified, respectively, by mirrors for applying facial makeup and by rearview mirrors for automobiles. Cylindrical mirrors focus a parallel beam of light to a line focus. A paraboloidal mirror may be used to focus parallel rays to a real focus, as in a telescope mirror, or to produce a parallel beam from a source at its focus, as in a searchlight. An ellipsoidal mirror will reflect light from one of its two focal points to the other, and an object situated at the focus of a hyperboloidal mirror will have a virtual image.",
  "Mirrors have a long history of use both as household objects and as objects of decoration. The earliest mirrors were hand mirrors; those large enough to reflect the whole body did not appear until the 1st century ad . Hand mirrors were adopted by the Celts from the Romans and by the end of the Middle Ages had become quite common throughout Europe, usually being made of silver, though sometimes of polished bronze.",
  "The use of glass with a metallic backing commenced in the late 12th and early 13th centuries, and, by the time of the Renaissance, Nürnberg and Venice had established outstanding reputations as centres of mirror production. The mirrors produced in Venice were famous for their high quality. Despite the strictures of the doges, Venetian workmen succumbed to the temptation to carry the secrets of their craft to other cities, and, by the middle of the 17th century, mirror making was practiced extensively in London and Paris. Generally, mirrors were extremely expensive—especially the larger variety—and the wonderment created at the time by the royal palace at Versailles was due in part to the profusion of mirrors that adorned the state rooms.",
  "From the late 17th century onward, mirrors—and their frames—played an increasingly important part in the decoration of rooms. The early frames were usually of ivory, silver, ebony, or tortoiseshell or were veneered with marquetry of walnut, olive, and laburnum. Needlework and bead frames were also to be found. Craftsmen such as Grinling Gibbons (1648–1721) often produced elaborately carved mirror frames to match a complete decorative ensemble. The tradition soon became established of incorporating a mirror into the space over the mantelpiece: many of the early versions of these mirrors, usually known as overmantels, were enclosed in glass frames. The architectural structure of which these mirrors formed a part became progressively more elaborate; designers such as the English brothers Robert and James Adam created fireplace units stretching from the hearth to the ceiling and depending largely for their effect on mirrors. On the whole, mirror frames reflected the general taste of the time and were often changed to accommodate alterations in taste, frames usually being cheaper and hence more easily replaced than the mirror itself.",
  "By the end of the 18th century, painted decoration largely supplanted carving on mirrors, the frames being decorated with floral patterns or classical ornaments. At the same time, the French started producing circular mirrors, usually surrounded by a Neoclassical gilt frame that sometimes supported candlesticks, which enjoyed great popularity well into the 19th century. Improved skill in mirror making also made possible the introduction of the cheval glass, a freestanding full-length mirror, supported on a frame with four feet. These were mainly used for dressing purposes, though occasionally they had a decorative function.",
  "New, cheaper techniques of mirror production in the 19th century led to a great proliferation in their use. Not only were they incorporated into pieces of furniture, such as wardrobes and sideboards, but they were also used extensively in decorative schemes for public places."
]