[
  "  Model T , automobile built by the Ford Motor Company from 1908 until 1927. Conceived by Henry Ford as practical, affordable transportation for the common man, it quickly became prized for its low cost, durability, versatility, and ease of maintenance. More than 15 million Model Ts were built in Detroit and Highland Park, Michigan. (The automobile was also assembled at a Ford plant in Manchester, England, and at plants in continental Europe.) Assembly-line production allowed the price of the touring car version to be lowered from $850 in 1908 (equivalent to about 18 months salary for an average wage) to less than $300 in 1925 (equivalent to about 4 months salary for an average wage). At such prices the Model T at times constituted as much as 40 percent of all cars sold in the United States. Even before it lost favour to larger, more powerful, and more luxurious cars, the Model T, known popularly as the “Tin Lizzie” or the “flivver,” had become an American folkloric symbol, essentially realizing Ford’s goal to “democratize the automobile.”",
  " Mass production of the Ford Model T    The Model T was offered in several body styles, including a five-seat touring car, a two-seat runabout, and a seven-seat town car. All bodies were mounted on a uniform 100-inch-wheelbase chassis. A choice of colours was originally available, but from 1913 to 1925 the car was mass-produced in only one colour—black. The engine was simple and efficient, with all four cylinders cast in a single block and the cylinder head detachable for easy access and repair. The engine generated 20 horsepower and propelled the car to modest top speeds of 40–45 miles per hour (65–70 km/h). In most models the engine was started by a hand crank, which activated a magneto connected to the flywheel, but after 1919 some models were equipped with battery-powered starters. The transmission, consisting of two forward gears and one reverse, was of the planetary type, controlled by three foot pedals and a lever rather than the more common hand lever used in sliding-gear transmissions. Spark and throttle were controlled by a hand lever on the steering column. The 10-gallon fuel tank was located under the front seat. Because gasoline was fed to the engine only by gravity, and also because the reverse gear offered more power than the forward gears, the Model T frequently had to be driven up a steep hill backward. Such deficiencies, along with its homely appearance, less-than-comfortable ride at top speeds, and incessant rattling, made the Model T the butt of much affectionate humour in innumerable jokes, songs, poems, and stories."
]