[
  "  molecule , a group of two or more atoms that form the smallest identifiable unit into which a pure substance can be divided and still retain the composition and chemical properties of that substance.",
  "  The division of a sample of a substance into progressively smaller parts produces no change in either its composition or its chemical properties until parts consisting of single molecules are reached. Further subdivision of the substance leads to still smaller parts that usually differ from the original substance in composition and always differ from it in chemical properties. In this latter stage of fragmentation the chemical bonds that hold the atoms together in the molecule are broken.",
  "  Atoms consist of a single nucleus with a positive charge surrounded by a cloud of negatively charged electrons . When atoms approach one another closely, the electron clouds interact with each other and with the nuclei. If this interaction is such that the total energy of the system is lowered, then the atoms bond together to form a molecule. Thus, from a structural point of view, a molecule consists of an aggregation of atoms held together by valence forces. Diatomic molecules contain two atoms that are chemically bonded. If the two atoms are identical, as in, for example, the oxygen molecule (O 2 ), they compose a homonuclear diatomic molecule, while if the atoms are different, as in the carbon monoxide molecule (CO), they make up a heteronuclear diatomic molecule. Molecules containing more than two atoms are termed polyatomic molecules, e.g., carbon dioxide (CO 2 ) and water (H 2 O). Polymer molecules may contain many thousands of component atoms.",
  "The ratio of the numbers of atoms that can be bonded together to form molecules is fixed; for example, every water molecule contains two atoms of hydrogen and one atom of oxygen. It is this feature that distinguishes chemical compounds from solutions and other mechanical mixtures. Thus hydrogen and oxygen may be present in any arbitrary proportions in mechanical mixtures but when sparked will combine only in definite proportions to form the chemical compound water (H 2 O). It is possible for the same kinds of atoms to combine in different but definite proportions to form different molecules; for example, two atoms of hydrogen will chemically bond with one atom of oxygen to yield a water molecule, whereas two atoms of hydrogen can chemically bond with two atoms of oxygen to form a molecule of hydrogen peroxide (H 2 O 2 ). Furthermore, it is possible for atoms to bond together in identical proportions to form different molecules. Such molecules are called isomers and differ only in the arrangement of the atoms within the molecules. For example, ethyl alcohol (CH 3 CH 2 OH) and methyl ether (CH 3 OCH 3 ) both contain one, two, and six atoms of oxygen, carbon , and hydrogen, respectively, but these atoms are bonded in different ways.",
  "Not all substances are made up of distinct molecular units. Sodium chloride (common table salt ), for example, consists of sodium  ions and chlorine ions arranged in a lattice so that each sodium ion is surrounded by six equidistant chlorine ions and each chlorine ion is surrounded by six equidistant sodium ions. The forces acting between any sodium and any adjacent chlorine ion are equal. Hence, no distinct aggregate identifiable as a molecule of sodium chloride exists. Consequently, in sodium chloride and in all solids of similar type, the concept of the chemical molecule has no significance. Therefore, the formula for such a compound is given as the simplest ratio of the atoms, called a formula unit—in the case of sodium chloride, NaCl.",
  " + −    Molecules are held together by shared electron pairs, or covalent bonds . Such bonds are directional, meaning that the atoms adopt specific positions relative to one another so as to maximize the bond strengths. As a result, each molecule has a definite, fairly rigid structure, or spatial distribution of its atoms. Structural chemistry is concerned with valence , which determines how atoms combine in definite ratios and how this is related to the bond directions and bond lengths. The properties of molecules correlate with their structures; for example, the water molecule is bent structurally and therefore has a dipole moment, whereas the carbon dioxide molecule is linear and has no dipole moment. The elucidation of the manner in which atoms are reorganized in the course of chemical reactions is important. In some molecules the structure may not be rigid; for example, in ethane (H 3 CCH 3 ) there is virtually free rotation about the carbon-carbon single bond.",
  "The nuclear positions in a molecule are determined either from microwave vibration-rotation spectra or by neutron  diffraction . The electron cloud surrounding the nuclei in a molecule can be studied by X-ray diffraction experiments. Further information can be obtained by electron spin resonance or nuclear magnetic resonance techniques. Advances in electron microscopy have enabled visual images of individual molecules and atoms to be produced.",
  "Theoretically the molecular structure is determined by solving the quantum mechanical equation for the motion of the electrons in the field of the nuclei (called the Schrödinger equation). In a molecular structure the bond lengths and bond angles are those for which the molecular energy is the least. The determination of structures by numerical solution of the Schrödinger equation has become a highly developed process entailing use of computers and supercomputers .",
  "If a molecule has no net electrical charge, its negative charge is equal to its positive charge. The forces experienced by such molecules depend on how the positive and negative charges are arranged in space. If the arrangement is spherically symmetric, the molecule is said to be nonpolar. If there is an excess of positive charge on one end of the molecule and an excess of negative charge on the other, the molecule has a dipole moment (i.e., a measurable tendency to rotate in an electric or magnetic field) and is therefore called polar. When polar molecules are free to rotate, they tend to favour those orientations that lead to attractive forces.",
  "Nonpolar molecules generally are considered lipophilic (lipid-loving), whereas polar chemicals are hydrophilic (water-loving). Lipid-soluble, nonpolar molecules pass readily through a cell membrane because they dissolve in the hydrophobic, nonpolar portion of the lipid bilayer. Although permeable to water (a polar molecule), the nonpolar lipid bilayer of cell membranes is impermeable to many other polar molecules, such as charged ions or those that contain many polar side chains. Polar molecules pass through lipid membranes via specific transport systems.",
  "The molecular weight of a molecule is the sum of the atomic weights of its component atoms. If a substance has molecular weight M , then M  grams of the substance is termed one mole . The number of molecules in one mole is the same for all substances; this number is known as Avogadro’s number (6.022140857 × 10 23 ). Molecular weights can be determined by mass spectrometry and by techniques based on thermodynamics or kinetic transport phenomena."
]