[
  " mortar , portable, short-barreled, muzzle-loading artillery piece that fires explosive projectiles at low velocities, short ranges, and high, arcing trajectories. The weapon is contrasted with larger artillery pieces, which fire at high velocities, long ranges, and low, direct trajectories. A present-day mortar consists of a lightweight tube that rests on a base plate and is supported by a bipod. The weapon is operated by dropping a mortar shell onto a firing pin in the tube that detonates the shell’s propellant, which launches it toward the target.",
  "In modern warfare , mortars up to 81 mm can be carried by infantry and used as a small-scale short-range substitute for artillery. Mortars have the advantages of portability because of their size, of freedom of movement without the need for logistical support, and of the capacity to be fired from a trench or defilade (a fighting position that protects the operators from direct return fire). Because of its high trajectory, mortar fire can be used against enemy positions such as trench lines, gun pits, and other locations not protected by overhead cover.",
  "The need to attack enemy strongholds from a distance, combined with advances in the field of metalwork, resulted in the invention of increasingly complex siege devices. Mortars were first used as early as 1453 by the Ottomans during the siege of Constantinople . Some were large devices that weighed 4,500 kg (5 tons) and were capable of firing projectiles in excess of 100 kg (220 pounds) through a tube roughly 1 metre (3 feet) in length. (Over time, the weight of the mortar declined, as lighter materials were developed.) A round was dropped down the tube, which was inserted into the ground at an angle, and propelled upward by an explosive charge. Those weapons were popular in early modern European warfare despite their inaccuracy.",
  "Although crude, the trench howitzer, the unwieldy ancestor of the modern mortar, was employed by the armies of Napoleon and the North and South in the American Civil War . The progenitor of most present-day mortars is the Stokes mortar, designed in January 1915 by British weapons designer F.W.C. (later Sir Wilfred) Stokes and used in World War I . The Stokes mortar was portable, weighing 49 kg (108 pounds). It could fire up to 22 rounds per minute at a range of 1,100 metres (3,600 feet).",
  "The mortar made its presence felt in the fierce ground fighting of World War II . Mortars light enough to be carried by troops cleared the way for advancing Allied armies from the fields of France to the rugged hills of Pacific island outposts. The mortar also served American and allied fighting forces in the conflicts in Korea and Vietnam , in which enemy forces took advantage of the hilly landscape for concealment and were not always easily dislodged by direct artillery fire.",
  " Guerrilla forces have effectively used the firepower and mobility of mortars against larger armies. A mortar can be easily fired on a position and be withdrawn by its operators before return fire can be directed. Insurgents have also used mortars against concentrations of civilians and civic leaders to cause terror and political instability."
]