[
  " motion sickness , sickness induced by motion and characterized by nausea . The term motion sickness was proposed by J.A. Irwin in 1881 to provide a general designation for such similar syndromes as seasickness, train sickness, car sickness, and airsickness. The term, though imprecise for scientific purposes, has gained wide acceptance.",
  "Motion sickness comprises a constellation of symptoms resulting from sudden exposure to periodic unnatural accelerations. The symptoms include dizziness, pallor, cold sweating, salivation, nausea, and vomiting.",
  "Motion sickness may result from exposure to swinging, turning, rocking, or up-and-down movements. The disorder apparently stems from the contradictory data relayed to the brain during such motions by the eyes and by the balance centre within the non-acoustic portion of the inner ear , which must be functional for symptoms to develop. In each ear the three semicircular canals and the paired otolith organs participate in maintaining the body’s equilibrium and in the coordination of eye-head-body movements. These organs are stimulated continually by gravity and also by sudden linear accelerations. The eyes, by contrast, relay information to the brain about the body’s position and movement based on external surroundings rather than internal cues.",
  "Motion sickness arises when the vestibular system of the inner ear sends messages about body position or movement that are contradicted by the information sent by the eyes. An example of this is seasickness: the inner ear senses changes in linear and angular acceleration as the body bobs up and down with the movement of the ship, but, since the cabin bobs up and down in synchrony with the passenger, the eyes register a relatively stable scene. The brain becomes confused by these contradictory messages from different sensory receptors. In response, it stimulates the production of abnormally large amounts of the hormones epinephrine , norepinephrine , and vasopressin . After a few more minutes of exposure to motion, electrical rhythms in the muscles of the stomach accelerate markedly from a normal three cycles per minute to as much as nine per minute. By this time the visible symptoms of motion sickness are well advanced, and feelings of nausea may culminate in vomiting.",
  "Motion sickness is a self-limiting disorder, and prevention of the motion is the key to recovery in all cases. In cases where this is not possible, as in many travel situations, there are nevertheless several strategies for avoiding or mitigating the effects of the disorder. In cases of sustained exposure to motion, such as during sea voyages and space missions, many people can adapt to motion sickness after three or four days and feel progressively fewer symptoms. During shorter exposures, and depending on the situation, several different tactics can be helpful. The single most effective measure is to fix the body, especially the head, with reference to the vehicle.",
  "Minimizing accelerations in a particular vehicle can involve altering factors such as seat location and time of day (e.g., in an aircraft) and cabin location and time of year (e.g., in a ship). The choice of vehicle for a given mode of travel may be important—e.g., flying above turbulence in a jet aircraft and the use of stabilizers in a ship. Sitting in a reclining posture, trying to avoid making turning movements of the head, closing one’s eyes, and focusing one’s gaze on relatively distant objects can also prove helpful. Motion sickness is also sometimes alleviated by concentrating on other tasks. Generally, unless vision is used to “lock” onto the horizon or to engage in activities resulting in distraction, there is less tendency to motion sickness if the eyes are closed. Reading and excessive eating or drinking tend to exacerbate the symptoms, as do anxiety and other stressful or painful emotional states. Certain illnesses, especially those with gastrointestinal symptoms, may increase one’s susceptibility to motion sickness. Given these suggestions, however, the prevention of motion sickness remains a highly individual matter.",
  "Several drugs have been developed for the prevention or relief of motion sickness, though they often produce unwanted side effects. A combination of 1- scopolamine hydrobromide and dextroamphetamine sulfate, taken shortly before departure, affords some protection for several hours. Promethazine hydrochloride, with minimal risk of side effects, is a good substitute for scopolamine. Several drugs in the antihistamine category also decrease susceptibility to motion sickness, including diphenidol, dimenhydrinate, cyclizine, and meclizine. The last named is effective over periods up to 24 hours."
]