[
  "  motion-picture camera , also called Movie Camera , any of various complex photographic cameras that are designed to record a succession of images on a reel of film that is repositioned after each exposure. Commonly, exposures are made at the rate of 24 or 30 frames per second on film that is either 8, 16, 35, or 70 mm in width.",
  "A motion-picture camera essentially consists of a body, a film-transport system, lenses, shutter, and a viewing-focusing system. The motor-driven transport system is the chief element that differentiates motion-picture cameras from still cameras. Within the camera, the unexposed film is housed in a totally dark chamber called the forward magazine. One or both edges of the film are lined with regularly spaced perforations, or sprocket holes. Sprocket-driven gears grip these perforations, feeding the film into an enclosed exposure chamber. A mechanical claw pulls the film into position behind the shutter, locking the film momentarily in place. The shutter opens, exposes an image onto the film, and closes. Then the claw, with an automatic pulldown movement, advances the film for the next exposure. Each frame of the film comes to a complete stop for its exposure, and hence each exposure is a single still photograph, or frame. As the film moves through the camera, the exposed sections are fed into the rear magazine, which is another totally dark chamber.",
  "  (Read Martin Scorsese’s Britannica essay on film preservation.)  ",
  "Most cameras now use the reflex system for viewing and focusing; in this system a mirror diverts to the viewfinder some of the light rays coming through the lens. Zoom lenses are commonly used on many cameras, as are ordinary wide-angle and telephoto lenses. The shutter is located behind the lens and in front of the film gate. It is usually rotary, and consists of a half-circle that is pivoted around in synchronization with the claw’s pulldown of the film, so that the half-circle blocks out light from the lens when the film is in transit and moves out of the way to let light through when the film frame is motionless. Cameras used in sound filming contain internal insulation to dampen the noise of their moving parts."
]