[
  "  Museum of Islamic Art , formerly (1881–1952) called Museum of Arab Art , museum in Cairo , one of the largest in the world dedicated to Islamic art and artifacts. The museum was founded in 1881, and its collection spans from the 7th-century Umayyad dynasty to the 19th-century Ottoman Empire . In 1903 the museum moved to its current building in Bāb Al-Khalq square.",
  "The Egyptian khedive  Tawfīq gave the decree that led to the establishment of the Museum of Arab Art in 1881. The decree authorized a group of European and Egyptian art preservationists, led by the Hungarian architect and conservator Max Herz, to gather detached fragments from historic structures in Cairo that had fallen into disrepair. These items were the beginnings of the modern museum’s collection and were housed in the mosque of the Fatimid  caliph al-Ḥākim. In 1903 the collection moved to a new museum building designed by Alfonso Manelesco in a neo- Mamluk style. In 1952 the museum changed its name to the Museum of Islamic Art.",
  "Since then the museum acquired a substantial collection of artifacts from outside Egypt, representing most of the major periods of Islamic history and most regions of the Islamic world. The museum’s collection includes a number of notable artifacts, such as the oldest Islamic gold dinar ever found, dating to the 7th century ce ; several rare Qurʾāns ; a restored Mamluk mosaic fountain; and an engraved ewer, or jug, taken from a grave thought to be that of the last Umayyad caliph, Marwān II .",
  "By 2003 the Museum of Islamic Art’s collection had swelled to more than 100,000 objects, making the exhibitions cramped and difficult for visitors to navigate. The Egyptian government elected to renovate and reorganize the museum, a seven-year project that was carried out in consultation with the Islamic art department of the Louvre and the Aga Khan Trust for Culture. The redesigned museum, which opened to visitors in 2010, displays only a small selection from the entire collection, with one wing devoted to Egyptian exhibits and another devoted to art from the rest of the Islamic world.",
  "In 2014 a car bomb targeting the nearby police headquarters seriously damaged the museum’s facade as well as 179 pieces of art inside. After years of reconstruction and restoration, most of the affected art was salvaged, and the museum reopened in 2017."
]