[
  " Green Book The Negro Travelers’ Green Book  the Green Book , in full The Negro Motorist Green Book , The Negro Travelers’ Green Book , or The Travelers’ Green Book , travel guide published (1936–67) during the segregation era in the United States that identified businesses that would accept African American customers. Compiled by Victor Hugo Green (1892–1960), a Black postman who lived in the Harlem section of New York City , the Green Book listed a variety of businesses—from restaurants and hotels to beauty salons and drugstores—that were necessary to make travel comfortable and safe for African Americans in the period before passage of Civil Rights Act of 1964 .",
  " Automobile travel exploded in the United States during the mid-20th century as more and more Americans were able to afford cars and had disposable income and leisure time (including paid vacations) that allowed them to explore the country. The proliferation of tourist homes, roadside motels , restaurants, and tourist attractions offered convenience that made it possible for car travel to be a joyful spontaneous adventure for most Americans. This was seldom the experience for African American travelers during the Jim Crow era, however.",
  "Because segregation was pervasive not just in the South but throughout the country, Black travelers not only met with the inconvenience and humiliation of being turned away from businesses but also had to be ever mindful of the threat of racist violence, including lynching . The landscape was dotted with “sundown towns,” where the presence of people of colour was banned after nightfall. To address the uncertainty of attaining lodging, meals, and fuel, African American car travelers brought with them blankets and pillows, extra food, drinks, and gasoline, as well as portable toilets.",
  " Green Book The Negro Motorist Green-Book  The difficulty, embarrassment, and fear that accompanied car travel for Black people became especially apparent to Green after he married a woman from Richmond , Virginia, to which the couple traveled from their home in Harlem. In 1936 he made an attempt to address the problem by producing The Negro Motorist Green Book , a 15-page guide that listed travel-related businesses in metropolitan New York City that welcomed African American customers. To compile the listing, Green, then age 44, drew on his own firsthand experience as well as recommendations from fellow postal workers. (Green lived in Harlem but delivered mail in New Jersey .) He found a model for his publication in the guides for Jewish travelers that appeared in Jewish newspapers.",
  " Green Book The Negro Motorist Green Book  The demand for the first Green Book was so great that by the publication of the second annual edition in 1937, Green had shifted his focus to a national scope. To do so, he used his involvement with the National Association of Letter Carriers to reach out to postal workers across the country to gather information. He also received assistance from Charles McDowell, the collaborator on Negro Affairs for the United States Travel Bureau, an office of the Department of the Interior charged with promoting American tourism. Early on Green also began soliciting recommendations from the guide’s users. In addition to motels, tourist homes, and restaurants, the book also had listings for taverns, nightclubs, tailors, barbershops, beauty salons, drug stores, liquor stores, gas stations, and garages. The guide included articles on safe driving, places of interest (“What to See in Chicago”), travel essays (“A Canadian Trip”), and special topics (“How to Guard Your Home During Vacation Season”), along with travel tips (“What to Wear” [in Bermuda]) and consumer reviews of automobiles.",
  " Green Book The Negro Travelers’ Green Book  By 1940 the Green-Book (a hyphen was added for part of the 1940s) had more than tripled in length; by 1947 it contained more than 80 pages. The book’s geographic scope was ever-expanding and eventually included all 50 states as well as listings for Canada , the Caribbean , Latin America , Europe , and Africa . As time went on, however, the subjects of the listings became limited to hotels, motels, and tourist homes. Publication of the Green Book was suspended during World War II but resumed in 1947. That year Green opened a travel company, Reservation Bureau, with its office on 135th Street in Harlem, above Smalls Paradise, a music venue that was central to African American culture in the 20th century. In 1952 he retired from the postal service.",
  "The Green Book was not the only publication of its kind. It was preceded by Hackley and Harrison’s Hotel and Apartment Guide for Colored Travelers (1930–31). The Travel Guide (1947–63) and Grayson’s Guide: The Go Guide to Pleasant Motoring (1953–59) were contemporaries of the Green Book , but neither was published as long nor reached as big an audience as the Green Book , which was dubbed the “bible of Black travel.” By 1962 there were more than two million copies of it in circulation.",
  "The guide listed both Black- and white-owned businesses. In some cases the welcoming of Black customers by white-owned businesses was a principled declaration of opposition to segregation, while in others it was merely a pragmatic recognition of the profits to be made from the increasing mobility and affluence of African Americans. The Green Book received special support from Esso (the forerunner of Exxon ), largely owing to the efforts of James Jackson, the first African American to work for the company as a marketing specialist. One of the only U.S. oil companies that allowed African Americans to buy franchises, Esso sponsored the Green Book and sold it in its gas stations.",
  "Although little of the content of the Green Book was overtly political, the implicit politics of exclusion and segregation’s denial of access and equity were the subtext of every listing. The comments that Green published from some of those who responded to his request for information were also often telling, such as remarks in the 1948 guide by a correspondent from Dickinson, North Dakota :",
  "The attitude of a majority of those I contacted was that, while they themselves had no color prejudice, some of their regular customers did have. This was the impression I gained from hotel operators, barbers, and others contacted. They were all eager to provide whatever services were required by Negroes visiting Dickinson.",
  "Ignorance is the root of prejudice. There is a special type of ignorance in this section regarding Negroes. There are so few Negroes living in North Dakota that a colored person is still a curiosity. Some of the prejudice here is merely unfamiliarity with any of the race. It is a general thing, and not specific. When talking about Negroes abstractly, they feel differently than if a colored person, in person, asks them for services.",
  "In his introduction to the 1948 edition of the guide (reprinted in multiple subsequent editions), Green himself wrote:",
  "There will be a day sometime in the near future when this guide will not have to be published. That is when we as a race will have equal opportunities and privileges in the United States. It will be a great day for us to suspend this publication for then we can go wherever we please, and without embarrassment.",
  "Green died in 1960, four years before the passage of the 1964 Civil Rights Act greatly reduced the need for the Green Book , which ceased publication in 1967."
]