[
  " musical , also called musical comedy , theatrical production that is characteristically sentimental and amusing in nature, with a simple but distinctive plot, and offering music, dancing, and dialogue.",
  "The antecedents of the musical can be traced to a number of 19th-century forms of entertainment including the music hall, comic opera, burlesque, vaudeville, variety shows, pantomime, and the minstrel show. These early entertainments blended the traditions of French ballet, acrobatics, and dramatic interludes. In September 1866 the first musical comedy, The Black Crook, opened in New York City. It was later described as a combination of French Romantic ballet and German melodrama, and it attracted patrons of opera and serious drama, as well as those of burlesque shows. In the late 1890s the British showman and entrepreneur George Edwardes brought his London Gaiety Girls to New York City, calling his production musical comedy to distinguish it from his previous burlesques.",
  "Much of American popular music of the first decades of the 20th century was written by European immigrants, such as Victor Herbert , Rudolf Friml , and Sigmund Romberg. They brought a form of operetta to the United States that was, in every sense, the generic source for musical comedy; it was sentimental and melodious and established a tradition of the play based on musical numbers and songs. Romberg’s works, such as The Student Prince (1924) and The Desert Song (1926), were also made into successful motion pictures. George M. Cohan ushered in the heyday of musical comedy with his productions; they introduced such memorable songs as “You’re a Grand Old Flag,”““Give My Regards to Broadway,” and “Over There”.",
  "During the 1920s and ’30s, musical comedy entered its richest period. Jerome Kern working with Guy Bolton and P.G. Wodehouse , wrote a number of outstanding comedies. George and Ira Gershwin teamed up to write Oh, Kay! (1926), Funny Face (1927), Strike Up the Band (1930), and others. Cole Porter wrote timeless and sophisticated compositions for such musicals as Anything Goes (1934) and Dubarry Was a Lady (1939). Other notable composers and lyricists of this period were Richard Rodgers and Oscar Hammerstein II, Harold Arlen , Jule Styne , and Vincent Youmans .",
  "The genre had taken a new turn with the production in 1927 of Show Boat (music by Kern, book and lyrics by Hammerstein); it was the first musical to provide a cohesive plot and initiate the use of music that was integral to the narrative, a practice that did not fully take hold until the 1940s. Based on a novel by Edna Ferber , the musical presented a serious drama based on American themes incorporating music that was derived from American folk melodies and spirituals.",
  "Later musicals that were as tightly constructed as Show Boat were Rodgers and Hammerstein’s Oklahoma! (1943), Carousel (1945), and South Pacific (1949). Alan Jay Lerner and Frederick Loewe also wrote a number of highly successful musicals, notably Brigadoon (1947) and My Fair Lady (1956). They also collaborated on the motion-picture musical Gigi (1958), and four of their theatrical works were later made into motion pictures. Leonard Bernstein wrote West Side Story (1957, with Stephen Sondheim), a conversion of the setting and elements of Shakespeare ’s Romeo and Juliet to mid-20th-century New York City.",
  "Musicals as they were known from the 1930s to the 1950s began to decline in the late 1960s. By then, musicals had begun to diverge in many different directions: rock and roll, operatic styling, extravagant lighting and staging, social comment, nostalgia, pure spectacle. The first notable example of the rock musical was Hair (1967), which found its social dissent in a combination of loud music, stroboscopic lighting, youthful irreverence, and nudity. In a few cases, rock music was combined with biblical stories, as in Godspell (1971) by Stephen Swartz and Jesus Christ Superstar (1971) by Andrew Lloyd Webber and Tim Rice . Other notable later musicals include Stephen Sondheim’s Company (1970) and Sweeney Todd (1979), Marvin Hamlisch and Edward Kleban’s A Chorus Line (1975), Lloyd Webber’s Evita (1978), Cats (1981), and The Phantom of the Opera (1986); and The Lion King (1997), with music by Elton John and lyrics by Tim Rice. Popular musicals in the 21st century included Stephen Schwartz’s Wicked (2003); The Book of Mormon (2011), with music, lyrics, and book by Matt Stone , Trey Parker , and Robert Lopez; and Lin-Manuel Miranda ’s Hamilton (2015)."
]