[
  "  Christchurch earthquakes of 2010–11 , also called Canterbury earthquakes , series of tremors that occurred within and near the city of Christchurch , New Zealand, and the Canterbury Plains region from early September 2010 to late December 2011. The severest of those events were the earthquake (magnitude from 7.0 to 7.1) that struck on September 4, 2010, and the large, destructive aftershock (magnitude 6.3) that occurred on February 22, 2011.",
  "  The principal event, sometimes referred to as the Darfield earthquake, struck at 4:35 am on September 4, 2010. The earthquake’s epicentre was located some 25 miles (40 km) west of Christchurch near the town of Darfield, and the focus was located about 6 miles (10 km) beneath the surface. It was caused by right-lateral movement along a previously unknown regional strike-slip fault in the western section of the Canterbury Plains. The fault, later named the Greendale Fault, appeared about 50 to 56 miles (80 to 90 km) southeast of the boundary between the Australian and Pacific tectonic plates, and part of the fault became visible at the surface because of the earthquake. Thousands of smaller aftershocks occurred in the months that followed.",
  "The severest aftershock occurred at 12:51 pm on February 22, 2011. In contrast to the main shock, this aftershock was generated by oblique thrust faulting (where one side of the fault is thrust upward over the other) along a different, undiscovered fault. Like the main shock, however, the February 22 aftershock stemmed from the deformation along regional plate boundaries where the Pacific and Indo-Australian tectonic plates push against one another. The focus of this temblor was relatively shallow, however, occurring only 3 miles (5 km) beneath the surface of Heathcote Valley, a suburb of Christchurch located on the Banks Peninsula . The aftershock’s depth and close proximity to Christchurch contributed to substantial shaking, surface cracking, and liquefaction (the conversion of soil into a fluidlike mass) in the city and surrounding area.",
  "Two large tremors struck the Christchurch metropolitan area during the early afternoon on June 13, 2011. The epicentres of each of these events, which possessed moment magnitudes of 5.6 and 6.3, were located some 10 km (6 miles) east of Christchurch at depths of 9 km (5.6 miles) and 7 km (4.4 miles), respectively. The June 13 events were located farther east of the known extent of the Greendale Fault, and they appeared to have been generated by strike-slip faulting rather than by thrust faulting associated with the February 22 event. As a result, some seismologists have downplayed any direct association between the June 13 events and those of the main shock and February 22 aftershock. Other seismologists, however, suggested that stresses built up by these earlier temblors likely contributed to those of June 13, as well as to a series of shallow marine tremors ranging from magnitude 4.0 to magnitude 6.0 that shook the Christchurch area on December 23, 2011.",
  "Buildings and roads across the Christchurch region, which had been weakened by the September event and its aftershocks, were severely damaged or destroyed in the February event. Christchurch’s city centre was hit particularly hard and was evacuated. Over the months that followed, it was established that more than 180 people had died in the quake; many of them had been killed outright as structures collapsed and debris fell in the streets, crushing cars and buses as well.",
  "One of the worst incidents was the collapse of the Canterbury Television (CTV) building, in the city centre, which was razed almost entirely. An estimated 100 or more people had been in the building at the time of the quake. Although some were rescued on the day of the quake, the search for others was suspended because it was thought that the remaining victims could not have survived; further, it was feared that the building’s remains were too unstable to be safe for rescue workers. Efforts resumed the following day, however, after the building was secured. Both the Anglican and Roman Catholic cathedrals of Christchurch suffered serious damage. Church officials believed that the latter structure was beyond repair, and the spire of the Anglican cathedral collapsed.",
  "Other towns in the area around Christchurch were seriously affected, although fewer lives were lost. The port town of Lyttelton , near the epicentre of the earthquake, sustained widespread damage to buildings, wharves, and other infrastructure. Bexley and other suburbs were flooded after water mains broke; after the waters receded, quake-damaged roads and homes remained covered with silt. Impromptu community efforts distributed food and helped dig out the property of affected residents. Continuing aftershocks in the days after February 22 further weakened structures throughout the area, and portions of several suburbs had to be evacuated.",
  "The day after the quake, Prime Minister John Key declared a state of national emergency in the quake area, expanding his government’s powers to coordinate rescue and recovery efforts. More than 1,000 New Zealand Defence Force personnel led the response, aided by more than 100 members of the Singaporean armed forces who were in New Zealand for a joint training exercise at the time of the quake. Australia, Japan, Singapore, the United Kingdom, the United States, and other countries also sent hundreds of search-and-rescue workers. Rescue efforts were at times hampered, however, by the potential dangers posed by the aftershocks.",
  "The removal of wreckage and official damage assessments were ongoing. Hundreds of buildings in the central business district and some 10,000 dwellings were deemed to be unsalvageable, and it was expected that they would have to be demolished. Further, it was predicted that because the quake had rendered the land so unstable in some places, certain areas might have to be abandoned altogether. Indeed, it was believed that by the time of the June 13 aftershocks, some 50,000 former residents of Christchurch had already moved permanently to other places in New Zealand or to Australia. In March 2012 it was announced that because of additional damage it had sustained in the aftershocks, the Anglican cathedral was beyond repair and would be demolished."
]