[
  " San Francisco , American dramatic film, released in 1936, that recounted the San Francisco earthquake of 1906 . It is noted for the performances of its cast and for what were, for its time, stunning special effects.",
  "The setting is San Francisco’s bawdy Barbary Coast in the days before the earthquake. Singer Mary Blake (played by Jeanette MacDonald) arrives in town and meets Blackie Norton ( Clark Gable ), owner of the Paradise gambling hall. Norton offers Blake a contract to sing at the Paradise, which she accepts. Later, however, Nob Hill socialite Jack Holt (Jack Burley) encourages her to join the Tivoli Opera House, and Blake, who has fallen for Norton, leaves the Paradise when she realizes that his feelings for her are not as genuine as she had hoped. Blake signs with the Tivoli and begins a relationship with Holt. After her debut, however, Blake and Norton reconcile, and she decides to resume working at the Paradise. Norton’s tough childhood friend, Father Tim Mullin ( Spencer Tracy ), tries to convince Norton that Blake is too good to be singing in a saloon and must pursue her career with the opera. The men have a falling out, and Blake leaves with Mullin. Further melodrama ensues, but it is interrupted when the earthquake strikes, devastating the city. Norton searches out Mullin, with whom he reconciles. The two eventually come upon Blake, who is working at a camp for survivors, and Norton rediscovers his religious faith upon finding her alive. The three join hundreds of other survivors and look over the desolate city, which the viewer sees transformed into a shining new metropolis. The film ends with the cast singing “Battle Hymn of the Republic.”",
  "Gable, MacDonald, and Tracy delivered strong performances, though Gable, who was warned of MacDonald’s reputation as a prima donna, had been reluctant to do the film. Although he never warmed to her off the set, their chemistry on-screen is considerable. Tracy earned an Academy Award nomination for his role as the tough neighborhood priest. For many, however, the highlight of the film is the depiction of the earthquake, brought to life by sophisticated special effects. The title song, “San Francisco,” was later made one of the city’s official songs."
]