[
  "  heliosphere , the region surrounding the Sun and the solar system that is filled with the solar magnetic field and the protons and electrons of the solar wind .",
  "  The solar magnetic field in the heliosphere has a dipole structure. The magnetic field lines that are carried outward from the Sun by the solar wind remain attached to the Sun’s surface. Because of the Sun’s rotation, the lines are drawn into a spiral structure. In one hemisphere (either the northern or the southern), the magnetic field lines are directed inward, and in the other they are directed outward. Between these two different hemispheres is a structure called the heliospheric current sheet.",
  "The solar wind flows outward through the solar system into the interstellar medium (ISM) and begins to feel the effects of the ISM at the termination shock, where the solar wind starts to lose speed. The region beyond the termination shock in which the solar wind slows is called the heliosheath. Neutral atoms in the heliosheath form a “ribbon” that is probably caused by solar wind particles being reflected back into the solar system by the magnetic field in the ISM. At the outward boundary of the heliosheath is the heliopause , where the outward pressure of the solar wind balances the pressure of the incoming ISM. The heliopause is usually considered to be the boundary of the solar system and is about 123 astronomical units (AU; 1 astronomical unit = 150 million km) from the Sun. (By comparison, Neptune, the outermost planet, is 30 AU from the Sun.)",
  "It was originally thought that the heliosphere was stretched into a teardrop shape by its encounter with the ISM. The U.S. space probes Voyager 1 and 2 crossed the termination shock at a distance of 94 and 84 AU from the Sun in 2004 and 2007, respectively. Since the two Voyagers are traveling out of the solar system in different directions, this implied that the heliosphere has an asymmetrical shape. However, subsequent observations of atoms in the heliosheath by the Cassini spacecraft orbiting Saturn and the Interstellar Boundary Explorer orbiting Earth showed the heliosphere was actually a sphere. Voyager 1 crossed the heliopause on August 25, 2012."
]