[
  " mystery story , ages-old popular genre of tales dealing with the unknown as revealed through human or worldly dilemmas; it may be a narrative of horror and terror, a pseudoscientific fantasy, a crime-solving story, an account of diplomatic intrigue, an affair of codes and ciphers and secret societies, or any situation involving an enigma. By and large, mystery stories may be divided into two sorts: tales of the supernatural and riddle stories.",
  "Supernatural tales are of ancient origin and form a substantial part of the body of folk literature. But the literary cultivation of fear and curiosity for its own sake began to emerge in the 18th-century pre-Romantic era with the Gothic novel. This genre was invented by a worldly Englishman, Horace Walpole, whose Castle of Otranto (1765) may be said to have founded the horror story as a permanent form. Mary Wollstonecraft Shelley introduced the pseudoscientific note in her famous novel Frankenstein (1818), about the creation of a monster that ultimately destroys its creator, Dr. Frankenstein.",
  "In the Romantic era the German storyteller E.T.A. Hoffmann and the American writer Edgar Allan Poe raised the mystery story to a level far above mere entertainment through their skillful intermingling of reason and madness, eerie atmosphere and everyday reality. They invested their spectres, doubles, and haunted houses with a psychological symbolism that gave their tales a haunting credibility.",
  "The Gothic influence persisted throughout the 19th century in such works as Joseph Sheridan Le Fanu’s House by the Churchyard and “Green Tea,” Wilkie Collins’ Moonstone, and Bram Stoker’s vampire tale Dracula. Later masters of the mystery tale were Ambrose Bierce, Arthur Machen, Algernon Blackwood, Lord Dunsany, and H.P. Lovecraft; but isolated masterpieces have been produced by writers not usually associated with the genre, for example, Guy de Maupassant’s “Horla,” A.E. Coppard’s “Adam and Eve and Pinch Me,” Saki’s “Sredni Vashtar” and “The Open Window,” and W.F. Harvey’s “August Heat.” Some of the best-known mystery stories owe their power to their development of full-bodied characters in a realistic social environment and the very absence of mysterious atmosphere. In this category are Aleksandr Pushkin’s “Queen of Spades” and W.W. Jacob’s “Monkey’s Paw.”",
  "Riddle stories, too, have an ancient heritage. The riddle of Samson, propounded in the Bible (Judges 14:12–18), is the most famous early example, but puzzles were also popular among the ancient Egyptians and the Greeks. The distinguishing feature of the riddling mystery story is that the reader be confronted with a number of mysterious facts and situations, explanation of which is reserved until the end of the story.",
  "Poe’s short story “The Gold Bug” is a classic example of one perennially popular type of mystery, the story of a search for lost treasure. In the more sinister field of murder are innumerable tales of roguery involving mystery and crime but without the familiar detective interludes. Two notable riddle stories of modern times offered no solution to the riddle posed and gained wide attention by their novelty: “The Lady or the Tiger” by Frank R. Stockton and “The Mysterious Card” by Cleveland Moffett.",
  "More nearly akin to the detective story than any of these are the spy stories, tales of international intrigue and adventure, entertainingly written by John Buchan, Valentine Williams, Cyril McNeile, William Le Queux, and many others. Two directions taken by the modern spy story were typified by Ian Fleming’s enormously popular James Bond thrillers, using technical marvels that approached science-fiction fantasy, and John le Carré’s austerely realistic stories ( e.g., The Spy Who Came in from the Cold, 1963)."
]