[
  "  neon (Ne) ,  chemical element , inert gas of Group 18 ( noble gases ) of the periodic table , used in electric signs and fluorescent lamps . Colourless, odourless, tasteless, and lighter than air, neon gas occurs in minute quantities in Earth’s  atmosphere and trapped within the rocks of Earth’s crust . Though neon is about 3  1  2  times as plentiful as helium in the atmosphere, dry air contains only 0.0018 percent neon by volume. This element is more abundant in the cosmos than on Earth. Neon liquefies at −246.048 °C (−411 °F) and freezes at a temperature only 2  1  2  ° lower. When under low pressure, it emits a bright orange-red light if an electrical current is passed through it. This property is utilized in neon signs (which first became familiar in the 1920s), in some fluorescent and gaseous conduction lamps, and in high-voltage testers. The name neon is derived from the Greek word neos , “new.”",
  "Neon was discovered (1898) by the British chemists Sir William Ramsay and Morris W. Travers as a component of the most volatile fraction of liquefied crude argon obtained from air. It was immediately recognized as a new element by its unique glow when electrically stimulated. Its only commercial source is the atmosphere, in which it is 18 parts per million by volume. Because its boiling point is −246 °C (−411 °F), neon remains, along with helium and hydrogen , in the small fraction of air that resists liquefaction upon cooling to −195.8 °C (−320.4 °F, the boiling point of liquid nitrogen). Neon is isolated from this cold, gaseous mixture by bringing it into contact with activated charcoal , which adsorbs the neon and hydrogen; removal of hydrogen is effected by adding enough oxygen to convert it all to water, which, along with any surplus oxygen, condenses upon cooling. Processing 88,000 pounds of liquid air will produce one pound of neon.",
  "No stable chemical compounds of neon have been observed. Molecules of the element consist of single atoms . Natural neon is a mixture of three stable isotopes : neon-20 (90.92 percent); neon-21 (0.26 percent); and neon-22 (8.82 percent). Neon was the first element shown to consist of more than one stable isotope. In 1913, application of the technique of mass spectrometry revealed the existence of neon-20 and neon-22. The third stable isotope, neon-21 was detected later. Twelve radioactive isotopes of neon also have been identified."
]