[
  "  New Economic Policy (NEP) , the economic policy of the government of the Soviet Union from 1921 to 1928, representing a temporary retreat from its previous policy of extreme centralization and doctrinaire socialism.",
  "The policy of War Communism , in effect since 1918, had by 1921 brought the national economy to the point of total breakdown. The Kronshtadt Rebellion of March 1921 convinced the Communist Party and its leader, Vladimir Lenin , of the need to retreat from socialist policies in order to maintain the party’s hold on power. Accordingly, the 10th Party Congress in March 1921 introduced the measures of the New Economic Policy. These measures included the return of most agriculture, retail trade, and small-scale light industry to private ownership and management while the state retained control of heavy industry, transport, banking, and foreign trade. Money was reintroduced into the economy in 1922 (it had been abolished under War Communism). The peasantry were allowed to own and cultivate their own land, while paying taxes to the state. The New Economic Policy reintroduced a measure of stability to the economy and allowed the Soviet people to recover from years of war, civil war, and governmental mismanagement. The small businessmen and managers who flourished in this period became known as NEP men.",
  "  But the NEP was viewed by the Soviet government as merely a temporary expedient to allow the economy to recover while the Communists solidified their hold on power. By 1925 Nikolay Bukharin had become the foremost supporter of the NEP, while Leon Trotsky was opposed to it and Joseph Stalin was noncommittal. The NEP was dogged by the government’s chronic inability to procure enough grain supplies from the peasantry to feed its urban work force. In 1928–29 these grain shortages prompted Joseph Stalin, by then the country’s paramount leader, to forcibly eliminate the private ownership of farmland and to collectivize agriculture under the state’s control, thus ensuring the procurement of adequate food supplies for the cities in the future. This abrupt policy change, which was accompanied by the destruction of several million of the country’s most prosperous private farmers, marked the end of the NEP. It was followed by the reimposition of state control over all industry and commerce in the country by 1931."
]