[
  " Out of the Past , American film noir , released in 1947, that is widely recognized as a quintessential example of the genre.",
  "Jeff Bailey (played by Robert Mitchum ) appears to be an ordinary gas station attendant in a small California town. When he is called to a meeting with the slick gangster Whit Sterling ( Kirk Douglas ), however, Bailey is forced to reveal to his girlfriend (Virginia Huston) that his real name is Jeff Markham and that he is, in fact, a private detective. In an extended flashback, Jeff retraces his history with Whit, who years earlier had hired him to track down Kathie Moffat ( Jane Greer ). According to Whit, Kathie had been his girlfriend but had shot him and taken off for Mexico with $40,000 of his money. Upon locating her in Acapulco, Jeff found himself immediately enchanted by the seductive baby-faced Kathie—a classic femme fatale—and soon ran off with her to San Francisco. When Jeff’s disgruntled business partner (Steve Brodie) eventually found the couple and attempted to blackmail them, though, Kathie fatally shot him and then disappeared.",
  "The film then shifts to the present, and Jeff discovers that Kathie has returned to Whit, to whom she has confessed the affair. To make it up to his former client, Jeff accepts a job retrieving some income tax records with which a lawyer, Leonard Eels (Ken Niles), is threatening to blackmail Whit. The mission is quickly revealed to be a ruse, however, with Whit planning on killing Leonard and pinning the murder on Jeff. The intricate plot that ensues ends badly for Jeff, Kathie, and Whit: all three characters end up dead, shot either by each other or by the police.",
  " Out of the Past is often ranked among the greatest film noirs ever made. Director Jacques Tourneur, previously known for such B-grade horror films as  Cat People  (1942) and I Walked with a Zombie (1943), received high praise for his teaming of Mitchum and Douglas, and Mitchum’s laconic performance in particular has been hailed as one of the best of his career. Although Geoffrey Homes, whose pulp novel Build My Gallows High (1946) provided the film’s source material, was officially credited with the screenplay, his draft was substantially rewritten by both James M. Cain and Frank Fenton. Against All Odds , a loose remake, was released in 1984."
]