[
  "  order , also called order of architecture , any of several styles of classical or Neoclassical architecture that are defined by the particular type of column and entablature they use as a basic unit. A column consists of a shaft together with its base and its capital. The column supports a section of an entablature, which constitutes the upper horizontal part of a classical building and is itself composed of (from bottom to top) an architrave, frieze, and cornice. The form of the capital is the most distinguishing characteristic of a particular order. There are five major orders: Doric, Ionic, Corinthian, Tuscan, and Composite.",
  "  There are many separate elements that make up a complete column and entablature. At the bottom of the column is the stylobate; this is a continuous flat pavement on which a row of columns is supported. Rising out of the stylobate is the plinth, a square or circular block that is the lowest part of the base. Atop the plinth and forming the remainder of the base are one or more circular moldings that have varying profiles; these may include a torus (a convex molding that is semicircular in profile), a scotia (with a concave profile), and one or more fillets, or narrow bands.",
  "The shaft, which rests upon the base, is a long, narrow, vertical cylinder that in some orders is articulated with fluting (vertical grooves). The shaft may also taper inward slightly so that it is wider at the bottom than at the top.",
  "Atop the shaft is the capital, which serves to concentrate the weight of the entablature on the shaft and also acts as an aesthetic transition between those two elements. In its simplest form (the Doric), the capital consists (in ascending order) of three parts; the necking, which is a continuation of the shaft but which is set off from it visually by one or more narrow grooves; the echinus, a circular block that bulges outward at its uppermost portion in order to better support the abacus; and the abacus itself, a square block that directly supports the entablature above and transmits its weight to the rest of the column below.",
  "The entablature is composed of three horizontal sections that are visually separated from each other by moldings and bands. The three parts of the entablature (in ascending order) are called the architrave, frieze, and cornice.",
  "The unit used in the measurement of columns is the diameter of the shaft at the base; thus, a column may be described as being eight (lower) diameters high.",
  "Ancient Greek architecture developed two distinct orders, the Doric and the Ionic, together with a third (Corinthian) capital, which, with modifications, were adopted by the Romans in the 1st century bc and have been used ever since in Western architecture.",
  " Encyclopædia Britannica  The Doric order is characterized by a slightly tapered column that is the most squat of all the orders, measuring in height (including the capital) only about four to eight lower diameters. The Greek forms of the Doric order have no individual base and instead rest directly on the stylobate, although subsequent forms of Doric frequently were given a conventional plinth-and-torus base. The Doric shaft is channeled with 20 shallow flutes. The capital, as stated before, consists of a simple necking; a spreading, convex echinus; and a square abacus. The frieze section of the Doric entablature is distinctive. It is composed of projecting triglyphs (units each consisting of three vertical bands separated by grooves) that alternate with receding square panels, called metopes, that may be either plain or carved with sculptured reliefs. The Roman forms of the Doric order have smaller proportions and appear lighter and more graceful than their Greek counterparts.",
  " Encyclopædia Britannica  The Ionic order differs from the Doric in having more flutes on its shaft and in the scrolls, or volutes, that droop over the front and rear portions of the echinus in the capital. The echinus itself is carved with an egg-and-dart motif. The height of the entire Ionic order—column, base, capital, and entablature— is nine lower diameters. The base of the column has two tori (convex moldings) separated by a scotia. The shaft, which is eight lower diameters high, has 24 flutes. On the entablature, the architrave is usually made up of three stepped fasciae (bands). The frieze lacks the Doric triglyph and metope, and hence this area can hold a continuous band of carved ornament, such as figural groups.",
  " Encyclopædia Britannica  The Corinthian order is the most elegant of the five orders. Its distinguishing characteristic is the striking capital, which is carved with two staggered rows of stylized acanthus leaves and four scrolls. The shaft has 24 sharp-edged flutes, while the column is 10 diameters high.",
  " Encyclopædia Britannica  The Tuscan order is a Roman adaptation of the Doric. The Tuscan has an unfluted shaft and a simple echinus-abacus capital. It is similar in proportion and profile to the Roman Doric but is much plainer. The column is seven diameters high. This order is the most solid in appearance of all the orders.",
  " Encyclopædia Britannica  The Composite order, which was not ranked as a separate order until the Renaissance, is a late Roman development of the Corinthian. It is called Composite because its capital is composed of Ionic volutes and Corinthian acanthus-leaf decoration. The column is 10 diameters high.",
  "The Doric and Ionic orders originated nearly simultaneously on opposite shores of the Aegean Sea; the Doric on the Greek mainland and the Ionic in the Greek cities of Asia Minor. (The volutes of the Ionic capital were adapted from Phoenician and Egyptian capital designs.) The Doric may be considered the earlier order of the two only in its developed form. Both orders originated in temples constructed out of wood. The earliest well-preserved example of Doric architecture is the Temple of Hera at Olympia , built soon after 600 bc . From these beginnings, the evolution of the stone Doric column can be traced in architectural remains in Greece, Sicily, and southern Italy, where the Doric was to remain the chief order for monumental buildings for the next eight centuries.",
  "The Greeks as well as the Romans regarded the Corinthian as only a variant capital to be substituted for the Ionic. The first known use of a Corinthian capital on the outside of a building is that of the choragic Monument of Lysicrates (Athens, 335/334 bc ). The Corinthian was raised to the rank of an order by the 1st-century- bc Roman writer and architect Vitruvius.",
  "The Romans adopted the Doric, Ionic, and Corinthian orders and modified them to produce the Tuscan order, which is a simplified form of the Doric, and the Composite order, which is a combination of the Ionic and Corinthian orders. Another Roman innovation was the superposed order; when columns adorned several successive stories of a building, they were normally of different orders, in an ascending sequence from heaviest to most slender. Thus columns of the Doric order were assigned to the ground floor of a building, Ionic ones to the middle story, and Corinthian or Composite ones to the top story. To avoid the complications of separate orders for each story, the architects of the Renaissance invented the Colossal order, which is composed of columns extending the height of two or more stories of a building.",
  "Vitruvius was the only ancient Greek or Roman writer on architecture whose works survived the Middle Ages. When his handbook for Roman architects, De architectura, was rediscovered in the early 15th century, Vitruvius was at once hailed as the authority on classical architecture. Based on his writings, Italian architects of the Renaissance and Baroque periods developed an aesthetic canon that established rules for superposing the classical orders. The architects also laid down rules for the proportions of the orders and their parts down to the most minute members. The exact proportional dimensions of every element of an order was specified, so that, given the diameter of the column or any other dimension, the entire order and all of its separate elements could be reconstructed through routine calculations. The rules were thus carried to extravagant lengths that were undreamed of by the Greeks and rarely observed by the Romans.",
  "Succeeding artistic periods witnessed revivals of the archaeologically “correct” use of the orders, though many architects continued to use the various orders with the utmost freedom. In Modernist architecture of the 20th century, the orders passed from use as superfluous ornament, their structural functions having been taken over by columns and piers made of steel or reinforced concrete."
]