[
  "  organic compound , any of a large class of chemical compounds in which one or more atoms of carbon are covalently linked to atoms of other elements, most commonly hydrogen , oxygen , or nitrogen . The few carbon-containing compounds not classified as organic include carbides , carbonates , and cyanides .",
  "In general, organic compounds are substances that contain carbon (C), and carbon atoms provide the key structural framework that generates the vast diversity of organic compounds. All things on Earth (and most likely elsewhere in the universe) that can be described as living have a crucial dependence on organic compounds. Foodstuffs—namely, fats , proteins , and carbohydrates —are organic compounds, as are such vital substances as hemoglobin , chlorophyll , enzymes , hormones , and vitamins . Other materials that add to the comfort, health, or convenience of humans are composed of organic compounds, including clothing made of cotton, wool , silk , and synthetic fibres ; common fuels, such as wood , coal , petroleum , and natural gas ; components of protective coatings, such as varnishes , paints , lacquers , and enamels ; antibiotics and synthetic drugs ; natural and synthetic rubber ; dyes ; plastics ; and pesticides .",
  " Read about the differences between organic compounds and inorganic compounds in the article chemical compound . ",
  "When chemistry took on many of the characteristics of a rational science at the end of the 18th century, there was general agreement that experiment could reveal the laws that governed the chemistry of inanimate, inorganic compounds. The compounds that could be isolated from living organic entities, however, appeared to have compositions and properties entirely different from inorganic ones. Very few of the concepts that enabled chemists to understand and manipulate the chemistry of inorganic compounds were applicable to organic compounds. This great difference in chemical behaviour between the two classes of compounds was thought to be intimately related to their origin. Inorganic substances could be extracted from the rocks, sediments, or waters of the Earth, whereas organic substances were found only in the tissues or remains of living organisms. It was therefore suspected that organic compounds could be produced only by organisms under the guidance of a power present exclusively in living things. This power was referred to as a vital force.",
  "This vital force was thought to be a property inherent to all organic substances and incapable of being measured or extracted by chemical operations. Thus, most chemists of the time believed that it was impossible to produce organic substances entirely from inorganic ones. By about the middle of the 19th century, however, several simple organic compounds had been produced by the reaction of purely inorganic materials, and the unique character of organic compounds was recognized as the consequence of an intricate molecular architecture rather than of an intangible vital force.",
  "The first significant synthesis of an organic compound from inorganic materials was an accidental discovery of Friedrich Wöhler, a German chemist. Working in Berlin in 1828, Wöhler mixed two salts (silver cyanate and ammonium chloride) in an attempt to make the inorganic substance ammonium cyanate. To his complete surprise, he obtained a product that had the same molecular formula as ammonium cyanate but was instead the well-known organic compound urea. From this serendipitous result, Wöhler correctly concluded that atoms could arrange themselves into molecules in different ways, and the properties of the resulting molecules were critically dependent on the molecular architecture. (The inorganic compound ammonium cyanate is now known to be an isomer of urea; both contain the same type and number of atoms but in different structural arrangements.) Encouraged by Wöhler’s discovery, others succeeded in making simple organic compounds from inorganic ones, and by roughly 1860 it was generally recognized that a vital force was unnecessary for the synthesis and interconversion of organic compounds.",
  "Although a large number of organic compounds have since been synthesized, the structural complexity of certain compounds continues to pose major problems for the laboratory synthesis of complicated molecules. But modern spectroscopic techniques allow chemists to determine the specific architecture of complicated organic molecules, and molecular properties can be correlated with carbon bonding patterns and characteristic structural features known as functional groups.",
  "The carbon atom is unique among elements in its tendency to form extensive networks of covalent bonds not only with other elements but also with itself. Because of its position midway in the second horizontal row of the periodic table, carbon is neither an electropositive nor an electronegative element; it therefore is more likely to share electrons than to gain or lose them. Moreover, of all the elements in the second row, carbon has the maximum number of outer shell electrons (four) capable of forming covalent bonds. (Other elements, such as phosphorus [P] and cobalt [Co], are able to form five and six covalent bonds, respectively, with other elements, but they lack carbon’s ability to bond indefinitely with itself.) When fully bonded to other atoms, the four bonds of the carbon atom are directed to the corners of a tetrahedron and make angles of about 109.5° with each other. The result is that not only can carbon atoms combine with one another indefinitely to give compounds of extremely high molecular weight, but the molecules formed can exist in an infinite variety of three-dimensional structures. The possibilities for diversity are increased by the presence of atoms other than carbon in organic compounds, especially hydrogen (H), oxygen (O), nitrogen (N), halogens (fluorine [F], chlorine [Cl], bromine [Br], and iodine [I]), and sulfur (S). It is the enormous potential for variation in chemical properties that has made organic compounds essential to life on Earth.",
  "The structures of organic compounds commonly are represented by simplified structural formulas, which show not only the kinds and numbers of atoms present in the molecule but also the way in which the atoms are linked by the covalent bonds—information that is not given by simple molecular formulas, which specify only the number and type of atoms contained in a molecule. (With most inorganic compounds, the use of structural formulas is not necessary, because only a few atoms are involved and only a single arrangement of the atoms is possible.) In the structural formulas of organic compounds, short lines are used to represent the covalent bonds. Atoms of the individual elements are represented by their chemical symbols, as in molecular formulas.",
  "Structural formulas vary widely in the amount of three-dimensional information they convey, and the type of structural formula used for any one molecule depends on the nature of the information the formula is meant to display. The different levels of sophistication can be illustrated by considering some of the least complex organic compounds, the hydrocarbons. The gas ethane, for example, has the molecular formula C 2 H 6 . The simplest structural formula, drawn either in a condensed or in an expanded version, reveals that ethane consists of two carbon atoms bonded to one another, each carbon atom bearing three hydrogen atoms. Such a two-dimensional representation correctly shows the bonding arrangement in ethane, but it does not convey any information about its three-dimensional architecture. A more sophisticated structural formula can be drawn to better represent the three-dimensional structure of the molecule. Such a structural formula correctly shows the tetrahedral orientation of the four atoms (one carbon and three hydrogens) bonded to each carbon, and the specific architecture of the molecule.",
  "Larger organic molecules are formed by the addition of more carbon atoms. Butane, for example, is a gaseous hydrocarbon with the molecular formula C 4 H 10 , and it exists as a chain of four carbon atoms with 10 attached hydrogen atoms. As carbon atoms are added to a molecular framework, the carbon chain can develop branches or form cyclic structures. A very common ring structure contains six carbon atoms in a ring, each bonded in a tetrahedral arrangement, as in the hydrocarbon cyclohexane, C 6 H 12 . Such ring structures are often very simply represented as regular polygons in which each apex represents a carbon atom, and the hydrogen atoms that complete the bonding requirements of the carbon atoms are not shown. The polygon convention for cyclic structures reveals concisely the bonding arrangement of the molecule but does not explicitly convey information about the actual three-dimensional architecture. It should be noted that the polygon is only a two-dimensional symbol for the three-dimensional molecule.",
  "Under certain bonding conditions, adjacent atoms will form multiple bonds with each other. A double bond is formed when two atoms use two electron pairs to form two covalent bonds; a triple bond results when two atoms share three electron pairs to form three covalent bonds. Multiple bonds have special structural and electronic features that generate interesting chemical properties. The six atoms involved in a double bond (as in ethene, C 2 H 4 ) lie in a single plane, with regions above and below the plane occupied by the electrons of the second covalent bond. Atoms in a triple bond (as in acetylene, or ethyne, C 2 H 2 ) lie in a straight line, with four regions beside the bond axis occupied by electrons of the second and third covalent bonds.",
  "  Chemists observed early in the study of organic compounds that certain groups of atoms and associated bonds, known as functional groups, confer specific reactivity patterns on the molecules of which they are a part. Although the properties of each of the several million organic molecules whose structure is known are unique in some way, all molecules that contain the same functional group have a similar pattern of reactivity at the functional group site. Thus, functional groups are a key organizing feature of organic chemistry. By focusing on the functional groups present in a molecule (most molecules have more than one functional group), several of the reactions that the molecule will undergo can be predicted and understood.",
  "Because carbon-to-carbon and carbon-to-hydrogen bonds are extremely strong and the charge of the electrons in these covalent bonds is spread more or less evenly over the bonded atoms, hydrocarbons that contain only single bonds of these two types are not very reactive. The reactivity of a molecule increases if it contains one or more weak bonds or bonds that have an unequal distribution of electrons between the two atoms. If the two electrons of a covalent bond are, for one reason or another, drawn more closely to one of the bonded atoms, that atom will develop a partial negative charge and the atom to which it is bonded will develop a partial positive charge. A covalent bond in which the electron pair linking the atoms is shared unequally is known as a polar bond. Polar bonds, and any other bonds that have unique electronic properties, confer the potential for chemical reaction on the molecule in which they are present. This is because, for every reaction, one or more bonds of a molecule must be broken and new bonds formed. The presence of a partial negative charge (a region of high electron density) will draw to itself other atoms or groups of atoms that are deficient in electron density. This initiates the process of bond breaking that is a prerequisite for a chemical reaction. For these reasons, molecules with regions of increased or decreased electron density are especially important for chemical change.",
  "There are two major bonding features that generate the reactive sites of functional groups. The first, already mentioned, is the presence of multiple bonds. Both double and triple bonds have regions of high electron density lying outside the atom-to-atom bond axis. Double and triple bonds are known as functional groups, a term that is used to identify atoms or groups of atoms within a molecule that are sites of comparatively high reactivity. A second type of reactive site results when an atom other than carbon or hydrogen (termed a heteroatom ) is bonded to carbon. All heteroatoms have a greater or lesser attraction for electrons than does carbon. Thus, each bond between a carbon and a heteroatom is polar, and the degree of polarity depends on the difference between the electron-attracting properties of the two atoms. The most important atomic groupings that contain such reactive polar bonds are also able to generate functional groups.",
  "To emphasize the generality of reactions between molecules that contain the same functional group, chemists often represent the less reactive portions of a molecule by the symbol R. Thus, all molecules that contain a double bond, however complicated, can be represented by the general formula for an alkene—i.e.,",
  " ",
  "This type of formula suggests that the molecule will undergo those reactions that are common to double bonds and that the reaction will occur at the double bond. The rest of the molecule, represented by the four R groups, will remain unchanged by the reaction occurring at the functional group site.",
  "Molecules with more than one functional group, called polyfunctional, may have more complicated properties that result from the identity—and interconnectedness—of the multiple functional groups. Many natural products contain several functional groups located at specific sites within a large, complicated, three-dimensional structure.",
  "Alkanes are compounds that consist entirely of atoms of carbon and hydrogen (a class of substances known as hydrocarbons) joined to one another by single bonds. The shared electron pair in each of these single bonds occupies space directly between the two atoms; the bond generated by this shared pair is known as a sigma (σ) bond. Both carbon-carbon and carbon-hydrogen sigma bonds are single strong, nonpolar covalent bonds that are normally the least reactive bonds in organic molecules. Alkane sequences form the inert framework of most organic compounds. For this reason, alkanes are not formally considered a functional group. When a hydrocarbon chain is connected as a substituent to a more fundamental structural unit, it is termed an alkyl group. The simplest examples of alkanes are methane (CH 4 ; the principal constituent of natural gas), ethane (C 2 H 6 ), propane (C 3 H 8 ; widely used as a barbecue fuel), and butane (C 4 H 10 ; the liquid fuel in pocket lighters). Hydrocarbon chains commonly occur in cyclic forms, or rings; the most common example is cyclohexane (C 6 H 12 ).",
  "Organic compounds are termed alkenes if they contain a carbon-carbon double bond. The shared electron pair of one of the bonds is a σ bond. The second pair of electrons occupies space on both sides of the σ bond; this shared pair constitutes a pi (π) bond. A π bond forms a region of increased electron density because the electron pair is more distant from the positively charged carbon nuclei than is the electron pair of the σ bond . Even though a carbon-carbon double bond is very strong, a π bond will draw to itself atoms or atomic groupings that are electron-deficient, thereby initiating a process of bond-breaking that can lead to rupture of the π bond and formation of new σ bonds. A simple example of an alkene reaction, which illustrates the way in which the electronic properties of a functional group determine its reactivity, is the addition of molecular hydrogen to form alkanes, which contain only σ bonds.",
  " ",
  "Such reactions, in which the π bond of an alkene reacts to form two new σ bonds, are energetically favourable because the new bonds formed (two carbon-hydrogen σ bonds) are stronger than the bonds broken (one carbon-carbon π bond and one hydrogen-hydrogen σ bond). Because the addition of atoms to the π bond of alkenes to form new σ bonds is a general and characteristic reaction of alkenes, alkenes are said to be unsaturated. Alkanes, which cannot be transformed by addition reactions into molecules with a greater number of σ bonds, are said to be saturated.",
  "The alkene functional group is an important one in chemistry and is widespread in nature. Some common examples (shown here) include ethylene (used to make polyethylene), 2-methyl-1,3-butadieneisoprene (used to make rubber), and vitamin A (essential for vision).",
  " ",
  "For ethene, both the carbon atoms of an alkene and the four atoms connected to the double bond lie in a single plane.",
  "Molecules that contain a triple bond between two carbon atoms are known as alkynes. The triple bond is made up of one σ bond and two π bonds. As in alkenes, the π bonds constitute regions of increased electron density lying parallel to the carbon-carbon bond axis. Carbon-carbon triple bonds are very strong bonds, but reactions do occur that break the π bonds to form stronger σ bonds.",
  "The most common example of an alkyne is ethyne (also known as acetylene), used as a fuel for oxyacetylene torches in welding applications. Alkynes are not abundant in nature, but the fungicide capillan contains two alkyne functional groups.",
  " ",
  " p  A distinctive set of physical and chemical properties is imparted to molecules that contain a functional group composed of three pairs of doubly bonded atoms (usually all carbon atoms) bonded together in the shape of a regular planar (flat) hexagon. The hexagonal ring is usually drawn with an alternating sequence of single and double bonds. The molecule benzene, C 6 H 6 , first discovered by English physicist and chemist Michael Faraday in 1825, is the smallest molecule that can contain this functional group, and arenes contain one or more benzene (or structurally similar) rings. Because benzene and many larger arenes have a strong odour, they have long been known as aromatic hydrocarbons. Benzene, and all the larger arenes, have a characteristic planar structure forced on them by the electronic requirements of the six (or more) pi electrons. When named as substituents on other structural units, the aromatic units are called aryl substituents. Naphthalene, the active component of mothballs, contains two fused benzene rings. Benzo[a]pyrene, an aromatic hydrocarbon produced in small amounts by the combustion of organic substances, contains five fused benzene rings. Like several other polycyclic aromatic hydrocarbons, it is carcinogenic. Aromatic compounds are widely distributed in nature. Benzaldehyde, anisole, and vanillin, for example, have pleasant aromas.",
  " ",
  "An oxygen atom normally forms two σ bonds with other atoms; the water molecule, H 2 O, is the simplest and most common example. If one hydrogen atom is removed from a water molecule, a hydroxyl functional group (―OH) is generated. When a hydroxyl group is joined to an alkane framework, an alcohol such as ethanol, is produced.",
  " ",
  "When the hydroxyl group is joined to an aryl ring, a phenol results (shown above). Both alcohols and phenols are widespread in nature, with alcohols being especially ubiquitous. The hydroxyl group of alcohols and phenols is responsible for an interesting variety of physical and chemical properties. The biochemical action of vitamin E, for example, depends largely on the reactivity of the phenol functional group.",
  "An oxygen atom is much more electronegative than carbon or hydrogen atoms, so both carbon-oxygen and hydrogen-oxygen bonds are polar. The oxygen atom is slightly negatively charged, and the carbon and hydrogen atoms are slightly positively charged. The polar bonds of the hydroxyl group are responsible for the major reaction characteristics of alcohols and phenols. In general, these reactions are initiated by reaction of electron-deficient groups with the negatively charged oxygen atom or by reaction of electron-rich groups with the positively charged atoms—namely, carbon or hydrogen—bonded to oxygen.",
  "An organic molecule in which an oxygen atom is bonded to two carbon atoms through two sigma bonds is known as an ether. Ether molecules occur widely in nature. Diethyl ether was once widely used as an anesthetic. An aromatic ether known as Nerolin II (2-ethoxynaphthalene) is used in perfumes to impart the scent of orange blossoms. Cyclic ethers, such as tetrahydrofuran, are commonly used as organic solvents. Although ethers contain two polar carbon-oxygen bonds, they are much less reactive than alcohols or phenols.",
  " ",
  "Epoxides are cyclic ethers that contain a three-membered ring. The simplest example is oxirane (ethylene oxide). An epoxide is one of the functional groups in the insect hormone known as juvenile hormone.",
  "  A thiol is structurally similar to an alcohol but contains a sulfur atom in place of the oxygen atom normally found in an alcohol. The outstanding feature of thiols is their foul smell. The simplest thiol is hydrogen sulfide, H 2 S, the sulfur analog of water. It can be detected by the human nose at a concentration of a few parts per billion and is readily identifiable as having a rotten-egg odour. Ethanethiol is added in trace amounts to natural gas to give it a detectable odour, and striped skunks deter predators by releasing a liquid spray containing 3-methyl-1-butanethiol. When present as a substituent on another structural unit, the SH group is commonly termed mercapto , as in 2-mercaptoethanol.",
  "Amines are functional group compounds that contain at least one nitrogen atom bonded to hydrogen atoms or to alkyl or aryl groups. If the substituents (other than hydrogen atoms) are alkyl groups, the resulting compounds are termed alkyl amines . If one or more substituents is an aryl group, the compounds are termed aryl amines . Amines are commonly categorized as primary, secondary, or tertiary, depending on whether the nitrogen atom is bonded to one, two, or three alkyl or aryl groups, respectively. The nitrogen atom is bonded to its hydrogen atoms and alkyl groups by sigma (σ) bonds, but the nitrogen atom also bears a nonbonded electron pair. The three σ bonds and nonbonded electron pair are oriented around the nitrogen atom in a distorted tetrahedral geometry.",
  "In some compounds, the nonbonded electron pair on the nitrogen atom is replaced by a fourth σ bond to a hydrogen atom or to an alkyl or aryl group. The resulting compound, called a quaternary ammonium salt, has a positive charge on the nitrogen atom and a tetrahedral arrangement of groups around the nitrogen atom. Amines are very common organic molecules, and many are physiologically active. Amphetamine, for example, is a central nervous system stimulant and acts as an antidepressant. Amines are particularly valuable because of their ability to act as bases, a property that is a consequence of the ability of amines to accept hydrogen atoms from acidic molecules.",
  "Halides, or organohalides, are compounds that contain a halogen atom (fluorine, chlorine, bromine, or iodine) bonded to a carbon atom by a polar bond. The slightly positive charge that exists on the carbon atom in carbon-halogen bonds is the source of reactivity of halides. A wide variety of organohalides have been discovered in marine organisms, and several simple halide compounds have important commercial applications. Chloroethane (ethyl chloride) is a volatile liquid that is used as a topical anesthetic. Chloroethene (vinyl chloride) is the monomeric building block for polyvinyl chloride (PVC), and the mixed organohalide halothane is an inhalation anesthetic. The compound epibatidine, isolated from glands on the back of an Ecuadorian poison frog, has been found to be an especially potent painkiller.",
  "When an oxygen atom forms a double bond to a carbon atom, a carbonyl functional group is obtained. The carbon atom of a carbonyl group is bonded to two other atoms in addition to the oxygen atom. A wide range of functional groups are produced by the presence of different atomic groupings on the carbon of the carbonyl group. Two of the most important are aldehydes and ketones. In a ketone, both atoms bonded to the carbonyl carbon are other carbon atoms, and, in an aldehyde, at least one atom on the carbonyl carbon is a hydrogen. Similar to the double bond of alkenes, the carbon-oxygen double bond is made up of a σ bond, whose electron pair lies between the bonded atoms, and a π bond, whose electron pair occupies space on both sides of the σ bond.",
  "Many aldehydes and ketones have pleasant, fruity aromas, and these compounds are frequently responsible for the flavour and smell of fruits and vegetables. A 40 percent solution of formaldehyde in water is formalin, a liquid used for preserving biological specimens. Benzaldehyde is an aromatic aldehyde and imparts much of the aroma to cherries and almonds. Butanedione, a ketone with two carbonyl groups, is partially responsible for the odour of cheeses. Civetone, a large cyclic ketone, is secreted by the civet cat and is a key component of many expensive perfumes.",
  "The carbonyl group has a wide variety of reaction pathways open to it. Because of its π bond, the carbonyl group undergoes addition reactions similar to those that occur with alkenes but with a few important differences. Whereas carbon-carbon double bonds are nonpolar, carbon-oxygen double bonds are polar. Species that add to a carbonyl group to form new σ bonds react in such a way that electrophilic (electron-seeking) groups attack the oxygen atom and nucleophilic groups (those seeking positively charged centres) attack the carbon atom. Furthermore, addition to a carbonyl group results in the breaking of a strong π bond. The energy relationships of carbonyl addition reactions are consequently very different from those of alkene addition reactions. Other reaction possibilities of carbonyl compounds depend on the nature of the atomic groupings, termed substituents , attached to the carbonyl carbon. When both substituents are unreactive alkane fragments, as in ketones, there are few reactions other than carbonyl additions. When one of the substituents is not an alkane fragment, different possibilities emerge. In aldehydes, the carbonyl carbon is bonded to a hydrogen atom, and reactions that involve this hydrogen atom distinguish the reactions of aldehydes from those of ketones.",
  "The conjunction of a carbonyl and a hydroxyl group forms a functional group known as a carboxyl group.",
  " ",
  "The hydrogen of a carboxyl group can be removed (to form a negatively charged carboxylate ion), and thus molecules containing the carboxyl group have acidic properties and are generally known as carboxylic acids. Vinegar is a 5 percent solution of acetic acid in water, and its sharp acidic taste is due to the carboxylic acid present. Lactic acid provides much of the sour taste of pickles and sauerkraut and is produced by contracting muscles. Citric acid is a major flavour component of citrus fruits, such as lemons, grapefruits, and oranges. Ibuprofen, an effective analgesic and anti-inflammatory agent, contains a carboxyl group.",
  "The structural unit containing an alkyl group bonded to a carbonyl group is known as an acyl group. A family of functional groups, known as carboxylic acid derivatives, contains the acyl group bonded to different substituents.",
  " ",
  "Esters have an alkoxy (OR) fragment attached to the acyl group; amides have attached amino groups (―NR 2 ); acyl halides have an attached chlorine or bromine atom; and anhydrides have an attached carboxyl group. Each type of acid derivative has a set of characteristic reactions that qualifies it as a unique functional group, but all acid derivatives can be readily converted to a carboxylic acid under appropriate reaction conditions. Many simple esters are responsible for the pleasant odours of fruits and flowers. Methyl butanoate, for example, is present in pineapples. Urea, the major organic constituent of urine and a widely used fertilizer, is a double amide of carbonic acid. Acyl chlorides and anhydrides are the most reactive carboxylic acid derivatives and are useful chemical reagents, although they are not important functional groups in natural substances.",
  "Although each of the functional groups introduced above has a characteristic set of favoured reactions, it is not always possible to predict the properties of organic compounds that contain several different functional groups. In polyfunctional organic compounds, the functional groups often interact with one another to impart unique reactivity patterns to the compounds. As chemistry evolves as a science, it becomes possible to understand more of the behaviour of complex molecules, and chemists are able to design laboratory syntheses of increasingly complicated molecules, basing the synthetic plan upon the reactivity trends of functional groups.",
  "  Chemical synthesis is concerned with the construction of complex chemical compounds from simpler ones. A synthesis usually is undertaken for one of three reasons. The first reason is to meet an industrial demand for a product. For example, ammonia is synthesized from nitrogen and hydrogen and is used to make, among other things, ammonium sulfate, employed as a fertilizer; vinyl chloride is made from ethylene and is used in the production of polyvinyl chloride (PVC) plastic. In general, a vast range of chemical compounds are synthesized for applications as fibres and plastics, pharmaceuticals, dyestuffs, herbicides, insecticides, and other products.",
  "Second, an enormous number of compounds of considerable molecular complexity occur naturally, in both living organisms and their degradation products; examples are proteins (in animals) and alkaloids (alkaline materials found in plants). The syntheses of these natural products have usually been undertaken in the context of the determination of the structures of the compounds; if a material is deduced to have a particular structure on the basis of its chemical reactions and physical properties, then the discovery that a compound synthesized by an unambiguous method for this structure is identical to the natural product provides confirmation of the validity of the assigned structure.",
  "Third, a synthesis may be carried out to obtain a compound of specific structure that does not occur naturally and has not previously been made. This type of synthesis is performed in order to examine the properties of the compound and thereby test theories of chemical structure and reactivity.",
  "The range of compounds that are capable of being synthesized is essentially limitless. In practice, the synthesis of a preselected compound is made possible by particular functional groups undergoing transformations that, while they are dependent on the conditions applied to the compound, are largely independent of the structure of the remaining part of the molecule. Thus, the combination of knowledge of the structure of the compound to be synthesized and knowledge of the general types of transformation that compounds undergo enables a synthesis to be planned. The general approach, cut to its barest essentials, is to examine the structure of the desired end product—for example, Z—and to deduce the structure of some (slightly simpler) compound—for example, Y—that should be capable of transformation into Z by a reaction of known type. A possible precursor of Y is sought in similar manner, and in this way the chain of compounds is extended until a compound, A, is reached that is available for the work; the necessary transformations, beginning with A and ending with Z, are then carried out. Most individual steps in the sequence result in a change in only one bond; some result in changes in two bonds at a time, but it is unusual for more extensive changes to occur.",
  "Three factors must be borne in mind when evaluating a particular synthetic plan. The first is cost—of far greater importance in industrial, large-scale synthesis than in laboratory work in which a particular synthesis may be carried out only once, as in the total synthesis of a naturally occurring compound, and which in any case is likely to be on a relatively small scale. The environmental impact of chemical syntheses has become an important consideration. Syntheses or processes that have a benign environmental impact, whether by use of safe and commonly available reagents or by minimization of environmentally harmful waste products, have become an essential feature of so-called “green chemistry.”",
  "Second, the yield in each step must be considered. A step in a synthesis may give a very low yield of the desired product. For example, a proportion of the reactant may be converted into a different product by an alternative process that competes with the desired one; some of the product may undergo a subsequent reaction; or some of the product may be lost in the separation processes required for its isolation in a pure state. The yield is usually defined, on a percentage basis, as the number of molecules of product obtained when 100 could in principle have been formed. A yield of about 80 percent or more is generally considered good, but some transformations can prove so difficult to achieve that even a yield of 10 or 20 percent may have to be accepted. The ultimate synthetic goal in a perfect synthesis is to achieve 100 percent “atom efficiency,” in which all atoms of all reagents are incorporated into the synthesized product without the formation of any by-products.",
  "Naturally, the yield of a process affects the cost of the product, because the shortfall from a 100 percent yield represents wasted material. In addition, yield can be of the utmost importance in determining whether a synthesis is a practicable possibility, because the overall yield of a synthesis is the product of the yields of the individual steps. If these intermediate yields are mostly low, the ultimate product may not be obtainable in the necessary amount from the available starting material.",
  "Finally, consideration must be given to the rate at which each step in the planned sequence occurs. In many instances, a desired reaction is possible in principle but in practice takes place so slowly as to be ineffective. It is then necessary to investigate whether the rate can be increased to a practicable level by altering the conditions of the reaction—for example, by raising the temperature or by adding an extra species, called a catalyst, that increases the rate without altering the course of the reaction.",
  "The product of a synthesis is normally contaminated with reagents used in the synthesis, by-products, and possibly some unchanged starting material; these contaminants must be removed in order for a pure product to be obtained. In a multistep synthesis, it is normally desirable to purify the product from each step before proceeding to the next.",
  "Until the mid-20th century, most organic compounds were distinguished from one another largely on the basis of simple physical and chemical properties. Knowledge of these properties, however, yields only superficial clues about a compound’s molecular structure, and the determination of that structure was a complicated process (for large molecules at least) that involved careful analysis of several reaction pathways. Chemists had no way to see what molecules looked like, because molecules are so small that no device such as a microscope could be developed that would give a complete image of a molecular structure. One technique, X-ray crystallography, can give precise structural data for some molecules, but only those that can be obtained in solid, crystalline form. Normally, a full X-ray structure determination is a costly, time-consuming endeavour that is applied to only the most puzzling structures. Sufficient information to decipher a molecule’s structure is much more easily obtained by the use of one or more spectroscopic techniques.",
  " Spectroscopy is a general term used for the instrumental processes by which information about molecular structure is obtained through careful analysis of the absorption, scattering, or emission of electromagnetic radiation by compounds. Electromagnetic radiation is the continuous spectrum of energy-bearing waves ranging from extremely short waves, such as high-energy X-rays (with wavelengths of about 10 nanometres [nm]), to very long, low-energy waves such as radio waves (with wavelengths of one metre [m] or more). Visible light, for example, is the range of electromagnetic radiation detectable by human vision, with wavelengths of roughly 400 to 700 nm. Objects appear coloured when they absorb visible light of certain wavelengths, and those absorbed wavelengths are consequently absent from light that passes from the coloured object to the eyes .",
  "Molecules are able to absorb light of certain wavelengths because the energy content of the absorbed light is the precise value needed to cause a molecule to be excited from one energy state to a higher one. The myriad energy levels in a molecule are said to be quantized because each one differs from another by a discrete, measurable energy value, just as each step in a stairway is a fixed height above, or below, all others. Thus, by measuring the wavelengths of the electromagnetic radiation absorbed by a molecule, it is possible to gain information about the various energy levels within it. This information can then be correlated with specific details of molecular structure. Instruments called spectrometers measure the wavelengths of light that are absorbed by molecules in various regions of the electromagnetic spectrum. The most important spectroscopic techniques for structure determination are ultraviolet and visible spectroscopy, infrared spectroscopy, and nuclear magnetic resonance spectroscopy. A fourth technique, termed mass spectrometry, does not depend on absorption of electromagnetic radiation, but it is valuable for the information it provides about the number and type of atoms present in a molecule. The following sections briefly describe the various applications of these techniques for organic compounds.",
  "Most organic compounds are transparent to the relatively high-energy radiation that constitutes the ultraviolet (200–400 nm) and visible (400–700 nm) portion of the electromagnetic spectrum, and consequently they appear colourless in solution. This is because the electrons in the σ bonds of organic molecules require wavelengths of even higher energy (such as those of X-rays) to excite them to the next higher accessible energy level. Electrons in π bonds, however, can be promoted to higher energy levels by ultraviolet and visible light, and UV-visible spectroscopy consequently provides useful structural information for molecules that contain π bonds. When multiple π bonds are separated from each other by intervening single bonds, they are said to be conjugated.",
  "  The UV-visible spectrum of a molecule is dramatically affected by the presence of conjugation. As the number of conjugated π bonds increases, the UV-visible spectrum shows light absorption at a greater number of different wavelengths (i.e., the spectrum contains more absorption peaks), and light of longer wavelengths (and lower energy) is absorbed. The many individual peaks of UV-visible spectra normally coalesce to produce a continuous absorption spectrum, with some of the strongest individual absorption peaks appearing as sharp spikes. For example, the UV-visible spectrum of azulene, a molecule that contains five conjugated π bonds, shows a strong absorbance in the visible region of the electromagnetic spectrum, which correlates with its intense blue colour.",
  "Naturally occurring organic compounds that are highly coloured contain an extensive system of conjugated π bonds. The compound largely responsible for the bright orange colour of carrots, β-carotene, contains 11 conjugated π bonds. UV-visible spectroscopy is especially informative for molecules that contain conjugated π bonds.",
  "  In organic compounds, atoms are said to be bonded to each other through a σ bond when the two bonded atoms are held together by mutual attraction for the shared electron pair that lies between them. The two atoms do not remain static at a fixed distance from one another, however. They are free to vibrate back and forth about an average separation distance known as the average bond length. These movements are termed stretching vibrations. In addition, the bond axis (defined as the line directly joining two bonded atoms) of one bond may rock back and forth within the plane it shares with another bond or bend back and forth outside that plane. These movements are called bending vibrations. Both stretching and bending vibrations represent different energy levels of a molecule. These energy differences match the energies of wavelengths in the infrared region of the electromagnetic spectrum—i.e., those ranging from 2.5 to 15 micrometres (μm; 1 μm = 10 −6 m). An infrared spectrophotometer is an instrument that passes infrared light through an organic molecule and produces a spectrum that contains a plot of the amount of light transmitted on the vertical axis against the wavelength of infrared radiation on the horizontal axis. In infrared spectra the absorption peaks point downward because the vertical axis is the percent transmittance of the radiation through the sample. Absorption of radiation lowers the percent transmittance value. Since all bonds in an organic molecule interact with infrared radiation, IR spectra provide a great deal of structural data.",
  "The stretching vibrations of strong carbon-hydrogen bonds cause the absorptions around 3.4 μm, with the sharp peak at 3.2 μm due to the hydrogen atom on the carbon-carbon double bond. The many bending vibrations of carbon-hydrogen bonds cause the complicated absorption pattern ranging from about 7 to 25 μm. This area of IR spectra is called the fingerprint region, because the absorption pattern is highly complex but unique to each organic structure. The stretching vibrations for both the carbon-carbon and carbon-oxygen double bonds are easily identified at 6.1 and 5.8 μm, respectively. Most of the functional groups have characteristic IR absorptions similar to those for carbon-oxygen and carbon-carbon double bonds. Infrared spectroscopy is therefore extremely useful for determining the types of functional groups present in organic molecules.",
  "Absorption of long-wavelength (1–5 m) low-energy radiation in the radio-frequency region of the electromagnetic spectrum is due to the atomic nuclei in a molecule. Many (but not all) atomic nuclei have a small magnetic field, which makes them behave somewhat like tiny bar magnets. When placed in a strong external magnetic field, such nuclei can assume different energy states; in the simplest case, two energy states are possible. In the lower energy state, the magnetic field of the nucleus is aligned with the external magnetic field, and, in the higher energy state, it is aligned against the field. The energy difference between the two levels depends on the strength of the external magnetic field. In modern NMR spectrometers, organic compounds are placed in magnetic fields ranging from about 1.4 to 18.0 teslas (T) and are irradiated with radio-frequency waves. For comparison, the Earth’s magnetic field is about 0.00007 T. At a magnetic-field strength of 1.4 T, the energy difference between the lower and higher energy states of a 1 H proton nucleus is only 0.024 J mol-1. Electromagnetic radiation with a frequency of about 60 megahertz (MHz) can supply the energy needed to convert the lower energy state to the higher one. The energy difference between the magnetic energy levels of a nucleus is measured as an absorption peak, or a resonance. Because the energy of the absorbed radiation depends on the environment around the absorbing nucleus in a molecule, NMR spectroscopy provides the most structural information of all the spectroscopic techniques used in chemistry. Especially valuable are proton magnetic resonance spectroscopy, which measures the resonances due to energy absorption by hydrogen atoms in organic compounds, and carbon-13 magnetic resonance spectroscopy, which yields the resonances due to absorption by atoms of carbon-13 ( 13 C), a naturally occurring isotope of carbon that contains six protons and seven neutrons.",
  "  Proton NMR spectra yield a great deal of information about molecular structure because most organic molecules contain many hydrogen atoms, and the hydrogen atoms absorb energy of different wavelengths depending on their bonding environment.",
  "NMR absorbances appear in a spectrum as a series of sharp spikes or peaks. Although there is no vertical scale on the spectrum, the relative height of each peak corresponds roughly to the strength of the absorption. The horizontal scale does not show proton resonances in simple wavelength units. Instead, the position of each peak is normally measured relative to the absorption of the protons in the compound tetramethylsilane, (CH 3 ) 4 Si. Tetramethylsilane is an inert liquid added in small amounts to the compound being analyzed. All 12 of its hydrogen atoms absorb at the same position to give a single sharp peak, which is arbitrarily assigned a positional value of zero. This peak is then used as a reference point for all other peaks in the spectrum. The hydrogen atoms in the molecule being analyzed generally appear to the left of the reference peak because they absorb radiation of higher energy than the hydrogens of tetramethylsilane.",
  "The distance of the proton absorptions from the reference peak is given by a number called the chemical shift. Each unit of chemical shift represents a fractional increase of one part per million (ppm) in the energy of absorbed radiation, relative to the value for tetramethylsilane. For example, in the proton NMR spectrum of bromoethane, the hydrogen atoms of the CH 3 group appear at about 1.6 ppm and the hydrogens of the CH 2 group at about 3.3 ppm. Atoms in a molecule have different chemical shifts because they experience slightly different local magnetic fields owing to the presence of nearby electrons. Electrons generate a magnetic field of their own, which reduces the magnitude of the total field at the nucleus. Nuclei that are surrounded by regions of high electron density, such as the hydrogen atoms of tetramethylsilane, are said to be shielded from the applied field of the instrument’s magnet. The electronegative bromine atom in bromoethane pulls electrons away from the carbon and hydrogen atoms. The CH 2 hydrogens are more strongly affected than the CH 3 hydrogens and thus have a greater chemical shift, because they are closer to the bromine atom. All three hydrogens on the CH 3 group are exposed to the same local magnetic field and consequently have the same chemical shift. Such hydrogens are said to be equivalent. The two hydrogens on the CH 2 group are also equivalent. The chemical shift of hydrogen atoms is the most important piece of information provided by NMR spectroscopy, because it reveals a great deal about the nature of the bonds around the hydrogen.",
  "Two more features of NMR spectra are important aids to structure assignment. The first is the area of space enclosed by the absorption peaks. The area under the peaks is directly proportional to the number of hydrogen atoms contributing to the peak. NMR spectrometers have a feature, called integration, which, when selected by the user, calculates the area under each peak and plots the result as a line that is displaced vertically at a peak by an amount proportional to the area under the peak. The integration of the bromoethane spectrum, for example, shows that the absorption peaks around 1.6 ppm have an area that is 1.5 times greater than the area of the peaks at 3.3 ppm. This is consistent with, and supports, the assignment of the peaks to the CH 3 and CH 2 groups because the ratio of the area of the CH 3 peak to the CH 2 peak is expected to be 3:2, or 1.5:1, for the numbers of hydrogen atoms are in a 3:2 ratio.",
  "The second additional feature is the pattern of the absorption peaks. In the bromoethane example, the CH 3 peak is split into three distinct peaks, called a triplet. The CH 2 peak is split into four peaks, called a quartet. These multiple peaks are caused by nearby hydrogen atoms through a process termed spin-spin splitting . Each set of equivalent hydrogens on a given carbon is split into an n+1 multiplet by adjacent hydrogen atoms that are nonequivalent to the hydrogens of the given carbon. These splittings are generally observed for all nonequivalent hydrogens bonded to the one or two adjoining carbon atoms. In the bromoethane spectrum, the CH 3 absorption appears as a triplet owing to the effects of the two hydrogens on the adjacent CH 2 group. Reciprocally, the CH 2 absorption is a quartet because of the effects of the three hydrogen atoms on the neighbouring CH 3 group.",
  "These three important features of a proton NMR spectrum—chemical shift, relative peak size, and spin-spin splitting—provide detailed information about the number and location of hydrogen atoms in a molecule. By incorporating information gained from carbon-13 magnetic resonance, chemists can often induce an unambiguous structure for a molecule whose molecular formula is known.",
  "Naturally occurring carbon is composed almost entirely of the carbon-12 isotope, which has no magnetic moment and thus is not detectable by NMR techniques. However, carbon-13 ( 13 C) atoms, which make up about 1 percent of all carbon atoms, do absorb radio-frequency waves in a manner similar to hydrogen. Thus, 13 C NMR is possible, and the technique provides valuable information about the structure of the carbon skeleton in organic molecules. Because, on average, only 1 out of every 100 carbon atoms in a molecule is a 13 C isotope and because 13 C atoms absorb electromagnetic radiation very weakly, 13 C NMR signals are about 6,000 times weaker than proton signals. Modern instrumentation has overcome this handicap, and 13 C NMR has become a readily accessible analytical technique. As in proton spectra, the 13 C peaks are plotted as chemical shifts relative to an internal standard, such as the carbon resonance of tetramethylsilane.",
  "  The spectrum of the cyclic hydrocarbon methylcyclohexane serves as a useful example of 13 C NMR spectroscopy. The chemical shifts of different carbon atoms are larger than for hydrogen atoms, and the five magnetically different 13 C atoms appear as five distinct peaks. Unlike proton spectra, however, the peak areas are not directly proportional to the number of absorbing nuclei. Thus, each of the peaks at 35.8 ppm and 26.8 ppm (generated by the two carbon atoms at the positions labeled 3 and 4, respectively, in the figure) are larger than each of the peaks at 23.1 ppm, 33.1 ppm, and 26.8 ppm (generated by the single carbon atoms at positions 1, 2, and 5, respectively) but not in an exact 2:1 ratio. The two atoms labeled at position 3 are magnetically equivalent (as are the two at position 4), because the molecule is symmetrical about a line drawn vertically through its centre.",
  "The 13 C spectrum for methylcyclohexane does not show any multiplets arising from spin-spin splitting for two different reasons. The first reason is that spin-spin coupling between two adjacent 13 C atoms is so weak that it does not show up on the spectrum. This is because nearly all the 13 C atoms in a molecule are bonded to more abundant 12 C atoms, which do not give rise to spin-spin splitting. The second reason is that the spin-spin splitting that does occur between 13 C atoms bonded to hydrogen atoms has been removed from the spectrum by an instrumental technique termed proton decoupling. Proton decoupling eliminates all the splitting patterns that would normally be observed in a 13 C spectrum for all carbon atoms bonded to one or more hydrogen atoms and is done routinely to simplify the spectrum.",
  "Analyzed alone or in combination, proton and 13 C NMR spectra allow correct structures to be assigned to many organic compounds, including most isomers.",
  " m z  Mass spectrometry differs from the types of spectroscopy previously discussed because the molecular information that the technique provides does not depend on absorption of electromagnetic radiation. In a mass spectrometer, molecules are converted to charged fragments called ions, which are then separated according to their masses. The chart that records the masses of the fragments together with a measure of their relative abundance is known as a mass spectrum. From the masses and abundance of the peaks in a mass spectrum, it is often possible to determine the exact mass of the molecule being analyzed and to obtain clues about molecular structure. Today chemists can use one of several different types of mass spectrometer. A brief description of electron-ionization mass spectrometry, widely used for the analysis of relatively small molecules, illustrates the general principles.",
  "In simple terms, a mass spectrometer (all components of which operate in a high vacuum) consists of an inlet chamber into which the compound to be analyzed is introduced and vaporized. The gaseous molecules then pass into an ionization chamber, where they are bombarded by a beam of high-energy electrons. The electron beam generates, among other things, a positively charged molecule known as a molecular ion, which results from the removal of one electron from the molecule. The molecular ion can subsequently break apart into smaller fragments. The positively charged fragments (which for simplicity are considered here to bear only a single positive charge) are then accelerated by an electric field and directed into a mass analyzer. The mass analyzer contains a strong magnetic field, through which the molecular ions must pass. As the ions pass through the magnetic field, they are deflected into a curved path that is dependent on both their charge and mass. Ions of different mass travel along a different trajectory before reaching a detector, which records the intensities and masses of the ions that strike it. The mass spectrum that is recorded shows the mass-to-charge ratio ( m / z ) along the horizontal axis and ion abundance along the vertical axis. For ions bearing a single positive charge, z equals 1, and the horizontal axis shows the masses of the fragments directly.",
  "The mass spectrum of the ketone 2-butanone serves as an example. The strongest peak in the spectrum is known as the base peak, and its intensity is arbitrarily set at a value of 100. The peak at m / z = 72 is the molecular ion and as such gives the molecular mass of the molecule. In high-resolution mass spectrometry, the mass of the molecular ion can be measured to an accuracy of 4 ppm. In such an instrument, the molecular ion of 2-butanone would appear at m / z = 72.0575, which would unambiguously establish its molecular formula as C 4 H 8 O. High-resolution mass spectrometry is an excellent method for determining the molecular formulas of organic compounds.",
  "Valuable information about molecular structure also can be obtained from the mass of the fragments present in the mass spectrum. Various functional groups cause molecules to break apart in characteristic ways. Ketones, for example, usually break apart at the bond in which the alkane chain is joined to the carbonyl group. Loss of the CH 3 group ( m / z = 15) from 2-butanone generates the fragment at m / z = 57. Loss of the heavier CH 3 CH 2 group ( m / z = 29) from 2-butanone generates the base peak at m / z = 43.",
  "The spectroscopic techniques discussed above are central to the modern study of chemistry; they allow chemists to determine the specific molecular architecture of many organic substances. For very complicated molecules, such as many natural products that occur in living organisms, even a complete set of spectra is insufficient to allow an unambiguous structural assignment. Molecular structure can then be determined only by a step-by-step synthesis of the molecule, followed by confirmation that the synthetic molecule is identical to the natural one.",
  "The electronic features of functional groups are responsible for the types of reactions that are characteristic of each group. Because there is a great deal of similarity in the electronic characteristics of the different functional groups, there is a corresponding similarity in the types of reaction that different groups undergo. Just as the properties of the multitude of organic compounds are made more comprehensible by considering the reactions of a specific functional group, so too can the plethora of organic reactions be made more understandable by categorization into common types of chemical reaction, such as substitution, elimination, addition, hydrolysis, condensation, and acid-base and oxidation-reduction reactions.",
  "The simple replacement of one atom or group of atoms in a molecule by a second atom or group of atoms is called a substitution reaction. An illustrative example is the conversion of benzyl bromide to benzyl alcohol, using a solution of sodium hydroxide in water.",
  "In this reaction the bromine atom of the benzyl bromide has been replaced by the hydroxyl group of the sodium hydroxide. The displaced bromine atom joins with the sodium ion to form the inorganic by-product sodium bromide, but the focus in organic reactions is always on the changes that occur to the organic molecules. Substitution reactions can also lead to the formation of cyclic compounds, as in the production of a cyclic ether from a di-functional compound containing both a halide atom and a hydroxyl group.",
  "The formation of new bonds in a molecule by the removal of atoms takes place in an elimination reaction. These reactions are often responsible for the formation of double bonds, as in the formation of an alkene from an alcohol by the action of concentrated sulfuric acid, and for the thermal elimination of hydrogen chloride to make chloroethene.",
  "The addition of one molecule to another to give a single new molecule constitutes an important class of reactions. Illustrative is the addition of chlorine to ethylene to give the dichloroethane used for the industrial production of vinyl chloride. Alcohols are commonly made by the addition of water to alkenes, as in the preparation of 2-propanol.",
  "The scission (or cleavage) of a molecule by reaction with water, with insertion of the elements of water into the final products, is called hydrolysis. An example is the acid-catalyzed hydrolysis of ethyl acetate.",
  "This reaction is typical of reversible reactions that do not go to completion. When one mole (the quantity with a weight in grams numerically equal to the molecular weight) of ethyl acetate and one mole of water react, only about one-third of the ethyl acetate is converted to acetic acid and ethyl alcohol. Since the products can also react by a reverse reaction to reform starting materials, the reaction is shown with two single-headed arrows, one pointing to products and the other to starting materials. Several effective methods can be employed to increase the yield of the desired reaction products.",
  "The formation of a single bond between two molecules, or two parts of the same molecule, accompanied by the elimination of water (or another small molecule such as an alcohol) is a condensation reaction. Many polymerization reactions are condensation reactions. For example, the polymer nylon-6,6 is produced by the repeated condensation of hexanedioic acid with hexamethylenediamine.",
  " ",
  "For much of organic chemistry, an acid may be defined as a compound that can transfer a proton (H + ) to a base, and a base may be defined as any entity with an unshared pair of electrons (and therefore capable of accepting a proton). In acid-base reactions a proton is transferred from an acid to a base.",
  "If the acid and base are neutral molecules, the product is a positive ion and a negative ion and is known as a salt. A specific example is the reaction of benzoic acid with sodium hydroxide to form sodium benzoate (and water, which always forms as a by-product when the base is hydroxide ion). Sodium benzoate is often added to breads and baked goods in very small amounts to preserve freshness.",
  "  A carbon atom (and therefore the molecule in which it occurs) becomes oxidized if it loses electron density during a reaction or becomes reduced if it gains electron density. A carbon atom loses electron density when it bonds to a more electronegative atom and gains electron density when it bonds to a less electronegative atom. The most common oxidation reactions occur when carbon atoms bond to oxygen (the process for which the reaction type is named) or when hydrogen atoms are removed from carbon. Conversely, the most common reduction reactions occur when hydrogen is added to a carbon atom or when oxygen is removed is from a carbon atom. Because an increase of electron density at one atom must always be accompanied by a decrease of electron density at a different atom, an oxidation reaction always occurs in tandem with a reduction reaction. The combustion of methane is a simple example. Another example is the oxidation of ethanol to acetic acid, which can be used by common breath-analyzer kits to measure the alcohol level in a person’s breath on the basis of the visible colour changes that occur as orange potassium dichromate is reduced to green chromium (III) sulfate. Humans, and all other aerobic organisms, require oxygen for the metabolic oxidation of foodstuffs. The fully oxidized product of such metabolic oxidation is carbon dioxide, which is exhaled via the lungs."
]