[
  " Charismatic , (foaled 1996), American racehorse ( Thoroughbred ) who in 1999 won the Kentucky Derby and the Preakness Stakes but lost at the Belmont Stakes , ending his bid for the coveted Triple Crown of American horse racing .",
  "Charismatic was initially seen as a $200,000 disappointment, which was how much Beverly and Bob Lewis of Los Angeles had paid for him. He raced 13 times as a two-year-old, mounting a seven-race losing streak. His trainer, D. Wayne Lukas , reportedly referred to him as excess baggage in his barn. In spite of those drawbacks, he improved slowly and finally came up with an impressive win in the 1999 Lexington Stakes in Kentucky. The win was sufficient to convince everyone concerned to enter him in the Kentucky Derby.",
  "Charismatic went off at 30–1 odds in the Derby and ran on the outside to stay clear of the pack. He made a late spurt in the homestretch for a dramatic win by a neck over Menifee. The Preakness was a close replica of the Derby. The difference was that Menifee chased Charismatic rather than the other way around, but the result was the same: a win by Charismatic (this time by one and a half lengths).",
  "Charismatic was the 2–1 favourite at the Belmont Stakes. With  1  4  mile to go in the race, Charismatic took the lead from Silverbulletday, the only filly running, and battled two long shots, the 29–1 Lemon Drop Kid and the 54–1 Vision and Verse. Jockey Chris Antley got little response from Charismatic and felt the colt drop and dip underneath him—a sign that the horse was in pain. Charismatic finished the race in third place; Lemon Drop Kid was the winner. Antley jumped off as soon as Charismatic stopped running and held the colt’s left front hoof in his hands to keep the weight off it until help arrived, a move some observers believe helped save the horse from later being euthanized. An ambulance was rushed out on the track to take the colt back to the barn, where X-rays showed that he had fractured two bones in his left front leg. The colt had surgery, recovered, and was soon bound for stud duty."
]