[
  "   pendulum ,  body suspended from a fixed point so that it can swing back and forth under the influence of gravity . Pendulums are used to regulate the movement of clocks because the interval of time for each complete oscillation, called the period, is constant. The formula for the period T of a pendulum is T = 2π    L    g    , where L is the length of the pendulum and g is the acceleration due to gravity.",
  "The Italian scientist Galileo first noted (c. 1583) the constancy of a pendulum’s period by comparing the movement of a swinging lamp in a Pisa cathedral with his pulse rate. The Dutch mathematician and scientist Christiaan Huygens invented a clock controlled by the motion of a pendulum in 1656. The priority of invention of the pendulum clock has been ascribed to Galileo by some authorities and to Huygens by others, but Huygens solved the essential problem of making the period of a pendulum truly constant by devising a pivot that caused the suspended body, or bob, to swing along the arc of a cycloid rather than that of a circle.",
  "A simple pendulum consists of a bob suspended at the end of a thread that is so light as to be considered massless. The period of such a device can be made longer by increasing its length, as measured from the point of suspension to the middle of the bob. A change in the mass of the bob, however, does not affect the period, provided the length is not thereby affected. The period, on the other hand, is influenced by the position of the pendulum in relation to Earth. Because the strength of Earth’s gravitational field is not uniform everywhere, a given pendulum swings faster, and thus has a shorter period, at low altitudes and at Earth’s poles than it does at high altitudes and at the Equator.",
  "There are various other kinds of pendulums. A compound pendulum has an extended mass, like a swinging bar, and is free to oscillate about a horizontal axis. A special reversible compound pendulum called Kater’s pendulum is designed to measure the value of g , the acceleration of gravity.",
  "Another type is the Schuler pendulum. When the Schuler pendulum is vertically suspended, it remains aligned to the local vertical even if the point from which it is suspended is accelerated parallel to Earth’s surface. This principle of the Schuler pendulum is applied in some inertial guidance systems to maintain a correct internal vertical reference, even during rapid acceleration.",
  "A spherical pendulum is one that is suspended from a pivot mounting, which enables it to swing in any of an infinite number of vertical planes through the point of suspension. In effect, the plane of the pendulum’s oscillation rotates freely. A simple version of the spherical pendulum, the Foucault pendulum , is used to show that Earth rotates on its axis. See also  ballistic pendulum ."
]