[
  "  Pentagon , large five-sided building in Arlington county, Virginia, near Washington, D.C. , that serves as the headquarters of the U.S. Department of Defense, including all three military services— Army , Navy , and Air Force .",
  "Constructed during 1941–43, the Pentagon was intended to consolidate the offices of the War Department, which had occupied 17 separate facilities throughout Washington. Although President Franklin D. Roosevelt initially favoured a building without windows to protect it from potential air raids, he was later convinced by building engineers that such a facility would be impractical. He eventually supported a five-sided design by George Edwin Bergstrom—though Gilmore Clarke, the chairman of the Commission of Fine Arts, whose office was charged with advising the president and Congress on federally funded artistic and public structures, criticized it as “one of the most serious and worst attacks on the plan of Washington.” The site selected was mostly a swampy wasteland whose only structure was the small, obsolete Washington Airport. In order to stabilize the area, some 5.5 million cubic yards (4.2 million cubic metres) of dirt were trucked in, and 41,492 concrete piles were set to support the building’s foundation. To protect the vista of neighbouring Arlington National Cemetery , the Pentagon’s height was strictly limited to 77 feet 3.5 inches (24 metres). With the country’s entry into World War II in December 1941, just three months after the start of construction in September, completion of the building became a national priority. More than 13,000 workers laboured day and night, and within just eight months of groundbreaking, Secretary of War Henry Stimson relocated his offices to the new facility.",
  "  At its completion at a cost of $83 million in January 1943, the Pentagon was the world’s largest office building, covering 29 acres (12 hectares)—including a 5-acre (2-hectare) central court—and containing roughly 3,700,000 square feet (344,000 square metres) of usable floor space for approximately 25,000 people. Plans to convert the building to a hospital or some other peacetime facility after the war were abandoned with the rapid onset of the Cold War , which required a high degree of military preparedness. The Pentagon remains one of the world’s largest office buildings.",
  "Constructed of steel and reinforced concrete with some limestone facing, the structure has five floors, excluding its mezzanine and basement. It consists of five concentric pentagons, or “rings,” with 10 spokelike corridors connecting the whole. There are 17.5 miles (28 km) of corridors, but, because of its innovative construction, it is possible to walk between any two points within the building in approximately seven minutes. Several libraries serve as research facilities for the military, and these repositories subscribe to more than 1,700 periodicals in a wide variety of languages. Two cafeterias, a dining room, and seven snack bars are also located on the premises. There are 67 acres (27 hectares) of parking lots, which can accommodate about 8,700 automobiles. Bus and taxi terminals are located beneath a huge concourse containing a shopping centre for Pentagon employees. The Washington Metro subway also serves the facility, and a heliport was added in 1956.",
  "  In 2001, on the 60th anniversary of the Pentagon’s groundbreaking, five terrorists hijacked a commercial airliner and piloted it into the building during the September 11 attacks . Part of the southwest side of the building was destroyed, and 189 people, including the terrorists, were killed. The damage was largely repaired within a year.",
  "Discussion of the Pentagon can be found in Philip Bigler , Washington in Focus: The Photo History of the Nation’s Capital (1988); Jeanne Fogle , Two Hundred Years: Stories of the Nation’s Capital (1991); and Donald R. Kennon and Richard Striner , Washington Past and Present: A Guide to the Nation’s Capital , 2nd ed. (1983, reissued 1993). Steve Vogel , The Pentagon: A History (2007), focuses on the planning and construction of the building."
]