[
  " perspective , method of graphically depicting three-dimensional objects and spatial relationships on a two-dimensional plane or on a plane that is shallower than the original (for example, in flat relief).",
  " bce Perceptual methods of representing space and volume, which render them as seen at a particular time and from a fixed position and are characteristic of Chinese and most Western painting since the Renaissance, are in contrast to conceptual methods. Pictures drawn by young children and primitives (untrained artists), many paintings of cultures such as ancient Egypt and Crete, India, Islam, and pre-Renaissance Europe, as well as the paintings of many modern artists, depict objects and surroundings independently of one another—as they are known to be, rather than as they are seen to be—and from the directions that best present their most characteristic features. Many Egyptian and Cretan paintings and drawings, for example, show the head and legs of a figure in profile, while the eye and torso are shown frontally ( see  photograph ). This system produces not the illusion of depth but the sense that objects and their surroundings have been compressed within a shallow space behind the picture plane.",
  "In Western art, illusions of perceptual volume and space are generally created by use of the linear perspectival system, based on the observations that objects appear to the eye to shrink and parallel lines and planes to converge to infinitely distant vanishing points as they recede in space from the viewer. Parallel lines in spatial recession will appear to converge on a single vanishing point, called one-point perspective. Perceptual space and volume may be simulated on the picture plane by variations on this basic principle, differing according to the number and location of the vanishing points. Instead of one-point (or central) perspective, the artist may use, for instance, angular (or oblique) perspective, which employs two vanishing points.",
  "Another kind of system—parallel perspective combined with a viewpoint from above—is traditional in Chinese painting. When buildings rather than natural contours are painted and it is necessary to show the parallel horizontal lines of the construction, parallel lines are drawn parallel instead of converging, as in linear perspective. Often foliage is used to crop these lines before they extend far enough to cause a building to appear warped.",
  " Adoration of the Magi Adoration of the Magi  The early European artist used a perspective that was an individual interpretation of what he saw rather than a fixed mechanical method. At the beginning of the Italian Renaissance , early in the 15th century, the mathematical laws of perspective were discovered by the architect Filippo Brunelleschi , who worked out some of the basic principles, including the concept of the vanishing point, which had been known to the Greeks and Romans but had been lost. These principles were applied in painting by Masaccio (as in his Trinity fresco in Santa Maria Novella, Florence; c. 1427), who within a short period brought about an entirely new approach in painting. A style was soon developed using configurations of architectural exteriors and interiors as the background for religious paintings, which thereby acquired the illusion of great spatial depth. In his seminal Della pittura (1436; On Painting ), Leon Battista Alberti codified, especially for painters, much of the practical work on the subject that had been carried out by earlier artists; he formulated, for example, the idea that “vision makes a triangle, and from this it is clear that a very distant quantity seems no larger than a point.”",
  "Linear perspective dominated Western painting until the end of the 19th century, when Paul Cézanne flattened the conventional Renaissance picture space. The Cubists and other 20th-century painters abandoned the depiction of three-dimensional space altogether and hence had no need for linear perspective.",
  "Linear perspective plays an important part in presentations of ideas for works by architects, engineers, landscape architects, and industrial designers, furnishing an opportunity to view the finished product before it is begun. Differing in principle from linear perspective and used by both Chinese and European painters, aerial perspective is a method of creating the illusion of depth by a modulation of colour and tone."
]