[
  " human resources management , the management of the people in working organizations. It is also frequently called personnel management, industrial relations, employee relations, manpower management, and personnel administration. It represents a major subcategory of general management, focusing exclusively on the management of human resources, as distinguished from financial or material resources. The term may be used to refer to selected specific functions or activities assigned to specialized personnel officers or departments. It is also used to identify the entire scope of management policies and programs in the recruitment, allocation, leadership, and direction of employees.",
  "Human resources management begins with the definition of the required quantities of people possessing particular skills to carry out specific tasks. Thereafter, job candidates must be found, recruited, and selected. After hiring, the employees must be trained or retrained, negotiated with, counseled, evaluated, directed, rewarded, transferred, promoted, and finally released or retired. In many of these relations, managers deal directly with their associates. In some companies, however, employees are represented by unions, meaning that managers bargain with representative associations. Such collective-bargaining relationships are generally described as labour relations.",
  "Current practice shows wide variation in the range of responsibilities assigned to human resource or industrial-relations departments. Personnel responsibilities typically include: (1) organizing—devising and revising organizational structures of authority and functional responsibility and facilitating two-way, reciprocal, vertical, and horizontal communication; (2) planning—forecasting personnel requirements in terms of numbers and special qualifications, scheduling inputs, and anticipating the need for appropriate managerial policies and programs; (3) staffing, or manning—analyzing jobs, developing job descriptions and specifications, appraising and maintaining an inventory of available capabilities, recruiting, selecting, placing, transferring, demoting, promoting, and thus assuring qualified manpower when and where it is needed; (4) training and development—assisting team members in their continuing personal growth, from pre-employment, preparatory job training to executive development programs; (5) collective bargaining—negotiating agreements and following through in day-to-day administration; (6) rewarding—providing financial and nonfinancial incentives for individual commitment and contribution; (7) general administration—developing appropriate styles and patterns of leadership throughout the organization; (8) auditing, reviewing, and researching—evaluating current performance and procedures in order to facilitate control and improve future practice.",
  "Examples of specific tasks include monitoring grievance settlements, maintaining safety and accident control programs, administering employee benefits and services, forecasting future personnel requirements, recommending changes in organizational structures, supervising formal in-house communication, conducting employee attitude and morale surveys, and overseeing compliance with legal requirements for the employment relationship.",
  "Individual human resource or personnel departments may be assigned varying degrees of responsibility in a few, many, or all of these areas. In areas assigned to them, personnel departments exercise various levels of authority. Some officers and departments create policies and make major decisions and determinations, while others make less significant contributions. The person in charge of human resources may be a member of a company’s executive committee; if so, he or she may be expected to lead and assume responsibility for all manpower management policy and programs. Other personnel departments are essentially “staff,” or advisory; their activities are restricted to recommending, consulting, and providing such specified technical and professional services as are requested by operating managers."
]