[
  " phase , in mechanics of vibrations, the fraction of a period (i.e., the time required to complete a full cycle) that a point completes after last passing through the reference, or zero, position. For example, the reference position for the hands of a clock is at the numeral 12, and the minute hand has a period of one hour. At a quarter past the hour the minute hand has a phase of one-quarter period, having passed through a phase angle of 90°, or π /2 radians. In this example the motion of the minute hand is a uniform circular motion, but the concept of phase also applies to simple harmonic motion such as that experienced by waves and vibrating bodies.",
  "If the position y of a point or particle changes according to a simple harmonic law, then it will change in time t according to the product of the amplitude, or maximum displacement, r, of the particle and a sine or cosine function composed of its angular speed, symbolized by the Greek letter omega ( ω ), the time t, and what is called the angle, symbolized by the Greek letter epsilon ( ε ): y = r sin ( ωt + ε ). The angle ( ωt + ε ) is called the phase angle at time t, which at zero time is equal to ε . Phase itself is a fractional value—the ratio of elapsed time t to the period T, or t / T —and is equal to the ratio of the phase angle to the angle of the complete cycle, 360°, or 2 π radians. Thus, phase for uniform circular or harmonic motion has the value ( ωt + ε )/2 π . Applying this expression to the example of the moving minute hand cited above, ε is zero (zero phase angle at zero time), angular speed is 2 π radians per hour, and time t is  1  4  hour, giving a phase of  1  4  .",
  "When comparing the phases of two or more periodic motions, such as waves, the motions are said to be in phase when corresponding points reach maximum or minimum displacements simultaneously. If the crests of two waves pass the same point or line at the same time, then they are in phase for that position; however, if the crest of one and the trough of the other pass at the same time, the phase angles differ by 180°, or π radians, and the waves are said to be out of phase (by 180° in this case).",
  " The measurement of phase difference is of central importance in alternating-current technology. In the diagram , two curves represent the voltage ( E ) and the current ( I ) in an alternating-current (AC) circuit with pure inductance. The difference in phase angle between the voltage and the current is 90°, and the current is said to lag one-quarter cycle in phase. This lag may be seen from the diagram. In AC power transmission the terms multiphase and polyphase are applied to currents that are out of phase with one another. In a two-phase system there are two currents with a phase-angle difference of 90°; in a three-phase system the currents differ in phase angle by 120°."
]