[
  " pi , in mathematics , the ratio of the circumference of a circle to its diameter. The symbol π was devised by British mathematician William Jones in 1706 to represent the ratio and was later popularized by Swiss mathematician Leonhard Euler . Because pi is irrational (not equal to the ratio of any two whole numbers), its digits do not repeat, and an approximation such as 3.14 or 22/7 is often used for everyday calculations. To 39 decimal places, pi is 3.141592653589793238462643383279502884197.",
  "The Babylonians (c. 2000 bce ) used 3.125 to approximate pi, a value they obtained by calculating the perimeter of a hexagon inscribed within a circle and assuming that the ratio of the hexagon’s perimeter to the circle’s circumference was 24/25. The Rhind papyrus (c. 1650 bce ) indicates that ancient Egyptians used a value of 256/81 or about 3.16045. Archimedes (c. 250 bce ) took a major step forward by devising a method to obtain pi to any desired accuracy, given enough patience. By inscribing and circumscribing regular polygons about a circle to obtain upper and lower bounds, he obtained 223/71 < π < 22/7, or an average value of about 3.1418. Archimedes also proved that the ratio of the area of a circle to the square of its radius is the same constant.",
  "Over the ensuing centuries, Chinese, Indian, and Arab mathematicians extended the number of decimal places known through tedious calculations, rather than improvements on Archimedes’ method. By the end of the 17th century, however, new methods of mathematical analysis in Europe provided improved ways of calculating pi involving infinite series . For example, Isaac Newton used his binomial theorem to calculate 16 decimal places quickly. Early in the 20th century the Indian mathematician Srinivasa Ramanujan developed exceptionally efficient ways of calculating pi that were later incorporated into computer algorithms. In the early 21st century computers calculated pi to 62,831,853,071,796 decimal places, as well as its two-quadrillionth digit when expressed in binary (0).",
  "Pi occurs in various mathematical problems involving the lengths of arcs or other curves, the areas of ellipses , sectors, and other curved surfaces, and the volumes of many solids. It is also used in various formulas of physics and engineering to describe such periodic phenomena as the motion of pendulums , the vibration of strings, and alternating electric currents ."
]