[
  " Pinus pinea  pine , (genus Pinus ), genus of about 115 species of evergreen  conifers of the pine family ( Pinaceae ), distributed throughout the world but native primarily to northern temperate regions. Pines and other conifers are key members of the taiga (boreal forests), coniferous forests , and mixed forests throughout the world, and many pine species are iconic or characteristic constituents of a number of specific ecosystems , such as the longleaf pine ( Pinus palustris ) ecosystem of the southern United States. Like all trees, the plants provide habitat and a variety of other ecosystem services , and pine seeds are an important food source for birds , squirrels , and other animals. The chief economic value of pines is in the construction and paper -products industries, but they are also sources of turpentine , rosin , oils , and wood tars . Edible pine seeds, which are sold commercially as pine nuts, pignoli, piñons, or pinyons, are produced by several species. Many pines are cultivated as ornamentals, including black, white, Himalayan, and stone pines, and some are planted in reforestation projects or for windbreaks. Pine-leaf oil, used medicinally, is a distillation product of the leaves; charcoal, lampblack, and fuel gases are distillation by-products.",
  "Pines are softwoods, but commercially they may be designated as soft pines or hard pines. Soft pines, such as white, sugar, and piñon pines, have relatively soft timber, needles in bundles of five (less commonly, one to four), stalked cones with scales lacking prickles, and little resin . Their wood is close-grained, with thin, nearly white sapwood ; the sheaths of the leaf clusters are deciduous, and the leaves contain a single fibrovascular bundle. Hard pines, such as Scotch, Corsican, and loblolly pines, have relatively hard timber, needles in bundles of two or three (rarely, five to eight), cone scales with prickles, and large amounts of resin. Their wood is coarse-grained and usually dark-coloured, with pale, often thick sapwood; the sheaths of the leaf clusters are persistent, and the leaves have two fibrovascular bundles.",
  "Young pine trees are usually conical, with whorls of horizontal branches. Older trees may have round, flat, or spreading crowns. Most species have thick rough furrowed bark . Pines have two types of branches, long shoots and short shoots, and three types of leaves , primordial, scale, and adult. Seedling plants bear the lance-shaped spirally arranged primordial leaves. The triangular scale leaves, also lance-shaped, are borne on the long shoots of older trees. Both long and short shoots develop in the axils of the deciduous scale leaves. The needlelike photosynthetic adult leaves, with two or more resin canals, are borne in fascicles (bundles) of two to five (rarely, up to eight or solitary) at the tip of each short shoot; they remain on the tree 2 to 17 years.",
  " Pinus lambertiana     Pollen -bearing male cones are covered with many fertile scales, each of which bears two pollen sacs. Ovule-bearing female cones, borne on the same tree, have several spirally arranged bracts (modified leaves), each of which is located below a scale with two ovules (potential seeds). In spring or early summer the pollen sacs release pollen through longitudinal slits; each grain has two air bladders for wind dispersal. The scales on the female cones open to receive the pollen and then close; actual fertilization takes place late the following spring. After fertilization, the woody female cone develops over a two- to three-year period. In some species the cones open at maturity and the seeds are released, while in others the cones remain closed for several years until opened by rotting, by food-seeking animals, or by fire . In some pines the scale bearing the nutlike seed may be expanded to form a wing for airborne dispersal.",
  " Arceuthobium minutissimum  Pines are susceptible to several fungal diseases, among them white-pine blister rust , and are attacked by many insects, such as sawflies , weevils , bark beetles , and pine tip moths. Some pines are also susceptible to nematode infections and infestations by parasitic dwarf mistletoes (genus Arceuthobium ). Pine forests often suffer severe fire damage, being very combustible because of their high resin content. Pines can tolerate drought but require full sunlight and clean air for good growth and reproduction.",
  "Many botanists consider the genus Pinus to contain two subgenera: Haploxylon , or soft pines, which have one fibrovascular bundle, and Diploxylon , or hard pines, which have two.",
  "Many pines have both lumber trade names and several common names. Numerous trees commonly called pines are not true pines but belong to other genera in the family Pinaceae or to other families of conifers.",
  " Pinus sylvestris  The Scotch pine ( P. sylvestris ) of northern Europe, when grown under optimum conditions, attains a height of 20 to 40 metres (70 to 130 feet). It is conical in youth, acquires a mushroom-shaped crown in maturity, and has a straight trunk as much as one metre (about three feet) in diameter, fiery red-brown bark, and gnarled, twisted boughs densely clothed with blue-green foliage at the extremities. Scotch pine occurs in varying abundance from Finland and Sweden to the mountains of Spain and the higher slopes of Mount Etna and, longitudinally, from the shores of the North Sea to Siberia. Abundant in the Scandinavian Peninsula, it is the “fir” ( fur, fura ) of the old Norsemen and still retains that name in Great Britain, although it is a true pine. Economically, it is valued for timber and also for turpentine and tar.",
  "Closely allied to the Scotch pine is the mugo pine ( P. mugo ), a recumbent bush or small tree, generally only a metre or two (3 to 6.5 feet) high, which often has long zigzag stems that root occasionally at the kneelike bends where they rest upon the ground. It abounds in the Bavarian and Tirolese Alps.",
  "The Austrian, or black, pine ( P. nigra ) grows to a height of 30 or even 45 metres (98 to 148 feet), with a straight trunk and branches in regular whorls, forming in a large tree a pyramidal head. It derives its name from the sombre aspect of its dark green, sharp, rigid, rather long leaves. The tree displays a deeply fissured bark and light brown branches. This species, widely cultivated as an ornamental, is native to Europe and western Asia.",
  "The cluster pine, or pinaster ( P. pinaster ), a vigorous grower in coastal sand, has been cultivated extensively for the purpose of stabilizing sand drifts, especially on the dunes of the Bay of Biscay and the Mediterranean. It grows to a height of 12 to 24 metres (39 to 79 feet), and the deeply furrowed trunk occasionally reaches a diameter of a metre or more at the base. Forests of pinaster, apart from the production of timber, have great economic value as a source of turpentine.",
  "Italian stone pines (or umbrella pines, P. pinea ) are native to the Mediterranean region and have naturalized in many places. Their spreading rounded canopies of light green foliage, supported on a tall and often branchless trunk, form a particularly striking feature of the landscape of Italy. The cones have been prized from the days of ancient Rome for their edible seeds (pignoli), which are still used for food.",
  "The Himalayan white pine (or blue pine, P. wallichiana ) differs chiefly from the Italian stone pine in its longer cones and drooping glaucous foliage. It grows in parts of India, in Bhutan, and on some of Nepal’s ranges, where it attains large dimensions.",
  "The Eurasian stone pine ( P. cembra ) abounds on the Alps, the Carpathians, and the Siberian mountain ranges. The oily seeds are eaten by the inhabitants of the Alps and Siberia and yield a fine oil used for food. The wood is remarkably even-grained and is used by Swiss wood-carvers.",
  "The eastern white pine ( P. strobus ) is one of the most valuable of North American timber trees because of its large size and the soft even grain of its white wood. It once formed extensive forests from Newfoundland to Manitoba, from Minnesota to Maine, and southward to the mountains to Georgia, but it was cut intensively for so long that by the second half of the 20th century very few old trees remained. On deep rich soil, eastern white pine can attain a height of 60 metres (197 feet) and a trunk diameter of 1 to 1.5 metres (3.3 to 5 feet). The western white pine ( P. monticola ) grows in the mountains of the northwestern United States and British Columbia, has light brown wood, and is extensively cut for lumber.",
  " The sugar pine ( P. lambertiana ) of California is the largest known pine, often 60 to 70 metres (197 to 230 feet) tall, with a trunk diameter of 2 or even 3.5 metres (6.5 to 11.5 feet). Its crown is pyramidal with horizontal or slightly drooping branches. Its cones are the longest of any pine species, reaching up to 61 cm (24 inches) in length.",
  "North American stone pines are typically timberline species and are more important as protectors of valuable watersheds than for the timber they produce. The whitebark pine ( P. albicaulis ) extends along mountain slopes from British Columbia to California and eastward to Montana and Wyoming. The Mexican white pine ( P. strobiformis ) attains its northern limits in the southwestern United States.",
  " Pinus edulis  The single-leaf piñon ( P. monophylla ) occurs sporadically through northern Mexico and the southwestern United States. The Parry piñon ( P. quadrifolia ) is the four-needle piñon of southern California and northern Baja California. Nut pine, or pinyon pine ( P. edulis ), is the most widely distributed tree of this nut group. The seeds of the group are large and tasty and are sold in markets as pine nuts.",
  "Longleaf pine ( P. palustris ) is the most-notable yellow pine of the southern United States; it abounds on sandy soils from the Carolinas and Florida westward to Louisiana and Texas. The most-marked features of the tree are its long tufted foliage and its tall columnar trunk, sometimes 35 metres (115 feet) high, which furnishes one of the most-valued pine timbers. Loblolly pine ( P. taeda ), shortleaf pine ( P. echinata ), and slash pine ( P. elliottii ) are other important timber trees in the southern United States. The Caribbean pine ( P. caribaea ) extends over several islands in the Caribbean and into Central America.",
  "Ponderosa, western yellow, or bull pine ( P. ponderosa ), which grows 45 to 60 metres (148 to 197 feet) high, with a trunk 1.5 to 2.5 metres (5 to 8 feet) in diameter, is noted for its soft, easily worked wood. It is the most widely distributed American pine, found in the mountain forests of western North America from British Columbia to South Dakota and south to Texas and Mexico.",
  " Pinus radiata  The beautiful Monterey pine ( P. radiata ), distinguished by the brilliant colour of its foliage, is found sparingly along the California coast and is one of the most widely grown timber pines in the world. The Torrey pine ( P. torreyana ) is found only in a narrow strip along the coast near San Diego, California, and on Santa Rosa Island and is the least widely distributed of all known pines.",
  "The pitch pine ( P. rigida ), found from the coast of Massachusetts southwestward throughout the Appalachian region, is a tree 12 to 15 metres (39 to 49 feet) in height with a rugged trunk, occasionally 1 metre (3.3 feet) in diameter. The tree is one of the few pines that will flourish in salt marshes .",
  " Pinus aristata  The bristlecone pines ( P. aristata and P. longaeva ) are restricted to relatively high mountaintops in the southern Rocky Mountains and adjacent ranges of the southwestern United States. The Great Basin bristlecone pine ( P. longaeva ) is notable for being extremely long-lived, a specimen from Nevada thought to be about 5,000 years old. Frequently, these trees are damaged by severe climate, becoming contorted and gnarled, with most of the tree dead."
]