[
  " military necessity , the claim that, because of extreme circumstances, security concerns override competing considerations. A proposed course of action therefore ought to be pursued despite the considerable costs exacted by its execution.",
  "Though the term military necessity can be used to describe any instance in which political, social, or economic calculations are superseded by reasons of war, it is most commonly employed in situations in which security considerations are said to trump ethical restraints on the conduct of war. The claim of military necessity is usually invoked when an actor defies the principles of just-war theory, such as a state claiming that extreme military circumstances have forced it to abandon the principles of discrimination or minimum force.",
  "Any declaration of military necessity entails two separate and equally problematic claims. First, it assumes that the proposed military course of action is inevitable, such that a failure to take the action would lead to certain defeat. Second, it assumes that the goal pursued is indispensable, such that failure to achieve the goal would have disastrous implications. In other words, an actor claiming military necessity is suggesting both that success is necessary and that the proposed course of action is the only way to achieve that success. The resort to military necessity thus exaggerates the foresight available to decision makers and circumvents debates concerning the moral and political necessity of the goal pursued. Such use obscures the availability of alternatives and the calculations of costs, benefits, and risks that ought to characterize decision making in war.",
  "The concept of military necessity has been criticized by just-war theorists, who consider that ethical considerations must intervene in debates about warfare. This response is characterized by two extreme positions. On the one hand, absolutists reject the concept of military necessity as a farce, concocted by elites or military organizations to justify whatever is necessary to win a war, reduce the risks of losing, or even reduce the costs of war. Absolutists argue that moral considerations always trump cost-benefit calculations, no matter how extreme the circumstances. On the other hand, utilitarians conceive of military necessity as entirely compatible with the laws of war. Though the concept does define the limits of those laws, it has also acted as a restraint in war by limiting transgressions to those acts that are truly indispensable for securing the ends of war.",
  "Between these two extremes are those who want to strike a balance between the requirements of humanity and those of military necessity. They require that transgressions of the rules of war be preceded by calculations that take into account the reasonable risks that military actors can be expected to assume, the value of victory, the costs of defeat, and the extent to which moral precepts are placed in jeopardy. These moderate critics do leave room for justifications of military necessity in cases of extreme emergency, such as threats to the survival of a community as opposed to mere defeat or even occupation."
]