[
  " transparency , capacity of outsiders to obtain valid and timely information about the activities of government or private organizations.",
  "While related to political concepts such as accountability, openness, and responsiveness, the concept of transparency originated in the financial world, referring to a corporation’s duty to provide accounts of its activities to shareholders, oversight bodies, and the public.",
  "In the United States the 1966 Freedom of Information Act—which provides limited guarantees of citizen access to government information—was a transparency milestone. It has been emulated, and in many cases exceeded in scope, by legislation in other countries. Democratic and market reform, and a growing anticorruption movement, did the most to make transparency a key governance concept. Transparent political processes are seen as more accountable and democratic , while transparency in the economy facilitates free-market processes. In both spheres, rights of access to information and the parallel obligations of institutions to uphold those rights are proposed as safeguards against abuses and as good governance activities in their own right.",
  "Thus, transparency is widely seen as integral to a variety of political goals, including corruption control, fair financing of election campaigns, enhancing democracy in existing institutions such as the European Union , consolidating democracy in transitional societies, and limiting international conflict. Transparency in business is advocated as a safeguard against corporate fraud, infiltration by organized crime or political interests, and financial crises.",
  "In practice, however, transparency can be problematic. Where civil society is weak or where citizens and the press are intimidated, opportunities to obtain information will go unused and may be risky. Information on technical issues may be difficult to understand. Officials may release disinformation, create expensive and complex transparency procedures, or disseminate material in obfuscatory forms. Institutions and procedures for implementing transparency and genuine commitment to the principle itself need continuing attention.",
  "Equally problematic are the limits of transparency: Few would require a government to reveal strategic decisions in wartime or a business to give legitimate trade secrets to all comers. Yet determining these exceptions and their proposed usage is itself complicated. Officials need a sphere of autonomy within which they can freely debate options and from which they can implement policies authoritatively. Excessive transparency may undermine autonomy, drive decision making into undocumented back channels, and create more corruption. Transparency in private dealings may expose citizens to official or personal reprisals. Strong governments can enforce business transparency, but other states are weak, and international businesses can be so decentralized that no country’s transparency policy will be effective. Sovereign governments may break their own laws with impunity, and international organizations may be so remote that civil society has little influence upon them.",
  "Finally, transparency can have unintended consequences. Disclosing political contributions may expose donors to pressure from incumbent officials, thus discouraging donations to challengers. Laws mandating open meetings and requests for documentary evidence are useful to public officials who seek to intervene in other agencies’ doings. Transparency could check international conflict by clarifying actions and intentions, or it could produce disinformation and “noise” that increase risks. At best, transparency is subject to limitations applying to all public policies. At worst, it places the burden of checking authority upon those most vulnerable to abuses."
]