[
  " c. ce  Amarāvatī sculpture , Indian sculpture that flourished in the Andhra region of southeastern India from about the 2nd century bc to the end of the 3rd century ad , during the rule of the Sātavāhana dynasty. It is known for its superb reliefs, which are among the world’s finest examples of narrative sculpture.",
  "In addition to the ruins of the great stupa, or relic mound, at Amarāvati, the style is also seen in the stupa remains at Jaggayyapeta, Nāgārjunīkoṇḍa, and Goli, in Andhra Pradesh state, and as far west as Ter, Mahārāshtra state. The style also spread to Ceylon (now Sri Lanka), as seen at Anurādhapura, and to much of Southeast Asia.",
  "The Amarāvatī stupa was begun about 200 bc and underwent several renovations and additions. One of the largest stupas built in Buddhist India, it was about 160 feet (50 m) in diameter and 90 to 100 feet (about 30 m) high, but it has been largely destroyed, much of the stone having been used by local contractors during the 19th century to make lime mortar. Many of the surviving narrative reliefs and decorative plaques are in the Government Museum, Madras, and the British Museum. A depiction of the monument on a railing slab gives an indication of the appearance of the stupa at the end of the 2nd century ad . The slab shows a low drum with a hemispherical dome, the railings and drum covered with carvings, and the whole surrounded by an elaborate and richly carved railing. The four cardinal points are marked by groups of five pillars, while free-standing columns topped by lions are set up at the four entrances, replacing the toraṇ  a (ceremonial gateway) of earlier stupas.",
  "The reliefs, carved on the greenish white limestone characteristic of the region, mostly depict events of the Buddha’s life and his previous births ( Jātaka stories). The crowded yet unified compositions of the later period are filled with dynamic movement, a keen awareness of the dramatic, and a delight in the sensuous world. Overlapping figures and the use of diagonals suggest depth. There is an abundance of rounded forms and a richness so overwhelming that the frame is barely able to contain the sculpture. The four centuries over which the style developed were also a period of change from aniconic to iconic representation of the Buddha, and at Amarāvatī both methods of depiction appear together on one slab—the iconic being represented by images of the seated and standing Buddha, and the aniconic by an empty throne symbolizing his presence."
]