[
  " body politic , in Western political thought, an ancient metaphor by which a state, society, or church and its institutions are conceived of as a biological (usually human) body. As it is usually applied, the metaphor implies hierarchical leadership and a division of labour , and it carries a strong autocratic or monarchial connotation.",
  "The first recorded instance of the body politic metaphor appears in the Rigveda ( c. 1500 bce ), the oldest of the sacred books of Hinduism . There the South Asian caste system is explained by comparing the priesthood to the mouth, soldiers to the arms, shepherds to the thighs, and peasants to the feet of humankind.",
  "A well-known ancient example of a bodily metaphor appears in “The Belly and the Members,” a fable attributed to the legendary Greek fabulist Aesop . In the fable, the other members of the body revolt against the belly, which they think is doing none of the work while getting all of the food. The hands, mouth, teeth, and legs initiate a strike, but after a few days they realize that they are weak and ailing. They thus learn that cooperation between all members of the body, including the invisible belly, is vital for the body’s health. The story’s not-so-subtle moral is that society, like a body, functions better when all do their assigned tasks and work together. The social metaphor translated easily into the political world.",
  "In the 4th century bce , Plato articulated and refined the political usage of the metaphor in his Republic and Laws . His metaphoric conception of the state emphasized fitness and well-being over illness, the latter condition occurring when the different parts of the state fail to perform the functions proper to them.",
  "The Greeks’ fondness for the organic welfare of their state continued in the voice of their poets. Aristophanes , especially in Wasps (422 bce ), claimed that poets needed to cure the diseases of the state. Shortly after, Demosthenes ’ orations encouraging the Athenians to fight against Philip of Macedon —particularly, his “Third Philippic”—compared Philip to the attack of a fever or an illness.",
  "The Greeks influenced Rome, and in the 1st century bce  Livy was as familiar with the analogy as was his predecessor Cicero . Livy’s History of Rome cited Aesop’s fable of the other body parts revolting against the belly in his recounting of the secession of the plebeians (commoners). During the early Roman Republic , according to Livy, the plebeians seceded from the city of Rome, isolating themselves on the Sacred Mount or the Aventine. Menenius Agrippa was sent to end the crisis, and he used his version of the fable to convince the plebeians to return to the state. In Livy’s words, the Roman Senate (the belly) agreed that it received food from the plebeians (the body), but it did not go to waste. The Senate digested it and sent it back through the blood and veins of the republic. Hence, cooperation between all gave vitality to the republican body. The fable lived on in Plutarch , in the poetry of Marie de France , and in William Shakespeare ’s Coriolianus .",
  "With the Christianization of the Roman Empire from the early 4th century ce , the metaphor of the body politic was transformed, though its meaning changed little and continued to imply subordination. In the 1st century ce  St. Paul used the metaphor amply, molding Christ and the church into a single body and further depicting the church as the bride of Christ in I Corinthians 12:12–27, which clearly demonstrates the influence of ancient authors:",
  "For just as the body is one and has many members, and all the members of the body, though many, are one body, so it is with Christ.…If the foot were to say, “Because I am not a hand, I do not belong to the body,” that would not make it any less a part of the body. And if the ear were to say, “Because I am not an eye, I do not belong to the body,” that would not make it any less a part of the body.…The eye cannot say to the hand, “I have no need of you,” nor again the head to the feet, “I have no need of you.”…That there may be no dissension within the body, but the members may have the same care for one another.…Now you are the body of Christ and individually members of it.",
  " Colossians 1:18 adds that Christ “is the head of the body, the church.” And Ephesians 5:23–30 continues the metaphor:",
  "For the husband is the head of the wife just as Christ is the head of the church…because we are members of his body.",
  "Early theologians continued the use of bodily metaphors. Their notion of the body politic was a mystical Christian body united in the sharing of Christ, the Eucharist or transubstantiation (the substantial change of the bread and the wine of the mass into the body and blood of Christ). The metaphor took on a theocratic connotation, implying divine leadership. For example, Chapter 12 of Book IV of St. Augustine ’s City of God is titled, “Concerning the Opinion of Those Who Have Thought That God is the Soul of the World, and the World is the Body of God.”",
  "In the Middle Ages the model used in the clerical world spread to secular politics. At first the church presented itself as a mystical body politic whose original head was the pope ; kings and princes were its members. But eventually lay authorities vied for leadership, and theorists argued for a divinely inspired monarchy (head) until, to a large extent, the 18th-century revolutions dismembered the medieval Christian body.",
  "The church was first conceptualized as a body, often that of a bride, and Christ was either the body’s head or the bride’s groom. Later, kings and popes associated themselves with the Christian body, integrating its ambivalent dual nature. Like Christ, kings and popes lived and died, but the institutions of monarchy and papacy continued. The German medieval historian Ernst Kantorowicz was the first to highlight the double nature of the monarchy in The King’s Two Bodies: A Study in Mediaeval Political Theology (1957). He suggested a dual construction consisting of the king’s body, which dies because of its physical or biological nature, and the monarchial institution, which endures and indeed is everlasting. The construction was expressed in the traditional rallying cry that followed the death of a king: “The king is dead, long live the king!”",
  "Reflecting on Kantorowicz’s analysis, the Italian historian Agostino Paravicini Bagliani, in The Pope’s Body (2000), considered how the church formulated its own institutional continuity based again on the bodily metaphor. The pope died a human death, but the ecclesiastical institution, like Christ, continued. For Paravicini Bagliani, the ecclesiastical rituals that surrounded the death of a pope cemented the inherent internal contradiction between the pope’s physical transience and the church’s institutional continuity and survival.",
  "Perhaps the most-sweeping medieval elaboration of the concept was left to John of Salisbury and his Policraticus , an essential work of medieval political theory. Like his ancient Greek model, John’s political society mirrored a healthy human body. It discussed the body of a republic (a complete anachronism in the 12th century) that was ultimately dominated by its Christian soul , symbolized in the spiritual leadership of the priesthood. For John, the head of the republic was a leader who was subject to the rule of God, as, in a body, the head is subjected to the rule of its soul. He then proceeded down the physical body, attributing the heart to the Senate; the ears, eyes, and mouth to judges and provincial governors; the hands to officials and soldiers; the stomach and intestines to treasurers and record keepers; and the feet to the peasantry.",
  "In the 13th century the Florentine scholar Brunetto Latini ’s Li livres dou tresor (1262–66; Book of Treasure ) continued the political usage of the metaphor, as did the theological writings of St. Thomas Aquinas . Influenced by Policraticus , Aquinas discussed the necessity of deference to the leadership of a king, arguing that such a form of governance was as natural as the existence of a soul in a body. Similarly, John of Paris ’s De potestate regia et papali ( c. 1302; “On Royal and Papal Powers”), defending the subordination of the pope to a king, used the metaphor to argue for the commonsensical leadership of a single common force. The argument of single leadership is repeated in Marsilius of Padua ’s Defensor pacis (1324; “Defender of the Peace”).",
  "The medieval tendency to fuse church and state was bound to create the need to identify a unitary leadership, a requirement that was accommodated in the bodily metaphor. In his On the Duty of the King , the Christian reformer John Wycliffe continued the defense of a divinely inspired kingship, arguing from the bodily metaphor. In his case, leadership moved organically. The king was the kingdom’s head or heart. The medieval apogee of the metaphor was attained in Livre du corps de policie ( c. 1407; The Book of the Body Politic ), by the French poet and author Christine de Pisan , the first female professional writer of France. She analyzed the state into three parts (ruler, nobles, and commoners) that cooperated, like a well-functioning body, for the benefit of the whole.",
  "In the 16th century, King Henry VIII of England initiated the dismemberment of the body politic metaphor by putting himself in the role of head of the church. Slightly before that time, Sir John Fortescue ’s De laudibus legum Angliae ( c. 1470; “In Praise of the Laws of England”) had argued that nerves (laws) bound the British body politic, advocating a limited monarchy and parliamentary rule. In 1606 Barnabe Barnes ’s Foure Bookes of Offices granted the head to the king and, this time, the lungs to the laws. The Reformation dismantled the metaphor even further, challenging most often those associated with the head—the king or the pope. The partition of Christianity allowed rulers to refer to the old metaphor to assert control over a population that could disavow the leader’s choice of allegiance (Catholicism or Protestantism ). The usage of the metaphor advertised unity as Christianity splintered, and the long association between religion and politics decayed.",
  " John Milton ’s Of Reformation Touching Church-Discipline in England (1641) refashioned “The Belly and the Members” fable into “The Fable of the Wen and the Members.” The wen (or boil)—a metaphor for a Catholic bishop—having grown close in size to a head argued for his prime position over the rest of the members of the body. A philosopher, brought to a meeting of the members, exposes him for what he is—a foul excrescence.",
  "Shakespeare also instilled doubt in the metaphor’s validity, questioning in Coriolanus the organic cooperation between members of the body and comparing plebeians to the monstrous Hydra of Greek mythology and to diseases like the measles or scabs. Pushing the usage of the metaphor to its extreme, Milton and Shakespeare pointed to the truism that a body, like society, does not always function well.",
  "In the mid-17th century, Thomas Hobbes effectively killed the body politic metaphor by insisting on the artificiality of the state. In Leviathan (1651) he discussed the natural selfishness of humankind and the consequent need to impose upon individuals an external authority to prevent perpetual violence. Created to preserve peace, the Leviathan (the state) was an artifical social institution, not a biological or natural one.",
  "After the 17th century the usage of the body politic metaphor declined even further. After the Industrial Revolution , when issues of social contract gained prominence, social institutions were conceived of as machines rather than as natural organisms."
]