[
  " broken windows theory , academic theory proposed by James Q. Wilson and George Kelling in 1982 that used broken windows as a metaphor for disorder within neighbourhoods. Their theory links disorder and incivility within a community to subsequent occurrences of serious crime .",
  "Broken windows theory had an enormous impact on police policy throughout the 1990s and remained influential into the 21st century. Perhaps the most notable application of the theory was in New York City under the direction of Police Commissioner William Bratton. He and others were convinced that the aggressive order-maintenance practices of the New York City Police Department were responsible for the dramatic decrease in crime rates within the city during the 1990s. Bratton began translating the theory into practice as the chief of New York City’s transit police from 1990 to 1992. Squads of plainclothes officers were assigned to catch turnstile jumpers, and, as arrests for misdemeanours increased, subway crimes of all kinds decreased dramatically. In 1994, when he became New York City police commissioner, Bratton introduced his broken windows-based “quality of life initiative.” This initiative cracked down on panhandling, disorderly behaviour, public drinking , street prostitution , and unsolicited windshield washing or other such attempts to obtain cash from drivers stopped in traffic. When Bratton resigned in 1996, felonies were down almost 40 percent in New York, and the homicide rate had been halved.",
  "Prior to the development and implementation of various incivility theories such as broken windows, law enforcement scholars and police tended to focus on serious crime; that is, the major concern was with crimes that were perceived to be the most serious and consequential for the victim, such as rape , robbery , and murder . Wilson and Kelling took a different view. They saw serious crime as the final result of a lengthier chain of events, theorizing that crime emanated from disorder and that if disorder were eliminated, then serious crimes would not occur.",
  "Their theory further posits that the prevalence of disorder creates fear in the minds of citizens who are convinced that the area is unsafe. This withdrawal from the community weakens social controls that previously kept criminals in check. Once this process begins, it feeds itself. Disorder causes crime, and crime causes further disorder and crime.",
  "Scholars generally define two different types of disorder. The first is physical disorder, typified by vacant buildings, broken windows, abandoned vehicles, and vacant lots filled with trash. The second type is social disorder, which is typified by aggressive panhandlers, noisy neighbours, and groups of youths congregating on street corners. The line between crime and disorder is often blurred, with some experts considering such acts as prostitution and drug dealing as disorder while many others classify them as crimes. While different, these two types of disorder are both thought to increase fear among citizens.",
  "The obvious advantage of this theory over many of its criminological predecessors is that it enables initiatives within the realm of criminal justice policy to effect change, rather than relying on social policy. Earlier social disorganization theories and economic theories offered solutions that were costly and would take a long time to prove effective. Broken windows theory is seen by many as a way to effect change quickly and with minimal expense by merely altering the police crime-control strategy. It is far simpler to attack disorder than it is to attack such ominous social ills as poverty and inadequate education.",
  "Although popular in both academic and law-enforcement circles, broken windows theory is not without its critics. One line of criticism is that there is little empirical evidence that disorder, when left unchallenged, causes crime. To validate the theory in its entirety, it must be shown that disorder causes fear, that fear causes a breakdown of social controls (sometimes referred to as community cohesion), and that this breakdown of social controls in turn causes crime. Finally, crime must be shown to increase levels of disorder.",
  "The strongest empirical support for the broken windows theory came from the work of political scientist Wesley Skogan, who found that certain types of social and physical disorder were related to certain kinds of serious crime. However, Skogan prudently recommended caution in the interpretation of his results as proof of the validity of the broken windows theory. Even this qualified support has been questioned by some researchers. In a reanalysis of Skogan’s data, political theorist Bernard Harcourt found that the link between neighbourhood disorder and purse snatching, assault, rape, and burglary vanished when poverty, neighbourhood stability, and race were statistically controlled. Only the link between disorder and robbery remained. Harcourt also criticized the broken windows theory for fostering “zero-tolerance” policies that are prejudicial against the disadvantaged segments of society.",
  "In his attempt to link serious crime with disorder, criminal justice scholar Ralph Taylor found that no distinct pattern of relationships between crime and disorder emerged. Rather, some specific disorderly acts were linked to some specific crimes. He concluded that attention to disorder in general might be an error and that, while loosely connected, specific acts may not reflect a general state of disorder. He suggested that specific problems would require specific solutions. This seemed to provide more support for problem-oriented policing strategies than it did for the broken windows theory.",
  "In short, the validity of the broken windows theory is not known. It is safe to conclude that the theory does not explain everything and that, even if the theory is valid, companion theories are necessary to fully explain crime. Alternatively, a more complex model is needed to consider many more cogent factors. Almost every study of the topic has, however, validated the link between disorder and fear. There is also strong support for the belief that fear increases a person’s desire to abandon disorderly communities and move to environments that are more hospitable. This option is available to the middle class, who can afford to move, but not to the poor, who have fewer choices. If the middle class moves out and the poor stay, the neighbourhood will inevitably become economically disadvantaged. This suggests that the next wave of theorization about neighbourhood dynamics and crime may take an economic bent."
]