[
  " The Young Person’s Guide to the Orchestra , in full The Young Person’s Guide to the Orchestra: Variations and Fugue on a Theme of Henry Purcell, Op. 34 , composition for orchestra by British composer Benjamin Britten . The work was written at the request of the British Ministry of Education for use in the short educational film Instruments of the Orchestra (1946). Its concert premiere was given in Liverpool , England , on October 15, 1946.",
  "  For his theme in the work, Britten drew on English Baroque composer Henry Purcell ’s stately rondeau from  Abdelazer  . The theme is first stated by the full orchestra, then restated by different sections of the orchestra (in order, woodwinds , brass , strings , and percussion ) before being stated again by the full orchestra. In so doing, Britten makes clear the different timbres of the different sections of the orchestra.",
  "In the next section of the piece, Britten offers variant forms of the theme for featured instruments from each family—first woodwinds, then strings, brass, and percussion, a different order than that of the opening section. Generally speaking, he begins with the highest-pitched instruments in each family (for example, flutes and piccolo in the woodwinds) and proceeds to the lowest (in the woodwinds, the bassoon ), with different tempi and energies to make the most of the varied instrumental timbres. When he reaches the percussion instruments, special prominence is given to timpani and xylophone , which are able to play particular pitches, but he does not neglect the more rhythmic members of that family.",
  "In the last portion of the work, Britten combines all the sections of the orchestra in an intricate fugue on a new, dancelike theme derived from the original. That fugues were especially popular during Purcell’s lifetime—in the Baroque era —makes Britten’s choice of fugue form particularly suitable to his source material. Beginning with flutes and piccolo, each instrument states the new melody in turn as overlapping layers of music gradually emerge. Thus, the piece not only allows listeners to hear the contrasting voices of the instruments but also offers a peek into musical techniques of earlier centuries, showing how a melody can bounce from one instrument to another in sequence while other melodic ideas occupy the background. For the grand finale, the original theme reappears in its entirety, set boldly beneath the dancelike fugue theme."
]