[
  " the Shadow , American pulp-magazine vigilante created in 1931 by Walter Gibson for the publishing company Street & Smith. Inspired by the radio character of the same name, the Shadow went on to become one of the most influential and enduring characters of the pulp era.",
  "In 1930 Street & Smith began to sponsor the radio show Detective Story Hour , intending to promote their magazine Detective Story . The radio show, which was broadcast nationally on CBS , used a menacing-sounding narrator referred to as the Shadow. The character was memorable enough to cause people to ask newsstand vendors for a magazine that featured him, though no such magazine yet existed. Responding to this, Street & Smith hired Gibson, a writer and magician, to create a story based on the voice of the radio character. Gibson wrote a short novel, “The Living Shadow,” that was published in the first issue of The Shadow Magazine (April 1931). The character Gibson created was a mysterious figure who dressed in a flowing cloak and a slouch hat, battling criminals with a brace of blazing .45 automatic pistols. He sometimes operated alone, but more often he employed a variety of agents to help investigate crimes. The Shadow battled gangsters, spies, mad scientists, and a variety of bizarre master criminals. The stories—usually set in New York City—were fast-paced but internally logical, with exciting action sequences and clever plot twists.",
  "For several years the Shadow’s real identity was unknown to readers. He used several cover identities, most often that of Lamont Cranston, a wealthy globe-trotter. The Shadow would use Cranston’s identity whenever the real Cranston was abroad, initially doing so without Cranston’s knowledge. In 1937 it was revealed that the Shadow’s real name was Kent Allard, a World War I flying ace who had supposedly died years earlier.",
  "The magazine was very popular. Initially a monthly release, it changed to a twice-monthly schedule for much of its run. Gibson penned 282 of the 325 Shadow stories published during the magazine’s run, with Theodore Tinsley and Bruce Elliott producing most of the remainder. Artists George Rozen and Graves Gladney provided striking cover art for most issues. Concurrent with the magazine’s run, Street & Smith also published Shadow comic books and licensed a newspaper comic strip . The Shadow’s popularity was such that the character also returned to radio in 1937 as the protagonist of a weekly series . A 15-chapter movie serial starring Victor Jory was released in 1940. A pair of Shadow B-movies were produced in 1937 and 1938, and three more were made in 1946.",
  "By the late 1940s, however, pulp magazines had become less popular with readers, and they were replaced by inexpensive paperbacks and comic books. In 1949 Street & Smith canceled their entire pulp line, including The Shadow Magazine . The weekly radio show ended in 1954, and another Shadow movie was released in 1958.",
  "The Shadow was the first pulp character to be given his own ongoing title. He was the inspiration for numerous other pulp characters as well as being a major influence in the creation of the comic-book superhero  Batman . (The first published Batman story was a rewrite of the Shadow story “Partners of Peril,” written by Tinsley in 1936.) Interest in the Shadow continued long after The Shadow Magazine ceased publication, with the character revived in various comic-book series and a selection of the original novels reprinted in paperback form. In 1963 Belmont Books published several new Shadow novels written by Walter Gibson. Alec Baldwin played the title character in the film The Shadow (1994), which incorporated elements from both the pulp character and the radio show."
]