[
  " Selective Service System , independent federal agency in the United States created to administer the military draft nationwide to conscript troops quickly in the event of war . Founded in 1940, the Selective Service System oversees the military registration of all draft-age males (that is, age 18 through 25) and manages the Alternative Service Program for individuals classified as conscientious objectors (persons who object to war because of their moral or religious principles). The most recent draft in the United States was conducted in 1973.",
  "The Selective Training and Service Act of 1940, signed into law by President Franklin D. Roosevelt , created the country’s first peacetime draft. With Europe already engulfed in World War II and Japan making threatening moves in the Pacific, Roosevelt wanted to strengthen the unprepared U.S. armed forces. After World War II the Soviet Union rose to challenge U.S. political and military power, and the country retained the draft to maintain a large standing army capable of countering potential Soviet aggression.",
  "Public sentiment turned against the draft during the Vietnam War , in part because of the availability of deferments that seemed to favour the wealthy and powerful, spreading a perception that the poor were shouldering more than their fair share of the burden. That perception, combined with the general unpopularity of the war, led Congress to refuse to extend the draft law in 1973. Since that time the United States has had an all-volunteer military. In 1975 the requirement that draft-age males register for service was suspended. However, in 1980, after the Soviet Union invaded Afghanistan , President Jimmy Carter reinstated the law.",
  "Almost all male noncitizens living in the United States who are 18 to 25 years old—including illegal aliens, refugees , and those with permanent residency status—are required to register with the Selective Service System. Full-time military personnel are not required to register, but members of the National Guard and Reserves who are not on full-time active duty must do so. Conscientious objectors must also register; however, if the draft is instituted, they have the opportunity to file for an exemption from military service on religious or moral grounds. Individuals who are hospitalized or incarcerated are required to register within 30 days after they are released, and noninstitutionalized disabled men capable of leaving their homes must also register. The Selective Service System requires the disabled to register even if their disability would excuse them from service, because it does not have the authority to classify an individual as disabled.",
  "Failure to register with the Selective Service System carries several penalties, including not being eligible for certain educational and other federal programs, such as most government jobs, job training, and student loans and grants. The legislatures of several U.S. states and territories have enacted similar penalties at the state and territorial level. Forty states and four territories have linked some of their programs and benefits, such as driver’s license services, to automatic Selective Service registration."
]