[
  " physical activity , any form of bodily movement that is produced by the contraction of skeletal muscle and therefore results in energy expenditure. Physical activity includes the complete spectrum of activity, from very low levels of energy expenditure to maximal exertion. Thus, physical activity includes not only exercise , such as walking, running, and bicycling, but also certain work-related activities (e.g., lifting), household activities (e.g., cleaning), and leisure activities (e.g., gardening).",
  "Physical activity has been recognized by numerous public health organizations as an important vehicle for improving the health of human populations. Regular physical activity has numerous beneficial effects on the mind and body. For example, it can help prevent depression and multiple chronic conditions, including type 2 diabetes and heart disease. It can also help to control weight and can extend life. Conversely, according to the World Health Organization (WHO), physical inactivity is responsible for an estimated 3.2 million deaths globally. As a result, a sedentary lifestyle is considered to be a leading preventable cause of death.",
  "Various recommendations have been set forth regarding the amount of physical activity that is needed to maintain health and prevent disease. Countries often have their own recommendations and physical activity guidelines. WHO also has global recommendations, which are specific to different age groups and include guidelines for persons with reduced mobility. For example, for persons aged 5 to 17, WHO recommends at least 60 minutes of daily physical activity at moderate to vigorous levels. For older individuals, at least 150 minutes of moderate or 75 minutes of vigorous aerobic physical activity (or a combination thereof) are recommended each week. For older adults whose mobility is poor, WHO recommends physical activity on three or more days each week.",
  "Despite national and international recommendations, however, many adults do not engage in physical activity at levels sufficient to maintain health. In the United States , for example, two out of every three people fail to meet national physical activity recommendations.",
  "Many people may not meet physical activity recommendations because of barriers to activity participation. Indeed, although there is a plethora of evidence supporting the benefits of regular physical activity for improving health and function, barriers to physical activity remain. For example, lack of time, lack of motivation, or lack of confidence may prevent some people from engaging in physical activity. In other instances, convenient and safe places, such as sidewalks or bicycle trails, may be absent. Such barriers often can be overcome by various strategies, such as by planning ahead and by identifying and using convenient and available resources.",
  "For persons with disabilities, physical activity may be prevented by certain environmental barriers—such as inaccessible equipment and programs, transportation difficulties, and unsafe neighbourhoods—as well as by a variety of personal barriers, such as chronic health conditions and limited income. Accessibility of fitness and recreation programs and facilities is a critical issue that affects the participation of persons with disabilities in fitness and leisure activities and ultimately affects their ability to improve their health and quality of life.",
  "Another major issue for disabled persons is the lack of attention given in promotional campaigns to the needs of persons with disabilities. Public health messages that encourage people to become more physically active usually recommend activities that are unattainable by certain disabled populations. For example, those who are unable to walk or who have difficulty walking cannot be active at recommended physical activity levels developed specifically for walking.",
  "The relationship between physical functioning and physical activity is a reciprocal one: physical functioning provides the individual with the capacity to engage in physical activities, and physical activity helps to maintain and, in some cases, improve physical functioning. However, when physical functioning is reduced and physical inactivity is increased as a consequence, the implications for health can be profound.",
  "Physical functioning often decreases with age, in part because as persons age, the burden of disability increases. Aging persons who are affected by disability typically experience increased difficulty in performing activities of daily living (ADL), such as dressing, shopping, and showering. Secondary conditions associated with a disability, such as weakness or pain , may further hinder the ability of aging individuals to be physically active.",
  "The natural aging process and the high incidence of physical inactivity observed in persons with disabilities significantly increase the risk of premature physical decline. Those factors accentuate the importance of physical activity in maintaining health and function. Studies of physical activity in aging and in disabled populations have demonstrated that physical activities involving endurance and strength training can help to improve fitness and general well-being and reduce fatigue and pain. In addition, health benefits accrue with increasing amounts of physical activity, when performed safely. In elderly and disabled persons, vigorous physical activity performed in excess amounts increases the risk of injury. Thus, physical activity must be conducted in a manner that allows maximum benefits at the lowest possible risk. For the elderly and the disabled, exercise specialists work to ensure that physical activity programs are safe and effective by taking into account factors such as the progressive nature of certain disabilities (e.g., multiple sclerosis ) and physiological changes that occur with aging or after injury. Shoulder injuries, for example, are common in wheelchair users and have prompted the development of alternative exercises that reduce stress on the joints and muscles used for ambulation.",
  "An introduction to physical activity and its impact on health is Claude Bouchard , Steven N. Blair , and William L. Haskell (eds.), Physical Activity and Health , 2nd ed. (2012). Issues regarding physical activity among disabled and aging populations are treated in Robert D. Steadward , Garry D. Wheeler , and E. Jane Watkinson (eds.), Adapted Physical Activity (2003). Lynda Ransdell et al., Developing Effective Physical Activity Programs (2009), discusses physical activity interventions for different populations, including women and older adults."
]