[
  " augmentative and alternative communication (AAC) , form of communication used in place of or in addition to speech . Augmentative and alternative communication (AAC) includes the use of communication aids, such as alphabet boards and electronic communication devices that speak, as well as unaided communication methods, such as sign language and gestures. People who are unable to speak, or to speak clearly, rely on AAC to exchange information, express needs, maintain relationships, and participate in the activities of their community. People typically use multiple AAC methods and may use different methods with different people. For example, a children with dysarthria (a motor speech disorder ) may be understood by their parents, but for classroom participation and phone conversations they may need to augment their communication with an electronic communication device.",
  "AAC methods are typically differentiated as aided or unaided. Unaided communication methods include vocalizations and speech attempts as well as gestures and body movements. Many unaided communication methods are used and understood by most people, such as facial expressions, looking ( eye gaze), pointing, and other common gestures. Other methods, such as individualized signals, may be understood only by familiar people. For example, a child may raise an arm to talk about someone who is tall and look toward a kitchen to talk about food, hunger, or the person who cooks. In addition, people with limited ability to move may use subtle finger movements or eye blinks as codes for answering “yes” or “no” to questions.",
  "Sign language is also considered an unaided communication method. There are many different sign languages, specific to different cultures, such as American Sign Language and British Sign Language. Elements of sign language may be used by people who are unable to physically produce all the hand shapes and coordinated two-handed movements typical of sign languages. Individuals with limited speech and multiple impairments may be taught to use individual signs or adapted signs from a sign language. For example, a child with cerebral palsy may learn to use sign positions to quickly communicate needs or wants, such as touching a fist to the forehead to indicate “father” and touching the mouth to indicate “eat.”",
  "Aided communication methods include use of electronic and nonelectronic communication aids. Nonelectronic aids include writing tools, as well as boards and books with letters, words, pictures, or other symbols. There are many types of communication symbols. Blissymbolics, for example, is a language composed of thousands of graphic symbols. Boardmaker, a graphics database for making communication aids, contains several thousand picture communication symbols translated into numerous languages. People may communicate by eye-pointing or by directly touching symbols with their fingers or other body parts. If someone cannot point, a communication partner may point to symbols until the person indicates which symbols are wanted.",
  "The category of electronic communication aids includes hundreds of dedicated communication devices, as well as computer -based communication systems and AAC software . The selection of devices is based on individual needs and capabilities of the people in their environment. For example, people who can spell typically choose devices that have synthesized speech to speak messages that are typed. Most devices allow people to sequence words or symbols to create messages or recall pre-stored phrases. People who cannot operate devices by touching symbols or letters may use alternate access methods, such as scanning, a joystick, and mouse emulation.",
  " Melanie Freid-Oken and Harold A. Bersani , Speaking Up and Spelling It Out (2000), is a collection of essays, poems, and case descriptions of users of augmentative and alternative communication. In-depth and technical works are Anne Warrick , Communication Without Speech: Augmentative and Alternative Communication Around the World (1998); Lyle L. Lloyd , Donald R. Fuller , and Helen H. Arvidson (eds.), Augmentative and Alternative Communication: A Handbook of Principles and Practices (1997); and Stephen von Tetzchner and Harald Martinsen , Introduction to Augmentative and Alternative Communication , 2nd ed. (2000)."
]