[
  " Lemme Tas’e, Daddy Lemme Tas’e, Daddy Uncle Remus and His Friends Uncle Remus and His Friends  African American folktale , storytelling tradition that evolved among enslaved African Americans in the 18th and 19th centuries.",
  "When slaves arrived in the New World from Africa in the 1700s and 1800s, they brought with them a vast oral tradition . The details and characters of the stories evolved over time in the Americas, though many of the motifs endured. The African hare , for example, continued to play the trickster but became Brer Rabbit (or Bruh Rabbit). The African jackal became the American fox. And the African tortoise became a turtle or terrapin . Even with modifications, however, those tales carried from Africa retained a distinctive flavour.",
  "Most slaveholders forcibly suppressed the languages, customs, and cultures of the individuals they enslaved. Black slaves often turned to singing and storytelling as a means of expression, as they had traditionally done in Africa. Their nightly entertainment included tales about the world’s creation, heroic deeds, and magic. Those stories took the form of parables, which conveyed ideals, morals, and cultural values to the listener.",
  "One type of African American folktale explains why animals look or act the way they do. Common in other cultures as well, those tales—such as “Why the Lizard Often Nods” and “Why the Owl Never Sleeps at Night” are often amusing and attempt to explain common animal behaviour.",
  "Another type, the “how-and-why” story, is filled with hidden messages and offers moral guidance. “Tappin, the Land Turtle,” for instance, includes references to the brutality of slavery and explains how hope and humour make the circumstance more bearable. Other how-and-why tales include “Why Women Always Take Advantage of Men” and “Why the Sister in Black Works Hardest.”",
  "The oral tradition kept African folktales alive. Storytelling of that type shares several features with oral traditions around the world. It is typically performed in a particular place, at a particular time, and uses a special language; despite those rules, it employs flexible patterns and structures that aid composition, memory, and re-performance. The audience often participates in the performance as well.",
  "For African Americans, the telling of folktales not only enabled the preservation and dissemination of African culture, but it gave some respite from the unbearable hardships of slavery, if only briefly. The storytelling tradition also encouraged a sense of community in being one of few activities that were not controlled by their white owners. Slaves sometimes used folktales to pass coded information about meeting places or escape plans to one another. This theme of outsmarting the slaveholder is reflected in many folktales, such as “The Riddle Tell of Freedom.”",
  "Although folktales reflected the uncertainties of life for enslaved African Americans, they also provided a message of stability and assurance. The mother image found in some tales, for example, represents tenderness and goodness, while the child-hero is a symbol of purity and innocence. The smaller, less-powerful creatures, such as Brer Rabbit, always outsmart the larger, stronger characters, such as Brer Fox and Brer Bear. Students of the folktale generally hold that outcome as representative of the slaves’ desire to outwit their stronger, more-powerful owners. In the brutal world of the slaves, these images meant a great deal.",
  "After the abolition of slavery in 1865, the Brer Rabbit character became John, a trickster who worked on a Southern plantation and never failed to outwit the “old master.” Little evidence exists to prove that the John tales were told during the era of slavery. Students of those stories hold that they are representative of the relationship between the free Black, who is free only in name, and the former slaveholder.",
  "Unlike the John stories, the animal tales do not draw a clear distinction between just and unjust antagonists. They do, however, refute the romantic myth of the plantation that originated in the 1830s and is popularly represented in the 1939 movie  Gone with the Wind  . On the mythic Southern plantation, virtue, honour, pride, and benevolence determine status. Conversely, in the humanlike society represented in the animal tales, status is based on power, and winning is all that matters.",
  "  Brer Rabbit Conversing with Brer Fox, Brer Wolf, Brer Coon, and Brer Bear Nights with Uncle Remus   Slave folktales continue to be an important part of not only African American literature but also American literature in general. They were first written down in the late 19th century but became widely available only when journalist Joel Chandler Harris published Uncle Remus, His Songs and His Sayings: The Folk-lore of the Old Plantation (1880). Harris’s popular book both preserved a significant collection of oral tales—though, like so many narratives of that era, its use of dialect is painful to the modern reader—and introduced many Euro-Americans to the stories of a hitherto unknown culture.",
  "Harris’s collection presents a fictional plantation slave, Uncle Remus, as the book’s narrator, who recounts to a seven-year-old white boy the meaning behind the various antics of various humanlike animals. In his story “Tar-Baby” (1879), first published in The Atlanta Constitution , Harris launched Brer Rabbit and Brer Fox, the first of a larger group of animal characters that were to populate the pages of Uncle Remus and later books. Brer Fox secretly constructs a tar creature in order to catch Brer Rabbit. Then he hides to watch what happens. Tar-Baby, not surprisingly, does not respond to Brer Rabbit’s civilities. The story proceeds as follows:",
  "Brer Rabbit keep on axin’ ’im, en de Tar-Baby, she keep on sayin’ nuthin’, twel present’y Brer Rabbit draw back wid his fis’, he did, en blip he tuck ’er side er de head. Right dar’s whar he broke his merlasses jug. His fis’ stuck, en he can’t pull loose. De tar hilt ’im. But Tar-Baby, she stay still, en Brer Fox, he lay low.",
  "“Ef you don’t lemme loose, I’ll knock you agin,” sez Brer Rabbit, sezee, en wid dat he fotch ’er a wipe wid de udder han’, en dat stuck. Tar-Baby, she ain’t sayin’ nuthin’, en Brer Fox, he lay low.",
  "“Tu’n me loose, fo’ I kick de natal stuffin’ outen you,” sez Brer Rabbit, sezee, but de Tar-Baby, she ain’t sayin’ nuthin’. She des hilt on, en den Brer Rabbit lose de use er his feet in de same way. Brer Fox, he lay low. Den Brer Rabbit squall out dat ef de Tar-Baby don’t tu’n ’im loose he butt ’er cranksided. En den he butted, en his head got stuck. Den Brer Fox, he sa’ntered fort’, lookin’ des ez innercent ez wunner yo’ mammy’s mockin’-birds.",
  "“Howdy, Brer Rabbit,” sez Brer Fox, sezee. “You look sorter stuck up dis mawnin’,” sezee, en den he rolled on de groun’, en laft en laft twel he couldn’t laff no mo’.",
  "Many story collectors since Harris have published more-readable, often more-authentic, renditions of African American folktales. One notable collector of African American folktales was cultural anthropologist and folklorist Elsie Clews Parsons , who in the 1910s and ’20s traveled to the Bahamas , to the Sea Islands , off the coast of the southeastern United States, and elsewhere to collect stories and study their origins. A collection titled Mules and Men (1935) by African American author Zora Neale Hurston may serve as a counterpoint to Harris’s Uncle Remus collection in its attempt to share the stories from the perspective of an insider.",
  " Gayl Jones , Liberating Voices: Oral Tradition in African American Literature (1991); William Bascom , African Folktales in the New World (1992); Lee Alfred Wright , Identity, Family, and Folklore in African American Literature (1995); Roger Abrahams (ed.), African American Folktales: Stories from Black Traditions in the New World (1999)."
]