[
  " Solanum tuberosum  potato , ( Solanum tuberosum ),  annual plant in the nightshade family ( Solanaceae ), grown for its starchy edible tubers . The potato is native to the Peruvian-Bolivian Andes and is one of the world’s main food crops. Potatoes are frequently served whole or mashed as a cooked vegetable and are also ground into potato flour, used in baking and as a thickener for sauces. The tubers are highly digestible and supply vitamin C , protein, thiamin , and niacin .",
  " Solanum tuberosum  Potatoes are thought to have been independently domesticated several times and were largely cultivated in South America by the Incas as early as 1,800 years ago. Encountered by the invading Spaniards, potatoes were introduced into Europe during the second half of the 16th century. By the end of the 17th century the plant was a major crop in Ireland, and by the end of the 18th century it was a major crop in continental Europe, particularly Germany, and in the west of England. It continued to spread, in both Western and Eastern hemispheres, during the first four decades of the 19th century, and the Irish economy itself became dependent upon the potato. However, the disastrous failures of the Irish crops in the mid-19th century (especially in 1846 and 1848), because of late blight ( Phytophthora infestans ), and the resulting Irish Potato Famine generated a more-cautious attitude toward dependence on the plant.",
  "The potato is one of some 150 tuber-bearing species of the genus Solanum (a tuber is the swollen end of an underground stem). The compound leaves are spirally arranged; each leaf is 20–30 cm (about 8–12 inches) long and consists of a terminal leaflet and two to four pairs of leaflets. The white, lavender, or purple flowers have five fused petals and yellow stamens . The fruit is a small poisonous berry with numerous seeds.",
  " Solanum tuberosum  The stems extend underground into structures called stolons . The ends of the stolons may enlarge greatly to form a few to more than 20 tubers, of variable shape and size, usually ranging in weight up to 300 grams (10 ounces) but occasionally to more than 1.5 kg (3.3 pounds). The skin varies in colour from brownish white to deep purple; the starchy flesh normally ranges in colour from white to yellow, but it too may be purple. The tubers bear spirally arranged buds (eyes) in the axils of aborted leaves, of which scars remain. The buds sprout to form clones of the parent plant, allowing growers to vegetatively propagate desired characteristics. Indeed, vegetative reproduction is always used commercially, though the resulting decrease in genetic diversity has made the popular varieties more vulnerable to pests and diseases ."
]