[
  " precession , phenomenon associated with the action of a gyroscope or a spinning top and consisting of a comparatively slow rotation of the axis of rotation of a spinning body about a line intersecting the spin axis. The smooth, slow circling of a spinning top is precession, the uneven wobbling is nutation.",
  " In the Figure the disk of weight W and the attached shaft are rotating at high speed about the spin axis AB. The angular speed ω, which is clockwise viewed from A, can be indicated either by the curved arrow ω in the plane of the disk or by the vector ω ′ perpendicular to the disk and pointing to the right. The curved arrow ω and the vector ω ′ are analogous, respectively, to the rotation and advance of a right-hand screw in a nut; this is known as the right-hand rule. It is usually more convenient to represent rotations and turning moments (which tend to produce rotations) by vectors rather than by curved arrows.",
  "The shaft and the stationary column AC are connected by a ball-and-socket joint at A, which permits the shaft to rotate about any line through A . In the arrangement shown in the Figure, the weight W creates a clockwise moment WL about A, which can be represented by a vector M of magnitude WL, acting at A and perpendicular to AB . Because of the moment, the shaft will precess (rotate slowly) about the axis of the column in a clockwise direction, viewed from C  ; the angular velocity of precession is indicated by the vector Ω. It should be noted that ω ′ ,  M, and Ω are at right angles to one another and that the spin vector ω ′ always rotates toward the moment vector M . It can be shown that Ω, the angular velocity of precession, does not depend on the angle α  , which, in the case of a spinning top, is close to 180 degrees.",
  "The precession of tops is frequently accompanied by a phenomenon known as nutation, which is evidenced by a wavelike motion of the end of the spin axis caused by variations in the angle α ."
]