[
  " Travelers Insurance , leading American insurance company with a history of mergers, acquisitions, and spin-offs, largely in the insurance and financial services industries.",
  "The Travelers Insurance Company was founded in 1864 by James Batterson, a stonecutter. That year it sold the first accident insurance in the United States, and in 1865 it began selling life insurance, thus becoming the first company in the country to offer more than one type of insurance. By the time Batterson died in 1901, Travelers also offered health, liability, and automotive insurance, at a time when many insurers still restricted themselves to a single line of insurance. In 1919 the company became the first to sell aviation insurance, and during World War II it underwrote the Manhattan Project , which built the first atomic bomb. Travelers introduced its logo—a red umbrella to symbolize protection—in 1960. In 1965 the company was renamed The Travelers Corporation.",
  "In 1993, after suffering losses in real estate, Travelers was acquired by the Primerica conglomerate, which had been formed in 1987 from the non-packaging operations of the American Can Co.",
  "American Can itself was the product of mergers. Created through the consolidation of several producers of metal cans for the food industry, American Can monopolized 90 percent of the nation’s can-making capacity when it was founded in 1901. Antitrust decisions eventually restricted the company’s selling procedures, however. American Can was notable for its pioneering research in tin-plating, container sterilization, and the use of aluminum cans. At the time of the Travelers acquisition, Primerica also owned investment firm Smith Barney, Harris Upham & Co. and had purchased the Shearson brokerage business of the American Express Company.",
  "Under the direction of chief executive officer Sanford I.Weill, Primerica renamed itself Travelers Group and in 1996 bought the casualty and property insurance businesses of the Aetna Life and Casualty Company. One year later Travelers bought Salomon Brothers Inc. and merged that investment banking company with its own Shearson-Smith Barney unit to form Salomon Smith Barney Holdings Inc., creating one of the largest securities firms in the United States. In 1998 Travelers merged with Citicorp to form Citigroup . The new financial services conglomerate came under Weill’s leadership and assumed the red umbrella logo, retaining it even after spinning off, in 2002, the property and casualty insurance business to form a new, publicly traded firm called Travelers Property Casualty Corp."
]