[
  "  projection , in geometry, a correspondence between the points of a figure and a surface (or line). In plane projections, a series of points on one plane may be projected onto a second plane by choosing any focal point, or origin, and constructing lines from that origin that pass through the points on the first plane and impinge upon the second ( see  illustration ). This type of mapping is called a central projection. The figures made to correspond by the projection are said to be in perspective, and the image is called a projection of the original figure. If the rays are parallel instead, the projection is likewise called “parallel”; if, in addition, the rays are perpendicular to the plane upon which the original figure is projected, the projection is called “orthogonal.” If the two planes are parallel, then the configurations of points will be identical; otherwise this will not be true.",
  " Projective geometry ( q.v. ) is the discipline concerned with projections and the properties preserved under a “projective transformation,” the term used for the result of a succession of central or parallel projections.",
  "In cartography, the word projection is used in an extended sense to indicate some well-defined manner of representing a part of the Earth’s surface on a flat map. For example, the “Mercator projection” cannot be defined by a projection in the geometric sense. On the other hand, stereographic projection is a true projection widely used both in cartography and in the mathematical theory of functions of a complex variable. It refers to the projection of points from a sphere to a plane, defined by choosing a plane through the centre of the sphere, such as the equatorial plane, and projecting the points on the sphere by central projection from one of the poles to that plane. In general, stereographic projection is possible from any point on the sphere to a plane perpendicular to the axis of the sphere joining the given point with its antipodal point. Other common true projections used in mapping are cylindrical and conic projections, which are projections onto a cylinder or cone wrapped around the sphere and then unrolled to form a flat surface."
]