[
  "  psychology , scientific discipline that studies mental states and processes and behaviour in humans and other animals.",
  "The discipline of psychology is broadly divisible into two parts: a large profession of practitioners and a smaller but growing science of mind , brain , and social behaviour. The two have distinctive goals, training, and practices, but some psychologists integrate the two.",
  "  (Read Sigmund Freud’s 1926 Britannica essay on psychoanalysis.)  ",
  "In Western culture, contributors to the development of psychology came from many areas, beginning with philosophers such as Plato and Aristotle . Hippocrates philosophized about basic human temperaments (e.g., choleric, sanguine, melancholic) and their associated traits. Informed by the biology of his time, he speculated that physical qualities, such as yellow bile or too much blood, might underlie differences in temperament ( see also  humour ). Aristotle postulated the brain to be the seat of the rational human mind, and in the 17th century René Descartes argued that the mind gives people the capacities for thought and consciousness : the mind “decides” and the body carries out the decision—a dualistic mind-body split that modern psychological science is still working to overcome. Two figures who helped to found psychology as a formal discipline and science in the 19th century were Wilhelm Wundt in Germany and William James in the United States. James’s The Principles of Psychology (1890) defined psychology as the science of mental life and provided insightful discussions of topics and challenges that anticipated much of the field’s research agenda a century later.",
  "  During the first half of the 20th century, however, behaviourism dominated most of American academic psychology. In 1913 John B. Watson , one of the influential founders of behaviourism, urged reliance on only objectively measurable actions and conditions, effectively removing the study of consciousness from psychology. He argued that psychology as a science must deal exclusively with directly observable behaviour in lower animals as well as humans, emphasized the importance of rewarding only desired behaviours in child rearing, and drew on principles of learning through classical conditioning (based on studies with dogs by the Russian physiologist Ivan Pavlov and thus known as Pavlovian conditioning ). In the United States most university psychology departments became devoted to turning psychology away from philosophy and into a rigorous empirical science.",
  "Beginning in the 1930s, behaviourism flourished in the United States, with B.F. Skinner leading the way in demonstrating the power of operant conditioning through reinforcement. Behaviourists in university settings conducted experiments on the conditions controlling learning and “shaping” behaviour through reinforcement, usually working with laboratory animals such as rats and pigeons. Skinner and his followers explicitly excluded mental life, viewing the human mind as an impenetrable “black box,” open only to conjecture and speculative fictions. Their work showed that social behaviour is readily influenced by manipulating specific contingencies and by changing the consequences or reinforcement (rewards) to which behaviour leads in different situations. Changes in those consequences can modify behaviour in predictable stimulus-response (S-R) patterns. Likewise, a wide range of emotions , both positive and negative, may be acquired through processes of conditioning and can be modified by applying the same principles.",
  "Concurrently, in a curious juxtaposition, the psychoanalytic theories and therapeutic practices developed by the Vienna-trained physician Sigmund Freud and his many disciples—beginning early in the 20th century and enduring for many decades—were undermining the traditional view of human nature as essentially rational. Freudian theory made reason secondary: for Freud, the unconscious and its often socially unacceptable irrational motives and desires, particularly the sexual and aggressive, were the driving force underlying much of human behaviour and mental illness . Making the unconscious conscious became the therapeutic goal of clinicians working within this framework.",
  "Freud proposed that much of what humans feel, think, and do is outside awareness, self-defensive in its motivations, and unconsciously determined. Much of it also reflects conflicts grounded in early childhood that play out in complex patterns of seemingly paradoxical behaviours and symptoms. His followers, the ego psychologists, emphasized the importance of the higher-order functions and cognitive processes (e.g., competence motivation, self-regulatory abilities) as well as the individual’s psychological defense mechanisms . They also shifted their focus to the roles of interpersonal relations and of secure attachment in mental health and adaptive functioning, and they pioneered the analysis of these processes in the clinical setting.",
  "After World War II, American psychology, particularly clinical psychology, grew into a substantial field in its own right, partly in response to the needs of returning veterans. The growth of psychology as a science was stimulated further by the launching of Sputnik in 1957 and the opening of the Russian-American space race to the Moon . As part of this race, the U.S. government fueled the growth of science. For the first time, massive federal funding became available, both to support behavioral research and to enable graduate training. Psychology became both a thriving profession of practitioners and a scientific discipline that investigated all aspects of human social behaviour, child development , and individual differences, as well as the areas of animal psychology, sensation , perception , memory , and learning.",
  "Training in clinical psychology was heavily influenced by Freudian psychology and its offshoots. But some clinical researchers, working with both normal and disturbed populations, began to develop and apply methods focusing on the learning conditions that influence and control social behaviour. This behaviour therapy movement analyzed problematic behaviours (e.g., aggressiveness, bizarre speech patterns, smoking , fear responses) in terms of the observable events and conditions that seemed to influence the person’s problematic behaviour. Behavioral approaches led to innovations for therapy by working to modify problematic behaviour not through insight, awareness, or the uncovering of unconscious motivations but by addressing the behaviour itself. Behaviourists attempted to modify the maladaptive behaviour directly, examining the conditions controlling the individual’s current problems, not their possible historical roots. They also intended to show that such efforts could be successful without the symptom substitution that Freudian theory predicted. Freudians believed that removing the troubling behaviour directly would be followed by new and worse problems. Behaviour therapists showed that this was not necessarily the case.",
  "To begin exploring the role of genetics in personality and social development, psychologists compared the similarity in personality shown by people who share the same genes or the same environment. Twin studies compared monozygotic (identical) as opposed to dizygotic (fraternal) twins, raised either in the same or in different environments. Overall, these studies demonstrated the important role of heredity in a wide range of human characteristics and traits, such as those of the introvert and extravert , and indicated that the biological-genetic influence was far greater than early behaviourism had assumed. At the same time, it also became clear that how such dispositions are expressed in behaviour depends importantly on interactions with the environment in the course of development, beginning in utero.",
  "By the early 1960s the relevance of the Skinnerian approach for understanding complex mental processes was seriously questioned. The linguist Noam Chomsky ’s critical review of Skinner’s theory of “verbal behaviour” in 1959 showed that it could not properly account for human language acquisition . It was one of several triggers for a paradigm shift that by the mid-1960s became the “cognitive revolution,” which compellingly argued against behaviourism and led to the development of cognitive science . In conjunction with concurrent analyses and advances in areas from computer science and artificial intelligence to neuroscience, genetics , and applications of evolutionary theory , the scientific study of the mind and mental activity quickly became the foundation for much of the evolving new psychological science in the 21st century.",
  "Psychological scientists demonstrated that organisms have innate dispositions and that human brains are distinctively prepared for diverse higher-level mental activities, from language acquisition to mathematics , as well as space perception, thinking, and memory . They also developed and tested diverse theoretical models for conceptualizing mental representations in complex information processing conducted at multiple levels of awareness. They asked such questions as: How does the individual’s stored knowledge give rise to the patterns or networks of mental representations activated at a particular time? How is memory organized? In a related direction, the analysis of visual perception took increasing account of how the features of the environment (e.g., the objects, places, and other animals in one’s world) provide information, the perception of which is vital for the organism’s survival. Consequently, information about the possibilities and dangers of the environment, on the one side, and the animal’s dispositions and adaptation efforts, on the other, become inseparable: their interactions become the focus of research and theory building.",
  "Concurrently, to investigate personality, individual differences, and social behaviour, a number of theorists made learning theories both more social (interpersonal) and more cognitive. They moved far beyond the earlier conditioning and reward-and-punishment principles, focusing on how a person’s characteristics interact with situational opportunities and demands. Research demonstrated the importance of learning through observation from real and symbolic models, showing that it occurs spontaneously and cognitively without requiring any direct reinforcement. Likewise, studies of the development of self-control and the ability to delay gratification in young children showed that it is crucially important how the situation and the temptations are cognitively appraised: when the appraisal changes, so does the behaviour. Thus, the focus shifted from reinforcement and “stimulus control” to the mental mechanisms that enable self-control.",
  "Traditional personality-trait taxonomies continued to describe individuals and types using such terms as introversion-extraversion and sociable-hostile , based on broad trait ratings. In new directions, consistent with developments in cognitive science and social psychology , individual differences were reconceptualized in terms of cognitive social variables, such as people’s constructs (encoding of information), personal goals and beliefs, and competencies and skills. Research examined the nature of the consistencies and variability that characterize individuals distinctively across situations and over time and began to identify how different types of individuals respond to different types of psychological situations. The often surprising findings led to new models of cognitive and affective information-processing systems.",
  "In clinical applications, cognitive-behaviour therapy (CBT) was developed. CBT focuses on identifying and changing negative, inaccurate, or otherwise maladaptive beliefs and thought patterns through a combination of cognitive and behaviour therapy. It helps people to change how they think and feel about themselves and others. In time, these cognitive-behavioral treatment innovations, often supplemented with medications, were shown to be useful for treating diverse problems, including disabling fears, self-control difficulties, addictions, and depression .",
  "In social psychology, beginning in the early 1970s, social cognition—how people process social information about other people and the self—became a major area of study. Research focused on such topics as the nature and functions of self-concepts and self-esteem ; cultural differences in information processing; interpersonal relations and social communication; attitudes and social-influence processes; altruism , aggression, and obedience; motivation , emotion, planning, and self-regulation; and the influence of people’s dispositions and characteristics on their dealings with different types of situations and experiences. Recognizing that much information processing occurs at levels below awareness and proceeds automatically, research turned to the effects of subliminal (below awareness) stimuli on the activation of diverse kinds of mental representations, emotions, and social behaviours. Research at the intersection of social cognition and health psychology began to examine how people’s beliefs, positive illusions, expectations, and self-regulatory abilities may help them deal with diverse traumas and threats to their health and the stress that arises when trying to cope with diseases such as HIV / AIDS and cancer . Working with a variety of animal species, from mice and birds to higher mammals such as apes, researchers investigated social communication and diverse social behaviours, psychological characteristics, cognitive abilities, and emotions, searching for similarities and differences in comparison with humans.",
  "In developmental psychology , investigators identified and analyzed with increasing precision the diverse perceptual, cognitive, and numerical abilities of infants and traced their developmental course, while others focused on life-span development and mental and behavioral changes in the aging process. Developmental research provided clear evidence that humans, rather than entering the world with a mental blank slate, are extensively prepared for all sorts of cognitive and skill development. At the same time, research also has yielded equally impressive evidence for the plasticity of the human brain and the possibilities for change in the course of development.",
  "Late in the 20th century, methods for observing the activity of the living brain were developed that made it possible to explore links between what the brain is doing and psychological phenomena, thus opening a window into the relationship between the mind, brain, and behaviour. The functioning of the brain enables everything one does, feels, and knows. To examine brain activity, functional magnetic resonance imaging (fMRI) is used to measure the magnetic fields created by the functioning nerve cells in the brain, detecting changes in blood flow. With the aid of computers, this information can be translated into images, which virtually “light up” the amount of activity in different areas of the brain as the person performs mental tasks and experiences different kinds of perceptions, images, thoughts, and emotions. They thus allow a much more precise and detailed analysis of the links between activity in the brain and the mental state a person experiences while responding to different types of stimuli and generating different thoughts and emotions. These can range, for example, from thoughts and images about what one fears and dreads to those directed at what one craves the most. The result of this technology is a virtual revolution for work that uses the biological level of neural activity to address questions that are of core interest for psychologists working in almost all areas of the discipline.",
  "The advances described above led to the development in the early years of the 21st century of a new, highly popular field: social cognitive neuroscience (SCN). This interdisciplinary field asks questions about topics traditionally of interest to social psychologists, such as person perception, attitude change, and emotion regulation. It does so by using methods traditionally employed by cognitive neuroscientists, such as functional brain imaging and neuropsychological patient analysis. By integrating the theories and methods of its parent disciplines, SCN tries to understand the interactions between social behaviour, cognition, and brain mechanisms.",
  "The term epigenetic is used to describe the dynamic interplay between genes and the environment during the course of development. The study of epigenetics highlights the complex nature of the relationship between the organism’s genetic code , or genome, and the organism’s directly observable physical and psychological manifestations and behaviours. In contemporary use, the term refers to efforts to explain individual differences in physical as well as behavioral traits (e.g., hostility-aggression) in terms of the molecular mechanisms that affect the activity of genes, essentially turning on some genes and turning off others.",
  "Epigenetic regulation of gene activity plays a critical role in the process of development, influencing the organism’s psychological and behavioral expressions. Thus, while the genome provides the possibilities, the environment determines which genes become activated. In the early 21st century there emerged evidence for the important role of the environment (e.g., in maternal behaviour with the newborn) in shaping the activity of genes. Epigenetic factors may serve as a critical biological link between the experiences of an individual and subsequent individual differences in brain and behaviour, both within and across generations. Epigenetic research points to the pathways through which environmental influence and psychological experiences may be transformed and transmitted at the biological level. It thus provides another route for the increasingly deep analysis of mind-brain-behaviour links at multiple levels of analysis, from the psychological to the biological.",
  "The discoveries and advances of psychological science keep expanding its scope and tools and changing its structure and organization. For most of the 20th century, psychological science consisted of a variety of specialized subfields with little interconnection. They ranged from clinical psychology to the study of individual differences and personality, to social psychology, to industrial-organizational psychology , to community psychology, to the experimental study of such basic processes as memory, thinking, perception and sensation, to animal behaviour , and to physiological psychology . In larger academic psychology departments, the list got longer. The various subfields, each with its own distinct history and specialized mission, usually were bundled together within academic departments, essentially a loose federation of unrelated disciplines, each with its own training program and research agenda. Late in the 20th century this situation began to change, fueled in part by the rapid growth of developments in cognitive science and social cognitive neuroscience, including the discovery of new methods for studying cognition, emotion, the brain, and genetic influences on mind and behaviour.",
  "In the early years of the 21st century, psychology became an increasingly integrative science at the intersection or hub of diverse other disciplines, from biology , neurology , and economics to sociology and anthropology . For example, stimulated by Amos Tversky’s and Daniel Kahneman ’s theory of decision making under risk, new areas developed, including behavioral economics and decision making, often being taught by psychologists in business schools. Likewise, advances in cognitive neuroscience led to the subfield of neuroeconomics.",
  "In another direction, links deepened between psychology and law . This connection reflected new findings in psychology about the nature of human social behaviour, as well as the fallibility of eyewitness testimony in legal trials and the distortions in retrospective memory.",
  "Likewise, with recognition of the role of mental processes and self-care behaviour in the maintenance of health, the fields of behavioral medicine and health psychology emerged. These subfields study links between psychological processes, social behaviour, and health.",
  "At the same time, within psychology, old sub-disciplinary boundaries were crossed more freely. Interdisciplinary teams often work on a common problem using different methods and tools that draw on multiple levels of analysis, from the social to the cognitive and to the biological.",
  "An extremely wide range of diverse research methods are used by psychological scientists to pursue their particular goals. To study verbal and nonverbal behaviour and mental processes in humans, these include questionnaires, ratings, self-reports, and case studies; tests of personality, attitudes, and intelligence ; structured interviews; daily diary records; and direct observation and behaviour sampling outside the laboratory. Diverse laboratory measures are used to study perception, attention , memory, decision making, self-control, delay of gratification, and many other visual, cognitive, and emotional processes, at levels of both conscious and automatic or unconscious information processing.",
  "The astonishing growth in computational power that began in the final decades of the 20th century transformed research on methods of data analysis in psychology. More-flexible and more-powerful general linear models and mixed models became available. Similarly, for nonexperimental data, multiple regression analysis began to be augmented by structural equation models that allow for chains and webs of interrelationships and for analysis of extremely complex data. The availability of free, fast, and flexible software also began to change teaching in the measurement area.",
  " Albert Bandura , Principles of Behavior Modification (1969), is a classic in the psychology of behaviour modification based on social learning. The leading figure of behaviourism discusses its nature, methods, and goals in B.F. Skinner , About Behaviorism (1974).",
  " Jean Piaget , The Child’s Conception of Number (1952), and The Origins of Intelligence in Children (1952), are excellent examples of Piaget’s research and thinking. An in-depth illustration of complex learning theories in cognitive science is provided in David E. Rumelhart , G. Hinton , and R.J. Williams , “Learning Internal Representations by Error Propagation,” in David E. Rumelhart and James L. McClelland , Parallel Distributed Processing: Explorations in the Microstructure of Cognition , vol. 1 (1986).",
  " Walter Mischel , Personality and Assessment (1968), is the classic critique and analysis of key issues and challenges in personality psychology. An overview of the field of personality and major perspectives in the psychological study of individual differences are provided in Walter Mischel , Yuichi Shoda , and Ozlem Ayduk , Introduction to Personality: Toward an Integrative Science of the Person , 8th ed. (2008). R.R. McCrae and P.T. Costa , “A Five-Factor Theory of Personality,” in L.A. Pervin and O.P. John (eds.), Handbook of Personality: Theory and Research , 2nd ed. (1999), provides a view of traditional personality-trait assessment by ratings and factor analytic methods.",
  "The historical bases, core concepts, and methodologies of social cognitive neuroscience can be found in K. Ochsner , “Social Cognitive Neuroscience: Historical Development, Core Principles, and Future Promise,” in Arie Kruglanski and E. Tory Higgins (eds.), Social Psychology: Handbook of Basic Principles , 2nd ed. (2007).",
  "Exploration of measurement and testing theory with a focus on educational applications is provided in R.J. de Ayala , The Theory and Practice of Item Response Theory (2008). A solid introduction to the use of complex measurement models in the analysis of nonexperimental data is provided in Andrew Gelman and Jennifer Hill , Data Analysis Using Regression and Multilevel/Hierarchical Models (2007). S.E. Maxwell and H.D. Delaney , Designing Experiments and Analyzing Data: A Model Comparison Perspective , 2nd ed. (2004), offers an introduction to the design of psychological experiments and data analysis."
]