[
  " Pennsylvania Journal  salutary neglect , policy of the British government from the early to mid-18th century regarding its North American colonies under which trade regulations for the colonies were laxly enforced and imperial supervision of internal colonial affairs was loose as long as the colonies remained loyal to the British government and contributed to the economic profitability of Britain. This “salutary neglect” contributed involuntarily to the increasing autonomy of colonial legal and legislative institutions, which ultimately led to American independence.",
  "In the mid-17th century—in pursuit of a favourable balance of trade and of continuing to exploit raw materials from colonies that also served as a market for English manufactured goods—the English government adopted the so-called Navigation Acts . Under the Navigation Act of 1651, all goods exported to England or its colonies had to be transported on English vessels or on ships from the country from which the goods originated. This action prevented England’s great maritime rival, the Dutch, from acting as middlemen in international trade with the English colonies, especially of commodities originating in Africa or Asia. Subsequent acts required that all goods bound for England or English colonies, regardless of origin, had to be shipped only on English vessels and that certain “enumerated articles” from the colonies (which came to include sugar, cotton, and tobacco) could be shipped only to England, with trade in those items with other countries prohibited. Moreover, ultimately, all goods from other countries bound for the colonies or goods from the colonies destined for other countries had to first pass through English ports, where they were subject to customs duties. Those duties elevated the price of non-English goods so that they were prohibitively expensive for the colonists. Vice-Admiralty courts, presided over by judges but lacking juries (which were viewed as overly sympathetic to colonial interests), were established in the colonies to address violations of trade regulations. In 1696 Parliament established the Board of Trade largely with the intention of maintaining even tighter control of colonial trade.",
  " c.  Some historians believe that these tight reins on the colonies had begun to loosen in the late 17th century, but there is no doubt that a sea change occurred with the ascendancy of Robert Walpole as Britain’s chief minister in 1721. Under Walpole (who is generally regarded as Britain’s first prime minister) and his secretary of state, Thomas Pelham-Holles, 1st duke of Newcastle (who later served as prime minister, 1754–56, 1757–62), British officials began turning a blind eye to colonial violations of trade regulations. Most historians argue that this loosening of the enforcement of the Navigation Acts was primarily the result of a deliberate though unwritten policy—that Walpole was content to ignore illegal trade if the ultimate result was greater profits for Britain. If increased colonial purchases of British goods or goods from other British colonies resulted from colonial prosperity that came about through backdoor trade with France, what was the harm? Moreover, as some historians have noted, to have strictly enforced the regulations would have been much more costly, requiring an even larger body of enforcement officials. Other historians, however, argue that a greater cause of salutary neglect was not deliberate but was instead the incompetence, weakness, and self-interest of poorly qualified colonial officials who were patronage appointees of Walpole. Still other historians blame this lack of poor leadership not on patronage but on the lack of desirability of colonial postings, which tended to be filled not by officials in the prime of their careers but by the new and inexperienced or the old and undistinguished.",
  "During the period of salutary neglect, colonial legislatures spread their wings. In theory, considerable power was vested in colonial governors (most of whom were crown-appointed, though the governors in proprietary colonies were chosen by the proprietor, and those of the corporate colonies [Rhode Island and Connecticut] were elected). Governors generally had the power to convene and dismiss the legislature as well as to appoint judges and justices of the peace. They also served as commander in chief of the colony’s military forces. In practice, however, they often exerted much less control over the affairs of the colony than did the legislature, which not only had the power of the purse but paid the governor’s salary and was not beyond withholding it if he worked against its agenda. In the process the colonial legislatures grew used to making their own decisions and to those decisions’ having authority.",
  "Historians frequently link the reversal of the policy of salutary neglect with the conclusion of the French and Indian War (1754–63) and the desire by many in Parliament to recoup the considerable costs of defending the colonies with British forces through revenue-generating enforcement of trade restrictions. Even before this, however, as early as the 1740s, some British legislators and officials had pledged to reimpose rigid policing of trade regulations because they were angered by colonial land banks’ issuing currency, which took the form of bills of credit based on mortgaged land value. One immediate result was Parliament’s passage in 1751 of the Currency Act, which severely curtailed the issuing of paper money in the New England colonies. The Currency Act of 1764 extended these limitations to all the colonies. Also in 1764, Prime Minister George Grenville issued the Sugar Act to raise revenue and attempt to end the smuggling of sugar and molasses from the French and Dutch West Indies. A year later Grenville lowered the boom with the Stamp Act (1765), Parliament’s first attempt to raise revenue through direct taxation of all colonial commercial and legal papers, newspapers, pamphlets, cards, almanacs, and dice, which was greeted with violent opposition in the colonies and was repealed in 1766. At the same time, though, Parliament issued the Declaratory Act, which reasserted its right of direct taxation anywhere within the empire, “in all cases whatsoever.” If it was not already clear that the policy of salutary neglect was a thing of the past, it would be with the passage in 1767 of the so-called Townshend Acts (named for their sponsor, Charles Townshend , chancellor of the Exchequer under Prime Minister William Pitt, the Elder ). Collectively these four acts were aimed at reasserting the British government’s authority over the colonies through the suspension of the recalcitrant New York Assembly and through strict provisions for the collection of revenue duties. Ironically, the unwritten policy that was expunged did not receive the name by which it is known today until 1775, when Edmund Burke , an opponent of the Stamp and Townshend acts, speaking in Parliament, reflected back on the “wise and salutary neglect” of the colonies by British officials that had allowed British commerce with those colonies to expand by a factor of 12 since l700."
]