[
  "  rain , precipitation of liquid water drops with diameters greater than 0.5 mm (0.02 inch). When the drops are smaller, the precipitation is usually called drizzle. See also  precipitation .",
  "Concentrations of raindrops typically range from 100 to 1,000 per cubic m (3 to 30 per cubic foot); drizzle droplets usually are more numerous. Raindrops seldom have diameters larger than 4 mm, because as they increase in size they break up. The concentration generally decreases as diameters increase. Except when the rain is heavy, it does not reduce visibility as much as does drizzle. Meteorologists classify rain according to its rate of fall. The hourly rates relating to light, moderate, and heavy rain are, respectively, less than 2.5 mm, 2.8 to 7.6 mm, and more than 7.6 mm.",
  "Raindrops may form by the coalescence of small water droplets that collide or from the melting of snowflakes and other ice particles as they fall into warm air near the ground.",
  " Mount Waialeale , Hawaii, with a 20-year annual average of 11,700 mm (460 inches) from tropical easterlies, is the wettest known point on the Earth. The nearest competitor is Cherrapunji, Meghālaya, with an annual average of 11,430 mm from the moist tropical monsoon. Less than 250 mm and more than 1,500 mm per year represent approximate extremes of rainfall for all of the continents. Rainfall is slight in the central regions of the subtropical anticyclones, which are therefore the desert regions of the Earth. In parts of the desert no appreciable rain has ever been observed.",
  "Over most of Europe, South America, eastern North America, and central Africa, the annual rainfall exceeds 500 mm (20 inches), while over most of Asia, excluding India, Tibet, and China, the annual rainfall is less than 500 mm, being less than 250 mm in a long tongue extending from Arabia across to northeast Mongolia. The central regions of Australia, most of northern and a part of southwest Africa, portions of the intermontane area of the United States, and portions of the west-central coast and southern east coast of South America also have less than 250 mm of rain in the year. Portions of the western coast of Africa, between the Equator and 10° N, a strip of the western coast of India, parts of Assam, a coastal strip of Myanmar (Burma), windward mountain slopes in the temperate latitudes of North and South America, and many isolated tropical stations average more than 2,500 mm of rain in the year. Rainfall intensities greater than 30 mm in five minutes, 150 mm in one hour, or 500 mm per day are quite rare, but these intensities on occasion have been more than doubled for the respective durations."
]