[
  " rainbow , series of concentric coloured arcs that may be seen when light from a distant source—most commonly the Sun—falls upon a collection of water drops—as in rain, spray, or fog. The rainbow is observed in the direction opposite to the Sun.",
  "The coloured rays of the rainbow are caused by the refraction and internal reflection of light rays that enter the raindrop, each colour being bent through a slightly different angle. Hence, the composite colours of the incident light will be separated upon emerging from the drop. The most brilliant and most common rainbow is the so-called primary bow, which results from light that emerges from the drop after one internal reflection.",
  "Although light rays may exit the drop in more than one direction, a high density of the rays emerge at a minimum angle of deviation from the direction of the incoming rays. The observer thus sees the highest intensity looking at the rays that have minimum deviation, which form a cone with the vertex in the observer’s eye and with the axis passing through the Sun. Light emerging from raindrops after one internal reflection has a minimum deviation of about 138° and thus the greatest intensity in the directions forming a cone with an angular radius of about 42°, with arcs (from inside to outside) of violet, indigo, blue, green, yellow, orange, and red.",
  "Occasionally, a secondary bow may be observed, which is considerably less intense than the primary bow and has its colour sequence reversed. The secondary rainbow has an angular radius of about 50° and hence is seen outside of the primary bow. This bow results from light that has undergone two internal reflections within the water drop. Higher-order rainbows, resulting from three or more internal reflections, are exceedingly weak and hence are rarely observed.",
  "Occasionally, faintly coloured rings are seen just inside of the primary bow. These are called supernumerary rainbows; they owe their origin to interference effects on the light rays emerging from the water droplet after one internal reflection.",
  "Robert Greenler, Rainbows, Halos, and Glories (1980); Marcel Minnaert, Light and Color in the Outdoors (1993; originally published in Dutch, 1937)."
]