[
  " pocket shark , (genus Mollisquama ), either of two species of enigmatic small deepwater sharks known for the presence of internal pockets located near their pectoral fins. Pocket sharks are known from only two specimens, collected in 1979 and 2010 from different marine environments . The pocket shark is most closely related to the kitefin sharks ( Dalatias licha ), another typically deepwater species classified within the family Dalatiidae. The cookie-cutter sharks ( Isistius ) and the pygmy shark ( Euprotomicrus bispinatus ), which are among the smallest shark species known, are probably the pocket shark’s best-known relatives.",
  "Detailed information about the habitat and distribution of pocket sharks is scant; what is known about the group has been derived from two specimens collected in very different parts of the world. The pocket shark ( Mollisquama parini ) was described in 1984 from a single specimen of a large female collected near the Nazca Ridge in the southeast Pacific Ocean in 1979. A second specimen, a juvenile male, was collected in 2010 in the northern Gulf of Mexico and first described in 2015; however, it was not until 2019 that it was formally classified as a separate species, the American pocket shark ( M. mississippiensis ). Both species were collected from mid-water trawls at depths between 330 and 580 metres (approximately 1,100 and 1,900 feet), with the actual seafloor depth in each habitat being considerably deeper (2,000–3,000 metres [roughly 6,600–9,800 feet]).",
  "Although very little is known about the ecology and natural history of pocket sharks, some of their physical features may provide clues to their life history. The pocket shark resembles many other deepwater shark species, most of which are relatively small, seldom reaching 2 metres (6.5 feet) in length. The American pocket shark was only 14 cm (5.5 inches) in length. Pocket shark bodies are cigar -shaped, and they lack the pointed snouts typical of many other shark species, having instead a generally rounded head. Although the small size and the delicate condition of the two specimens has prevented detailed studies of gut contents to examine the shark’s feeding choices, the presence of sharp and pointed teeth in both specimens suggests that pocket sharks may be effective predators.",
  "Pocket sharks are viviparous : they give birth to live young. The young possess a yolk sac and are nourished inside the female until they are born. The details surrounding the pocket shark’s litter size, gestation period, and mating and nursery grounds are unknown. However, the presence of a yolk sac scar on the small juvenile male American pocket shark suggests that it was newly birthed and that its capture site may be an area where young are born.",
  "One of the main physical features that distinguishes pocket sharks from other shark species is the presence of an internal “pocket” gland located just above each pectoral fin. The pocket opens to the outside through several slits, and its interior is lined with specialized cells . Although some scientists have speculated that these glands may secrete sex attractants ( pheromones ) to assist in enticing mates in the deepwater environment , anatomical studies strongly suggest that these glands produce a bioluminescent fluid, which may be used to blind and confuse predators or lure prey. The American pocket shark also possesses photophores (light-emitting organs) spread across various parts of its body."
]