[
  " Walk off the Earth , Canadian music group that gained a reputation for their playful videos of cover songs and unique blend of folk , rock , pop , and reggae . The band gained an international following in 2012 with their cover of the Gotye song “Somebody That I Used to Know,” which the five band members performed simultaneously on one guitar .",
  "Gianni (“Luminati”) Nicassio (vocals, multi-instrumentalist) and Ryan Marshall (vocals, multi-instrumentalist) began playing together in Burlington , Ontario , in 2006 and gradually met the rest of the Walk off the Earth lineup through other local bands. The name “Walk off the Earth” (WOTE) reflects their desire for fans to forget about their problems and to “walk off the earth” when listening to their music.",
  "For the first two WOTE albums, Smooth Like a Stone on a Beach (2007) and My Rock (2010), Luminati and Marshall were joined by Pete (“Pablo”) Kirkwood on drums. Both records were produced by Luminati and released through his independent label, Slapdash Records. Kirkwood left the band following these two albums.",
  "Luminati and Marshall were then joined by classically trained pianist and multi-instrumentalist Mike Taylor. In 2011 Joel Cassady left Humber College’s music program to become a drummer and multi-instrumentalist for WOTE. Sarah Blackwood was the lead singer of the Burlington punk band The Creepshow as well as a solo artist before joining Walk off the Earth. Blackwood became a regular contributor to the band in 2010 and joined permanently in 2012.",
  "The band began uploading videos of cover songs to YouTube in 2009. After coming up with an idea to have multiple people play one guitar, Luminati heard Gotye’s “Somebody That I Used to Know” in 2011 and thought it would be the perfect fit for their next video. The performance was filmed in Luminati’s kitchen the day after a New Year’s Eve Party. The video received 35 million views in less than three weeks and attracted global attention.",
  "WOTE’s major label debut, R.E.V.O. (an acronym for the band’s motto, “Realize Every Victory Outright”), was released in October 2012. The four-song EP was produced by Justin Koop and cowritten with producer-songwriter Thomas (“Tawgs”) Salter. The first single, “Red Hands,” was the first song written by the band’s current lineup. It went double platinum in Canada and reached No. 1 on the Billboard Adult Alternative Songs chart and No. 9 in the Canada Hot 100 chart.",
  "The full-length album R.E.V.O. , released in March 2013, includes the EP’s four tracks, six more original songs, and the band’s cover of “Somebody That I Used to Know.” R.E.V.O. was certified gold in Canada and earned the band Juno Award nominations for Breakthrough Group of the Year and Pop Album of the Year in 2013 and 2014, respectively.",
  "The band’s second full-length record with Columbia Records, Sing It All Away , was released in June 2015. The two lead singles, “Rule the World” and “Sing It All Away,” were released in March and April 2015, respectively. Sing It All Away also features “Home We’ll Go,” a collaboration with producer Steve Aoki. In 2012 WOTE released compilations of their YouTube cover songs in the 16-song albums Vol. I (2012) and Vol. II (2012), through Slapdash Records.",
  " The original version of this entry was published by The Canadian Encyclopedia . "
]