[
  " shift work , arrangement of working hours that differs from the standard daylight working hours (i.e., 8:00 am to 5:00 pm ). Organizations that adopt shift work schedules extend their normal working hours beyond the standard eight-hour shifts by using successive teams of workers. Notable examples of organizations that adopt shift work schedules include hospitals, fire stations, and police stations. However, forces such as industrialization, new technologies, and the globalized economy have contributed to the creation of a society that operates 24 hours a day. This 24-hour society has led to an increase in the need for shift work in other industries as well.",
  "Organizations may structure shift work in a variety of ways, depending on their needs. One organization may adopt two 12-hour shifts, whereas another may adopt three 8-hour shifts. Shift work systems can also differ in the direction and speed of shift rotation. Shift systems that rotate employee schedules from morning shifts to evening shifts to night shifts have a forward rotation, whereas shifts that rotate counterclockwise (i.e., night to evening to morning) have a backward rotation. With regard to the speed of rotation, shift systems fall into three major categories: (a) permanent shift systems (e.g., permanent night shift); (b) slowly rotating shift systems (e.g., weekly rotating); and (c) rapidly rotating shift systems (e.g., an employee works the morning shift on Monday, the evening shift on Tuesday and Wednesday, and the night shift on Thursday and Friday).",
  "Although shift systems remain popular with employees on the front end because they provide a degree of flexibility, research investigating shift work has found that such schedules have primarily negative effects for both individuals and organizations.",
  "Most of the early work on the psychological outcomes of shift work focused on the exploration of shift workers’ attitudes, such as job satisfaction. This research suggests that, although workers welcome the idea of shift systems up front, they are typically less satisfied with their work than nonshift workers. Additionally, the research shows that psychological and emotional distress accompanies shift work. However, studies on the severity of these issues have not been conclusive.",
  "A great deal of research has investigated the impact of shift work on individual circadian rhythms . Humans have evolved over thousands of years as a species that habitually sleeps during the night and is awake during the day. The rotation of Earth around the sun creates a 24-hour cycle of light and dark, which is internalized by humans and forms a natural internal body clock. All human circadian rhythms normally show a fixed-phase relationship. For example, body temperature peaks in the evening. In general, many bodily functions are at their highest level of activity during the day, allowing for a natural progression toward sleep at night.",
  "Sleep problems occur for shift workers as a result of the mismatch between environmental time cues and the internal timing system. Although the natural light-dark cycle, the clock time, and other social cues may remain the same, the timing of shift workers’ work and sleep is delayed. Evidence suggests that adjustments to the shift workers’ body clocks are slow, if they occur at all. This mismatch between the environment and the internal body clock has been linked to negative outcomes such as sleep deprivation and chronic fatigue.",
  "Chronic fatigue is linked with greater incidence of physical injury. A greater number of serious job-related injuries occur among employees who work night shifts. Night shift workers are more likely to be involved in automobile accidents on the drive home from work than day shift workers. While the link between work hours and increased risk of injury seems clear, several potential confounding factors must be considered for injuries sustained on the job. Significantly, night shift workers are often less experienced and work with less supervision than their daytime counterparts.",
  "By far the most prevalent health complaint associated with shift work is gastrointestinal problems. Irregular eating schedules and diminished access to healthful foods may in part account for this. The relationship between cardiovascular disease and shift work has also been explored. Many characteristics of shift workers are considered predictors of cardiovascular disease (e.g., poor eating habits, gastrointestinal disorders, sleeping disorders, less favorable working conditions). Shift work has additionally been shown to have negative effects on the reproductive cycles of women (e.g., increased menstrual pain and fertility problems). The physiological effects of shift work may also influence drug activity and effectiveness, suggesting that persistent shift work may be incompatible with the efficacious treatment of disease.",
  "In addition to the psychological and physical effects, shift work is related to several social and domestic variables. For example, although organizations may believe that it is advantageous to operate on a 24-hour schedule, estimates place the cost of shift work among U.S. companies at tens of billions of dollars a year. Research has shown higher rates of absenteeism among shift working populations. Thus, the cost results in part from lost productivity because of absenteeism and higher medical bills because of increased injury and accidents. Additionally, shift work is associated with a decreased ability to balance work and nonwork responsibilities. Divorce rates for shift workers are substantially higher than those for day workers.",
  "Several individual difference variables have been shown to be important to the relationship between shift work schedules and outcomes. For example, “morningness,” or a preference for going to bed early and rising early in the morning, is moderately associated with difficulty adjusting to night work. Additionally, sleep flexibility (i.e., the ability to sleep at unusual times) and vigor (i.e., the ability to overcome drowsiness) predict an individual’s level of tolerance for shift work.",
  "Individual differences in age and personality are also frequently investigated. The older an employee is, the less tolerance he or she will have for shift work. It has been recommended that shift work be voluntary after the age of 40. Over the age of 50, it becomes increasingly difficult for individuals to alter their sleep-wake cycles. Many physical ailments increase with advancing age, and this increase in physical problems affects older individuals’ ability to adjust to shift work. With regard to personality, it has been found that introverts are generally more morning-oriented than extroverts, making it more difficult for them to adjust to shift work.",
  "Another individual difference variable that has been explored is the amount of social support an individual receives. Supervisor support has been found to be a crucial buffer to the negative effects of stress induced by shift work.",
  "Research suggests that shift work has negative effects for individuals, organizations, and society. These effects are many and serious. However, for some organizations, shift work is a necessity. Research on the design of a shift work system that is minimally detrimental to employees is ongoing.",
  "One review of shift systems produced five general recommendations regarding the design of shift work systems. First, it seems that night work should be reduced as much as possible. If this is not possible, an organization should adopt a rapidly rotating system. Second, long shifts (e.g., 9 to 12 hours) should be avoided. Third, flexible work arrangements should be integrated with shift systems. Fourth, shift changes within the same day should be avoided, and the number of consecutive days worked should be limited. The final recommendation suggests that forward rotation is most preferable."
]