[
  " self-fulfilling prophecy , process through which an originally false expectation leads to its own confirmation. In a self-fulfilling prophecy an individual’s expectations about another person or entity eventually result in the other person or entity acting in ways that confirm the expectations.",
  "A classic example of a self-fulfilling prophecy is the bank failures during the Great Depression . Even banks on strong financial footing sometimes were driven to insolvency by bank runs. Often, if a false rumor started that the bank was insolvent (incapable of covering its deposits), a panic ensued, and depositors wanted to withdraw their money all at once before the bank’s cash ran out. When the bank could not cover all the withdrawals, it actually did become insolvent. Thus, an originally false belief led to its own fulfillment.",
  "Self-fulfilling prophecies are important to the understanding of intergroup relations. Under just the right (or wrong) conditions, inaccurate social stereotypes may lead to their own fulfillment. For example, members of groups stereotyped as more intelligent, competent, or likable can, through the operation of self-fulfilling prophecies, actually become more intelligent, competent, or likable than members of groups stereotyped as less intelligent, competent, or likable. Thus, self-fulfilling prophecies may contribute to the maintenance not only of stereotypes themselves but of the group differences and inequalities that give rise to those stereotypes. Such processes, however, are limited, and the extent to which they contribute to group differences and inequalities is the subject of considerable controversy.",
  "The earliest empirical research on self-fulfilling prophecies examined whether teachers’ false expectations for their students caused students to achieve at levels consistent with those teachers’ expectations. Repeatedly, although not always, research demonstrated that teachers’ expectations are indeed self-fulfilling, as students sometimes come to perform at levels consistent with their teachers’ originally false expectations.",
  "This research has been interpreted by many scholars as providing a powerful insight into social, educational, and economic inequality. Teachers’ expectations seem to systematically advantage students from already advantaged backgrounds and disadvantage students from already disadvantaged backgrounds. To the extent that education is a major stepping-stone toward occupational and economic advancement, self-fulfilling prophecies, it would seem, constitute a major social force operating to prevent the disadvantaged from improving their lot.",
  "Classic studies also showed that both physical attractiveness and racial stereotypes could be self-fulfilling. When men interviewed a woman whom they falsely believed was conventionally physically attractive (accomplished through the use of false photographs in nonface-to-face interviews), not only were the men warmer and friendlier to her, but she became warmer and friendlier in response. Moreover, when white interviewers treated white interviewees in the same cold and distant manner they used with African American interviewees, the performance of the white interviewees suffered.",
  "Self-fulfilling prophecies have been demonstrated in a wide variety of educational, occupational, professional, and informal contexts. They have been demonstrated in experimental laboratory studies, experimental field studies, and naturalistic studies. Indeed, it is fairly easy to string together a few of the classic studies to tell a compelling story about how teachers’ expectations, employers’ expectations, and expectations in everyday interactions victimize people from stigmatized social groups. The logic here is quite simple. Stereotypes are widely shared and inaccurate. Stereotypes lead to inaccurate expectations. These expectations, in turn, are self-fulfilling. According to this perspective, self-fulfilling prophecies constitute a major source of social inequalities and social problems.",
  "For several reasons, however, evidence for the power of self-fulfilling prophecies is far from conclusive. First, some of the classic studies had major methodological problems. Second, many have proven difficult to replicate. Third, the overall power of self-fulfilling prophecies, especially as obtained in naturalistic studies that do not involve experimenters intentionally creating false expectations in participants, is not large at all. Fourth, there currently is about as much evidence that positive self-fulfilling prophecies improve the performance of low-achieving students as there is that negative self-fulfilling prophecies harm their performance. Fifth, considerable evidence indicates that people are not rudderless ships, relentlessly tossed around on the seas of other people’s expectations. Instead, people have their own motivations and goals that enable them to successfully combat others’ false expectations.",
  "Overall, therefore, the evidence does not justify a simple picture of self-fulfilling prophecies as powerful and pervasive sources of social problems. But the picture gets even fuzzier when other research is added to the mix. Although not all stereotypes are 100 percent accurate, it can be argued that most of the empirical studies that have assessed people’s beliefs about groups and then compared those beliefs with criteria regarding what those groups are actually like (census reports, results from hundreds of empirical studies, self-reports) find that people’s beliefs correspond to groups’ characteristics quite well. Indeed, the accuracy of many of the people’s stereotypes (the extent to which people’s beliefs about groups correspond to what those groups are actually like) is one of the largest relationships in all of social psychology.",
  "In addition, the shared component of stereotypes is typically even more accurate than is the individual or idiosyncratic component. Arguably, people do not rigidly and powerfully apply their stereotypes when judging individuals. They often readily jettison their stereotypes when clear and relevant personal information is available about the person being judged, and overall the effect of stereotypes on judging individuals is generally quite small. Thus, some of the key assumptions underlying the “self-fulfilling stereotypes are a powerful and pervasive source of social problems” story, that stereotypes are widely shared and inaccurate and that they powerfully distort expectations for individuals, seem to be largely invalid.",
  "A second important assumption underlying the argument for the power of self-fulfilling prophecies is that even if these prophecies are small in any given study, those small effects, because they likely accumulate over time, can become quite large and hence at least partially account for major social inequalities. For example, if teachers’ expectations increased the IQ of high-expectancy students only 3 points per year and decreased the IQ of low-expectancy students only 3 points per year and if these effects accumulated, then at the end of six years there would be a 36-IQ-point difference between two students who started out with identical IQ test scores but different expectancies.",
  "However, empirical research on self-fulfilling prophecies in education has not provided any evidence of accumulation. Rather than accumulating to become larger and larger over time, the effects of self-fulfilling prophecies in the classroom dissipate over time, as they become smaller and smaller. Given the evidence for generally high accuracy in teachers’ expectations, strongly erroneous teachers’ expectations may be the exception rather than the rule. Thus, students may be highly unlikely to be the target of the same type of erroneous expectation year after year, thereby limiting the likelihood that they will be subjected to the same erroneous expectation (and its self-fulfilling effects) year after year.",
  "Nonetheless, the story about the role of self-fulfilling prophecies in social problems should not be completely discarded. Self-fulfilling prophecies probably do play a real yet relatively modest role in creating or maintaining social inequalities based on characteristics such as race, ethnicity, social class, gender, and attractiveness. Moreover, in some contexts this role can be quite large. Some of the largest self-fulfilling prophecy effects ever obtained were found among students from stigmatized social and demographic groups (African American students, lower social class students, and students with histories of low achievement). Additionally, even though educational self-fulfilling prophecies do not accumulate, they can be very long-lasting. Finally, the types of diagnostic labels often used in educational contexts—learning disabled, emotionally disturbed, neurologically impaired—are inaccurately applied sufficiently often that they may frequently create inaccurately low expectations that are indeed self-fulfilling."
]