[
  "  franking , term used for the right of sending letters or postal packages free of charge. The word is derived from the French affranchir (“free”). The privilege was claimed by the British House of Commons in 1660 in “a Bill for erecting and establishing a Post Office,” their demand being that all letters addressed to or sent by members during the session should be carried free.",
  "The clause embodying this claim was struck out by the Lords , but it was replaced with a proviso for the free carriage of all letters to and from the sovereign and the great officers of state. The privilege was also extended to the single inland letters of the members of that Parliament during that session only. The practice, however, apparently was tolerated until 1764, when, by an act dealing with postage, it was legalized. Every peer and each member of the House of Commons was allowed to send free 10 letters a day, not exceeding an ounce in weight, to any part of the United Kingdom, and to receive 15. The act did not restrict the privilege to letters either actually written by or to the member, and thus the right was very easily abused. Members sent and received letters for friends, all that was necessary being the signature of the peer or member of parliament in the corner of the envelope. Wholesale franking grew usual, and MPs supplied their friends with envelopes already signed to be used at any time. On January 10, 1840, parliamentary franking was abolished on the introduction of the uniform penny rate.",
  "In the United States the franking privilege was first granted in January 1776 to the soldiers engaged in the American Revolution . The right was gradually extended until it included nearly all officials and members of the public service. By special acts the privilege was bestowed on presidents and their widows . The vice president , members of the House and Senate and delegates, the clerk of the house, and the secretary of the senate were given the privilege of sending and receiving free through the mail all public documents printed by order of Congress . This privilege continued until the 30th day of June following the expiration of the officials’ respective terms of office. In place of paid postage, the written name of the official, or a facsimile, and designation of the office appeared on the envelope or parcel.",
  "The Congressional Record or any part thereof could, under the frank of a member or delegate, be carried free under regulations of the postmaster general. Seeds transmitted by the secretary of agriculture or by any member or delegate receiving seeds from the department for transmission could be sent free in the mails under frank. This privilege applied to former members and former delegates for a period of nine months after the expiration of their terms. The vice president, members, members elect, delegates, and delegates elect could send free through the mails, under their franks, any mail matter to any government official or to any person, correspondence not exceeding 4 ounces (113 grams) in weight, upon official or departmental business. United States government agencies are entitled to use the so-called “penalty” statement (“Whoever makes use of any official envelope, label, or endorsement authorized by law, to avoid the payment of postage or registry fee on his private letter, packet, package, or other matter in the mail, shall be fined not more than $300.”) in lieu of postage stamps. The equivalent legend in the United Kingdom is O.H.M.S. (“on her majesty’s service”)."
]