[
  "  Reading , city, seat (1752) of Berks county , southeastern Pennsylvania , U.S., on the Schuylkill River , 51 miles (82 km) northwest of Philadelphia . Laid out in 1748 by Nicholas Scull and William Parsons on land owned by Thomas and Richard Penn (sons of William Penn , Pennsylvania’s founder), it was built around Penn Common, a large open square, and named for the hometown of the Penn family in Berkshire , England. During the American Revolution , Reading served as a supply depot and manufacturer of cannon.",
  "Industrial growth began in the late 18th century with the development of the iron and steel industries in Berks county. After the production of upper Great Lakes ore overshadowed that of Pennsylvania ore, Reading shifted to the fabrication of iron and steel. The opening of the Schuylkill Canal to Philadelphia (1824) and the Union Canal to Lebanon and Middletown on the Susquehanna River (1828) and the completion of the Philadelphia and Reading Railroad (1884) greatly stimulated industrial growth. In the 1890s, safety-bicycle manufacturing mushroomed. Development of the textile and hosiery industry was started about 1900 by two German technicians, Ferdinand Thun and Henry Janssen, who installed the first braiding and knitting machine in the country. In 1974 Reading became the site of the world’s first multi-tenant manufacturers’ outlet (opened by women’s lingerie manufacturer Vanity Fair), and outlet stores and malls continue to play a prominent role in the local economy. In the early 21st century, local industries included electronic components, batteries, specialty steels, energy-storage technology, and medical devices.",
  "The Reading area is the seat of Albright College (1856), Alvernia University (1958), Kutztown University (originally Keystone State Normal School, 1866), and the Berks campus (1958) of Berks–Lehigh Valley College of Pennsylvania State University (Penn State Berks). Mount Penn (1,300 feet [396 metres]), with a red-and-gold pagoda (1908) and a stone observation tower (1939) at its summit, is the centre of a city park. Local historic landmarks include the Daniel Boone Homestead (where Boone was born in 1734), the Conrad Weiser Homestead (1729), and Hopewell Furnace National Historic Site near Pottstown . An annual folk festival at nearby Kutztown reflects the Pennsylvania Dutch (German) heritage of the area.",
  "Officially designated “Baseballtown” in 2002 by local authorities, the Greater Reading area has a long history with the American national pastime that dates from the formation of the Reading Athletic Club in 1858. Minor league professional baseball has been played on and off in Reading since the late 19th century, and the Reading Fightin Phils of the Eastern League have been an affiliate of the Philadelphia Phillies since 1967—currently the longest continuous association between a Major League Baseball team and a “farm club.” The city also has a minor league ice hockey team. Inc. borough, 1783; city, 1847. Pop. (2000) 81,207; Reading Metro Area, 373,638; (2010) 88,082; Reading Metro Area, 411,442."
]