[
  " Red Cloud , Native American name Mahpiua Luta , (born 1822, on the Platte River, Nebraska Territory, U.S.—died Dec. 10, 1909, Pine Ridge Agency, S.D.), a principal chief of the Oglala Teton Dakota ( Sioux ), who successfully resisted (1865–67) the U.S. government’s development of the Bozeman Trail to newly discovered goldfields in Montana Territory.",
  "Red Cloud had no hereditary title of his own but emerged as a natural leader and spokesman of his people through the force of his own character and through bravery in battle. Determined to protect the Native Americans’ prime hunting grounds, Red Cloud in 1865 led the opposition of Sioux, Cheyenne , and Arapaho when the U.S. government began to build and fortify a road from Fort Laramie, in present Wyoming , by way of the Powder River to Montana . He intercepted the first contingents of army construction troops on the Bozeman Trail that summer, holding them prisoner for more than two weeks. Thereafter, he refused all offers to negotiate and relentlessly attacked workers along the route. The two-year harassment came to be known as Red Cloud’s War and did not end until the United States agreed to abandon all posts and to desist from any further effort to open the road. When the garrisons had finally been withdrawn and the forts burned, Red Cloud signed the Second Treaty of Fort Laramie (April 29, 1868), laid down his arms, and allowed himself to be settled on the Red Cloud Agency, in Nebraska .",
  "Many of Red Cloud’s followers, however, including his own son, scorned his accommodation with the white man and left the agency to pursue the war. While he kept his pledge of peace, Red Cloud defended Native American culture and continued to criticize the policies of the federal government. In 1878 he and his people moved to Pine Ridge Agency, whence he made several trips to Washington, D.C. , to publicize his views. He and his wife were baptized as Christians and took the names John and Mary a few years before his death."
]