[
  " dancing plague of 1518 , event in which hundreds of citizens of Strasbourg (then a free city within the Holy Roman Empire , now in France ) danced uncontrollably and apparently unwillingly for days on end; the mania lasted for about two months before ending as mysteriously as it began.",
  "In July 1518, a woman whose name was given as Frau (Mrs.) Troffea (or Trauffea) stepped into the street and began dancing. She seemed unable to stop, and she kept dancing until she collapsed from exhaustion. After resting, she resumed the compulsive frenzied activity. She continued this way for days, and within a week more than 30 other people were similarly afflicted. They kept going long past the point of injury. City authorities were alarmed by the ever-increasing number of dancers. The civic and religious leaders theorized that more dancing was the solution, and so they arranged for guildhalls for the dancers to gather in, musicians to accompany the dancing, and professional dancers to help the afflicted to continue dancing. This only exacerbated the contagion, and as many as 400 people were eventually consumed by the dancing compulsion. A number of them died from their exertions. In early September the mania began to abate.",
  "The 1518 event was the most thoroughly documented and probably the last of several such outbreaks in Europe, which took place largely between the 10th and 16th centuries. The otherwise best known of these took place in 1374; that eruption spread to several towns along the Rhine River .",
  "Contemporary explanations for the dancing plague included demonic possession and overheated blood . Investigators in the 20th century suggested that the afflicted might have consumed bread made from rye flour contaminated with the fungal disease ergot , which is known to produce convulsions. American sociologist Robert Bartholomew posited that the dancers were adherents of heretical sects, dancing to attract divine favour. The most widely accepted theory was that of American medical historian John Waller, who laid out in several papers his reasons for believing that the dancing plague was a form of mass psychogenic disorder . Such outbreaks take place under circumstances of extreme stress and generally take form based on local fears. In the case of the dancing plague of 1518, Waller cited a series of famines and the presence of such diseases as smallpox and syphilis as the overwhelming stressors affecting residents of Strasbourg. He further maintained that there was a local belief that those who failed to propitiate St. Vitus, patron saint of epileptics and of dancers, would be cursed by being forced to dance."
]