[
  "  Marine One , any aircraft of the U.S. Marine Corps transporting the president of the United States . Strictly speaking, Marine One is the call sign adopted by a Marine aircraft while the president is aboard. However, in common usage, it has come to mean any of the state-of-the-art helicopters reserved for the president.",
  "Although the U.S. military had adopted helicopters in the 1940s, safety concerns led the Secret Service to prohibit the president from flying in them. However, that policy changed the following decade as the escalating Cold War increased the potential for an emergency evacuation in the event of a nuclear attack. Officials ultimately settled on the Bell H-13J, which was relatively slow and small—accommodating just one pilot and two passengers—but noted for its safety record. In a test run known as “Operation Alert,” Dwight D. Eisenhower became the first president to fly in a helicopter, on July 12, 1957, when he was transported from the White House to Camp David . The Bell was flown by a U.S. Air Force pilot; also aboard was a Secret Service agent..",
  "Helicopters soon became indispensable in presidential travel—both within the United States and abroad—though the uncomfortable Bell was quickly replaced by larger models. Since the Air Force only operated smaller-sized helicopters, the U.S. Army and Marine Corps assumed responsibility. When flown by the former, the aircraft was designated Army One, while the latter was identified as Marine One. This arrangement continued until 1976, when the Marines were given sole responsibility; their pilots are selected from Marine Helicopter Squadron One (HMX-1; “ Nighthawks ”).",
  "  While the first presidential helicopters offered few amenities, later versions became increasingly sophisticated. The current models can fly more than 150 miles (241 km) per hour and feature ballistic armor and antimissile countermeasures. In addition, the green-and-white helicopters have electromagnetic-pulse protection in the event of a nuclear explosion. As a further protective measure, a decoy helicopter flies alongside Marine One. The relatively spacious interior, which can accommodate at least 14 passengers, includes a bathroom. When the helicopter lands, a Marine is waiting outside to greet the president, regardless of the location. The vice president travels in Marine Two.",
  "Different helicopter models have been used over the years. The Sikorsky VH-3A was introduced during the John F. Kennedy administration, and the VH-3D entered service during Jimmy Carter ’s presidency. The latter were supplemented with the VH-60N in the 1980s. In 2014 work began on a fleet of VH-92 helicopters, which were based on the Sikorsky S-92. The projected cost for each aircraft was more than $237 million."
]