[
  " The Artist , French black-and-white film, released in 2011, that was an homage to movies of the 1920s and became the first mostly silent feature to win the Academy Award for best picture since the first Academy Awards ceremony in 1929. The movie also won the Golden Globe Award for best musical or comedy as well as the BAFTA and César awards for best film.",
  " The Artist opens at the premiere of a movie starring silent-film idol George Valentin (played by Jean Dujardin). Peppy Miller (Bérénice Bejo), one of Valentin’s adoring fans, contrives to slip past the security cordon and reach Valentin’s side, where she playfully kisses him. A photograph of the kiss appears in the next day’s newspaper, captioned “Who’s That Girl?” She auditions as a dancer, and, when Valentin sees her at Kinograph Studios, he insists to the studio boss, Al Zimmer ( John Goodman ), that she be cast in his next movie, A German Affair . Over the next few years, Peppy establishes her career. One day, Zimmer shows Valentin an innovation: film with sound. Valentin dismisses the idea. Talkies take hold nonetheless, and Peppy becomes a star of the new era. Eventually, Zimmer fires Valentin.",
  "In an effort to revive his career, Valentin produces, directs, and stars in the silent picture Tears of Love , but its opening not only coincides with the opening of Peppy’s new talkie film but also takes place on the day of the stock market crash of 1929 , and his movie fails at the box office. Valentin begins drinking heavily; his wife, Doris (Penelope Ann Miller), leaves him; and he is forced to move from his mansion to a tiny apartment. Eventually, he begins auctioning off his belongings and must let his loyal chauffeur, Clifton (James Cromwell), go. One night, in alcohol-fueled despair, he attempts to burn all his old film reels. The conflagration engulfs his apartment, and his constant companion, a Jack Russell terrier, rushes out to find a nearby policeman to save Valentin. He is found unconscious, clutching a film canister. Peppy sees the news of his hospitalization and rushes to his bedside. When she sees that the film that he saved is A German Affair , she takes him to her mansion to recuperate. He discovers that Clifton is now working for Peppy and that it was Peppy who bought the personal items that he sold. Upset, he rips off his bandages and returns to his charred apartment. Peppy returns from the studio and finds Valentin gone. She gets in her car and frantically drives to his home, arriving just in time to stop him from shooting himself. She tells him that he has a part in her next movie. In the final scene, which has sound, Peppy and Valentin are tap-dancing together while making a musical.",
  "Writer and director Michel Hazanavicius won praise for his meticulous evocation of silent movies of the classical era. The Artist debuted at the Cannes festival , where it was nominated for the Palm d’Or and Dujardin won the award for best actor (and Uggie, the dog, was given an award called the Palm Dog). The film went on to win six César awards and was well received at other film festivals before going into general release."
]