[
  "  two-state solution , proposed framework for resolving the Israeli-Palestinian conflict by establishing two states for two peoples: Israel for the Jewish people and Palestine for the Palestinian people. In 1993 the Israeli government and the Palestine Liberation Organization (PLO) agreed on a plan to implement a two-state solution as part of the Oslo Accords, leading to the establishment of the Palestinian Authority (PA).",
  "The two-state solution proposed by the Oslo Accords was born out of a series of historical events. After the fall of the Ottoman Empire, Jews and Arabs both claimed the right to self-determination in historical Palestine. A first attempt at partitioning the land in 1948 resulted in an Israeli state but no Palestinian state, and the West Bank and Gaza Strip fell under Jordanian and Egyptian rule, respectively. In the Six-Day War of 1967, Israel captured and occupied the West Bank, the Gaza Strip, and other Arab territories, which in the aftermath led to the idea that Israel would exchange land it had captured for peace with its Arab neighbours, including, eventually, the Palestinians.",
  "Both Jewish and Palestinian expectations for an independent state in historical Palestine can be traced to World War I , as the United Kingdom attempted to shore up support against the Ottoman Empire and the Central Powers . The Hussein-McMahon correspondence of 1915–16 promised British support for Arab independence in exchange for Arab support against the Ottoman Empire. Though the correspondence discussed the extent of territory under Arab rule, historical Palestine, which was not located along the disputed edges and whose population was predominantly Arab, was not explicitly discussed and was assumed to be included in the agreement by Hussein ibn Ali , the emir of Mecca, and his supporters. The following year the Balfour Declaration promised British support for the establishment of a national home for the Jewish people in Palestine.",
  "  Over the following decades, waves of Jewish immigration to Palestine led to a significant increase in the Jewish population. The rapid immigration rate, which was managed by the United Kingdom, was met with protests from the Arab population. In 1947, as the United Kingdom prepared to withdraw from the region, the United Nations passed a partition plan (known as UN Resolution 181 ) that would divide Palestine into a Jewish state and an Arab state, an idea originally proposed by the British government about a decade earlier. The partition plan was rejected by the Arabs, and the ensuing conflict over territory led to the first Arab-Israeli war (1948–49) .",
  "At the close of the war, the State of Israel had captured additional territory, while Transjordan (now Jordan ) took control of the West Bank and Egypt took control of the Gaza Strip. Hundreds of thousands of Palestinians either fled or were expelled, most of them becoming stateless refugees, while hundreds of thousands of Jews fled or were expelled from Arab countries and were resettled in Israel. Palestinians, having no government of their own, organized themselves into many separate groups to promote a nationalist struggle. These groups were largely superseded by the establishment of the Palestine Liberation Organization (PLO) in 1964, an umbrella group promoting Palestinian self-determination.",
  "    Conflict between Israel and its Arab neighbours was renewed with the Six-Day War in 1967. Israel took control of the Gaza Strip and the West Bank, including East Jerusalem , as the Egyptian and Jordanian armies retreated. The Sinai Peninsula was among other territories captured by Israel in the war that were not claimed by the Palestinians. In 1979 the territory was returned to Egypt as part of a comprehensive peace agreement known as the Camp David Accords . That agreement, which solidified the idea of “land for peace” as a negotiating principle, included principles that laid the foundation for a two-state solution.",
  "In 1987 Palestinians living under Israeli rule began an uprising, known as the first intifada . The minister of defense Yitzhak Rabin initiated a harsh crackdown in an attempt to suppress the uprising. The determination of the Palestinians, however, convinced him and many other Israelis that permanent peace would not be possible without recognizing and negotiating with the Palestinians. While the Likud government of Yitzhak Shamir accepted dialogue with the PLO in Madrid in 1991, it came only after years of stalling and under intense pressure from the United States. In 1992 Rabin (now leader of the Labour Party ) was elected prime minister with a mandate to pursue peace with the PLO.",
  "In the 1990s a breakthrough agreement negotiated between Israeli and Palestinian leaders in Oslo, Norway, set out a process for a mutually negotiated two-state solution to be gradually implemented by the end of the decade. Although the process showed initial promise and progress, a combination of dissatisfaction and distrust led to the breakdown and delay of the process. After frustration and provocation led to the outbreak of violence in 2000, the process proved difficult to restart before coming to a virtual halt after 2008.",
  "  In 1993 Israel, led by Rabin’s foreign minister Shimon Peres , held a series of negotiations with the PLO in Oslo , Norway. In early September Yasser Arafat sent a letter to Rabin saying that the PLO recognized Israel’s right to exist, accepted UN Resolutions 242 and 338 (which called for lasting peace with Israel in exchange for Israel’s withdrawal to its pre-1967 borders), and renounced terrorism and violence. Days later they signed a Declaration of Principles (known as the Oslo Accords), agreeing to set up Palestinian self-government over five years’ time in exchange for Palestinian partnership in matters of Israeli security. The most contentious issues (including Jerusalem , final borders and Jewish settlements in the West Bank and the Gaza Strip, and the return of Palestinian refugees) were set to be discussed after that five-year period.",
  "  Negotiations continued as Israel and the PLO worked to implement a two-state solution on the ground. In May 1994 a deal concluded in Cairo led to the withdrawal of Israeli forces from the cities of Gaza and Jericho that same month and set up the Palestinian Authority (PA) to carry out civilian functions in those areas. The PA’s autonomous governance was extended to six other cities in 1995, after the conclusion of the Interim Agreement on the West Bank and the Gaza Strip (known as Oslo II). A seventh city, Hebron , was to be handed over in 1996. This agreement also split the West Bank and the Gaza Strip into three types of territory: areas under Palestinian administration and security (“Area A”), areas under Palestinian administration but joint Israeli-Palestinian security (“Area B”), and areas under Israeli administration and security (“Area C”).",
  "From the start, some Israelis and Palestinians sought to disrupt a two-state solution. Religious nationalists on both sides believed their respective governments did not have the right to cede any part of the land. In 1994, during the overlap of the Jewish festival of Purim and the Islamic holy month of Ramadan , Jewish extremist Baruch Goldstein opened fire on Muslim worshippers in the Sanctuary of Abraham above the Cave of Machpelah (also called the Tomb of the Patriarchs) in Hebron , a holy site frequented by both Jews and Muslims. The same year, Hamas , a militant Palestinian organization that likewise rejected a two-state solution, began a campaign of suicide bombings. On November 4, 1995, Rabin was assassinated by a Jewish extremist while attending a peace rally.",
  "As the election campaign to replace Rabin was underway, violence from the dissenters persisted. After a series of suicide bombings orchestrated by Hamas in early 1996, Benjamin Netanyahu (Likud Party), campaigning on a slogan of “peace with security,” won the election against key Oslo negotiator Peres. Upon becoming prime minister of Israel, Netanyahu initially refused to meet with Arafat or to implement Israel’s withdrawal from Hebron as agreed upon by his predecessor. Netanyahu and Arafat later agreed to a partial withdrawal from the city with the 1997 Hebron Agreement. In October 1998, five years after the Oslo Accords were signed and final status negotiations were supposed to take place, Netanyahu and Arafat concluded the Wye River Memorandum. Under this agreement, Israel was to continue a partial withdrawal from the West Bank while the PA was to implement a crackdown on Palestinian violence. The agreement was suspended the following month, however, after opposition in Netanyahu’s coalition threatened a vote of no confidence in the Knesset , Israel’s legislative body. Despite the suspension of the agreement, the Knesset voted no confidence anyway, and early elections were held.",
  "  In the 1999 elections the Labour Party was returned to power, and the new prime minister, Ehud Barak, pursued final status negotiations. Though negotiations progressed, a high-profile summit at Camp David fell through, and Barak’s premiership was short-lived. Negotiations were likewise disrupted with Likud leader Ariel Sharon ’s contentious visit in 2000 to the Temple Mount. The Temple Mount, which is also the site of Al-Aqṣā Mosque and the Dome of the Rock , is sacred to both Jews and Muslims and is located in a central area of Jerusalem claimed by both Israelis and Palestinians as part of their capital. The visit was seen as a deliberate provocation and sparked riots. Barak resigned in late 2000 before any final status agreements could be reached.",
  "  Sharon was elected in 2001 in the midst of the second intifada, which had been sparked by his visit in 2000 to the Temple Mount. Negotiations stalled as the Israeli-Palestinian conflict reached one of its most violent periods. Israeli troops reentered cities in the West Bank and confined Arafat to his compound in Ramallah until he fell gravely ill in 2004. Sharon, meanwhile, tried a new approach to the peace process in 2005 by unilaterally dismantling Jewish settlements in the Gaza Strip (along with four Jewish settlements in the West Bank) and withdrawing Israeli troops from the territory. Facing fierce opposition, especially within his own party, he formed a new party, Kadima , which was committed to the pursual of a two-state solution.",
  "Sharon suffered a massive stroke in early 2006, only months before elections. Ehud Olmert became acting prime minister and took the reins of Kadima, which became the dominant party in the Knesset after the elections. The PA also held legislative elections early that year, in which Hamas won a surprise majority. Although some leaders of Hamas now indicated a willingness to accept a two-state solution, as well as the bilateral agreements between Israel and the PA, Israel was unwilling to negotiate with a Hamas-led government.",
  "After armed infighting among factions in 2007, PA Pres. Mahmoud Abbas dissolved the government, leaving Hamas out of the PA. Peace talks between Israel and the PA commenced later that year with an international conference in Annapolis , Maryland, U.S. The negotiations continued into 2008 but failed to lead to a new deal after Olmert was forced to step down amid corruption charges. His foreign minister, Tzipi Livni , was unable to win the post of prime minister to replace him. The contents of the talks, which discussed final status issues, were leaked and published by Al Jazeera in 2011. Both sides seemed to accept on principle the division of Jerusalem and a symbolic number of Palestinians refugees to be repatriated into Israel. In one of the meetings, moreover, Olmert offered the Palestinian negotiators more than 93 percent of the territory they claimed in the West Bank.",
  "  Netanyahu was returned to the post of prime minister in 2009. President Abbas insisted that Netanyahu pick up negotiations where Olmert had left them and refused to meet without a freeze on building Jewish settlements on territory claimed by the Palestinians. Under pressure from the United States, Netanyahu implemented a freeze on settlements in the West Bank from November 2009 to September 2010. Because a freeze was not implemented for Jewish neighbourhoods in East Jerusalem, which Netanyahu insisted were not settlements, Abbas refused to meet until the last few weeks of the freeze. When the freeze ended, negotiations ceased. Direct talks did not occur again until Livni was appointed to resume the task in 2013–14. The talks fell apart after relations continued to falter and negotiators failed to make significant progress within the set timetable.",
  "After years of negotiations at a standstill, the administration of U.S. Pres. Donald Trump announced its intent to revive the peace process in 2017. Though both Israeli and Palestinian leaders initially reacted to the initiative with optimism, the Palestinians were disheartened when the United States recognized Jerusalem as Israel’s capital in December 2017 and moved its ambassadorial mission to that city the following May. As tensions brewed between the United States and the PA, the United States began to cut funding to the PA, as well as to UNRWA (United Nations Relief and Works Agency for Palestinian Refugees in the Near East) and other aid programs, arguing that the support was not in accordance with the U.S. national interest. The country also ordered the closure of the PLO office in Washington, D.C., citing its recent lack of negotiations with Israel.",
  "By the time the Trump administration unveiled its peace plan, which it touted as the “Deal of the Century,” the Palestinians had determined that the United States could no longer play a fair role as mediator in the conflict. The first part of the plan, which proposed significant development in the economy and infrastructure of the Palestinian territories, was announced in June 2019. The second part of the plan, the political component, was released in January 2020 and envisioned predetermined solutions to final status issues: Israel would keep nearly all of its West Bank settlements, impose sovereignty over the Jordan Valley located along the West Bank’s eastern border, and retain an undivided Jerusalem as its capital, while Palestinians would receive demilitarized self-governance within a reduced West Bank territory and the Gaza Strip. The plan, which was received favourably by Israeli leaders but condemned by Palestinian leaders, did little to revitalize negotiations before the end of Trump’s presidency. In 2021 the administration of U.S. Pres. Joe Biden began restoring aid to the Palestinians and promised to reopen the PLO office in Washington, D.C."
]