[
  " I Know Why the Caged Bird Sings , the first of seven autobiographical works by American writer Maya Angelou , published in 1969. The book chronicles her life from age 3 through age 16, recounting an unsettled and sometimes traumatic childhood that included rape and racism . It became one of the most widely read and taught books written by an African American woman.",
  "The prologue describes an event in which Angelou, as a small child, is reciting a poem in church. Feeling ugly because she imagined in vain that the dress her grandmother made her would be so pretty that she would be seen as a beautiful white child, she forgets the poem and then wets her pants as she flees the church in embarrassment.",
  "The story begins in 1931, as Maya, age three, and her elder brother, Bailey, are sent to Stamps, Arkansas , to live with their paternal grandmother, whom they call Momma, after their parents’ breakup. Momma owns the only store in the African American part of town. The children settle into life with Momma, helping her at the store and learning to read and do arithmetic. One night a former sheriff warns Momma to hide her disabled son because white men are planning revenge after a Black man “messed with” a white woman. Later a group of young white girls ridicule Momma while she stands, dignified and unmoving, outside the store. When the Great Depression hits, Momma keeps the store from going under by allowing customers to trade their rations for goods. One Christmas , Maya and Bailey receive gifts from their parents, whom they assumed to be dead. A year later their father, Daddy Bailey, arrives in a fancy car, and he takes Maya and Bailey to St. Louis to live with their mother, the beautiful Vivian.",
  "At first they stay with Vivian’s mother and their uncles. At school, Maya and her brother are more advanced than the other students, and they are moved up a grade. Later the children move in with Vivian and her boyfriend, Mr. Freeman. Mr. Freeman begins molesting eight-year-old Maya, threatening to kill Bailey if she tells anyone. One day he rapes her, and she conceals her stained underwear under the mattress. When changing the linens, Bailey and Vivian find the garment and realize what happened. During Mr. Freeman’s trial, Maya lies when asked whether he touched her before the rape. Later Mr. Freeman is found dead, apparently having been beaten to death. Feeling guilty, Maya stops speaking to anyone except Bailey. After a few months of her silence, Maya and Bailey are sent back to Momma.",
  "Maya is relieved to be back in Stamps, but she continues her silence. Eventually, the sophisticated Mrs. Bertha Flowers takes Maya under her wing, telling her that it is important to speak and giving her books to read aloud, and she begins talking again. At the age of 10, Maya is sent to work for a white woman, who calls her Mary rather than her name (Marguerite). Offended, Maya breaks some china in order to get fired. Later, Bailey is upset when he sees a movie starring Kay Francis because he thinks the actress looks just like Vivian, and he makes an unsuccessful attempt to return to his mother. Maya later makes her first friend, Louise Kendricks, a girl from school. During this time, Maya continues to encounter racism. When she develops cavities, Momma takes her to the white dentist who borrowed money from Momma during the Depression, but he refuses to treat the child, and they have to take a bus to the closest Black dentist. Bailey later sees the decaying corpse of a Black man pulled out of a pond, and a white man makes him help some Black men carry the body into the jail. After the incident, Momma decides to take Maya and Bailey back to their mother.",
  "Maya and Bailey move with their mother to Oakland , California. There Maya attends a school in which she is one of only three Black students. When she is 14 years old, she is awarded a scholarship to the California Labor School, where she studies drama and dance. Vivian’s new husband, Daddy Clidell, becomes a genuine father figure to Maya.",
  "Maya spends a summer in southern California with Daddy Bailey and his girlfriend, Dolores. Dolores and Maya do not get along. One day, Daddy Bailey takes Maya with him on a shopping trip to Mexico. Maya enjoys the excursion until she loses track of her father, who eventually returns to their car too drunk to drive. Although she has never driven before, Maya manages to drive them to the border, where she hits another car. At this point, Daddy Bailey wakes up, pacifies the other driver, and then drives the rest of the way home. Upon their return, Daddy Bailey and Dolores argue, and he walks out. Maya tries to console Dolores, but Dolores insults Vivian, leading Maya to slap her. Dolores then cuts Maya, who decides to run away. After spending a night in a junkyard, she awakens to find a community of Black, white, and Mexican runaways living there. She stays for a month and then returns to Vivian.",
  "In the meantime, Bailey has become friends with “a group of slick street boys” and begun dating a white prostitute. At the age of 16 he leaves home, to his sister’s great sorrow. Maya browbeats the transit company into hiring her as the first female African American streetcar conductor in San Francisco . However, after spending one semester at the job, she returns to school. She later reads the lesbian novel The Well of Loneliness (1928) by Radclyffe Hall , and, misunderstanding what lesbianism is, she begins to fear that she might be a lesbian. Though Vivian tries to reassure her, she is not assuaged, and she determines to have sex with a boy. The encounter is unpleasant, and it results in Maya’s becoming pregnant. On Bailey’s advice, she keeps the news to herself and returns to school. After graduating from high school, Maya tells Vivian and Daddy Clidell, who are fully supportive. After Guy is born, Vivian assures Maya that she will be a good mother.",
  "The book’s title came from the poem “Sympathy” by Paul Laurence Dunbar . Against the backdrop of racial tensions in the South , Angelou confronted the traumatic events of her childhood and explored the evolution of her strong identity as an African American woman. Her individual and cultural feelings of displacement were mediated through her passion for literature, which proved both healing and empowering.",
  "After the 1968 assassination of Martin Luther King, Jr. , Angelou was inspired by a meeting with writer James Baldwin and cartoonist Jules Feiffer to write I Know Why the Caged Bird Sings as a way of dealing with the death of her friend and to draw attention to her own personal struggles with racism. The book was immediately popular and remained on best-seller lists for two years. Angelou cowrote the screenplay for the 1979 television movie version of the story, which starred Esther Rolle as Momma and Diahann Carroll as Vivian."
]