[
  " Second Great Awakening , Protestant religious revival in the United States from about 1795 to 1835. During this revival, meetings were held in small towns and large cities throughout the country, and the unique frontier institution known as the camp meeting began. Many churches experienced a great increase in membership, particularly among Methodist and Baptist churches. The Second Great Awakening made soul-winning the primary function of ministry and stimulated several moral and philanthropic reforms, including temperance and the emancipation of women. Generally considered less emotional than the Great Awakening of the early 18th century, the second wave of evangelical revivalism led to the founding of numerous colleges and seminaries and to the organization of mission societies across the country.",
  "The Second Great Awakening can be divided into three phases. The first phase (1795–1810) was associated with frontier camp meetings conducted by American preachers James McGready, John McGee, and Barton W. Stone in Kentucky and Tennessee . The second and more conservative phase of the awakening (1810–25) centred in the Congregational churches of New England under the leadership of theologians Timothy Dwight , Lyman Beecher , Nathaniel W. Taylor, and Asahel Nettleton. The third and final phase (1825–35) stemmed from the activities of evangelist Charles Grandison Finney , who began his revivalism in small towns in western New York in the 1820s but eventually conducted revival meetings in the largest cities in the United States and Britain.",
  "During the Second Great Awakening revivalistic theology in many denominations shifted from Calvinism to a practical Arminianism as preachers emphasized the ability of sinners to make an immediate decision for their salvation ; theological differences almost disappeared among evangelical churches. Moreover, under Finney’s aegis a rationale for carefully contrived revival techniques evolved. After 1835 an irregular corps of professional revival experts traveled through the towns and cities of America and Britain organizing annual revival meetings at the invitation of local pastors who wanted to reinvigorate their churches. Although many American Protestants lost interest in revivalism in the first half of the 20th century, tent revivals as well as annual revivals in churches in the South and Midwest continued to be an important feature of Protestant church life."
]