[
  " projection , the mental process by which people attribute to others what is in their own minds . For example, individuals who are in a self-critical state, consciously or unconsciously , may think that other people are critical of them. The concept was introduced to psychology by the Austrian psychoanalyst Sigmund Freud (1856–1939), who borrowed the word projection from neurology , where it referred to the inherent capacity of neurons to transmit stimuli from one level of the nervous system to another (e.g., the retina “projects” to the occipital cortex, where raw sensory input is rendered into visual images). In contemporary psychological science the term continues to have the meaning of seeing the self in the other. This presumably universal tendency of the human social animal has both positive and negative effects. Depending on what qualities are projected and whether or not they are denied in the self, projection can be the basis of both warm empathy and cold hatred.",
  "In projection, what is internal is seen as external. People cannot get inside the minds of others; to understand someone else’s mental life, one must project one’s own experience. When someone projects what is consciously true of the self and when the projection “fits,” the person who is the object of projection may feel deeply understood. Thus, a sensitive father infers from his daughter’s facial expression that she is feeling sad; he knows that when he himself is sad, his face is similar. If he names the child’s assumed emotion , she may feel recognized and comforted. Intuition , leaps of nonverbal synchronicity (as when two persons in a relationship suddenly find themselves making similar gestures or thinking of the same image simultaneously), and peak experiences of mystical union (as when one feels perfectly attuned with an idealized other person, such as a romantic partner) involve a projection of the self into the other, often with powerful emotional rewards. Neuroscientific discoveries regarding mirror neurons and right-brain-to-right-brain communication processes (in which intuitive, emotional, nonverbal, and analogical thinking is shared between caregivers and children via intonation, facial affect, and body language) are establishing the neurological bases of such long-noted projective phenomena.",
  "On the other hand, projection frequently functions as a psychological defense against painful internal states (“I am not the person feeling this; you are!”). When people project aspects of the self that are denied, unconscious, and hated and when they distort the object of projection in the process, projection can be felt as invalidating and destructive. At a social level, racism , sexism , xenophobia, homophobia , and other malignant “othering” mindsets have been attributed at least partly to projection. There is research evidence, for example, that men with notably homophobic attitudes have higher-than-average same-sex arousal, of which they are unaware. Projection of disowned states of mind is also a central dynamic in paranoia as traditionally conceptualized. Paranoid states such as fears of persecution, irrational hatred of an individual or group, consuming jealousy in the absence of evidence of betrayal, and the conviction that a desired person desires oneself (i.e., erotomania, the psychology behind stalking ) result from the projection of unconscious negative states of mind (e.g., hostility, envy, hatred, contempt, vanity, sadism , lust, greed, weakness, etc.). In other words, paranoia involves both the disowning of a personal tendency and the conviction that this tendency is “coming at” oneself from external sources.",
  "The Austrian-born British psychoanalyst Melanie Klein (1882–1960) wrote about a primal form of projection, “projective identification,” that she assumed to derive from the earliest mental life of children, before they feel psychologically separate from caregivers. Via this process, which has become an important concept in contemporary psychoanalytic thinking, a person tries to expel a state of mind by projecting it but remains identified with what is projected, is convinced of the accuracy of the attribution, and induces in the object of projection the feelings or impulses that have been projected. For example, a man in a rage projects his anger onto his wife, whom he now sees as the angry one. He insists it is her hostility that stimulated his rage, and almost immediately his wife becomes angry. Projective identification exerts emotional pressure that evokes in the other whatever has been projected. Another example: A woman in psychotherapy experiences her therapist’s ending a session on time as a sadistic attack. She loudly berates him for abusing her, accusing him of enjoying hurting her. In response to this denunciation and its misrepresentation of his motives, the normally compassionate therapist notices that he is having sadistic thoughts. The projection has become a self-fulfilling fantasy. Because projective identification is a particularly challenging defense to deal with in psychotherapy, it has spawned an extensive psychoanalytic literature.",
  "Contrary to widespread professional opinion, however, projective identification is not simply a defense used by people with disorders of development and personality ( see also  mental disorders: Personality disorders ). It operates in everyday life in numerous subtle ways, many of which are not pathological. For example, when what is projected and identified with involves loving, joyful affects, a group can experience a rush of good feeling. People in love can sometimes read one another’s minds in ways that cannot be accounted for logically. Because such emotional contagion occurs ubiquitously, many contemporary psychoanalysts have reframed as “intersubjective” what was once seen as the patient’s one-way projection onto the therapist. That is, both parties in a therapeutic relationship (or any relationship) inevitably share a mutually determined emotional atmosphere.",
  "Klein’s writing led to a general professional acknowledgment that projection has more primitive and more mature forms. In its earliest expressions, self and other are not well differentiated. In mature projection, the other is understood to have a separate subjective life, with motives that may differ from one’s own. Before age three, children tend to assume that the emotional effect of an action was its intention. When caregivers set unwelcome limits, very young children react with normal, temporary hatred and accuse the parents of hating them. A slightly older child understands that when his mother’s limit-setting angers him, her act does not necessarily mean she is angry with him. Philosophers use the term “theory of mind” to denote this capacity to see others as having independent subjectivities. Contemporary psychoanalytic theorists and researchers refer to it as “mentalization.” Although a benign use of projection is the basis for understanding others’ psychologies, in mentalization there is little distortion of the other person’s mind because there is no automatic equation of it with the mind of the observer.",
  "Empirical studies of defense mechanisms have supported clinical observations about projection, including the idea that it is one of many universal psychological defenses that evolve and mature in normal development. Understanding projection has been critically important to psychiatry, clinical psychology, counseling, and the mental health professions generally. It has also been cited as an explanatory principle in political science , sociology , anthropology , and other social sciences .",
  "Classic works on psychological projection include Sigmund Freud , “Psycho-analytic Notes on an Autobiographical Account of a Case of Paranoia ( Dementia Paranoides )” (1911), in James Strachey (ed.), The Standard Edition of the Complete Psychological Works of Sigmund Freud (1953–74), vol. 12, pp. 1–82; and Melanie Klein , “Notes on Some Schizoid Mechanisms,” in The International Journal of Psycho-Analysis , 27:99–110 (1946). Freud’s theory of projection is discussed in Anne Hurry , Jack Novick , and Kerry Kelly Novick , “Freud’s Concept of Projection,” in the Journal of Child Psychotherapy , 4(2):75–88 (1976).",
  "More recent theorizing and research are presented in Phebe Cramer , “Defense Mechanisms: 40 Years of Empirical Research,” in the Journal of Personality Assessment 97(2):114–122 (2014); Peter Fonagy and Patrick Luyten , “Attachment, Mentalizing, and the Self,” in W. John Livesley and Roseann Larstone (eds.), Handbook of Personality Disorders , pp. 123–140 (2018); and Joseph Sandler (ed.), Projection, Identification, Projective Identification (1988, reprinted 2018)."
]