[
  " sexual reproduction , the production of new organisms by the combination of genetic information of two individuals of different sexes. In most species the genetic information is carried on chromosomes in the nucleus of reproductive cells called gametes , which then fuse to form a diploid zygote . The zygote develops into a new individual. Sexual reproduction is the dominant form of reproduction in living beings.",
  "Sexual reproduction allows for the reshuffling of genetic material, both within and between individuals of one generation, resulting in the potential for an extraordinary array of offspring, each with a genetic makeup different from that of its parents. In the sexual reproduction of all organisms except bacteria , there is one common feature: haploid, uninucleate gametes are produced that join in fertilization to form a diploid, uninucleate zygote. At some later stage in the life history of the organism, the chromosome number is again reduced by meiosis to form the next generation of gametes. The gametes may be equal in size (isogamy), or one may be slightly larger than the other (anisogamy); the majority of forms have a large egg and a minute sperm (oogamy). The sperm are usually motile and the egg passive, except in higher plants, in which the sperm nuclei are carried in pollen grains that attach to the stigma (a female structure) of the flower and send out germ tubes that grow down to the egg nucleus in the ovary. Some organisms, such as most flowering plants , earthworms , and tunicates , are bisexual (hermaphroditic, or monoecious)—i.e., both the male and female gametes are produced by the same individual. All other organisms, including some plants (e.g., holly and the ginkgo tree) and all vertebrates , are unisexual (dioecious): the male and female gametes are produced by separate individuals.",
  "In animals, fertilization—that is, the uniting of the gametes—can be either internal or external. In external fertilization, the male releases sperm over eggs that have been released by a female. This form of fertilization is used by many invertebrates and by most fish and amphibians . In internal fertilization, the sperm unites with the egg within the body of an adult. In the vast majority of cases, fertilization takes place within the body of the female.",
  "Sexual reproduction in plants also requires the uniting of male and female gametes. There is a much greater variety of structures and strategies used by plants. In general, flowers and cones are the locus of fertilization in plants."
]