[
  "  lunar eclipse , the Moon entering the shadow of Earth , opposite the Sun , so that Earth’s shadow sweeps over the Moon’s surface. An eclipse of the Moon can be seen under similar conditions at all places on Earth where the Moon is above the horizon. Lunar eclipses occur only at full moon and do not occur every month because the plane of the Moon’s orbit is inclined to that of Earth’s orbit around the Sun (the ecliptic) by about 5°. Therefore, at most new and full moons, Earth, the Sun, and the Moon are not in a straight line. See also  eclipse ; solar eclipse .",
  "The motion of the Moon around Earth is from west to east. For an observer facing south, the shadowing of the Moon begins at its left edge (if the Moon were north of the observer, as, for example, in parts of the Southern Hemisphere, the opposite would be true). After a part of the Moon’s surface is in the umbra and thus darkened, the Moon is said to be in partial eclipse. If the eclipse is a total one and circumstances are favourable, the whole disk of the Moon will pass through the umbra , the darkest part of the shadow, in about two hours. During this time the Moon is usually not completely dark. A part of the sunlight, especially the redder light, penetrates Earth’s atmosphere , is refracted into the shadow cone, and reaches the Moon. Meteorological conditions on Earth strongly affect the amount and colour of light that can penetrate the atmosphere. Generally, the totally eclipsed Moon is clearly visible and has a reddish brown, coppery colour, but the brightness varies strongly from one eclipse to another.",
  "  Before the Moon enters the umbra and after it leaves the umbra, it must pass through the penumbra , or partial shadow. The dimming of the Moon’s illumination by the penumbra is so slight as to be scarcely noticeable, and penumbral eclipses are rarely watched. When the border between the umbra and penumbra is visible on the Moon, the border is seen to be part of a circle, the projection of the circumference of Earth. This is a direct proof of the spherical shape of Earth, a discovery made by the ancient Greeks. Because of Earth’s atmosphere, the edge of the umbra is rather diffuse, and the times of contact between the Moon and the umbra cannot be observed accurately.",
  "During the eclipse the surface of the Moon cools at a rate dependent on the constitution of the lunar soil, which is not everywhere the same. Many spots on the Moon sometimes remain brighter than their surroundings during totality—particularly in their output of infrared radiation —possibly because their heat conductivity is less, but the cause is not fully understood.",
  "  In most calendar years there are two lunar eclipses; in some years one or three or none occur. An observer remaining at the same place (and granted cloudless skies) could see 19 or 20 lunar eclipses in 18 years. Over that period three or four total eclipses and six or seven partial eclipses may be visible from beginning to end, and five total eclipses and four or five partial eclipses may be at least partially visible. All these numbers can be worked out from the geometry of the eclipses. A total lunar eclipse can last as long as an hour and three-quarters, but for a solar total eclipse maximum duration of totality is only 7  1  2  minutes. This difference results from the fact that the Moon’s diameter is much smaller than the extension of Earth’s shadow at the Moon’s distance from Earth, but the Moon can be only a little greater in apparent size than the Sun."
]