[
  " rhythm , in poetry, the patterned recurrence, within a certain range of regularity, of specific language features, usually features of sound. Although difficult to define, rhythm is readily discriminated by the ear and the mind, having as it does a physiological basis. It is universally agreed to involve qualities of movement, repetition, and pattern and to arise from the poem’s nature as a temporal structure. Rhythm, by any definition, is essential to poetry ; prose may be said to exhibit rhythm but in a much less highly organized sense. The presence of rhythmic patterns heightens emotional response and often affords the reader a sense of balance.",
  " Metre , although often equated with rhythm, is perhaps more accurately described as one method of organizing a poem’s rhythm. Unlike rhythm, metre is not a requisite of poetry; it is, rather, an abstract organization of elements of stress, duration, or number of syllables per line into a specific formal pattern. The interaction of a given metrical pattern with any other aspect of sound in a poem produces a tension, or counterpoint, that creates the rhythm of metrically based poetry.",
  "Compared with the wide variety of metrical schemes, the types of metrically related rhythms are few. Duple rhythm occurs in lines composed in two-syllable feet, as in Shakespeare’s line",
  " ",
  "In metrical schemes based on three-syllable feet, the rhythm is triple:",
  " ",
  "Rising rhythm results when the stress falls on the last syllable of each foot in a line:",
  " ",
  "The reverse of this is falling rhythm:",
  " ",
  "Running, or common, rhythm occurs in metres in which stressed and unstressed syllables alternate (duple rhythm, rising or falling). Gerard Manley Hopkins, in reaction against traditional metres, coined the term sprung rhythm to apply to verse wherein the line is measured by the number of speech-stressed syllables, the number of unstressed syllables being indeterminate.",
  "The rhythms of free verse derive from the systematic repetition of language elements other than metrical stress patterns. Differentiation between the rhythmical basis of free verse and that of metrical verse involves a relative, rather than an absolute, distinction regarding the range of language features considered and the extent to which they are patterned. Since metrical verse is principally concerned with the distribution of relative stress values, it does not account for the significance of other linguistic features that may contribute to rhythmic effect. In free verse, rhythm most commonly arises from the arrangement of linguistic elements into patterns that more nearly approximate the natural cadence of speech and that give symmetry to the verse. The rhythmical resources available to free verse include syntactical patterning; systematic repetition of sound, words, phrases, and lines; and the relative value of temporal junctures occasioned by caesura (a marked pause in the middle of a line), line length, and other determinants of pace. Some authorities recognize in the highly organized patterning of imagery a further source of poetic rhythm. The following lines from Walt Whitman ’s “Song of Myself” illustrate many of these rhythmical devices:",
  "The rhythms that are characteristic of particular poets are sometimes ascribed to units of breath, as in the essay “Projective Verse” (1950) by the poet and critic Charles Olson : “And the line comes (I swear it) from the breath, from the breathing of the man who writes, at the moment that he writes.”"
]