[
  " 24-hour clock , time convention that begins the day at 00:00 and ends at 23:59, although 24:00 can be used to refer to 00:00 of the following day. The 24-hour clock is the international standard format for time (ISO 8601) and is currently the most widespread time notation worldwide. Professionals in areas as diverse as medicine and aviation widely make use of it, even in cultural contexts that are accustomed to the 12-hour clock , which divides the day into two 12-hour periods, am and pm .",
  "The ancient Egyptians are seen as the originators of the 24-hour day. The New Kingdom, which lasted from 1550 to 1070 bce , saw the introduction of a time system using 24 stars, 12 of which were used to mark the passage of the night. Hours were of different length, however, as summer hours were longer than winter hours. The ancient Greek astronomer Hipparchus later suggested splitting the day into 24 equinoctial hours. The medieval Muslims were especially interested in sundials and invented the now-ubiquitous sundial with the gnomon (the vertical needle of the dial) parallel to the polar axis of Earth. The 13th-century scholar Abū al-Ḥasan al-Marrakushi is credited with introducing equal hours, at least for astronomical purposes. Despite these efforts, variable-length, or seasonal, hours purportedly persisted until the 14th century in Europe.",
  "With the advent of mechanical clocks in the early 14th century, sundials with equal hours gradually came into general use in parts of Europe. The 24-hour dial became quite established in Italy in the 15th century, thereby underlining its allegiance to the 24-hour day. The so-called Italian hours referred to the 24-hour period lasting from sunset or 30 minutes after dusk until the following sunset. In countries such as England, however, time was measured by means of two periods of 1 to 12 shown on the dial. The Italian 24-hour dial was soon used in neighbouring countries as well, but the 24-hour clock system was considered impractical for striking clocks, which had to be moved ahead during the first six months of the year and moved back later. The double-XII sundial (a 12-hour system), on the other hand, allowed hours to be counted from noon, rather than from dawn. Noon was purportedly simpler to identify because of the position of the shadow it cast. Until the 19th century, sundials of both time conventions were still used to reset mechanical clocks.",
  " A Pioneer of Imperial Federation in Canada  Railway engineer Sir Sandford Fleming was an important advocate for the 24-hour clock in the 1800s, having missed a train in Ireland due to a misprinted schedule that listed pm rather than am . He also supported the adoption of standard time zones and a prime meridian . This initiative was taken further by Lewis Rutherfurd at the International Meridian Conference in 1884, who wished for a 24-hour universal day based on the initial meridian, namely Greenwich . This would give rise to Coordinated Universal Time (known as UTC) or Greenwich Mean Time (GMT). The global expansion of the 24-hour clock was allegedly pioneered by the Canadian Pacific Railway , which began to use it in 1886. Several countries officially adopted it, starting with Italy in 1893, followed by Denmark in 1916 and Greece the following year. Several other European and Latin American countries started using it by the early 1920s, whereas Turkey and Germany would adopt it in 1925 and 1927, respectively. As regards the military, the French Army and British Royal Navy began to use it in 1909 and 1915, respectively, while Canada adopted it in 1917. The British Army embraced the system in 1918, while the U.S. Navy adopted it in 1920, becoming the first U.S. organization to do so. The U.S. Army, however, did not start using it before 1942.",
  "The 24-hour clock is closely related to the military in the United States, with which it is often associated, as testified by the term military time . In this context, four numbers precede a letter which represents a given time zone. Z, for instance, represents UTC or GMT, used by countries such as the U.K., Ireland, and Portugal during Daylight Savings Time , while A refers to UTC+1 or Central European Time (CET), used by France, Italy, and other nations. During oral communication, code words from the NATO Phonetic Alphabet are used to prevent misunderstandings, as exemplified by Zulu for Z and Alpha for A. The designation J, on the other hand, refers to the time where the person is making the utterance and is thus strictly dependent on their location. A full hour is represented by means of the term hundred , as exemplified by zero six hundred hours for 06:00 or twenty-three hundred hours for 23:00. This is omitted on other occasions, as exemplified by zero seven thirty hours for 07:30 and by seventeen forty-five hours for 17:45.",
  "This chart converts times from the 24-hour clock to the 12-hour clock :"
]