[
  "  hexagon , in geometry , a six-sided polygon . In a regular hexagon, all sides are the same length, and each internal angle is 120 degrees. The area of a regular hexagon is commonly determined with the formula: area =  3√3  2  × side 2  In an irregular hexagon, the sides are of unequal length, and each internal angle can be more or less than 120 degrees. Regular hexagons can be used to pack the most number of units into a flat plane with no wasted space and with a minimum perimeter. Hexagons are not only commonly found in nature, they are also used in various types of human designs and data displays.",
  "    Honeycombs, snowflakes, the compound eyes of various insects, benzene and other cyclic compounds, and certain types of minerals are among the most well-known examples of hexagonal structures in nature.",
  "   Honeybees build their honeycombs with wax they produce, so they need a form that makes the most efficient use of this precious wax resource. The regular hexagon fits this requirement, allowing bees to fit the most cells into a honeycomb. Their hexagonal cells are nearly the exact same size with the same precise wall thickness across hives.",
  "In the past, this remarkable engineering feat was attributed mainly to the way bees evolved. Yet researchers have pointed out that simple laws of physics may also be at work, citing the example of floating rafts of bubbles. When the bubbles reach a certain number, they naturally change from spherical to hexagonal-faced structures as a more efficient way to fill the space. In a similar manner, the cells that bees make have a somewhat circular shape at first while the wax is still soft. It is possible that as the number of cells increases, the surface tension around them rises, and the circles gradually form into hexagons, hardening into the familiar hexagonal honeycomb pattern.",
  "  The laws of physics are also at work when six-sided snowflakes form. Depending on the weather conditions, snowflakes often begin as small regular hexagonal plates, formed by water molecules as they freeze. Because each of the hexagon’s internal angles is 120 degrees, such a plate has an unusually stable structure. As this plate tumbles through the clouds, exposed to different temperatures and levels of moisture, crystal arms grow from each of the six outside corners. When all corners are exposed to the same conditions, the arms grow into the symmetrical crystals seen in some snowflakes.",
  "  One of the most striking examples of hexagonal structures in minerals are basalt columns, as seen in the Devils Postpile National Monument in California and the Giant’s Causeway in Northern Ireland. Basalt columns are formed by lava outflows that cool and begin to shrink. The shrinking creates surface tension that produces cracks in the basalt. It turns out that cracks at 120 degrees release the most tension. Gradually the cracks create the hexagonal columns of basalt, although most of them are irregular. If all parts of the lava had cooled at the same rate, the basalt columns would all be regular hexagons.",
  "  There are only a few minerals whose internal structure is classified under the hexagonal system. They include calcite , dolomite , quartz , apatite , emerald , and ruby . Their structures allow light to travel through the crystals at difference speeds and at different angles.",
  "  Hexagons have a long history in human designs, particularly in tile patterns and in some architectural structures. More recently, hexagons have also been used to represent geographic data on computer-generated maps.",
  "Hexagon tiles can be tessellated, or arranged in a repeating pattern without gaps or overlaps, to fill a floor or wall space efficiently. Both regular and irregular hexagons can be used to create a variety of highly original, artistic designs. Hexagonal tiles often represent a more efficient, less costly use of materials than other tile shapes.",
  "  Hexagons are also used as architectural elements. Several well-known buildings, such as the New York Supreme Court Building, the Museum of Jewish History in Manhattan, and the Berlin-Tegel Airport were built using a six-sided design. In addition, the pulpits in many historical churches were built in a hexagonal shape not only for strength and durability but to represent the sacred number six, referring to the six days of creation. In material design engineering, synthetic, composite materials comprised of hexagonal forms can have minimal density and relatively high out-of-plane compression and shear properties, and may prove useful in the construction of tall buildings. The Sino Steel International Plaza T2 in Tianjin, China, is set to be the first super tall building to implement a hexagonal grid structure system for the exterior tube structure.",
  "The regular hexagon is also used to represent 3D geographic features and other geospatial data, such as population density, on 2D computer-generated maps. Hexagons not only can be tessellated in an evenly spaced grid, but they also allow curvatures in the 3D patterns of geographic and other data to be seen more accurately. For example, on maps depicting a large area of Earth’s curved surface, a hexagonal grid will show less distortion than will a typical square grid."
]