[
  "  eye colour , heritable phenotypic (observable) trait determined by pigmentation and light scattering in the iris of the eye . The iris is a ring of muscle and collagen fibres around a central opening, known as the pupil , through which light passes. The colour of the iris is commonly described by simple terms, such as blue, gray, green, hazel, or brown. However, eye colour varies across a continuous spectrum, such that formal classification schemes for eye colour range from simple three-colour systems to considering multiple colours within one eye. Eye colour is also affected by the variable light available in the environment, resulting in different perceptions of an individual’s eye colour.",
  "The most common colour of iris pigmentation is brown; global estimates suggest that about 79 percent of individuals have brown eyes. The global estimate for the percentage of persons with blue eyes is about 10 percent of the population, the percentage of persons with hazel eyes about 5 percent, and the percentage of persons with green eyes about 2 percent. The incidence of each eye colour varies geographically and in subpopulations.",
  "Eye colour has been recognized as a heritable trait since the early 1900s, when researchers began to study patterns in eye colour in children and their parents and found that brown eye colour is consistently dominant over blue eye colour. The genetics underlying human eye colour was once thought to be quite simple, following Mendelian dominant and recessive heredity . However, the factors that influence eye colour are actually far more complex, with multiple genes coding for different factors related to eye colour. Although the contributions of some genes, such as OCA2 and HERC2 , are well understood, the specific roles of other genes involved in determining eye colour are less clear. In addition, still other genes likely determine iris patterning, such as pigment (or peripupillary) rings and furrows, which also appear to be heritable.",
  "Variation in eye colour comes primarily from interactions between the iris and the light that enters the eye, which are of two types, reflection and scattering. The amount and distribution of the pigment melanin present in the iris impacts light reflection, such that greater amounts of melanin reflect more wavelengths of light, making eyes appear darker. The amount of collagen in the iris that is unobstructed by melanin or other materials determines the amount of light that is scattered. Collagen fibres selectively scatter short, blue wavelengths of light, making eyes appear blue.",
  "There are two major types of melanin in the iris, eumelanin, which produces a dark brown colour, and pheomelanin, which produces colours such as green and hazel. A mix of eumelanin and pheomelanin is associated with brown eye colour, whereas low amounts of eumelanin are associated with blue eye colour. The amount of melanin present in the iris can vary due to the number, size, and shape of melanosomes, organelles that store melanin within melanocytes (melanin-producing cells) in the skin and eyes.",
  "Assessing variation in eye colour is complicated by iris patterning, which can influence perceptions of eye colour. Iris patterns add variation in eye colour, making a single category an incomplete description of the colours in an eye. For example, a pigment ring is a distinct inner band of a different colour immediately around the pupil. Fuchs’ crypts are pits between collagen fibres that look like pigment-free windows to deeper tissue. A nevus is a small spot of pigment on or in the eye that resembles a freckle. Wölfflin nodules are light spots in the periphery of the iris that are formed by the clustering of collagen fibres. Contraction furrows are folds in iris tissue that resemble thin lines ringing the pupil. Conjunctival melanoma is a cancerous condition marked by the appearance of a pigmented lesion on the surface of the eye.",
  "Diverse industries, from fashion to medicine and criminal forensics, are interested in eye colour. The fashion industry has produced decorative contact lenses that change the appearance of eye colour or of the patterning of the iris, despite warnings from the medical community that unprescribed contact lenses can seriously damage the eyes. Scientists are interested in how genetic eye colour traits are associated with specific heritable health conditions, since genes that determine eye colour can also influence other traits. For example, Brushfield spots, visible white or gray spots caused by overgrowth and accumulation of connective tissue in the iris, are an iris pattern component that occurs in some persons with Down syndrome . Such associations can be diagnostic tools. Criminal investigators are interested in the genetics of observable eye colour traits, since the eye colour of a person can be determined by analyses of crime scene DNA , facilitating the identification of suspects."
]