[
  " flat Earth , the perception that Earth exists as a flat disk, either circular or square-shaped. This view persisted in the ancient world until empirical observations revealed that Earth’s shape was spherical or ellipsoidal . In modern times, however, the notion of a flat Earth has been revived and promoted on social media despite scientific evidence to the contrary.",
  "  To observe Earth’s curved horizon , one must be at least 10,668 metres (about 35,000 feet) above its surface. Since the technology of ancient cultures was insufficient to allow people to reach such heights, the world around them appeared to be flat and stationary. Their perceptions were further reinforced by the movements of the Sun and the Moon , which appear to rise in the east and set in the west relative to a flat horizon, and of the stars , which appear to rotate in a dome overhead.",
  " bce bce  Different descriptions of a flat Earth can be found in the annals of ancient civilizations worldwide. For example, ancient Egyptian and Mesopotamian records describe the world as a disk in the ocean with the heavens arching above it. An Iraqi tablet dated to 1000 bce shows Babylon at the centre of a flat disk, and the Greek philosopher Anaximander (610–546 bce ) perceived Earth as a flat disk perched at the top of a cylinder . In Norse cosmology, Earth’s flat plane is encircled by an ocean, with a world tree or pillar at the centre. In India some sacred texts describe the planet as a series of stacked flat disks, while others describe it as a horizontal wheel set on a vertical axle . In China Earth was described as flat and square into the 17th century, at which time Western science introduced evidence for the planet’s spherical shape ( see also  spherical Earth ).",
  "The idea that Earth is flat seems to have an enduring hold on human imagination. In the 1830s a commune in Britain, led by British writer Samuel Birley Rowbotham, resurrected the concept as backlash against rapid scientific progress. Members believed that Earth was a circular disk with the North Pole at the centre and a wall of ice surrounding the edges of the disk to contain the oceans. The group was regarded as a harmless symbol of British eccentricity.",
  "What would become the modern flat Earth concept emerged modestly in the 1950s as the Flat Earth Society, a small fringe group in Britain with a membership of fewer than 4,000 people. However, largely due to the rising influence of the Internet and social media in the early 2000s, the organization launched itself worldwide in October 2009, and annual conferences followed and catered to a variety of worldviews. Some of the society’s models echo the ancient view of Earth as a disk with a dome of stars rotating above it. The models of other groups, however, claim that the Sun and the Moon are only 50 km (31 miles) in diameter and that they circle the disk at a height of 5,500 km (3,417 miles). Others envision a world hemmed in by Antarctica (which is believed to extend infinitely in all directions), or they reject conventional laws of gravity, explaining that Earth exists as a disk that accelerates upward in order to give the illusion of gravity.",
  "Scientists and researchers who study this growing movement have found that its appeal is rooted in four trends: the public’s mistrust of official scientific sources, the perpetuation of conspiracy theories , loyalty to the groups and community they identify with, and the use of social media to spread misinformation. Flat Earth ideas have gained a large enough audience worldwide to alarm some scientists, who have launched their own social media campaigns to debunk the flat Earth models promoted online. Other researchers are working to overcome these perceptions by combining the teaching of rigorous evidence-based science with a restoration of public trust in scientific institutions attained by taking the questions of flat Earth adherents seriously and refraining from taking aloof and dismissive positions."
]