[
  " lucid dreaming , phenomenon of sleep in which one is aware that one is dreaming. During lucid dreaming, individuals not only are aware that they are dreaming but also may be able to direct the content of the dream, including their own actions.",
  "Lucid dreaming is thought to take place during the REM (rapid eye movement) phase of sleep , which first occurs about 90 minutes after falling asleep. REM sleep is marked by heightened activation of nerve cells in the cerebral cortex (the outermost portion of the brain ’s cerebrum ). Some scientists think that lucid dreaming occurs in a state that has characteristics of both REM sleep and wakefulness.",
  "The occurrence of lucid dreaming varies. According to a 2016 meta-analysis of data from more than 30 studies on the subject, roughly 55 percent of individuals experienced at least one lucid dream in their lifetime, and less than one-quarter of the general population had one or more lucid dreams per month. The phenomenon occurs more often in children than in teens or adults.",
  "Generally, individuals who are more prone to lucid dreaming have a larger prefrontal cortex—the part of the brain that covers the front portion of the cerebrum and is involved in controlling high-level tasks, such as reasoning and memory retrieval. Such individuals are often highly self-reflective. Lucid dreaming is also more common among persons with narcolepsy , a condition characterized by sudden uncontrollable spells of sleep during the day and sleep disturbances at night. One study showed that more than 77 percent of narcoleptic patients experienced lucid dreams.",
  "When nonlucid dreams occur during REM sleep, the parts of the brain that control self-reflective awareness, waking memory, and insight—the frontal and parietal cortical circuits—show decreased activity, and sleepers who are dreaming may think that they are awake. During lucid dreaming, however, the physiology of the brain changes such that dreamers realize that they are in fact dreaming. This awareness in lucid dreams is associated with increased activity in the anterior prefrontal, parietal, and temporal cortex.",
  "Various theories attempt to explain the underlying mechanisms of lucid dreaming. Specific sequences of sleep and wakefulness potentially allow certain areas of the brain that are active during wakefulness to remain active during sleep, which may permit the self-awareness and metacognition (self-monitoring and self-correction) required for lucid dreaming. If that is the case, lucid dreaming may be a hybrid state of both wakefulness and REM sleep. A second theory posits a psychological, rather than a physiological, mechanism—namely, that metacognition leads to lucidity. A third theory, drawing on both physiology and psychology, suggests that sleep disruptions result in sleep deprivation and higher-level cognition at rest such that a quick switch from wakefulness to REM sleep in a sleep-deprived person potentially increases the probability of lucid dreaming.",
  "There are a number of ways to induce lucid dreaming, including recording dreams in a diary, using drugs that inhibit neurotransmitters (signaling molecules in the brain), using external sensory cues, and interrupting sleep. One of the most successful methods of inducing lucid dreams involves a combination of three of those techniques: use of external cues to test reality to determine whether or not an individual is dreaming, use of the wake-up–back-to-bed technique (waking after five hours of sleep, staying up for a short period of time, and then going back to sleep), and use of mnemonic induction of lucid dreams, which helps individuals recognize when they are dreaming. Research has shown that, upon waking after five hours, study participants who applied the three techniques had envisioned themselves dreaming and repeating a statement that made them realize they were dreaming.",
  "Lucid dreaming can have both positive and negative effects. For example, it can be harnessed to refine motor skills, enhance creativity, and improve problem solving. However, the sleep disruptions associated with the induction of lucid dreaming can reduce sleep quality."
]