[
  " significant figures , also called significant digits , any of the digits of a number beginning with the digit farthest to the left that is not zero and ending with the last digit farthest to the right that is either not zero or that is a zero but is considered to be exact. Significant figures are used to report a value, measured or calculated, to the correct number of decimal places or digits that will reflect the precision of the value.",
  "  The number of significant figures a value has depends on how it was measured, or how it was calculated. When a measurement is taken, the precision of that measurement is dependent on the equipment used to take the measurement. The measurement will have some digits that are certain and one digit that is uncertain, or estimated. The digits will be certain to the lowest increment division of the equipment used to take the measurement, and the estimated digit will be based on a best guess when the measurement is between two of the lowest increments of the equipment. If, for example, a measurement is taken with a metric ruler that has millimetre markings as the lowest increment, the number of millimetres of the measurement will be known for certain. One other digit will be estimated, since the measured quantity can be between two millimetre increments. If the item being measured falls exactly on a millimetre marking, then the estimated digit is written as a zero, to indicate that the digit of the measurement beyond the millimetre increments on the ruler is thought to be a zero, and not a nonzero estimated value.",
  "The basic concept of significant figures in measurements relates to the fact that a measured value cannot be more precise than the equipment being used to make the measurement. It should be noted here that the equipment used to take a measurement does not determine the number of significant figures a measured value will have, only where the precision of a value must stop being written. Only one estimated value can ever be included in a measured quantity.",
  "Determining the number of significant figures in measured quantities is essential when reporting the precision of measured values and the precision that can be reported when measured values are used in calculations. The rules for determining the number of significant figures are as follows:",
  "For calculations involving measured quantities, the first step in determining the precision of the answer is to determine the number of significant figures in each of the measured quantities. Once done, the number of significant figures in a calculated value involving measurements is determined based on the mathematical operation being performed.",
  "When two or more measured quantities are added or subtracted, the resulting value will have the same number of decimal places as the value with the fewest number of decimal places (the limiting value). So if the measured values of 22.35 and 47.773 are added, the limiting value of 22.35 has two decimal places, which means that the result of the addition will have only two decimal places.",
  "When two or more measured quantities are being multiplied or divided, the answer will have the same number of total significant figures as the value with the fewest number of significant figures. So if the measured values of 2.445 and 31.7 are being multiplied, the resulting value will have three significant figures, since 2.445 has four significant figures, but 31.7 has only three significant figures.",
  "When a value is to be rounded off, the rules for rounding are:"
]