[
  "  rope , assemblage of fibres, filaments, or wires compacted by twisting or braiding (plaiting) into a long, flexible line. Wire rope is often referred to as cable ( q.v. ). The basic requirement for service is that the rope remain firmly compacted and structurally stable, even while the rope is bent, twisted, and pulled. The prime property of a rope is its tensile strength.",
  "The texture and the nature of a rope is determined by the colour, fineness, stiffness, strength, and stretchability of the fibres or filaments used in its construction. Cotton ropes, for example, are softer, weaker, and stretchier than manila or sisal ropes. Manila ropes are stronger, for a given size, than hemp or jute ropes. Since even short fibres can be spun into long flexible yarns, practically any fibre can be made into a rope.",
  "Ropes made of filaments drawn from ductile metals or synthetic polymers differ from natural-fibre ropes in that any particular filament contributing to the rope form runs throughout the entire length of the rope. A thick filament or wire is stiffer than a fine one of the same material; its use results in a stiffer rope for a given size.",
  "In the basic twisted rope structure, alternate stages are twisted in opposite directions to give torsional stability. When the rope twist is seen to spiral in direction upward to the right as the rope is held vertically, it is designated as right-laid or Z-twist; if upward to the left, as left-laid (S-twist). The braided or plaited rope structure provides torsional balance by crossing and recrossing rope components in maypole fashion.",
  "Natural-fibre, man-made filament, and wire ropes ordinarily range upward from a diameter of  3  16  in. (about 5 mm). Smaller ropes are designated cords; similar assemblages in which torsional balance is of no consequence are called twine or yarn. Cables are torsionally balanced structures formed by twisting several ropes together. Compared with organic-fibre ropes, wire ropes are stronger, stiffer, heavier, and less extensible. Man-made filament ropes are stronger than natural-fibre ropes but are generally stretchier.",
  "Rope making is divided into four phases: (1) The fibres or filaments are prepared for spinning (twisting) into yarns. (2) The fibres or filaments are spun or bunched into yarns and yarns into cords for the manufacture of man-made filament ropes. (3) A number of yarns are twisted into strands (forming). (4) Three or more strands are twisted into rope (laying).",
  "The fibres are combed or carded, then slivered and spun into yarn by the processes used in the textile industry. Strands, also known as readies, are formed by twisting yarns, or small cords, together. The stranding machines, called formers or bunchers, vary in size and form depending on ability to accommodate continuous strand lengths as well as on production rates and flyer speeds.",
  "The twisted rope consists generally of three S-twist strands, twisted (laid) together in the direction of opposing twist (Z-twist). The most common, three-strand rope, is also designated plain, or hawser-laid, rope; a four-strand rope, shroud-laid rope.",
  "The rope-laying operations require machines similar to strand-forming machinery. The strands, on bobbins, are pulled through a compression tube and twisted into rope by a revolving flyer. As twisted, the rope is wound onto a heavy steel bobbin, also turning with the flyer. The three subassemblies of the rope-laying machine, arranged in tandem horizontally, are the foreturn flyers (rotating strand bobbins), the capstan flyer (pulling mechanism), and the receiving flyer (rope-twisting and storage bobbin mechanism). The length of rope twisted in such a laying machine is limited by the dimensions of the receiving flyer.",
  "In another type of horizontal rope-laying machine, the strand bobbins are arranged in tandem within a flyer. As each strand is pulled off its bobbin, it is overtwisted and in this condition combined with its adjacent strands into rope. This machine requires no receiving bobbin in its flyer; the rope is coiled directly into a reel form. The rope length, accordingly, is limited only by the strand length. Such machines may be designed with component parts arranged horizontally or vertically to minimize required floor space.",
  "The ropewalk, a long, low building in which rope and other cordage are made by hand-operated tools, is still in use in certain areas. The length of the walk limits the length of rope that can be made without splicing; yarns spun in the longest walk (about 1,200 feet [370 metres]) form, when fully twisted, a 700-foot (210-metre) rope.",
  "Pictures from Egyptian tombs c . 1500 bc show men walking while making rope. The first walks were outdoor level spaces, often having posts at intervals to support long work as it was extended. Later walks were roofed or completely enclosed. A mechanized method based on the ropewalk is used extensively throughout the world.",
  "In addition to the twisted structures, ropes in the size range of 1-in. to 5-in. (2.5-cm to 12.7-cm) diameter are also made in which four sets of strands, equally paired left twist and right twist, are braided into an eight-strand plaited structure. Another braided rope structure, identified as double-braided rope, consists of a layer of heavy twisted yarns, braided about a coarse braided rope core, to envelop the core. Such braided ropes require specialized machinery and are used to best advantage where rope flexibility and torsional balance are prime service requirements.",
  "The constructional factor, for a given fibre or filament, that can most influence the strength of the rope is the degree of twist in the rope and strands; the greater the twist, the lower the strength. Repeated loading in tension, short of breaking the rope, will have no adverse effect on the rope strength. Actually, provided the tensile load is not great enough to break inner strand yarns, repeated loadings may result in higher breaking strengths by inducing better mutual adjustment of yarn and strand tensions as the rope is repeatedly stretched.",
  "Natural-fibre ropes deteriorate most readily because of fibre degradation caused by mold growth. Synthetic filament ropes deteriorate most readily when exposed to sunlight, elevated temperatures, or damaging chemicals, all of which accelerate filament decomposition. Rope kinks or strand kinks (cockles) result from an unbalanced twist relationship in the rope structure, the consequence of improper handling. In this respect, braided or plaited ropes are superior to twisted ropes.",
  "The marine rope user, who consumes the major portion of manufactured rope, formerly preferred heavy twisted manila rope but now finds nylon or polypropylene more serviceable because of their higher strength and lighter weight. If stretch or flexibility are also important considerations, ropes of composite filaments or plaited structures are preferred.",
  "The foregoing criteria are applied to many rope structures related to specific uses. Water skiing rope, for example, is generally braided polypropylene, which floats and resists kinking; mountain climbing rope is nylon, which is strong and firm; sail rope is spun (short filament) polyester, braided or twisted to minimize stretching."
]