[
  " rose , (genus Rosa ), genus of some 100 species of perennial shrubs in the rose family ( Rosaceae ). Roses are native primarily to the temperate regions of the Northern Hemisphere. Many roses are cultivated for their beautiful flowers, which range in colour from white through various tones of yellow and pink to dark crimson and maroon, and most have a delightful fragrance, which varies according to the variety and to climatic conditions.",
  " Rosa virginiana  Most rose species are native to Asia, with smaller numbers being native to North America and a few to Europe and northwest Africa. Roses from different regions of the world hybridize readily, giving rise to types that overlap the parental forms, and making it difficult to determine basic species. Fewer than 10 species, mostly native to Asia, were involved in the crossbreeding that ultimately produced today’s many types of garden roses.",
  " Rosa rugosa)  Roses are erect, climbing, or trailing shrubs, the stems of which are usually copiously armed with prickles of various shapes and sizes, commonly called thorns. The leaves are alternate and pinnately compound (i.e., feather-formed), usually with oval leaflets that are sharply toothed. The flowers of wild roses usually have five petals, whereas the flowers of cultivated roses are often double (i.e., with multiple sets of petals). Rose flowers’ size ranges from tiny miniatures 1.25 cm (0.5 inch) in diameter to hybrid flowers measuring more than 17.5 cm (7 inches) across. The rose plant’s fleshy, sometimes edible, berrylike “fruit” (actually the floral cup) is known as a hip and usually ranges from red to orange in colour.",
  "Roses can become infected by a number of diseases , most of them caused by fungi . Powdery mildew appears as a grayish white moldlike growth on the surface of young leaves and stems. Black spot fungus appears as conspicuous black spots on leaves and causes them to fall off. Rust is also a common disease of roses. Aphids are a common insect pest on the leaves and young stems.",
  "The flowers of the damask rose ( Rosa × damascena ) and several other species are the source of attar of roses used in perfumes. Many species, particularly the rugosa rose ( R. rugosa ), produce edible rose hips, which are a rich source of vitamin C and are sometimes used in preserves.",
  " Rosa  There are several major classes of garden roses. The best-known and most-popular class of rose is that of the hybrid tea roses, which accounts for the majority of roses grown in greenhouses and gardens and sold in florist shops. Hybrid teas come in the complete range of rose colours and have large symmetrical blossoms. Hybrid teas resulted from the crossbreeding of frequently blooming but fragile tea roses with vigorous hybrid perpetual roses. The hybrid perpetuals achieved great popularity until they were supplanted by the hybrid teas in the early 20th century. Polyantha roses are a class of very hardy roses that produce dense bunches of tiny blossoms. Floribunda roses are hardy hybrids that resulted from crossing hybrid teas with polyanthas. Grandiflora roses are relatively new hybrids resulting from the crossbreeding of hybrid teas and floribunda roses. Grandifloras produce full-blossomed flowers growing on tall hardy bushes. Among the other classes of modern roses are climbing roses, whose slender stems can be trained to ascend trellises; shrub roses, which develop into large bushes; and miniature roses, which are pygmy-sized plants bearing tiny blossoms. Altogether there are thousands of identifiable varieties of roses in those and other classes."
]