[
  "  runic alphabet , also called futhark , writing system of uncertain origin used by Germanic peoples of northern Europe, Britain, Scandinavia, and Iceland from about the 3rd century to the 16th or 17th century ad . Runic writing appeared rather late in the history of writing and is clearly derived from one of the alphabets of the Mediterranean area. Because of its angular letter forms, however, and because early runic inscriptions were written from right to left like the earliest alphabets, runic writing seems to belong to a more ancient system. Scholars have attempted to derive it from the Greek or Latin alphabets, either capitals or cursive forms, at any period from the 6th century bc to the 5th century ad . A likely theory is that the runic alphabet was developed by the Goths, a Germanic people, from the Etruscan alphabet of northern Italy and was perhaps also influenced by the Latin alphabet in the 1st or 2nd century bc . Two inscriptions, the Negau and the Maria Saalerberg inscriptions, written in Etruscan script in a Germanic language and dating from the 2nd and 1st centuries bc , respectively, give credence to the theory of Etruscan origins for runic.",
  "There are at least three main varieties of runic script: Early, or Common, Germanic (Teutonic), used in northern Europe before about 800 ad ; Anglo-Saxon, or Anglian, used in Britain from the 5th or 6th century to about the 12th century ad ; and Nordic, or Scandinavian, used from the 8th to about the 12th or 13th century ad in Scandinavia and Iceland. After the 12th century, runes were still used occasionally for charms and memorial inscriptions until the 16th or 17th century, chiefly in Scandinavia. The Early Germanic script had 24 letters, divided into three groups, called ættir, of 8 letters each. The sounds of the first six letters were f, u, th, a, r, and k, respectively, giving the alphabet its name: futhark. The Anglo-Saxon script added letters to the futhark to represent sounds of Old English that did not occur in the languages that had used the Early Germanic script. Anglo-Saxon had 28 letters, and after about 900 ad it had 33. There were also some slight differences in letter shape. The Scandinavian languages were even richer in sounds than Old English; but, instead of adding letters to the futhark to represent the new sounds, the users of the Nordic script compounded the letter values, using the same letter to stand for more than one sound— e.g., one letter for k and g, one letter for a, æ, and o. This practice eventually resulted in the reduction of the futhark to 16 letters.",
  "Other varieties of runes included the Hälsinge Runes ( q.v. ), the Manx Runes, and the stungnar runir, or “dotted runes,” all of which were variants of the Nordic script. More than 4,000 runic inscriptions and several runic manuscripts are extant. Approximately 2,500 of these come from Sweden, the remainder being from Norway, Denmark and Schleswig, Britain, Iceland, various islands off the coast of Britain and Scandinavia, and other countries of Europe, including France, Germany, Ukraine, and Russia."
]