[
  " Save the Children , any of several independent, voluntary organizations that seek to provide both disaster and long-term aid to disadvantaged children throughout the world. The original organization, Save the Children Fund, was founded in Great Britain in 1919 by Eglantyne Jebb and her sister Dorothy Buxton to provide relief to starving children in Germany and Austria-Hungary during the Allied blockade, which continued after the end of World War I . The organization subsequently broadened its concern to the needs of children worldwide, eventually providing medical and child-care services, nutritional assistance, and family self-help and community-development projects. A charter of children’s rights drafted by Jebb, known as the Geneva Declaration (1923), was adopted by the League of Nations in 1924 and later became the basis of the Declaration of the Rights of the Child, adopted by the United Nations  General Assembly in 1959, and the Convention on the Rights of the Child (1989), which has been ratified by almost all countries.",
  "After the founding of the Save the Children Fund, similar groups sprang up in other countries, notably in the United States in 1932 with the creation of the International Save the Children Fund of America (later renamed Save the Children). In 1979 national organizations in several countries formed the Save the Children Alliance (later renamed Save the Children International) to coordinate their relief activities. In the early 21st century Save the Children International comprised some 30 national groups operating in about 120 countries.",
  "From its earliest years, Save the Children employed innovative fund-raising and advertising techniques, including sponsorships of individual children who are identified to donors, full-page newspaper advertisements, and films of the organization’s famine- and disaster-relief activities. Save the Children organizations rely mostly on private charitable contributions for their funding."
]