[
  "  Isles of Scilly , also called Scilly Isles , group of about 50 small islands and many more islets lying southwest of Cornwall , England , 25 to 36 miles (40 to 58 km) off Land’s End . Administratively, the islands are a distinct unit within England, though they form a part of the historic county of Cornwall. Because their council serves the functions of both a district and a county, they have a status similar to that of a unitary authority. The administrative centre is on St. Mary’s, the largest island in the group.",
  "The islands are composed of granite and are a continuation of the granite masses of the Cornish mainland. They reach an elevation of 165 feet (50 metres) on St. Mary’s and have dangerous rocky coasts with many reefs. Because the islands’ climate is exceptionally mild—the mean monthly temperatures range from 45 to 62 °F (7 to 16 °C)—their fauna and flora are quite different from those on the English mainland. Many subtropical plants flourish. Seals live on the rocks and islets. Among an immense variety of seabirds that visit the islands, the roseate tern is the rarest British breeding tern, and the Manx shearwater has its only British breeding site in the islands.",
  "There are prehistoric remains in the form of barrows and rude pillars on the islands. Henry I (reigned 1100–35) gave the islands to the abbot of Tavistock in Devon . In the 16th century they became crown property and were leased in 1571 to Francis Godolphin, who built Star Castle above Hugh Town in 1593. During the English Civil Wars (1642–51), the islands were controlled by supporters of the monarchy, whose navy caused severe damage to Dutch ships. The Netherlands, which had been rebuffed after demanding reparation for losses, declared war against the islands in 1651. Soon after, Parliament’s supporters gained control of the islands. The war subsequently ended, although a formal peace treaty was not signed until April 17, 1986. In 1834 Augustus Smith succeeded the Godolphins as the islands’ lessee, and in 1933 the main islands were handed over to the British crown.",
  "Only five of the islands are inhabited—St. Mary’s, Tresco, St. Martin’s, Bryher, and St. Agnes. Most of the people live on St. Mary’s, which has a harbour at Hugh Town and a museum of Scilly history and prehistory. Bishop Rock Lighthouse (1858), at the islands’ western end, is a notable example of 19th-century civil engineering. The economy is based on tourism and on commercial flower growing and vegetable farming, the latter made possible by the prevailing mild climate. Fishing is also significant. There is ferry service to Penzance , on the mainland, and flights connect the islands to the Land’s End , Newquay , and Exeter airports. Area 6 square miles (16 square km). Pop. (2001) 2,153; (2011) 2,203."
]