[
  " Eretmochelys imbricata  sea turtle , any of seven species of marine turtles belonging to the families Dermochelyidae ( leatherback sea turtles ) and Cheloniidae (green turtles, flatback sea turtles, loggerhead sea turtles, hawksbills, and ridleys). Both families are highly aquatic, and most species only appear on coastal beaches for egg laying; however, the green turtle ( Chelonia mydas ) occasionally basks in terrestrial environments. Adult sea turtles are mainly denizens of tropical and subtropical seas, but the juveniles of both families occur naturally in more temperate waters.",
  " Chelonia mydas Chelonia mydas  Dermochelyids and cheloniids are distantly related; their divergence from one another took place between 100 million and 150 million years ago. Nevertheless, both groups have streamlined shells, forelimbs modified as flippers that propel their bodies through the water, figure-eight swimming strokes, and large, fully webbed hind feet as rudders. Cheloniids are hard-shelled sea turtles with a bony carapace (top shell) and plastron (bottom shell) with epidermal scutes ( scales ). In contrast, the leatherback shell of dermochelyids has a greatly reduced bony architecture, and the bones are less firmly articulated; scutes appear in hatchlings, but they are quickly shed, so the bony shell is covered with a thick, leathery skin.",
  " Dermochelys coriacea Dermochelys coriacea  Size varies greatly among the seven species; however, commonalities exist in diet and habitat. With some exception, most sea turtles are carnivorous and prefer warm, coastal marine environments. The leatherback sea turtle ( Dermochelys coriacea ) inhabits pelagic (open ocean ) environments. Apparently following the blooms of its jellyfish prey, it moves widely throughout the oceans. The shell lengths of few individuals exceed 1.6 metres (5 feet), although some reportedly reach 2.4 metres (8 feet). Adult and juvenile olive ridleys ( Lepidochelys olivacea ) are also largely pelagic, but they are known to frequent coastal regions such as bays and estuaries . The olive ridley and its relative, the Kemp’s ridley sea turtle ( L. kempii ), are small with wide rounded shells. As adults, both species have shells about 58–78 cm (23–31 inches) long. Leatherbacks and ridleys are largely carnivorous and consume a wide variety of crustaceans and mollusks .",
  " Caretta caretta  Chelonia mydas   Loggerhead ( Caretta caretta ) and green ( Chelonia mydas ) sea turtles have adult shell lengths between 0.9 and 1.2 metres (3 and 4 feet) long. The loggerhead is carnivorous and prefers coastal marine environments. It has the proportionately largest head of the sea turtles; this feature may be an adaptation that increases its jaw strength in order to crush the shells of large mollusks such as whelks . The green turtle is found in warm coastal waters around the world; however, unlike other sea turtles, it is predominantly herbivorous and feeds on algae or marine grasses.",
  "The hawksbill sea turtle ( Eretmochelys imbricata ) is largely tropical and common in coral reef habitats, where it feeds on sponges and a variety of other invertebrates . The flatback sea turtle ( Natator depressa ) occurs in the seas between Australia and New Guinea; it also feeds on a variety of invertebrates. The shells of adults of both species range from 90 to 100 cm (35 to 39 inches).",
  " Chelonia mydas  While reproductive behaviours and timing vary among populations and species, a general pattern is shared among all sea turtles. All are egg layers, and females must come ashore to bury their eggs in sandy environments. Except for Lepidochelys , which has a nesting cycle of 1–3 years, females nest only every third or fourth year; however, they often nest multiple times during a nesting season. While most species usually have two to four egg-laying events per nesting season, the loggerhead has up to seven. The female emerges from the surf at night, ponderously crawls to sandy areas above the high tide line, and digs a nest. The nest or egg chamber is dug exclusively with the hind limbs, the tail is positioned over the centre of the nest opening, and eggs are deposited. The nest is then filled in with sand, and the female returns to the sea. Each nest is created 12 to 14 days apart, and clutch size varies among species and populations; about 100 eggs per nesting event are common.",
  "Eggs incubate for about 50 to 60 days. Development is temperature-dependent, so a warmer nest brings about an earlier hatching. Within a given nest, hatching is nearly synchronous. Because of the depth of the nest, emergence requires that several hatchlings dig upward together. Hatchlings typically emerge from the ground at night and can instinctively recognize the horizon over the open ocean, although they can be confused by artificial lighting behind or along the beach. There is evidence that female loggerheads imprint on the magnetic field signature of the beach as hatchlings and use Earth’s magnetic field to navigate back to the same beach as adults to lay eggs of their own. Once in the surf, the hatchlings swim outward into the open ocean, and those of most species enter the gigantic oceanic gyres . The young sea turtles are pelagic, likely for 5 to 10 years, before returning to warm nearshore waters to continue their growth.",
  "Most species of sea turtles are threatened or endangered. They are typically slow to mature, long-lived, and migratory ; before reaching sexual maturity, many are captured—either intentionally or accidentally—in coastal fisheries and killed. The minimum time from hatching to first reproduction appears to be about 10 to 15 years, a characteristic shared by the largest species, D. coriacea , and the smallest species, L. kempii and L. olivacea . Others, such as Chelonia mydas , require over 20 years to reach sexual maturity and reproduce for the first time."
]