[
  " seismograph , instrument that makes a record of seismic waves caused by an earthquake , explosion, or other Earth -shaking phenomenon. Seismographs are equipped with electromagnetic sensors that translate ground motions into electrical changes, which are processed and recorded by the instruments’ analog or digital circuits. The terms seismograph and seismometer are often used interchangeably; however, whereas both devices may detect and measure seismic waves, only a seismograph possesses the capacity to record the phenomena. A record produced by a seismograph on a display screen or paper printout is called a seismogram.",
  "Although originally designed to locate natural earthquakes, seismographs have many other uses, such as petroleum exploration, investigation of Earth’s crust and lower layers, and monitoring of volcanic activity .",
  "An early seismic instrument called the seismoscope made no time record of ground oscillations but simply indicated that shaking had occurred. A Chinese scholar, Zhang Heng , invented such an instrument as early as 132 ce . It was cylindrical in shape with eight dragon heads arranged around its upper circumference, each with a ball in its mouth. Around the lower circumference were eight frogs, each directly under a dragon head. When an earthquake occurred, balls were released from a dragon’s mouth, probably by an internal pendulum that moved back and forth according to the direction of vibration, and were caught by a frog’s mouth, which produced noise.",
  " The Eruption of Vesuvius in 1872  In 1855 Italian scientist Luigi Palmieri designed a seismograph that consisted of several U-shaped tubes filled with mercury and oriented toward the different points of the compass . When the ground shook, the motion of the mercury made an electrical contact that stopped a clock and simultaneously started a recording drum on which the motion of a float on the surface of mercury was registered. This device thus indicated time of occurrence and the relative intensity and duration of the ground motion.",
  "The basic problem in measuring ground motions is to attain a steady point that remains fixed when the ground moves. Various types of pendulums have been used for that purpose. The simplest type is a common pendulum in which a heavy mass is suspended by a wire or rod from a fixed point (as in a clock). Other forms are the inverted pendulum, in which a heavy mass is fixed to the upper end of a vertical rod pointed at its lower end, and the horizontal pendulum, in which a rod with a mass on its end is suspended at two points so as to swing in a nearly horizontal plane instead of a vertical plane. After a series of earthquakes struck near Perthshire, Scotland, in 1839, a seismometer with an inverted pendulum was installed near Comrie in 1840.",
  "The first true seismograph, according to Italian seismologists, was created in 1875 by Italian physicist Filippo Cecchi. The Cecchi seismograph also used pendulums, but it was the first to record the relative motion of the pendulums with respect to Earth’s ground motions as a function of time. The motions produced by seismic waves would activate a clock, and the recording surface (which tracked ground motion) advanced 1 cm (0.04 inch) per second, which would allow a reader to establish the timing of an earthquake’s onset as well as its duration.",
  "  Seismograph developments occurred rapidly in 1880 when Scottish physicist Sir James Alfred Ewing , Scottish engineer Thomas Gray, and English geologist John Milne , who were working in Japan at the time, began to study earthquakes. Following a severe earthquake that occurred at Yokohama near Tokyo in that year, they organized the Seismological Society of Japan. Under its auspices various devices, forerunners of today’s seismograph, were invented. Among the instruments constructed in that period was Milne’s famous horizontal pendulum seismograph. Milne successfully used that seismograph to record several earthquakes in Japan. Then, after returning to England, he established a small worldwide seismographic network using such instruments.",
  "The horizontal pendulum seismograph was improved greatly after World War II . The Press-Ewing seismograph, developed in the United States for recording long-period waves , was widely used throughout the world. That device employed a Milne-type pendulum, but the pivot supporting the pendulum was replaced by an elastic wire to avoid friction.",
  "    If a common pendulum is free to swing in one direction and if the ground moves rapidly in the direction of freedom of the pendulum while the pendulum is motionless, the pendulum will tend to remain in place through inertia . If the ground moves back and forth (oscillates) and if the period of ground motion (the time necessary for one complete oscillation) is sufficiently shorter than the period of free oscillation of the pendulum, the pendulum will lag, and the movement of the ground relative to the pendulum can be recorded. The magnitude of that movement is commonly amplified electrically. When the period of the pendulum is comparable to that of the ground motion, the seismograph will not exactly record Earth’s movement. The correction, however, can readily be computed mathematically.",
  "The ground can move in any of three directions, two horizontal and one vertical. Because each kind of movement must be separately recorded, three pendulums, one for each direction, are needed for a complete seismograph.",
  "In general, then, the seismograph is an instrument in which the relative motion of pendulum and ground is recorded. It is equally possible to take the ratio between the deflection of the pendulum and the velocity (or acceleration ) of the ground. That ratio is called the velocity (or acceleration) sensitivity of the seismograph.",
  "If free oscillation of the pendulum is not minimized, it will mask the proper recording of seismic waves. The simplest way to reduce (damp out) the free oscillation of a pendulum is to suspend it in a viscous (thick) liquid of which the resisting force is proportional to the velocity of the pendulum. In practice, the required resisting force is exerted by a special device called a damper. In an electromagnetic damper, the resisting force is created by electrical currents induced in a copper plate moving in a strong magnetic field ( see  damping ).",
  "Various methods of recording pendulum motion have been developed. In the mechanical method (now of historical interest only), a sheet of smoked paper was wrapped around a rotating drum, so mounted as to move with Earth. A moving pen connected to the pendulum pressed lightly on the paper. The rotating drum shifted slightly with each revolution so that recorded lines were not superimposed on each other. The drum rotated without interruption; one sheet of paper usually lasted 24 hours. Though that method was simple and economical, the seismograph had to have a heavy mass to overcome the friction between pen and paper. In consequence, some mechanical seismographs weighed one ton or more. In the more-modern optical method, pendulum motion causes a mirror to move. Light is reflected by the mirror onto photosensitive paper wrapped on a drum. Thus, there is no friction to affect the pendulum.",
  "In the electromagnetic method, widely used today, a coil fixed to the mass of the pendulum moves in a magnetic field and creates an electric current. When the current is amplified electronically, high magnification is obtainable. Certain short-period seismographs of that type used for the observation of microearthquakes attain a magnification as high as 1,000,000 or more. In ordinary seismographic observation, the time of initiation of ground oscillations is recorded. Marks are placed on the seismogram once a minute; an extra one identifies the hour.",
  "  All the seismographs described so far measure oscillatory motions of the ground at a given point. The strain seismograph, in contrast, employs no pendulum, and its operation depends on changes in the distance between two points on the ground. That type of seismograph was devised in 1935 by American seismologist Hugo Benioff.",
  "Strong-motion seismographs, called accelerographs, are designed particularly to register intense movements of the ground, mainly for engineering purposes—i.e., antiseismic construction in earthquake-prone areas such as Japan. Strong-motion seismographs employ accelerometers as sensors, record digitally directly on magnetic tape or memory chips, and can measure ground acceleration up to twice gravity. Networks of accelerographs are now operative in several earthquake regions (e.g., California, Japan, Taiwan, Mexico), offering continuous direct recording linked to computers and the Internet . Data on ground shaking are thus available within seconds of a local damaging earthquake.",
  " P S  P S   A seismograph records oscillation of the ground caused by seismic waves that travel from their point of origin through Earth or along its surface. The seismogram of a nearby small earthquake has a simple pattern, showing the arrival of P waves ( longitudinal waves , which vibrate in the direction of propagation), S waves ( transverse waves —that is, waves that vibrate at right angles to the direction of propagation), and surface waves (compression waves with no vertical or longitudinal components). In the case of distant earthquakes or of nearby very large earthquakes, the seismogram pattern is more complicated because it shows various sorts of seismic waves that originate from one or many points but then may be reflected or refracted within Earth’s crust before reaching the seismograph. The relation between the arrival time of the P and S waves and the epicentral distance—i.e., the distance from the point of origin—is expressed by a time-distance curve, in which the arrival time is read on the vertical axis and the epicentral distance on the horizontal axis. If the arrival times of various seismic waves are read on the seismogram at a station and compared with the standard time-distance curves, the epicentral distance from that station (the distance of the centre of the earthquake from the recording station) can be determined. If the epicentral distance from at least three stations is known, the origin of the earthquake can be calculated by simple trigonometric methods .",
  "The eruption of a volcano is commonly accompanied by many small earthquakes, especially when a volcano resumes activity after a long dormant period. Observation with sensitive seismographs therefore plays an important role in predicting volcanic activity.",
  "Often a strong earthquake is preceded by small earthquakes. Observation of very small tremors with sensitive seismographs is helpful in predicting disastrous earthquakes.",
  "Seismographs sometimes detect small and long-continuing oscillations of the ground, called microseisms, that do not originate as earthquakes. The occurrence of some microseisms is related to storms at sea.",
  "Seismographs are used for detecting remote underground tests of nuclear weapons , in which the relatively faint seismic waves generated by an underground explosion must be distinguished from natural tremors. If the seismic waves generated by an explosive charge are recorded by sensitive seismographs installed at various points in the neighbourhood of the explosion, the underground structure of the site can be determined by analyzing the time-distance curves of the P waves, using both direct waves and those reflected or refracted at the boundaries of underground layers.",
  "  The depths of underground layers, their angle of inclination, and the speed of seismic waves in each layer can be also determined by using seismographs. Since the discovery of a large oil field in Texas by that method in 1923, seismic surveying has made rapid progress and is now used for oil and gas exploration. The improvement in the instruments and techniques achieved after World War II made it possible to determine the structure of Earth’s crust to a depth of 40–50 km (about 25–30 miles) by detonation of a small amount of explosive.",
  "Ground motions caused by injecting fracking water into underground disposal wells and dynamite blasts in mines, quarries, and public works also can be measured by the seismograph. Preliminary examinations based on seismographic measurements make it possible to estimate the intensity of shocks and, thus, evaluate the amount of damage caused by a given amount of dynamite. Rock bursts, in which rocks are ejected suddenly in deep pits or tunnels, are caused by increase of stress in the surrounding rocks. Experience in mines shows that an increase of small shocks detectable by highly sensitive geophones —portable seismometers for field use—generally indicates a rock burst hazard.",
  "  Detection of vibrations on the lunar surface by seismographs is of fundamental importance in determining the internal structure, physical state, and tectonic (crustal) activity of the Moon . Moon seismographs were installed during the Apollo program starting in 1969. They contained three long-period seismometers and a single-component, short-period, vertical seismometer. Many moonquakes were recorded by those instruments. Similar instruments were first placed on Mars by the Viking 2 lander in 1976 to determine the extent of seismic activity on that planet."
]