[
  " Carcharhinus leucas Carcharhinus leucas  shark , any of numerous species of cartilaginous fishes of predatory habit that constitute the order Selachii (class Chondrichthyes ).",
  "Sharks, together with rays and skates , make up the subclass Elasmobranchii of the Chondrichthyes. Sharks differ from other elasmobranchs, however, and resemble ordinary fishes, in the fusiform shape of their body and in the location of their gill clefts on each side of the head. Though there are exceptions, sharks typically have a tough skin that is dull gray in colour and is roughened by toothlike scales . They also usually have a muscular, asymmetrical, upturned tail; pointed fins; and a pointed snout extending forward and over a crescentic mouth set with sharp triangular teeth. Sharks have no swim bladder and must swim perpetually to keep from sinking to the bottom.",
  " Mustelus canis  There are more than 400 living species of sharks, taxonomically grouped into 14–30 families, according to different authorities. Several larger species can be dangerous to humans. Numerous sharks are fished commercially. However, overfishing in the late 20th and early 21st centuries substantially reduced the populations of some shark species.",
  " Odontaspis  Shark species are nondescript in colour, varying from gray to cream, brown, yellow, slate, or blue and often patterned with spots, bands, marblings, or protuberances. The oddest-looking sharks are the hammerheads ( Sphyrna ), whose heads resemble double-headed hammers and have an eye on each stalk, and the wobbegongs (family Orectolobidae), whose skin flaps and protective coloration closely resemble the seafloor. The vernacular of shark names indicate colours in living species, such as the blue ( Prionace glauca ), the white ( Carcharodon carcharias ; also known as the great white shark), and the lemon ( Negaprion brevirostris ) shark.",
  " Rhincodon typus  The whale shark ( Rhincodon typus ) and the basking shark ( Cetorhinus maximus ), both of which may weigh several tons, are harmless giants that subsist on plankton strained from the sea through modified gill rakers. Whale sharks may grow up to 18 metres (59 feet) in length, whereas basking sharks may reach 14 metres (46 feet) fully grown. All other sharks prey on smaller sharks, fish, squid , octopuses , shellfish, other invertebrates , and, in some species, trash. The largest among the more predatory species is the voracious 6-metre (20-foot) white shark, which attacks seals , dolphins , sea turtles , large fish, and occasionally people. The more sluggish Greenland shark ( Somniosus microcephalus ) of cold deep waters feeds on seals, large fish, and even swimming reindeer; they may also scavenge whale carcasses.",
  "Normally, sharks feed on fish, often attacking in schools. Open-ocean species such as the mackerel ( Lamna ), mako ( Isurus ), and thresher ( Alopias ) sharks frequently feed near the surface and are much sought after with rod and reel for sport. Beautifully streamlined and powerful swimmers, those open-ocean sharks are adept at feeding on fast tuna , marlin , and the like. Bottom-feeding species of sharks are stout, blunt-headed forms that tend to have more-sluggish habits. The shellfish eaters among them have coarse, pavementlike, crushing teeth.",
  " Fertilization in sharks is internal. The male introduces sperm into the female by using special copulatory organs (claspers) derived from the pelvic fins. The young in many species hatch from eggs within the female and are born alive. Other species may lay eggs or nurture their young in the uterus with a placental attachment to the mother, like humans. Some species may even consume their siblings before they are born.",
  " Carcharocles megalodon  The origin of sharks is obscure, but their geologic record goes back at least to the Devonian Period (419.2 million to 358.9 million years ago). Fossil sharklike fish appeared in the Middle Devonian Epoch and became the dominant vertebrates of the Carboniferous Period (358.9 million to 298.9 million years ago). Modern sharks appeared in the Early Jurassic Epoch (201.3 million to 174.1 million years ago) and by the Cretaceous Period (145 million to 66 million years ago) had expanded into the present-day families. Overall, evolution has modified shark morphology very little except to improve their feeding and swimming mechanisms. Shark teeth are highly diagnostic of species, both fossil and modern.",
  "Sharks’ geographic ranges are not well known. Their extensive movements are related to reproductive or feeding activities or to seasonal environmental changes. Tagging returns from large sharks on the east coast of the United States indicate regular movements between New Jersey and Florida, and blue sharks have been recovered after crossing the southern Atlantic Ocean. A tagged spiny dogfish ( Squalus acanthias ) was recovered after traveling about 1,600 km (1,000 miles) in 129 days. Advances in tracking technologies include the use of satellite tags that continuously beam a signal to orbiting satellites whenever the shark surfaces and in that manner reveal north-south movements, transoceanic movements, and roaming and migratory patterns that are beginning to be understood for many species.",
  "Some members of the Carcharhinus genus—most notably the bull shark ( C. leucas )—enter fresh waters. Riverine sharks are small to medium-sized and are exceptionally voracious and bold.",
  "Information on shark ecology and individual and group actions has provided increased insight into their behaviour . Because large sharks feed on lesser ones, the habit of segregation by size appears vital to their survival. In a uniform grouping, dominance between various species is apparent in feeding competition, suggesting a definite nipping order. All sharks keep clear of hammerheads, whose maneuverability enhanced by the rudder effect of the head gives them a swimming advantage over other sharks.",
  "Sharks circle their prey, disconcertingly appearing seemingly out of nowhere and frequently approaching from below. Feeding behaviour is stimulated by numbers and rapid swimming when three or more sharks appear in the presence of food. Activity progresses from tight circling to rapid crisscross passes. Under strong feeding stimuli, excitement can intensify into a sensory overload that may result in cannibalistic feeding, or “shark frenzy,” in which injured sharks, regardless of size, are devoured.",
  "Sharks may abstain from food for long periods, and in captivity they may refuse to feed. Feeding is inhibited in large males during courtship and in gravid females while on the nursery grounds. Areas selected for giving birth are usually free of large sharks.",
  "In locating food, the shark primarily uses the chemical senses, particularly the olfactory. Visual acuity is adapted to close and long-range location and to distinguishing moving objects more by reflection than by colour, in either dim or bright light. Pit organs over the body serve as distance touch receptors, responding to displacement produced by sound waves. Irregularly pulsed signals below 800 hertz will bring sharks rapidly to a given point, suggesting acoustic orientation from considerable distances ( see  mechanoreception: Ampullary lateral-line organs [electroreceptors] ).",
  "In addition, electroreception , the ability to detect minute electrical activities, works effectively at short distances in sharks. Electroreception may be the last sensory system used to direct sharks toward live prey just before they capture it.",
  "Feeding habits vary with foraging methods and dentition. Sharks with teeth adapted to shearing and sawing are aided in biting by body motions including a rotation of the body, twisting movement of the head and body, or rapid vibration of the head. In coming to position, the shark protrudes its jaws, erecting and locking the teeth in position.",
  "In Australia, New Zealand, South Africa, and elsewhere along coasts where sharks are considered a nuisance or pose a threat to humans, public beaches often have lookout towers, bells and sirens, or nets. Since 1937, meshing has been employed off Australian beaches to catch sharks, using gill nets suspended between buoys and anchors, parallel to the beach and beyond the breaker line. The nets enmesh sharks from any direction, and, though touching neither the surface nor the bottom and spaced well apart, the nets give simple effective control.",
  " Carcharodon carcharias Carcharodon carcharias  The most-feared species is the white shark, whose erratic presence in American coastal waters is associated with infrequent attacks along the California coast and elsewhere. Other sharks involved in attacks on humans are the tiger ( Galeocerdo cuvier ), bull , oceanic whitetip ( C. longimanus ), blue, and hammerhead. Of course, the larger the shark, the more formidable the attack, but several small specimens can be hazardous as well, a fact well attested to by seasonal attacks off the southeastern coast of the United States.",
  "Not all encounters with sharks can be characterized as “attacks.” Studies have suggested that a more accurate method of reporting incidents involving sharks and humans would place the encounters into one of four categories, rather than calling every encounter an attack. Such categories could include:",
  "Attacks on humans occur when sharks are hungry, harassed, or, in some cases, defending territory, though many interactions with humans appear more likely to be due to mistaken identity. Provocation is heightened by the kicking or thrashing vibrations people make in the water (which to sharks resemble the irregular movements of a wounded fish), the presence of speared fish or bait in the water, or the presence of blood from wounds or menstruation . Most injuries occur on the lower limbs and buttocks. It has been estimated that there are about 100 shark attacks worldwide per year. Less than 25 percent of those are fatal, largely a result of hemorrhage and shock. It should be noted, however, that shark attacks are much less frequent than other aquatic mishaps.",
  "Among the threats from humans that sharks face is finning, the practice of harvesting the lateral and dorsal fins and the lower tail fin from a shark by commercial fishing operations and others worldwide. After the shark has been captured and its fins have been removed, its body, which is most likely still alive, is often cast overboard to save weight and cargo space. The practice is thought to have arisen in China about 1000 ce primarily for the purpose of supplying fins for shark fin soup served to guests at social occasions where the dish is symbolic of the host’s status. Although most shark fin products are traded through Hong Kong, some are sent to local markets around the world that supply restaurants. The yearly global demand for shark fin soup results in the harvesting of tens of millions of sharks each year.",
  "Campaigns led by animal rights groups and environmentalists have discouraged the consumption of shark fin soup. Since 2011, some restaurants around the world have removed the soup from their menus, and, beginning in 2012, it was no longer served at official state functions in China.",
  "Shark fin tissue is known to contain the neurotoxin BMAA (beta-methylamino- l -alanine), which is produced by cyanobacteria ( blue-green algae ). The consumption of BMAA-contaminated food and water has been linked to certain forms of neurodegenerative disease in humans."
]