[
  " The Conjurer The Conjurer  cups and balls trick , oldest and most popular of the tricks traditionally performed by a conjurer . To begin the trick, the performer places a bead or ball under one of three inverted cups. The ball is then made to “jump” invisibly from one cup to another or to “multiply.” The basis for the illusion is a secret additional ball that, by skilled manipulation, is put under one cup while the known ball is removed as secretly from another cup. The manipulative work is aided by the distracting conversation, or patter, of the conjurer.",
  "In ancient Greece and later in different countries, pebbles or other small objects were used instead of balls for the trick. The shape and type of cup used also varied. Descendants of Roman conjurers used cylindrical boxwood dice shakers instead of cups, and the Italian term il gioco dei bussolotti , “the game of the dice shakers,” came to be used to refer to legerdemain.",
  "  (Read Harry Houdini’s 1926 Britannica essay on magic.)  ",
  "A usual adjunct of equipment for cups and balls was a bag with strings that was tied around the waist of the conjurer, like an apron. It was not only a serviceable way to carry the properties of the trick but a handy place for the conjurer to secretly hide and retrieve the balls. Throughout Europe the conjurer’s pocket apron was the badge of the profession of conjuring, and Taschenspieler, “pocket player,” became the common term for magician in German. Middle Eastern, South Asian, Southeast Asian, and East Asian conjurers performed the trick exactly as European magicians did, although their clothing often made unnecessary the need for a pocket apron.",
  "The trick persists in the United States as the shell game, a sleight-of-hand gambling game in which, traditionally, a pea is used under nutshells. The shells are rearranged on a flat surface as the pea is shifted between them, with onlookers invited to bet on the shell that covers the pea."
]