[
  " Bombyx  silk , animal fibre produced by certain insects and arachnids as building material for cocoons and webs, some of which can be used to make fine fabrics. In commercial use, silk is almost entirely limited to filaments from the cocoons of domesticated silkworms (caterpillars of several moth species belonging to the genus Bombyx ). See also  sericulture .",
  " bce  The origin of silk production and weaving is ancient and clouded in legend. The industry undoubtedly began in China, where, according to native record, it existed from sometime before the middle of the 3rd millennium bce . At that time it was discovered that the roughly 1 km (1,000 yards) of thread that constitutes the cocoon of the silkworm could be reeled off, spun, and woven, and sericulture early became an important feature of the Chinese rural economy. A Chinese legend says that it was the wife of the mythological Yellow Emperor, Huangdi , who taught the Chinese people the art; throughout history the empress was ceremonially associated with sericulture. The weaving of damask probably existed in the Shang dynasty , and the tombs of the 4th–3rd centuries bce at Mashan near Jiangling (Hubei province), excavated in 1982, have provided outstanding examples of brocade , gauze , and embroidery with pictorial designs as well as the first complete garments.",
  "The main Song dynasty achievement in silk production was the perfecting of kesi , an extremely fine silk tapestry woven on a small loom with a needle as a shuttle. The technique appears to have been invented by the Sogdians in Central Asia, improved by the Uighurs , and adapted by the Chinese in the 11th century. The term kesi (literally “cut silk”) derives from vertical gaps between areas of colours, caused by the weft threads not running right across the width; it has also been suggested that the word is a corruption of the Persian qazz or Arabic khazz , referring to silk and silk products. Kesi was used for robes, silk panels, and scroll covers and for translating painting into tapestry. In the Yuan dynasty , panels of kesi were exported to Europe, where they were incorporated into cathedral vestments.",
  "Silk weaving became a major industry and one of China’s chief exports in the Han dynasty . The caravan route across Central Asia, known as the Silk Road , took Chinese silk to Syria and on to Rome. In the 4th century bce the Greek philosopher Aristotle mentioned that sericulture was practiced on the island of Kos, but the art was evidently lost and reintroduced into Byzantium from China in the 6th century ce . Chinese textiles of Han date have been found in Egypt, in graves in northern Mongolia (Noin-ula), and at Loulan in Chinese Turkistan. Silk was used by Han rulers as diplomatic gifts, as well as to buy off the threatening nomads and to weaken them by giving them a taste of luxury.",
  "Early Han textiles recovered from Mawangdui show the further development of the weaving traditions already present at Mashan in the late Zhou, including brocade and embroidery, gauze, plain weaves, and damasks. Later finds elsewhere, however, are limited chiefly to damasks, very finely woven in several colours with patterns that generally repeat about every 5 cm (2 inches). These designs are either geometric, the zigzag lozenge being the most common, or consist of cloud or mountain scrolls interspersed with fabulous creatures and sometimes with auspicious characters. The rectilinear patterns were transmitted from woven materials to Luoyang bronze mirrors and appeared in paintings on both lacquer and silk; and the curvilinear scroll patterns, which are not natural to weaving, were probably adapted for embroidery from the rhythmic conventions of lacquer painting, which also provided scroll motifs for inlaid bronzes and paintings on silk. Thus, there was an interaction between the various media of Han dynasty arts that accounts for their unity of style.",
  " Ming and Qing textiles fully display the Chinese love of pageantry, colour, and fine craftsmanship. Prominent among woven textile patterns are flowers and dragons against a background of geometric motifs that date to the late Zhou (1046–256 bce ) and Han. Qing robes were basically of three types. The chaofu was a very elaborate court ceremonial dress; the emperor’s robe was adorned with the auspicious 12 symbols described in ancient ritual texts, while princes and high officials were allowed nine symbols or fewer according to rank. The caifu (“coloured dress”), or “dragon robe,” was a semiformal court dress in which the dominant element was the imperial five-clawed dragon ( long ) or the four-clawed dragon ( mang ). In spite of repeated sumptuary laws issued during the Ming and Qing, the five-clawed dragon was seldom reserved for objects of exclusively imperial use. Symbols used on the dragon robes also included the eight Buddhist symbols, symbols of the Daoist Eight Immortals ( Baxian ), eight precious things, and other auspicious devices. “Mandarin squares” had been attached front and back to Ming official robes as symbols of civil and military rank and were adapted by the Manchus to their own distinctive dress.",
  "According to legend, about 140 bce , sericulture as well as silk had spread overland from China to India. By the 2nd century ce India was shipping its own raw silk and silk cloth to Persia. (Japan, too, acquired and developed a thriving sericulture a few centuries later.)",
  "  Persia became a centre of silk trade between East and West under the Parthians (247 bce –224 ce ). Silk dyeing and weaving developed as crafts in Syria, Egypt, Greece, and Rome. The workers there used some raw silk from East Asia, but they derived most of their yarn by unraveling silk fabrics from the East. Silk culture largely remained a secret of Asia.",
  " Bombyx  Eventually a strong demand for the local production of raw silk arose in the Mediterranean area. Justinian I , Byzantine emperor from 527 to 565, persuaded two Persian monks who had lived in China to return there and smuggle silkworms to Constantinople (now Istanbul) in the hollows of their bamboo canes ( c. 550 ce ). These few hardy silkworms were the beginning of all the varieties that stocked and supplied European sericulture until the 19th century.",
  " c.  Silk culture flourished in Europe for many centuries, especially in the Italian city-states and (from 1480) in France. In 1854, however, a devastating silkworm plague appeared. Louis Pasteur , who was asked to study the disease in 1865, discovered the cause and developed a means of control. The Italian industry recovered, but that of France never did. Meanwhile Japan was modernizing its methods of sericulture, and soon it was supplying a large portion of the world’s raw silk. During and after World War II the substitution of such man-made fibres as nylon in making hosiery and other garments greatly reduced the silk industry. Still, silk has remained an important luxury material and remains an important product of China, Japan, South Korea, and Thailand."
]