[
  " simple harmonic motion , in physics , repetitive movement back and forth through an equilibrium, or central, position, so that the maximum displacement on one side of this position is equal to the maximum displacement on the other side. The time interval of each complete vibration is the same. The force responsible for the motion is always directed toward the equilibrium position and is directly proportional to the distance from it. That is, F = − kx , where F is the force, x is the displacement, and k is a constant. This relation is called Hooke’s law .",
  "A specific example of a simple harmonic oscillator is the vibration of a mass attached to a vertical spring, the other end of which is fixed in a ceiling. At the maximum displacement − x, the spring is under its greatest tension, which forces the mass upward. At the maximum displacement + x, the spring reaches its greatest compression, which forces the mass back downward again. At either position of maximum displacement, the force is greatest and is directed toward the equilibrium position, the velocity ( v ) of the mass is zero, its acceleration is at a maximum, and the mass changes direction. At the equilibrium position, the velocity is at its maximum and the acceleration ( a ) has fallen to zero. Simple harmonic motion is characterized by this changing acceleration that always is directed toward the equilibrium position and is proportional to the displacement from the equilibrium position. Furthermore, the interval of time for each complete vibration is constant and does not depend on the size of the maximum displacement. In some form, therefore, simple harmonic motion is at the heart of timekeeping.",
  "To express how the displacement of the mass changes with time, one can use Newton’s second law , F = ma , and set ma = − kx . The acceleration a is the second derivative of x with respect to time t , and one can solve the resulting differential equation with x = A cos ω t , where A is the maximum displacement and ω is the angular frequency in radians per second. The time it takes the mass to move from A to − A and back again is the time it takes for ω t to advance by 2π. Therefore, the period T it takes for the mass to move from A to − A and back again is ω T = 2π, or T = 2π/ω. The frequency of the vibration in cycles per second is 1/ T or ω/2π.",
  "Many physical systems exhibit simple harmonic motion (assuming no energy loss): an oscillating pendulum, the electrons in a wire carrying alternating current , the vibrating particles of the medium in a sound wave, and other assemblages involving relatively small oscillations about a position of stable equilibrium.",
  "The motion is called harmonic because musical instruments make such vibrations that in turn cause corresponding sound waves in air. Musical sounds are actually a combination of many simple harmonic waves corresponding to the many ways in which the vibrating parts of a musical instrument oscillate in sets of superimposed simple harmonic motions, the frequencies of which are multiples of a lowest fundamental frequency. In fact, any regularly repetitive motion and any wave, no matter how complicated its form, can be treated as the sum of a series of simple harmonic motions or waves, a discovery first published in 1822 by the French mathematician Joseph Fourier."
]