[
  " song , piece of music performed by a single voice , with or without instrumental accompaniment. Works for several voices are called duets, trios , and so on; larger ensembles sing choral music . Speech and music have been combined from earliest times; music heightens the effect of words, allowing them to be rendered with a projection and passion that is difficult to attain in speech alone. Singing style differs both within and between cultures, often reflecting such variables as the ideals of social interaction, perceptions of the spirit world, and the degree to which a society uses writing as a principal means of communication. Some cultures value a relaxed, natural vocal quality, with loosely articulated lyrics, while others cultivate a highly trained, tense sound, with precisely enunciated words.",
  "In Western music, folk song is customarily distinguished from art song. Folk songs are usually sung unaccompanied or with accompaniment provided by a single instrument—e.g., a guitar or a dulcimer . They are usually learned by ear and are infrequently written down; hence, they are susceptible to changes of notes and words through generations of oral transmission. Composers of most folk songs are unknown.",
  "Art songs, by contrast, are intended for performance by professional, or at least carefully taught, singers, generally accompanied by piano or instrumental ensemble. The notes are written down, and notes and words are thereafter resistant to casual alteration. Popular songs stand midway between folk and art songs with regard to technical difficulty, complexity of the musical structure, and resistance to change.",
  "  Folk songs often accompany activities such as religious ceremonies, dancing, labour, or courting. Other folk songs tell stories; chief among these are narrative ballads and lyrics . Anglo-American ballads are action-oriented, often dealing with a tragic episode. Lyric songs are more emotion-oriented, more sentimental. In many cultures—both historical and contemporary—the singing of heroic epics is also an important tradition. Folk songs typically have relatively straightforward melodies, usually with only one or a few notes per syllable. The language tends to follow certain conventions and is often repetitive. In most cases music and words are easily understandable, but in some traditions a special register of language is used for singing, which renders performances only partially—if at all—comprehensible to the average listener.",
  "Art songs in the European tradition are rarely connected with extramusical activities. Their texts tend to be sophisticated, their melodies often wide-ranging and complex. Art song, like classical music as a whole, is essentially an urban phenomenon, with origins in the medieval courts, colleges, cities, and churches. Twelfth-century trouvères and troubadours left a large corpus of melodies and sung verse; they were imitated throughout Europe. Melodies and poems are subtle and highly organized, the products of an aristocratic society. Manuscripts indicate no accompaniment; presumably it was improvised.",
  "With the growth of polyphonic music in Europe in the 13th and 14th centuries, composers learned to assign the principal melody to a solo singer, with subsidiary melodies played on instruments. The technique of having one melody imitate a preceding one led by the 15th century to elaborate textures wherein the vocal line’s primacy was threatened; there followed a reaction in songs with the sparsest possible accompaniment, merely a few chords. These became widely popular, and by the 16th century careful declamation and audibility of text became again a central concern.",
  "Seventeenth-century dramatic music saw further refinement of song style. Distinctions arose between recitative and aria , the former entirely word-oriented and free, with minimal chordal accompaniment, and the latter more virtuosic and melodically elaborate, with a richer, more varied accompaniment. Being musically more interesting, arias came to dominate opera , cantata , and oratorio , and in the 18th century relatively little attention was paid to solo song outside these genres. The songs of Wolfgang Amadeus Mozart and Joseph Haydn , for example, are not considered among their best works. Only in popular music did simple strophic (stanzaic) songs with keyboard accompaniment flourish.",
  " Songs Without Words Lieder ohne Worte Songs Without Words  In the early 19th century Franz Schubert’s songs excelled in dramatic realization and musical quality. Robert Schumann , Johannes Brahms , and the other leading Romantic songwriters learned from Schubert not only the art of varying a strophic melody but also the potential significance of the accompaniment. Felix Mendelssohn ultimately elevated the accompaniment to the status of song in his Songs Without Words (1832–45; Lieder ohne Worte ), a collection of textless pieces that evoke poetic imagery through the sound of the piano alone. In French song the works of composers such as Gabriel Fauré and Claude Debussy characteristically possess shifting, kaleidoscopic harmonies , influenced in part by the fluid accentual patterns of the language.",
  "Later composers continued to explore the relation of voice to accompaniment and to expand the singer’s range of expression and technique, sometimes treating the voice instrumentally. George and Ira Gershwin , for instance, incorporated suggestions of scat singing—an improvisational jazz vocal technique that uses meaningless syllables to imitate the sound of instrumental solos—into their opera Porgy and Bess (1935). In the later 20th and the early 21st century, American vocalist and composer Bobby McFerrin was recognized for his extraordinary ability to imitate not only the sound of single instruments but also entire ensembles using only his voice. ( See also  chanson ; lied ; vocal music .)"
]