[
  " sound production , in animals, the initiation of sound as a means of information transmission. Sounds are termed vocal when produced in the respiratory system and mechanical when produced by mutual contact of body parts or by contact with some element in the environment. Vocal sounds are restricted to vertebrate animals; nonvocal sounds are produced by many invertebrates and by some members of all vertebrate classes.",
  "Many animals possess special structures for producing mechanical sounds. Crickets and grasshoppers produce sound by rubbing together rasplike structures on their wings. Cicadas, which emit the loudest sounds known from insects, do so by means of a pair of membranous organs (timbal organs) at the base of the abdomen. A special muscle deadens the hearing apparatus of the insect when it is calling.",
  "In the vertebrates many means of mechanical sound production exist. A number of birds, of widely divergent families, have feathers modified for producing sound in flight. The specially modified tail tip of the rattlesnake is another familiar example. Many animals, especially among the mammals, produce sounds with parts of the body that are specialized for other purposes; stamping or drumming on the ground with the feet is seen in many species, and slapping the water with the tail is a common means employed by aquatic mammals to warn others of danger.",
  "Many fishes produce sounds by moving bones or teeth against each other, sometimes with the swim bladder acting as a resonating cavity. Among amphibians, the sirens (order Trachystomata), salamanders (Caudata), and caecilians (Gymnophiona) are silent or nearly so, but the frogs (Anura) are highly vocal, producing species-specific sounds by moving air between the mouth and lungs past vocal chords in the windpipe (trachea). Among reptiles, crocodilians and some turtles produce low-pitched sounds; lizards (except geckos) and snakes are usually silent, except for hissing sounds uttered under stress. Vocal sounds of birds are produced by the syrinx, a specialized region at the lower (posterior) end of the trachea. Mammalian vocalizations, on the other hand, originate in the larynx, a modification of the upper (anterior) end of the trachea. Members of both groups may use the mouth for resonating or filtering sound or may possess special outpouchings of the trachea or esophagus that serve as resonating cavities."
]