[
  " strong force , a fundamental interaction of nature that acts between subatomic particles of matter. The strong force binds quarks together in clusters to make more-familiar subatomic particles, such as protons and neutrons . It also holds together the atomic nucleus and underlies interactions between all particles containing quarks.",
  "The strong force originates in a property known as colour. This property, which has no connection with colour in the visual sense of the word, is somewhat analogous to electric charge. Just as electric charge is the source of electromagnetism , or the electromagnetic force, so colour is the source of the strong force. Particles without colour, such as electrons and other leptons , do not “feel” the strong force; particles with colour, principally the quarks, do “feel” the strong force. Quantum chromodynamics , the quantum field theory describing strong interactions, takes its name from this central property of colour.",
  "Protons and neutrons are examples of baryons , a class of particles that contain three quarks, each with one of three possible values of colour (red, blue, and green). Quarks may also combine with antiquarks (their antiparticles , which have opposite colour) to form mesons , such as pi mesons and K mesons. Baryons and mesons all have a net colour of zero, and it seems that the strong force allows only combinations with zero colour to exist. Attempts to knock out individual quarks, in high-energy particle collisions, for example, result only in the creation of new “colourless” particles, mainly mesons.",
  "In strong interactions the quarks exchange gluons , the carriers of the strong force. Gluons, like photons (the messenger particles of the electromagnetic force), are massless particles with a whole unit of intrinsic spin. However, unlike photons, which are not electrically charged and therefore do not feel the electromagnetic force, gluons carry colour, which means that they do feel the strong force and can interact among themselves. One result of this difference is that, within its short range (about 10 −15 metre, roughly the diameter of a proton or a neutron), the strong force appears to become stronger with distance, unlike the other forces.",
  "As the distance between two quarks increases, the force between them increases rather as the tension does in a piece of elastic as its two ends are pulled apart. Eventually the elastic will break, yielding two pieces. Something similar happens with quarks, for with sufficient energy it is not one quark but a quark-antiquark pair that is “pulled” from a cluster. Thus, quarks appear always to be locked inside the observable mesons and baryons, a phenomenon known as confinement. At distances comparable to the diameter of a proton, the strong interaction between quarks is about 100 times greater than the electromagnetic interaction. At smaller distances, however, the strong force between quarks becomes weaker, and the quarks begin to behave like independent particles, an effect known as asymptotic freedom."
]