[
  " sunlight , also called sunshine , solar radiation that is visible at Earth’s surface. The amount of sunlight is dependent on the extent of the daytime cloud cover. Some places on Earth receive more than 4,000 hours per year of sunlight (more than 90 percent of the maximum possible), as in the Sahara; others receive less than 2,000 hours, as in regions of frequent storminess, such as Scotland and Iceland. Over much of the middle-latitude region of the world, the amount of sunlight varies regularly as the day progresses, owing to greater cloud cover in the early morning and during the late afternoon.",
  "Ordinarily, sunlight is broken down into three major components: (1) visible light, with wavelengths between 0.4 and 0.8 micrometre, (2) ultraviolet light, with wavelengths shorter than 0.4 micrometre, and (3) infrared radiation, with wavelengths longer than 0.8 micrometre. The visible portion constitutes nearly half of the total radiation received at the surface of Earth. Although ultraviolet light constitutes only a very small proportion of the total radiation, this component is extremely important. It produces vitamin D through the activation of ergosterol. Unfortunately, the polluted atmosphere over large cities robs solar radiation of a significant portion of its ultraviolet light. Infrared radiation has its chief merit in its heat-producing quality. Close to half of total solar radiation received at the surface of Earth is infrared.",
  "On its path through the atmosphere the solar radiation is absorbed and weakened by various constituents of the atmosphere. It is also scattered by air molecules and dust particles. Short wavelengths of light, such as blue, scatter more easily than do the longer red wavelengths. This phenomenon is responsible for the varying colour of the sky at different times of day. When the sun is high overhead, its rays pass through the intervening atmosphere almost vertically. The light thus encounters less dust and fewer air molecules than it would if the sun were low on the horizon and its rays had a longer passage through the atmosphere. During this long passage the dominant blue wavelengths of light are scattered and blocked, leaving the longer, unobstructed red wavelengths to reach Earth and lend their tints to the sky at dawn and dusk.",
  "An effective absorber of solar radiation is ozone, which forms by a photochemical process at heights of 10–50 km (6–30 miles) and filters out most of the radiation below 0.3 micrometre. Equally important as an absorber in the longer wavelengths is water vapour. A secondary absorber in the infrared range is carbon dioxide. These two filter out much of the solar energy with wavelengths longer than 1 micrometre.",
  "The Eppley pyrheliometer measures the length of time that the surface receives sunlight and the sunshine’s intensity as well. It consists of two concentric silver rings of equal area, one blackened and the other whitened, connected to a thermopile. The sun’s rays warm the blackened ring more than they do the whitened one, and this temperature difference produces an electromotive force that is nearly proportional to the sunlight’s intensity. The electromotive force is automatically measured and recorded and yields a continuous record of the duration and intensity of the periods of sunlight."
]