[
  " symmetry , in physics, the concept that the properties of particles such as atoms and molecules remain unchanged after being subjected to a variety of symmetry transformations or “operations.” Since the earliest days of natural philosophy ( Pythagoras in the 6th century bce ), symmetry has furnished insight into the laws of physics and the nature of the cosmos. The two outstanding theoretical achievements of the 20th century, relativity and quantum mechanics , involve notions of symmetry in a fundamental way.",
  "The application of symmetry to physics leads to the important conclusion that certain physical laws, particularly conservation laws , governing the behaviour of objects and particles are not affected when their geometric coordinates—including time, when it is considered as a fourth dimension—are transformed by means of symmetry operations. The physical laws thus remain valid at all places and times in the universe. In particle physics , considerations of symmetry can be used to derive conservation laws and to determine which particle interactions can take place and which cannot (the latter are said to be forbidden). Symmetry also has applications in many other areas of physics and chemistry—for example, in relativity and quantum theory, crystallography, and spectroscopy . Crystals and molecules may indeed be described in terms of the number and type of symmetry operations that can be performed on them. The quantitative discussion of symmetry is called group theory.",
  "Valid symmetry operations are those that can be performed without changing the appearance of an object. The number and type of such operations depend on the geometry of the object to which the operations are applied. The meaning and variety of symmetry operations may be illustrated by considering a square lying on a table. For the square, valid operations are (1) rotation about its centre through 90°, 180°, 270°, or 360°, (2) reflection through mirror planes perpendicular to the table and running either through any two opposite corners of the square or through the midpoints of any two opposing sides, and (3) reflection through a mirror plane in the plane of the table. There are therefore nine symmetry operations that yield a result indistinguishable from the original square. A circle would be said to have higher symmetry because, for example, it could be rotated through an infinite number of angles (not just multiples of 90°) to give an identical circle.",
  " Subatomic particles have various properties and are affected by certain forces that exhibit symmetry. An important property that gives rise to a conservation law is parity . In quantum mechanics all elementary particles and atoms may be described in terms of a wave equation. If this wave equation remains identical after simultaneous reflection of all spatial coordinates of the particle through the origin of the coordinate system, then it is said to have even parity. If such simultaneous reflection results in a wave equation that differs from the original wave equation only in sign, then the particle is said to have odd parity. The overall parity of a collection of particles, such as a molecule, is found to be unchanged with time during physical processes and reactions; this fact is expressed as the law of conservation of parity. At the subatomic level, however, parity is not conserved in reactions that are due to the weak force .",
  "Elementary particles are also said to have internal symmetry; these symmetries are useful in classifying particles and in leading to selection rules . Such an internal symmetry is baryon number, which is a property of a class of particles called hadrons . Hadrons with a baryon number of zero are called mesons , those with a number of +1 are baryons . By symmetry there must exist another class of particles with a baryon number of −1; these are the antimatter counterparts of baryons called antibaryons. Baryon number is conserved during nuclear interactions."
]