[
  " Time , American weekly newsmagazine , published in New York City . Time was the creation of two young journalists, Henry R. Luce and Briton Hadden, who wanted to start a magazine that would inform busy readers in a systematic, concise, and well-organized manner about current events in the United States and the rest of the world. With Hadden as editor and Luce as business manager, they brought out the first issue on March 3, 1923. Time ’s format became standard for most other general newsmagazines, consisting of dozens of short articles tersely summarizing information on subjects of importance and general interest and arranged in “departments” covering such fields as national and international affairs, business, education, science, medicine, law, religion, sports, books, and the arts.",
  " Time attained a circulation of more than 175,000 by 1927, and it became the most influential newsmagazine in the United States. After Hadden’s death in 1929, Luce remained the editor and guiding force behind the magazine until 1964, when he assumed the title of editorial chairman of Time Inc. , the magazine’s publisher. Time long reflected Luce’s moderately conservative political viewpoint. By the 1970s, however, the magazine had assumed a more neutral, centrist stance in the tone of its reportage. From the 1970s to the end of the 20th century, the magazine’s circulation hovered just above four million, significantly higher than its U.S. rivals, Newsweek and U.S. News & World Report . At the turn of the century, owing to industry-wide declines in circulation and advertising in print news media, Time underwent a period of restructuring that included job cuts, employee buyouts, and the closure of several of its domestic bureaus. In 2017 Time Inc. agreed to sell itself to the Meredith Corporation in a deal valued at nearly $3 billion.",
  " Time appears in several foreign-language editions and publishes a number of annual issues, including the Time Person of the Year and the Time 100 issues, designating the most influential persons of the year. It also publishes Time for Kids , a weekly children’s magazine."
]