[
  "  Tower Hamlets , inner borough of London , England , extending eastward from the Tower of London and including most of the East End of Inner London . The meandering River Thames forms the southern boundary, the City of London lies to the west, Hackney is to the north, and Newham lies beyond the River Lea to the east. Tower Hamlets borough belongs to the historic county of Middlesex . The borough was established in 1965 by amalgamation of the former metropolitan boroughs of Bethnal Green, Poplar, and Stepney. It includes such areas and historic towns as (roughly from west to east) Spitalfields , Whitechapel, Bethnal Green, Wapping, Shadwell, Mile End, Stepney, Limehouse , Old Ford, Bow, Bromley, Poplar, and the Isle of Dogs (with Millwall, the West India Docks, and Cubitt Town).",
  "The Thames brought successive waves of immigrants to Tower Hamlets: French Huguenots established silk weaving in Spitalfields after 1685; Irish labourers came to build London’s expanding wet docks after about 1800; and from the 1880s Jews fled the pogroms of eastern and central Europe and established clothing and footwear crafts on Middlesex Street (Petticoat Lane) and on Commercial Street. Bengalis, originally drawn to the area as seamen, settled there in increasing numbers from the 1960s. In the early 21st century, ethnic minorities accounted for nearly half of the borough’s population.",
  " c. Encyclopædia Britannica  The poverty and attendant social problems of the East End have long drawn attention; in the late 19th century William Booth founded the Salvation Army there. Traditionally, the life of the area centred on the wharves along the Thames. Isambard Kingdom Brunel ’s steamship Great Eastern was launched at Millwall in 1859, and shipbuilding flourished there until the 1890s. Various roads were cut to the docks, and the now recreational Regent’s Canal linked the borough to northern England by way of the Grand Union Canal. Heavy damage inflicted by German bombing during World War II prompted a first wave of urban renewal, which was dominated by public housing. Dock and wharf closures from the late 1960s prompted a second, privately driven development boom. In the 1980s Canary Wharf and the area of the Isle of Dogs saw much innovative construction as part of the London Docklands redevelopment project. Near the Tower of London, the area of St. Katharine’s Docks (1825–28) was transformed beginning in 1968 by construction of a hotel, a trade centre, apartments, and a marina. In the late 20th century the borough became a centre for newspaper printing and publishing, as many firms relocated there from Fleet Street in the City of London.",
  "Several historic buildings survived the wartime bombings, including the Tower, the Royal Mint (no longer in use), All Hallows by the Tower (one of the oldest churches in London, containing a Roman mosaic floor), and three churches designed by Nicholas Hawksmoor —St. Anne (1712–24) in Limehouse, Christ Church (1714–29) in Spitalfields, and St. George in the East (1714–29). In the western part of the borough, the Whitechapel Art Gallery exhibits modern and contemporary works. Notable public open spaces include Victoria Park (in part) and Cemetery Park.",
  "   Tower Bridge carries traffic across the Thames, and the borough is linked to Southwark by the Rotherhithe Tunnel (1904–08). Farther east, both a pedestrian tunnel and the Blackwall Tunnel provide links with Greenwich . The Tower of London was designated a UNESCO World Heritage site in 1988. Area 7.6 square miles (20 square km). Pop. (2001) 196,106; (2011) 254,096."
]