[
  " trust , in Anglo-American law, a relationship between persons in which one has the power to manage property and the other has the privilege of receiving the benefits from that property. There is no precise equivalent to the trust in civil-law systems.",
  "A brief treatment of trusts follows. For full treatment, see  property law: Trusts .",
  "The trust is of great practical importance in Anglo-American legal systems. Consciously created trusts, usually called “express trusts,” are used in a wide variety of contexts, most notably in family settlements and in charitable gifts. Courts may also impose trusts on people who have not consciously created them in order to remedy a legal wrong (“constructive trusts”).",
  "Fundamental to the notion of the trust is the division of ownership between “legal” and “equitable.” This division had its origins in separate English courts in the late medieval period. The courts of common law recognized and enforced the legal ownership, while the courts of equity (e.g., Chancery) recognized and enforced the equitable ownership. The conceptual division of the two types of ownership, however, survived the merger of the law and equity courts that occurred in the 19th and 20th centuries. Thus, today, legal and equitable interests are usually enforced by the same courts, but they remain conceptually distinct.",
  "The basic distinction between legal and equitable ownership is quite simple. The legal owner of the property (the “trustee”) has the right to possession, the privilege of use, and the power to convey those rights and privileges. The trustee thus looks like the owner of the property to all the world except one person, the beneficial owner (“beneficiary”). As between the trustee and the beneficiary, the beneficiary receives all the benefits of the property. The trustee has the fiduciary duty to the beneficial owner to exercise his legal rights, privileges, and powers in such a way as to benefit not himself but the beneficiary. If the trustee fails to do this, the courts will require him to account to the beneficiary and may, in extreme cases, remove him as legal owner and substitute another in his stead.",
  "The divisions between legal and beneficial ownership are normally created by an express instrument of trust (usually a deed of trust or a will). The maker (“settlor”) of the trust will convey property to the trustee (who may be an individual or a corporation, such as a bank or trust company) and instruct the trustee to hold and manage the property for the benefit of one or more beneficiaries of the trust.",
  "While trusts are normally created by an express instrument of trust, courts will sometimes imply a trust between people who have not gone through the formal steps. A simple example would be the situation in which one member of a family advances money to another and asks the second member to hold the money or to invest it for him. A more complicated example of an implied trust would be the situation in which one party provides money to another for the purchase of property. Unless such provision was explicitly made as a gift or as the natural expression of a close relationship (e.g., parent-child), the acquired property is held in trust for the person who provided the money even though the second party holds the legal title. (This type of trust is frequently called a “resulting trust.”) Finally, courts will sometimes impose a trust relationship upon parties where there is no evidence that such a relationship was intended. For example, where one party obtains property from another by making fraudulent representations, the defrauding party is frequently required to hold the property in trust for the defrauded party. (This type of trust is a constructive trust.)",
  "Private express trusts are probably the most common form of trust. They are a traditional means of providing financial security for families. By will or by deed of trust, a testator or settlor places property in trust to provide for his family after he is deceased. The trustee may be a professional or may be a member of the family with experience in managing money, or a group of trustees may be chosen. The trustees will invest the property in a way that allows them to make regular payments to the deceased’s survivors. In some situations, such as where the deceased left minor or incompetent survivors, a court may create a trust for such persons’ benefit, even if the deceased did not do so. Hence, statutory guardianships for minors and incompetents are sometimes called “statutory trusts.”",
  "Public express trusts are created to benefit larger numbers of people, or, at least, are created with wider benefits in mind. The most common public trusts are charitable trusts, whose holdings are intended to support religious organizations, to enhance education, or to relieve the effects of poverty and other misfortunes. Such trusts are recognized for their beneficial social impact and are given certain privileges, such as tax exemption. Other public trusts are not considered charitable and are not so privileged. These include holdings for public groups with a common interest, such as a political party, a professional association, or a social or recreational organization.",
  "In the commercial sector, trusts have come to play important roles. Trusts may be established to manage various funds designated for special purposes by businesses and corporations. Such designations might include funds deposited against bonds issued by the company or liens on property that are being used as collateral against bonds. Money for employee-pension funds or profit-sharing programs is often managed through trust arrangements. Such commercial trusts are almost always managed by corporate trustees.",
  "Some modern civil-law systems, such as that of Mexico, have created an institution like a trust, but this has normally been done by adapting trust ideas from the Anglo-American system rather than by developing native ideas. In civil-law jurisdictions, many of the purposes to which the Anglo-American trust is put can be achieved in other ways. For example, the charitable trust of Anglo-American law has a close analogy in the civil-law “foundation” (French fondation, German Stiftung ). Regarding the purposes for private express trusts mentioned above, lawyers in European countries get professional management for assets by turning them over to managers who are paid a fee for their services. There is, however, a greater preference in civil-law countries than there is in Anglo-American ones for the administration of property by the person who owns and benefits from it."
]