[
  " tuna , (genus Thunnus ), also called tunny , any of seven species of oceanic fishes , some very large, that constitute the genus Thunnus and are of great commercial value as food. They are related to mackerels and are placed with them in the family Scombridae (order Perciformes ). Tunas vary considerably, both within and among species.",
  " Thunnus thynnus  Tunas are elongated, robust, and streamlined fishes; they have a rounded body that tapers to a slender tail base and a forked or crescent-shaped tail. In colour, tunas are generally dark above and silvery below, often with an iridescent shine. They have a conspicuous keel on either side of the tail base, a row of small finlets behind dorsal and anal fins, and a corselet of enlarged scales in the shoulder region. Another notable feature is a well-developed network of blood vessels below the skin that acts as a temperature-regulating device associated with long-term, slow swimming. Because of this vascular system, tunas are unique among fishes in their ability to maintain the temperature of their bodies above that of the surrounding water, often between 5 and 12 °C (9 and 21.7 °F) above ambient water temperature. Some muscles may even be up to 21 °C (almost 39 °F) higher than the surrounding water.",
  " Thunnus alalunga  The seven species of tunas in the genus Thunnus are the northern bluefin tuna ( T. thynnus ), albacore ( T. alalunga ), yellowfin tuna ( T. albacares ), southern bluefin tuna ( T. thynnus maccoyii ), bigeye tuna ( T. obesus ), blackfin tuna ( T. atlanticus ), and longtail tuna ( T. tonggol ). These different species range from moderate to very large in size. The giant of the group is the northern bluefin tuna, which grows to a maximum length and weight of about 4.3 metres (14 feet) and 800 kg (1,800 pounds). The yellowfin tuna reaches a maximum weight of about 180 kg (397 pounds), and the albacore grows to about 36 kg (79 pounds).",
  " Thunnus thynnus  The northern bluefin tuna characteristically has yellow finlets and is often marked with silvery spots or bars. It is important in sport and commercial fishing , with anglers rating it among the greatest trophies obtainable. Populations of northern bluefin tuna in the Atlantic Ocean have declined significantly since preindustrial times because of overfishing. As a result, many scientists and environmental organizations have called for a moratorium on the harvesting of this species. Such a ban, however, has yet to be implemented. The other commercially important species are the albacore, marked with a shining blue stripe on each side; the yellowfin, with yellow fins and a golden stripe on each side; and the bigeye, a robust fish with relatively large eyes.",
  "Tunas migrate long distances over all the world’s oceans and occupy tropical, temperate, and even some cooler waters. The only two species of relatively limited distribution are the blackfin tuna (western Atlantic) and the longtail tuna (Indo-Pacific region). Tunas feed on fishes, squid , shellfish , and a variety of planktonic organisms . They spawn in the open sea over very large areas. The canned meat of albacore and yellowfin tunas is one of the world’s most popular seafoods. Measures were undertaken in the late 20th century to prevent large numbers of dolphins from being killed by the nets used to catch tuna in the world’s oceans.",
  " Katsuwonus pelamis  Several other species in the family Scombridae are commonly known as tuna, among them the skipjack tuna ( Katsuwonus, or Euthynnus, pelamis ), a fish that is found worldwide and grows to about 90 cm (3 feet) and 23 kg (51 pounds). The bonitos , of the genus Sarda, are tunalike fishes found worldwide and have both commercial and sporting value."
]