[
  " walking , activity that ranges from a competitive sport, usually known as race walking, to a primary and popular form of outdoor recreation and mild aerobic exercise.",
  "The technique followed in the track-and-field sport of racewalking requires that a competitor’s advancing foot touch the ground before the rear foot leaves the ground, and for this reason the sport is sometimes known as heel-and-toe racing. In all countries in the world—with the exception of England—and in the Olympic Games the advancing leg must also be straightened briefly while that foot is in contact with the ground.",
  "Walking as a competitive sport dates from the latter half of the 19th century, although stories of individual walking feats were recorded much earlier. A 7-mile (11-km) walking event was introduced by the Amateur Athletic Club of England at its championships in 1866. During the 1870s and ’80s, professional races were held indoors in New York City in which athletes competed around the clock but were permitted to eat, rest, or nap. The winner was the contestant who covered the greatest distance in six days.",
  "Walking races of 10 miles and 3,500 metres were added to the men’s Olympic program in 1908. Since 1956, however, the Olympic distances have been 20 and 50 km. A women’s 10-km walk was introduced at the 1992 Games; at the 2000 Games the women’s walking event was extended to 20 km.",
  "Organized noncompetitive walking is extremely popular in the United States and Europe. Millions participate for the relaxation and exercise it offers. Walking for recreation or fitness is differentiated from hiking by its shorter distances, less challenging settings, and the lack of need for specialized equipment. Walking can simply be an unorganized meander around a local park or trail for relaxation or a daily regimen of several miles that is undertaken for health benefits.",
  "The shoes needed for comfortable recreational walking vary by conditions and the type of walk undertaken. While distance walkers often use conventional hiking boots, particularly in colder weather, shorter-distance recreational walking can comfortably be done in lighter shoes similar to those worn by runners.",
  "Walking is the preferred exercise of a significant segment of the population of North America and Europe. Its health benefits are well documented, ranging from better overall cardiovascular health to the promotion of healthy weight loss, stress relief, and a reduction in the risk of some forms of cancer by up to 40 percent. One major attraction of fitness walking is its less strenuous nature, which reduces the likelihood of the types of injuries more commonly seen in such high-impact sports as running. Fitness walking is an ideal form of exercise for senior citizens and others who need to exercise but prefer a more gentle means of doing so.",
  "Recreational walkers often utilize short sections of trails designed for long-distance hikers. However, not all walking trips are short. Some organized walks last for days and cover distances in excess of 50 miles. Through the efforts of organized walking associations, recreational walkers have established a sizeable trail network of their own in cities and rural areas. In the United States, the American Volkssport Federation is an umbrella organization made up of more than 500 local walking clubs nationwide that promote recreational walking and organize group walks or rambles. In Canada, the Canadian Volkssport Federation is home to another 100 local walking clubs that promote recreational walking in their areas. In Great Britain, the British Walking Federation oversees approximately 40 walking clubs nationwide.",
  " Elaine P. Ward (ed.), Masters Racewalking: American Coaches and Athletes Share Ideas on Technique, Training, and Racing (1996)."
]