[
  " 2  water , a substance composed of the chemical elements  hydrogen and oxygen and existing in gaseous, liquid, and solid states. It is one of the most plentiful and essential of compounds . A tasteless and odourless liquid at room temperature, it has the important ability to dissolve many other substances. Indeed, the versatility of water as a solvent is essential to living organisms. Life is believed to have originated in the aqueous solutions of the world’s oceans , and living organisms depend on aqueous solutions, such as blood and digestive juices, for biological processes. Water also exists on other planets and moons both within and beyond the solar system. In small quantities water appears colourless, but water actually has an intrinsic blue colour caused by slight absorption of light at red wavelengths.",
  "  Although the molecules of water are simple in structure (H 2 O), the physical and chemical properties of the compound are extraordinarily complicated, and they are not typical of most substances found on Earth. For example, although the sight of ice cubes floating in a glass of ice water is commonplace, such behaviour is unusual for chemical entities. For almost every other compound, the solid state is denser than the liquid state; thus, the solid would sink to the bottom of the liquid. The fact that ice floats on water is exceedingly important in the natural world, because the ice that forms on ponds and lakes in cold areas of the world acts as an insulating barrier that protects the aquatic life below. If ice were denser than liquid water, ice forming on a pond would sink, thereby exposing more water to the cold temperature. Thus, the pond would eventually freeze throughout, killing all the life-forms present.",
  "  Water occurs as a liquid on the surface of Earth under normal conditions, which makes it invaluable for transportation, for recreation, and as a habitat for a myriad of plants and animals . The fact that water is readily changed to a vapour (gas) allows it to be transported through the atmosphere from the oceans to inland areas where it condenses and, as rain, nourishes plant and animal life. ( See  hydrosphere: The hydrologic cycle for a description of the cycle by which water is transferred over Earth.)",
  "Because of its prominence, water has long played an important religious and philosophical role in human history. In the 6th century bce , Thales of Miletus , sometimes credited for initiating Greek philosophy , regarded water as the sole fundamental building block of matter:",
  "It is water that, in taking different forms, constitutes the earth, atmosphere, sky, mountains, gods and men, beasts and birds, grass and trees, and animals down to worms, flies and ants. All these are different forms of water. Meditate on water!",
  "Two hundred years later, Aristotle considered water to be one of four fundamental elements, in addition to earth, air, and fire. The belief that water was a fundamental substance persisted for more than 2,000 years until experiments in the second half of the 18th century showed that water is a compound made up of the elements hydrogen and oxygen.",
  "    The water on the surface of Earth is found mainly in its oceans (97.25 percent) and polar ice caps and glaciers (2.05 percent), with the balance in freshwater lakes, rivers, and groundwater. As Earth’s population grows and the demand for fresh water increases, water purification and recycling become increasingly important. Interestingly, the purity requirements of water for industrial use often exceed those for human consumption. For example, the water used in high-pressure boilers must be at least 99.999998 percent pure. Because seawater contains large quantities of dissolved salts, it must be desalinated for most uses, including human consumption.",
  "This article describes the molecular structure of water as well as its physical and chemical properties. For other major treatments of water, see  climate ; environmental works ; hydrosphere ; ice ; and pollution .",
  "  The water molecule is composed of two hydrogen atoms , each linked by a single chemical bond to an oxygen atom. Most hydrogen atoms have a nucleus consisting solely of a proton . Two isotopic forms, deuterium and tritium , in which the atomic nuclei also contain one and two neutrons , respectively, are found to a small degree in water. Deuterium oxide (D 2 O), called heavy water , is important in chemical research and is also used as a neutron moderator in some nuclear reactors .",
  "Although its formula (H 2 O) seems simple, water exhibits very complex chemical and physical properties. For example, its melting point , 0 °C (32 °F), and boiling point , 100 °C (212 °F), are much higher than would be expected by comparison with analogous compounds, such as hydrogen sulfide and ammonia . In its solid form, ice, water is less dense than when it is liquid, another unusual property. The root of these anomalies lies in the electronic structure of the water molecule.",
  "The water molecule is not linear but bent in a special way. The two hydrogen atoms are bound to the oxygen atom at an angle of 104.5°.   ",
  "The O―H distance (bond length) is 95.7 picometres (9.57 × 10 −11 metres, or 3.77 × 10 −9 inches). Because an oxygen atom has a greater electronegativity than a hydrogen atom, the O―H bonds in the water molecule are polar, with the oxygen bearing a partial negative charge (δ−) and the hydrogens having a partial positive charge (δ+).   ",
  "  Hydrogen atoms in water molecules are attracted to regions of high electron density and can form weak linkages, called hydrogen bonds, with those regions. This means that the hydrogen atoms in one water molecule are attracted to the nonbonding electron pairs of the oxygen atom on an adjacent water molecule. The structure of liquid water is believed to consist of aggregates of water molecules that form and re-form continually. This short-range order, as it is called, accounts for other unusual properties of water, such as its high viscosity and surface tension .",
  "An oxygen atom has six electrons in its outer ( valence ) shell, which can hold a total of eight electrons. When an oxygen atom forms a single chemical bond, it shares one of its own electrons with the nucleus of another atom and receives in return a share of an electron from that atom. When bonded to two hydrogen atoms, the outer electron shell of the oxygen atom is filled.",
  "The electron arrangement in the water molecule can be represented as follows.   ",
  "Each pair of dots represents a pair of unshared electrons (i.e., the electrons reside on only the oxygen atom). This situation can also be depicted by placing the water molecule in a cube.   ",
  "Each ↑↓ symbol represents a pair of unshared electrons. This electronic structure leads to hydrogen bonding.   ",
  "In the solid state (ice), intermolecular interactions lead to a highly ordered but loose structure in which each oxygen atom is surrounded by four hydrogen atoms; two of these hydrogen atoms are covalently bonded to the oxygen atom, and the two others (at longer distances) are hydrogen bonded to the oxygen atom’s unshared electron pairs.",
  "This open structure of ice causes its density to be less than that of the liquid state, in which the ordered structure is partially broken down and the water molecules are (on average) closer together. When water freezes, a variety of structures are possible depending on the conditions. Eighteen different forms of ice are known and can be interchanged by varying external pressure and temperature.",
  "The liquid state of water has a very complex structure, which undoubtedly involves considerable association of the molecules. The extensive hydrogen bonding among the molecules in liquid water produces much larger values for properties such as viscosity, surface tension, and boiling point than are expected for a typical liquid containing small molecules. For example, based on the size of its molecules, water would be expected to have a boiling point nearly 200 °C (360 °F) lower than its observed boiling point. In contrast to the condensed states (solid and liquid) of water, which exhibit extensive association among the water molecules, its gaseous (vapour) phase contains relatively independent water molecules at large distances from each other.",
  "The polarity of the water molecule plays a major part in the dissolution of ionic compounds during the formation of aqueous solutions. Earth’s oceans contain vast amounts of dissolved salts, which provide a great natural resource. In addition, the hundreds of chemical reactions that occur every instant to keep organisms alive all take place in aqueous fluids. Also, the ability of foods to be flavoured as they are cooked is made possible by the solubility in water of such substances as sugar and salt. Although the solubility of substances in water is an extremely complex process, the interaction between the polar water molecules and the solute (i.e., the substance being dissolved) plays a major role. When an ionic solid dissolves in water, the positive ends of the water molecules are attracted to the anions , while their negative ends are attracted to the cations . This process is called hydration. The hydration of its ions tends to cause a salt to break apart (dissolve) in the water. In the dissolving process the strong forces present between the positive and negative ions of the solid are replaced by strong water-ion interactions.",
  "When ionic substances dissolve in water, they break apart into individual cations and anions. For instance, when sodium chloride (NaCl) dissolves in water, the resulting solution contains separated Na + and Cl − ions.   ",
  "  In this equation the (s) represents the solid state, and the (aq), which is an abbreviation for aqueous, shows that the ions are hydrated—that is, they have a certain number of water molecules attached to them. As sodium chloride dissolves, four water molecules closely associate with the sodium ion. (The hydration number of Na + is four.) Just outside this inner hydration sphere is a region where water molecules are partially ordered by the presence of the [Na(H 2 O) 4 ] + hydrated ion. This partially ordered region blends into “regular” (bulk) liquid water.",
  "Generally speaking, the greater the charge density (the ratio of charge to surface area) of an ion, the larger the hydration number will be. As a rule, negative ions have smaller hydration numbers than positive ions because of the greater crowding that occurs when the hydrogen atoms of the water molecules are oriented toward the anion.",
  "Many nonionic compounds are also soluble in water. For example, ethanol (C 2 H 5 OH), the alcoholic component of wine , beer , and distilled spirits , is highly soluble in water. These beverages contain varying percentages of ethanol in aqueous solution with other substances. Ethanol is so soluble in water because of the structure of the alcohol molecule. The molecule contains a polar O―H bond like those in water, which allows it to interact effectively with water.",
  "There are many substances for which water is not an acceptable solvent. Animal fat , for example, is insoluble in pure water because the nonpolar nature of fat molecules renders them incompatible with polar water molecules. In general, polar and ionic substances are soluble in water. A useful rule of thumb for determining whether two substances are likely to be miscible (i.e., will mix to form a solution) is “like dissolves like.” That is, two polar substances are likely to mix to form a solution, as are two nonpolar substances.",
  "The characteristic ability of water to behave as a polar solvent (dissolving medium) changes when water is subjected to high temperatures and pressures. As water becomes hotter, the molecules seem much more likely to interact with nonpolar molecules. For example, at 300 °C (572 °F) and high pressure, water has dissolving properties very similar to acetone (CH 3 COCH 3 ), a common organic solvent.",
  "Water exhibits particularly unusual behaviour beyond its critical temperature and pressure (374 °C [705.2 °F], 218 atmospheres). Above its critical temperature, the distinction between the liquid and gaseous states of water disappears—it becomes a supercritical fluid, the density of which can be varied from liquidlike to gaslike by varying its temperature and pressure. If the density of supercritical water is high enough, ionic solutes are readily soluble, as is true for “normal” water; but, surprisingly, this supercritical fluid can also readily dissolve nonpolar substances—something ordinary water cannot do. Because of its ability to dissolve nonpolar substances, supercritical water can be used as a combustion medium for destroying toxic wastes. For example, organic wastes can be mixed with oxygen in sufficiently dense supercritical water and combusted in the fluid; the flame actually burns “underwater.” Oxidation in supercritical water can be used to destroy a wide variety of hazardous organic substances with the advantage that a supercritical-water reactor is a closed system, so there are no emissions released into the atmosphere.",
  "Water has several important physical properties. Although these properties are familiar because of the omnipresence of water, most of the physical properties of water are quite atypical. Given the low molar mass of its constituent molecules, water has unusually large values of viscosity, surface tension, heat of vaporization , and entropy of vaporization, all of which can be ascribed to the extensive hydrogen bonding interactions present in liquid water. The open structure of ice that allows for maximum hydrogen bonding explains why solid water is less dense than liquid water—a highly unusual situation among common substances.",
  "Water undergoes various types of chemical reactions. One of the most important chemical properties of water is its ability to behave as both an acid (a proton donor) and a base (a proton acceptor), the characteristic property of amphoteric substances. This behaviour is most clearly seen in the autoionization of water: H 2 O(l) + H 2 O(l) ⇌ H 3 O + (aq) + OH − (aq), where the (l) represents the liquid state, the (aq) indicates that the species are dissolved in water, and the double arrows indicate that the reaction can occur in either direction and an equilibrium condition exists. At 25 °C (77 °F) the concentration of hydrated H + (i.e., H 3 O + , known as the hydronium ion) in water is 1.0 × 10 −7 M, where M represents moles per litre. Since one OH − ion is produced for each H 3 O + ion, the concentration of OH − at 25 °C is also 1.0 × 10 −7 M. In water at 25 °C the H 3 O + concentration and the OH − concentration must always be 1.0 × 10 −14 : [H + ][OH − ] = 1.0 × 10 −14 , where [H + ] represents the concentration of hydrated H + ions in moles per litre and [OH − ] represents the concentration of OH − ions in moles per litre.",
  "When an acid (a substance that can produce H + ions) is dissolved in water, both the acid and the water contribute H + ions to the solution. This leads to a situation in which the H + concentration is greater than 1.0 × 10 −7 M. Since it must always be true that [H + ][OH − ] = 1.0 × 10 −14 at 25 °C, the [OH − ] must be lowered to some value below 1.0 × 10 −7 . The mechanism for reducing the concentration of OH − involves the reaction H + + OH − → H 2 O, which occurs to the extent needed to restore the product of [H + ] and [OH − ] to 1.0 × 10 −14 M. Thus, when an acid is added to water, the resulting solution contains more H + than OH − ; that is, [H + ] > [OH − ]. Such a solution (in which [H + ] > [OH − ]) is said to be acidic.",
  "The most common method for specifying the acidity of a solution is its pH , which is defined in terms of the hydrogen ion concentration: pH = −log [H + ], where the symbol log stands for a base-10 logarithm . In pure water, in which [H + ] = 1.0 × 10 −7 M, the pH = 7.0. For an acidic solution, the pH is less than 7. When a base (a substance that behaves as a proton acceptor) is dissolved in water, the H + concentration is decreased so that [OH − ] > [H + ]. A basic solution is characterized by having a pH > 7. In summary, in aqueous solutions at 25 °C:",
  "When an active metal such as sodium is placed in contact with liquid water, a violent exothermic (heat-producing) reaction occurs that releases flaming hydrogen gas. 2Na(s) + 2H 2 O(l) → 2Na + (aq) + 2OH − (aq) + H 2 (g) This is an example of an oxidation-reduction reaction , which is a reaction in which electrons are transferred from one atom to another. In this case, electrons are transferred from sodium atoms (forming Na + ions) to water molecules to produce hydrogen gas and OH − ions. The other alkali metals give similar reactions with water. Less-active metals react slowly with water. For example, iron reacts at a negligible rate with liquid water but reacts much more rapidly with superheated steam to form iron oxide and hydrogen gas.   ",
  "Noble metals, such as gold and silver , do not react with water at all."
]