[
  " weather , state of the atmosphere at a particular place during a short period of time. It involves such atmospheric phenomena as temperature , humidity , precipitation (type and amount), air pressure , wind , and cloud cover. Weather differs from climate in that the latter includes the synthesis of weather conditions that have prevailed over a given area during a long time period—generally 30 years. For a full discussion of the elements and origins of weather, see  climate . For a treatment of how conditions in space affect satellites and other technologies, see  space weather .",
  "  Weather, as most commonly defined, occurs in the troposphere, the lowest region of the atmosphere that extends from the Earth’s surface to 6–8 km (4–5 miles) at the poles and to about 17 km (11 miles) at the Equator. Weather is largely confined to the troposphere since this is where almost all clouds occur and almost all precipitation develops. Phenomena occurring in higher regions of the troposphere and above, such as jet streams and upper-air waves, significantly affect sea-level atmospheric-pressure patterns—the so-called highs and lows—and thereby the weather conditions at the terrestrial surface. Geographic features, most notably mountains and large bodies of water (e.g., lakes and oceans), also affect weather. Recent research, for example, has revealed that ocean-surface temperature anomalies are a potential cause of atmospheric temperature anomalies in successive seasons and at distant locations. One manifestation of such weather-affecting interactions between the ocean and the atmosphere is what scientists call the El Niño/Southern Oscillation (ENSO). It is believed that ENSO is responsible not only for unusual weather events in the equatorial Pacific region (e.g., the exceedingly severe drought in Australia and the torrential rains in western South America in 1982–83) but also for those that periodically occur in the mid-latitudes (as, for example, the record-high summer temperatures in western Europe and unusually heavy spring rains in the central United States in 1982–83). The ENSO event of 1997–98 was associated with winter temperatures well above average in much of the United States. The ENSO phenomenon appears to influence mid-latitude weather conditions by modulating the position and intensity of the polar-front jet stream ( see  jet stream ).",
  "Generally speaking, the changeability of weather varies widely in different parts of the world. It is most pronounced in the mid-latitude belts of the westerly winds, where a usually continuous procession of traveling high- and low-pressure centres produces a constantly shifting weather pattern. In tropical regions, by contrast, weather varies little from day to day or from month to month.",
  "Weather has a tremendous influence on human settlement patterns, food production, and personal comfort. Extremes of temperature and humidity cause discomfort and may lead to the transmission of disease; heavy rain can cause flooding, displacing people and interrupting economic activities; thunderstorms, tornadoes, hail, and sleet storms may damage or destroy crops, buildings, and transportation routes and vehicles. Storms may even kill or injure people and livestock. At sea and along adjacent coastal areas, tropical cyclones (also called hurricanes or typhoons) can cause great damage through excessive rainfall and flooding, winds, and wave action to ships, buildings, trees, crops, roads, and railways, and they may interrupt air service and communications. Heavy snowfall and icy conditions can impede transportation and increase the frequency of accidents. The long absence of rainfall, by contrast, can cause droughts and severe dust storms when winds blow over parched farmland, as with the “dustbowl” conditions of the U.S. Plains states in the 1930s.",
  "The variability of weather phenomena has resulted in a long-standing human concern with predictions of future weather conditions and weather forecasting . In early historical times, severe weather was ascribed to annoyed or malevolent divinities. Since the mid-19th century, scientific weather forecasting has evolved, using the precise measurement of air pressure, temperature, humidity, and wind direction and speed to predict changing weather. The development of weather satellites since the 1980s has enabled meteorologists to track the movement of cyclones, anticyclones, their associated fronts, and storms worldwide. In addition, the use of radar permits the monitoring of precipitation, clouds, and tropospheric winds. To predict the weather one week or more in advance, computers combine weather models, which are based on the principles of physics, with measured weather variables, such as current temperature and wind speed. These developments have improved the accuracy of local forecasts and have led to extended and long-range forecasts, although the high variability of weather in the mid-latitudes makes longer-range forecasts less accurate. In tropical regions, by contrast, daily weather variations are small, with regularly occurring phenomena and perceptible change associated more with seasonal cycles (dry weather and monsoons). For some tropical areas, tropical cyclones themselves are one of the more influential weather variables."
]