[
  " Dumbo Dumbo  animation , the art of making inanimate objects appear to move. Animation is an artistic impulse that long predates the movies. History’s first recorded animator is Pygmalion of Greek and Roman mythology, a sculptor who created a figure of a woman so perfect that he fell in love with her and begged Venus to bring her to life. Some of the same sense of magic, mystery, and transgression still adheres to contemporary film animation, which has made it a primary vehicle for exploring the overwhelming, often bewildering emotions of childhood—feelings once dealt with by folktales.",
  "  The theory of the animated cartoon preceded the invention of the cinema by half a century. Early experimenters, working to create conversation pieces for Victorian parlours or new sensations for the touring magic-lantern shows, which were a popular form of entertainment, discovered the principle of persistence of vision. If drawings of the stages of an action were shown in fast succession, the human eye would perceive them as a continuous movement. One of the first commercially successful devices, invented by the Belgian Joseph Plateau in 1832, was the phenakistoscope, a spinning cardboard disk that created the illusion of movement when viewed in a mirror. In 1834 William George Horner invented the zoetrope, a rotating drum lined by a band of pictures that could be changed. The Frenchman Émile Reynaud in 1876 adapted the principle into a form that could be projected before a theatrical audience. Reynaud became not only animation’s first entrepreneur but, with his gorgeously hand-painted ribbons of celluloid conveyed by a system of mirrors to a theatre screen, the first artist to give personality and warmth to his animated characters.",
  " Humorous Phases of Funny Faces  With the invention of sprocket-driven film stock, animation was poised for a great leap forward. Although “firsts” of any kind are never easy to establish, the first film-based animator appears to be J. Stuart Blackton , whose Humorous Phases of Funny Faces in 1906 launched a successful series of animated films for New York’s pioneering Vitagraph Company. Later that year, Blackton also experimented with the stop-motion technique—in which objects are photographed, then repositioned and photographed again—for his short film Haunted Hotel .",
  "In France, Émile Cohl was developing a form of animation similar to Blackton’s, though Cohl used relatively crude stick figures rather than Blackton’s ambitious newspaper-style cartoons. Coinciding with the rise in popularity of the Sunday comic sections of the new tabloid newspapers, the nascent animation industry recruited the talents of many of the best-known artists, including Rube Goldberg , Bud Fisher (creator of Mutt and Jeff ) and George Herriman (creator of Krazy Kat ), but most soon tired of the fatiguing animation process and left the actual production work to others.",
  " Gertie on Tour  The one great exception among these early illustrators-turned-animators was Winsor McCay , whose elegant, surreal Little Nemo in Slumberland and Dream of the Rarebit Fiend remain pinnacles of comic-strip art. McCay created a hand-coloured short film of Little Nemo for use during his vaudeville act in 1911, but it was Gertie the Dinosaur , created for McCay’s 1914 tour, that transformed the art. McCay’s superb draftsmanship, fluid sense of movement, and great feeling for character gave viewers an animated creature who seemed to have a personality, a presence, and a life of her own. The first cartoon star had been born.",
  "McCay made several other extraordinary films, including a re-creation of The Sinking of the Lusitania (1918), but it was left to Pat Sullivan to extend McCay’s discoveries. An Australian-born cartoonist who opened a studio in New York City, Sullivan recognized the great talent of a young animator named Otto Messmer , one of whose casually invented characters—a wily black cat named Felix—was made into the star of a series of immensely popular one-reelers. Designed by Messmer for maximum flexibility and facial expressiveness, the round-headed, big-eyed Felix quickly became the standard model for cartoon characters: a rubber ball on legs who required a minimum of effort to draw and could be kept in constant motion.",
  "This lesson did not go unremarked by the young Walt Disney , then working at his Laugh-O-gram Films studio in Kansas City, Missouri. His first major character, Oswald the Lucky Rabbit, was a straightforward appropriation of Felix; when he lost the rights to the character in a dispute with his distributor, Disney simply modified Oswald’s ears and produced Mickey Mouse .",
  "Far more revolutionary was Disney’s decision to create a cartoon with the novelty of synchronized sound. Steamboat Willie (1928), Mickey’s third film, took the country by storm. A missing element—sound—had been added to animation, making the illusion of life that much more complete, that much more magical. Later, Disney would add carefully synchronized music ( The Skeleton Dance , 1929), three-strip Technicolor ( Flowers and Trees , 1932), and the illusion of depth with his multiplane camera ( The Old Mill , 1937). With each step, Disney seemed to come closer to a perfect naturalism, a painterly realism that suggested academic paintings of the 19th century. Disney’s resident technical wizard was Ub Iwerks , a childhood friend who followed Disney to Hollywood and was instrumental in the creation of the multiplane camera and the synchronization techniques that made the Mickey Mouse cartoons and the Silly Symphonies series seem so robust and fully dimensional.",
  " Snow White and the Seven Dwarfs Snow White and the Seven Dwarfs  For Disney, the final step was, of course,  Snow White and the Seven Dwarfs  (1937). Although not the first animated feature, it was the first to use up-to-the-minute techniques and the first to receive a wide, Hollywood-style release. Instead of amusing his audience with talking mice and singing cows, Disney was determined to give them as profound a dramatic experience as the medium would allow; he reached into his own troubled childhood to interpret this rich fable of parental abandonment, sibling rivalry, and the onrush of adult passion.",
  " Fantasia Fantasia  With his increasing insistence on photographic realism in films such as  Pinocchio  (1940),  Fantasia  (1940),  Dumbo  (1941), and  Bambi  (1942), Disney perversely seemed to be trying to put himself out of business by imitating life too well. That was not the temptation followed by Disney’s chief rivals in the 1930s, all of whom came to specialize in their own kind of stylized mayhem.",
  " Max and Dave Fleischer had become successful New York animators while Disney was still living in Kansas City, Missouri. The Fleischers invented the rotoscoping process, still in use today, in which a strip of live-action footage can be traced and redrawn as a cartoon. The Fleischers exploited this technique in their pioneering series Out of the Inkwell (1919–29). It was this series, with its lively interaction between human and drawn figures, that Disney struggled to imitate with his early Alice cartoons.",
  "But if Disney was Mother Goose and Norman Rockwell, the Fleischers (Max produced, Dave directed) were stride piano and red whiskey. Their extremely urban, overcrowded, sexually suggestive, and frequently nightmarish work—featuring the curvaceous torch singer Betty Boop and her two oddly infantile colleagues, Bimbo the Dog and Koko the Clown—charts a twisty route through the American subconscious of the 1920s and ’30s, before collapsing into Disneyesque cuteness with the features Gulliver’s Travels (1939) and Mr. Bug Goes to Town (1941; also released as Hoppity Goes to Town ). The studio’s mainstay remained the relatively impersonal Popeye series, based on the comic strip created by Elzie Segar . The spinach-loving sailor was introduced as a supporting player in the Betty Boop cartoon Popeye the Sailor (1933) and quickly ascended to stardom, surviving through 105 episodes until the 1942 short Baby Wants a Bottleship , when the Fleischer studio collapsed and rights to the character passed to Famous Studios.",
  " Porky’s Midnight Matinee  Fresh Hare Fresh Hare   Less edgy than the Fleischers but every bit as anarchic were the animations produced by the Warner Bros. cartoon studio, known to its residents as “Termite Terrace.” The studio was founded by three Disney veterans, Rudolph Ising, Hugh Harmon, and Friz Freleng , but didn’t discover its identity until Tex Avery , fleeing the Walter Lantz studio at Universal, joined the team as a director. Avery was young and irreverent, and he quickly recognized the talent of staff artists such as Chuck Jones , Bob Clampett , and Bob Cannon. Together they brought a new kind of speed and snappiness to the Warners product, beginning with Gold Diggers of ’49 (1936). With the addition of director Frank Tashlin, musical director Carl W. Stalling, and voice interpreter Mel Blanc , the team was in place to create a new kind of cartoon character: cynical, wisecracking, and often violent, who, refined through a series of cartoons, finally emerged as Bugs Bunny in Tex Avery’s A Wild Hare (1940). Other characters, some invented and some reinterpreted, arrived, including Daffy Duck , Porky Pig, Tweety and Sylvester, Pepe LePew, Foghorn Leghorn, Road Runner , and Wile E. Coyote. Avery left Warner Brothers and in 1942 joined Metro-Goldwyn-Mayer’s moribund animation unit, where, if anything, his work became even wilder in films such as Red Hot Riding Hood (1943) and Bad Luck Blackie (1949).",
  "In Europe animation had meanwhile taken a strikingly different direction. Eschewing animated line drawings, filmmakers experimented with widely different techniques: in Russia and later in France, Wladyslaw Starewicz (also billed as Ladislas Starevitch), a Polish art student and amateur entomologist, created stop-motion animation with bugs and dolls; among his most celebrated films are The Cameraman’s Revenge (1912), in which a camera-wielding grasshopper uses the tools of his trade to humiliate his unfaithful wife, and the feature-length The Tale of the Fox (1930), based on German folktales as retold by Johann Wolfgang von Goethe . A Russian working in France, Alexandre Alexeïeff , developed the pinscreen, a board perforated by some 500,000 pins that could be raised or lowered, which created patterns of light and shadow that gave the effect of an animated steel engraving. It took Alexeïeff two years to create A Night on Bald Mountain (1933), which used the music of Modest Mussorgsky ; in 1963 Nikolay Gogol was the source of his most widely celebrated film, the dark fable The Nose . Inspired by the shadow puppet theatre of Thailand, Germany’s Lotte Reiniger employed animated silhouettes to create elaborately detailed scenes derived from folktales and children’s books. Her The Adventures of Prince Achmed (1926) may have been the first animated feature; it required more than two years of patient work and earned her the nickname “The Mistress of Shadows,” as bestowed on her by Jean Renoir . Her other works include Dr. Dolittle and His Animals (1928) and shorts based on musical themes by Wolfgang Amadeus Mozart ( Papageno , 1935; adapted from  The Magic Flute  ), Gaetano Donizetti ( L’elisir d’amore , 1939; “The Elixir of Love”), and Igor Stravinsky ( Dream Circus , 1939; adapted from Pulcinella ). In the 1950s Reiniger moved to England, where she continued to produce films until her retirement in the ’70s.",
  "Another German-born animator, Oskar Fischinger, took his work in a radically different direction. Abandoning the fairy tales and comic strips that had inspired most of his predecessors, Fischinger took his inspiration from the abstract art that dominated the 1920s. At first he worked with wax figures animated by stop motion, but his most significant films are the symphonies of shapes and sounds he called “coloured rhythms,” created from shifting colour fields and patterns matched to music by classical composers. He became fascinated by colour photography and collaborated on a process called Gasparcolor, which, as utilized in his 1935 film Composition in Blue , won a prize at that year’s Venice Film Festival. The following year, he immigrated to Hollywood, where he worked on special effects for a number of films and was the initial designer of the Toccata and Fugue sequence in Walt Disney’s Fantasia (1940). The Disney artists modified his designs, however, and he asked that his name be removed from the finished film. Through the 1940s and ’50s he balanced his work between experimental films such as Motion Painting No. 1 (1947) and commercials, and he retired from animation in 1961 to devote himself to painting.",
  "Fischinger’s films made a deep impression on the Scottish design student Norman McLaren, who began experimenting with cameraless films—with designs drawn directly on celluloid—as early as 1933 ( Seven Till Five ). A restless and brilliant researcher, he went to work for John Grierson at the celebrated General Post Office (GPO) Film Unit in London and followed Grierson to Canada in 1941, shortly after the founding of the National Film Board. Supported by government grants, he was able to play out his most radical creative impulses, using watercolours, crayons, and paper cutouts to bring abstract designs to flowing life. Attracted by the possibilities of stop-motion animation, he was able to turn inanimate objects into actors ( A Chairy Tale , 1957) and actors into inanimate objects ( Neighbours , 1952), a technique he called “pixellation.”",
  "The international success of McLaren’s work (he won an Oscar for Neighbours ) opened the possibilities for more personal forms of animation in America. John Hubley, an animator who worked for Disney studios on Snow White , Pinocchio , and Fantasia , left the Disney organization in 1941 and joined the independent animation company United Productions of America in 1945. Working in a radically simplified style, without the depth effects and shading of the Disney cartoons, Hubley created the nearsighted character Mister Magoo for the 1949 short Ragtime Bear . He and his wife, Faith, formed their own studio, Storyboard Productions, in 1955, and they collaborated on a series of increasingly poetic narrative films. They won Oscars for Moonbird (1959) and The Hole (1962). The Hubleys also created a much-admired series of short films based on the jazz improvisations of Dizzy Gillespie , Quincy Jones , and Benny Carter .",
  "The evolution of animation in Eastern Europe was impeded by World War II, but several countries—in particular Poland, Hungary, and Romania—became world leaders in the field by the 1960s. Włodzimierz Haupe and Halina Bielinska were among the first important Polish animators; their Janosik (1954) was Poland’s first animated film, and their Changing of the Guard (1956) employed the stop-action gimmick of animated matchboxes. The collaborative efforts of Jan Lenica and Walerian Borowczyk foresaw the bleak themes and absurdist trends of the Polish school of the 1960s; such films as Był sobie raz… (1957; Once Upon a Time… ), Nagrodzone uczucie (1957; Love Rewarded ), and Dom (1958; The House ) are surreal, pessimistic, plotless, and characterized by a barrage of disturbing images. Borowczyk and Lenica, each of whom went on to a successful solo career, helped launch an industry that produced as many as 120 animated films per year by the early ’60s. Animators such as Miroslaw Kijowicz, Daniel Szczechura, and Stefan Schabenbeck were among the leaders in Polish animation during the second half of the 20th century.",
  "Eastern Europe also became the centre of puppet animation, largely because of the sweetly engaging, folkloric work of Jiří Trnka . Based on a Hans Christian Andersen story, Trnka’s The Emperor’s Nightingale became an international success when it was fitted with narration by Boris Karloff and released in 1948. His subsequent work included ambitious adaptations of The Good Soldier Schweik (1954) and A Midsummer Night’s Dream (1959).",
  "  Born in Hungary, George Pal worked as an animator in Berlin, Prague, Paris, and the Netherlands before immigrating to the United States in 1939. There he contracted with Paramount Pictures to produce the Puppetoons series, perhaps the most popular and accomplished puppet animations to be created in the United States. A dedicated craftsman, Pal would produce up to 9,000 model figures for films such as Tulips Shall Grow , his 1942 anti-Nazi allegory. Pal abandoned animation for feature film production in 1947, though in films such as The War of the Worlds (1953) he continued to incorporate elaborate animated special-effects sequences.",
  "Animators in Czechoslovakia and elsewhere took the puppet technique down far darker streets. Jan Švankmajer , for example, came to animation from the experimental theatre movement of Prague. His work combines human figures and stop-motion animation to create disturbingly carnal meditations on sexuality and mortality, such as the short Dimensions of Dialogue (1982) and the features Alice (1988), Faust (1994), and Conspirators of Pleasure (1996). Švankmajer’s most dedicated disciples are the Quay brothers, Stephen and Timothy, identical twins born in Philadelphia who moved to London to create a series of meticulous puppet animations steeped in the atmosphere and ironic fatalism of Eastern Europe. Their Street of Crocodiles (1986), obliquely based on the stories of Bruno Schulz, is a parable of obscure import in which a puppet is freed of his strings but remains enslaved by bizarre sexual impulses.",
  " Wallace & Gromit: The Curse of the Were-Rabbit Wallace & Gromit: The Curse of the Were-Rabbit  Wallace & Gromit: The Curse of the Were-Rabbit Wallace & Gromit: The Curse of the Were-Rabbit    Nick Park , the creator of the Wallace and Gromit series, is the optimist’s answer to the Quay brothers—a stop-motion animator who creates endearing characters and cozy environments that celebrate the security and complacency of provincial English life. He and his colleagues at the British firm Aardman Animations, including founders Peter Lord and Dave Sproxton, have taken the traditionally child-oriented format of clay animation to new heights of sophistication and expressiveness.",
  " Yellow Submarine Yellow Submarine  More-traditional forms of line animation have continued to be produced in Europe by filmmakers such as France’s Paul Grimault ( The King and the Bird , begun in 1948 and released in 1980), Italy’s Bruno Bozzetto (whose 1976 Allegro Non Troppo broadly parodied Fantasia ), and Great Britain’s John Halas and Joy Batchelor ( Animal Farm , 1955) and Richard Williams ( Raggedy Ann and Andy , 1977). George Dunning’s  Yellow Submarine  (1968) made creative use of the visual motifs of the psychedelic era, luring young adults back to a medium that had largely been relegated to children.",
  " Toy Story Toy Story  A victim of rising production costs, full-figure, feature-length animation appeared to be dying off until two developments gave it an unexpected boost in the 1980s. The first was the Disney company’s discovery that the moribund movie musical could be revived and made palatable to contemporary audiences by adapting it to cartoon form ( The Little Mermaid , 1989); the second was the development of computer animation technology, which greatly reduced expenses while providing for new forms of expression. Although most contemporary animated films use computer techniques to a greater or lesser degree, the finest, purest achievements in the genre are the work of John Lasseter , whose Pixar Animation Studios productions have evolved from experimental shorts, such as Luxor, Jr. (1986), to lush features, such as Toy Story (1995; the first entirely computer-animated feature-length film), A Bug’s Life (1998), Finding Nemo (2003), The Incredibles (2004), WALL-E (2008), and Up (2009). Computer techniques are commonly incorporated into traditional line animations, giving films such as Disney’s Mulan (1998) and Dreamworks’s The Road to El Dorado (2000) a visual sweep and dimensionality that would otherwise require countless hours of manual labour.",
  "A century after its birth, animation continues to evolve. The most exciting developments are found on two distinct fronts: the  anime  (“animation”) of Japan and the prime-time television cartoons of the United States. An offspring of the dense, novelistic style of Japanese manga comic books and the cut-rate techniques developed for television production in 1960, anime such as Miyazaki Hayao ’s Princess Mononoke (1997) are the modern equivalent of the epic folk adventures once filmed by Mizoguchi Kenji ( The 47 Ronin , 1941) and Kurosawa Akira ( Yojimbo , 1961; “The Bodyguard”). Kon Satoshi ’s Perfect Blue (1997) suggests the early Japanese New Wave films of director Oshima Nagisa with its violent exploration of a media-damaged personality.",
  " The Simpsons The Simpsons Movie  South Park South Park   U.S. television animation, pioneered in the 1950s by William Hanna and Joseph Barbera ( Yogi Bear , The Flintstones ) was for years synonymous with primitive techniques and careless writing. But with the debut of  The Simpsons  in 1989, TV animation became home to a kind of mordant social commentary or outright absurdism (John Kricfalusi’s Ren and Stimpy ) that was too pointedly aggressive for live-action realism. When Mike Judge ’s Beavis and Butt-Head debuted on the MTV network in 1993, the rock-music cable channel discovered that cartoons could push the limits of censorship in ways no live-action television productions could. Following Judge’s success in 1997 were Trey Parker and Matt Stone with  South Park  , a series centred on foulmouthed kids growing up in the American Midwest and rendered in a flat, cutout animation style that would have looked primitive in 1906. The spiritual father of the new television animation is Jay Ward, whose Rocky and His Friends , first broadcast in 1959, turned the threadbare television style into a vehicle for absurdist humour and adult satire.",
  "Despite these boundary-pushing advances, full-figure, traditionally animated films continue to be produced, most notably by Don Bluth ( An American Tale , 1986), a Disney dissident who moved his operation to Ireland, and Brad Bird, a veteran of Simpsons minimalism who progressed to the spectacular full technique of The Iron Giant (1999). As digital imaging techniques continue to improve in quality and affordability, it becomes increasingly difficult to draw a clear line between live action and animation. Films such as The Matrix (1999), Star Wars: Episode One (1999), and  Gladiator  (2000), incorporate backgrounds, action sequences, and even major characters conceived by illustrators and brought to life by technology. Such techniques are no less creations of the animator’s art than were Gertie, Betty Boop, and Bugs Bunny.",
  " Giannalberto Bendazzi , Cartoons (1994); John Halas , Masters of Animation (1987); Jeff Lenburg , The Encyclopædia of Animated Cartoons (1991), and The Great Cartoon Directors (1983); Leonard Maltin , Of Mice and Magic—A History of American Animated Cartoons (1980); Charles Solomon , Enchanted Drawings—The History of Animation (1989)."
]