[
  "  wind , in climatology, the movement of air relative to the surface of the Earth. Winds play a significant role in determining and controlling climate and weather. A brief treatment of winds follows. For full treatment, see  climate: Wind .",
  "Wind occurs because of horizontal and vertical differences (gradients) in atmospheric pressure. Accordingly, the distribution of winds is closely related to that of pressure. Near the Earth’s surface, winds generally flow around regions of relatively low and high pressure—cyclones and anticyclones, respectively. They rotate counterclockwise around lows in the Northern Hemisphere and clockwise around those in the Southern Hemisphere. Similarly, wind systems rotate around the centres of highs in the opposite direction.",
  "In the middle and upper troposphere, the pressure systems are organized in a sequence of high-pressure ridges and low-pressure troughs, rather than in the closed, roughly circular systems nearer the surface of the Earth. They have a wavelike motion and interact to form a rather complex series of ridges and troughs. The largest of the wave patterns are the so-called standing waves that have three or four ridges and a corresponding number of troughs in a broad band in middle latitudes of the Northern Hemisphere. The westerlies of the Southern Hemisphere are much less strongly affected by standing disturbances. Associated with these long standing waves are the short waves (several hundred kilometres in wavelength) called traveling waves. Such traveling waves form the upper parts of near-surface cyclones and anticyclones to which they are linked, thus guiding their movement and development.",
  "At high latitudes the winds are generally easterly near the ground. In low, tropical, and equatorial latitudes, the northeasterly trade winds north of the intertropical convergence zone (ICZ), or thermal equator, and the southeasterly trade winds south of the ICZ move toward the ICZ, which migrates north and south with the seasonal position of the Sun. Vertically, winds then rise and create towering cumulonimbus clouds and heavy rain on either side of the ICZ, which marks a narrow belt of near calms known as the doldrums. The winds then move poleward near the top of the troposphere before sinking again in the subtropical belts in each hemisphere. From here, winds again move toward the Equator as trade winds. These gigantic cells with overturning air in each of the hemispheres in low latitudes are known as the Hadley cells. In the mid-latitudes, oppositely rotating wind systems called Ferrel cells carry surface air poleward and upper tropospheric air toward the Hadley cells. The three-dimensional pattern of winds over the Earth, known as general circulation, is responsible for the fundamental latitudinal structure of pressure and air movement and, hence, of climates.",
  "On a smaller scale are the local winds, systems that are associated with specific geographic locations and reflect the influence of topographic features. The most common of these local wind systems are the sea and land breezes, mountain and valley breezes, foehn winds (also called chinook, or Santa Ana, winds), and katabatic winds. Local winds exert a pronounced influence on local climate and are themselves affected by local weather conditions.",
  "Wind speeds and gustiness are generally strongest by day when the heating of the ground by the Sun causes overturning of the air, the descending currents conserving the angular momentum of high-altitude winds. By night, the gustiness dies down and winds are generally lighter."
]