[
  "  Zen , Chinese Chan , Korean Sŏn , also spelled Seon , Vietnamese Thien , important school of East Asian Buddhism that constitutes the mainstream monastic form of Mahayana Buddhism in China , Korea , and Vietnam and accounts for approximately 20 percent of the Buddhist temples in Japan . The word derives from the Sanskrit  dhyana , meaning “meditation.” Central to Zen teaching is the belief that awakening can be achieved by anyone but requires instruction in the proper forms of spiritual cultivation by a master. In modern times, Zen has been identified especially with the secular arts of medieval Japan (such as the tea ceremony , ink painting, and gardening) and with any spontaneous expression of artistic or spiritual vitality regardless of context. The Zen ideals of simplicity and orderliness even underpin the success and fame of Japanese tidying expert Marie Kondo, whose best-selling books and English-language TV programs have made her a celebrity in the West. In popular usage, the modern non-Buddhist connotations of the word Zen have become so prominent that in many cases the term is used as a label for phenomena that lack any relationship to Zen or are even antithetical to its teachings and practices.",
  "Compiled by the Chinese Buddhist monk Daoyun in 1004, Records of the Transmission of the Lamp ( Chingde chongdeng lu ) offers an authoritative introduction to the origins and nature of Zen Buddhism. The work describes the Zen school as consisting of the authentic Buddhism practiced by monks and nuns who belong to a large religious family with five main branches, each branch of which demonstrates its legitimacy by performing Confucian -style ancestor rites for its spiritual ancestors or patriarchs. The genealogical tree of this spiritual lineage begins with the seven buddhas, consisting of six mythological Buddhas of previous eons as well as Siddhartha Gautama, or Shakyamuni, the historical Buddha of the current age. The spiritual awakening and wisdom realized by these buddhas then was transmitted from master to disciple across 28 generations of semi-historical or mythological Buddhist teachers in India, concluding with Bodhidharma , the monk who supposedly introduced true Buddhism to China in the 5th century. This true Buddhism held that its practitioners could achieve a sudden awakening to spiritual truth, which they could not accomplish by a mere reading of Buddhist scriptures. As Bodhidharma asserted in a verse attributed to him,",
  "A special transmission outside the scriptures, not relying on words or letters; pointing directly to the human mind, seeing true nature is becoming a Buddha.",
  "From the time of Bodhidharma to the present, each generation of the Zen lineage claimed to have attained the same spiritual awakening as its predecessors, thereby preserving the Buddha’s “lamp of wisdom.” This genealogical ethos confers religious authority on present-day Zen teachers as the legitimate heirs and living representatives of all previous Buddhas and patriarchs. It also provides the context of belief for various Zen rituals, such as funeral services performed by Zen priests and ancestral memorial rites for the families of laypeople who patronize the temples.",
  "The Zen ethos that people in each new generation can and must attain spiritual awakening does not imply any rejection of the usual forms of Buddhist spiritual cultivation, such as the study of scriptures, the performance of good deeds, and the practice of rites and ceremonies, image worship, and ritualized forms of meditation. Zen teachers typically assert rather that all of these practices must be performed correctly as authentic expressions of awakening, as exemplified by previous generations of Zen teachers. For this reason, the Records of the Transmission of the Lamp attributes the development of the standard format and liturgy of the Chinese Buddhist monastic institution to early Zen patriarchs, even though there is no historical evidence to support this claim. Beginning at the time of the Song dynasty (960–1279), Chinese monks composed strict regulations to govern behaviour at all publicly recognized Buddhist monasteries. Known as “rules of purity” (Chinese: qinggui ; Japanese: shingi ), these rules were frequently seen as unique expressions of Chinese Zen. In fact, however, the monks largely codified traditional Buddhist priestly norms of behaviour, and, at least in China, the rules were applied to residents of all authorized monasteries, whether affiliated with the Zen school or not.",
  "Zen monks and nuns typically study Buddhist scriptures, Chinese classics, poetics, and Zen literature. Special emphasis traditionally has been placed on the study of “public cases” (Chinese: gongan ; Japanese: kōan ), or accounts of episodes in which Zen patriarchs reportedly attained awakening or expressed their awakening in novel and iconoclastic ways, using enigmatic language or gestures. Included in the Records of the Transmission of the Lamp and in other hagiographic compendia, the public cases are likened to legal precedents that are designed to guide the followers of Zen.",
  "Although Zen Buddhism in China is traditionally dated to the 5th century, it actually first came to prominence in the early 8th century, when Wuhou (625–705), who seized power from the ruling Tang dynasty (618–907) to become empress of the short-lived Zhou dynasty (690–705), patronized Zen teachers as her court priests. After Empress Wuhou died and the Tang dynasty was restored to power, rival sects of Zen appeared whose members claimed to be more legitimate and more orthodox than the Zen teachers who had been associated with the discredited empress. These sectarian rivalries continued until the Song dynasty, when a more inclusive form of Zen became associated with almost all of the official state-sponsored Buddhist monasteries. As the official form of Chinese Buddhism, the Song dynasty version of Zen subsequently spread to Korea, Japan, and Vietnam.",
  "During the reign of the Song, Zen mythology, Zen literature, and Zen forms of Buddhist spiritual cultivation underwent important growth. Since that time, Zen teachings have skillfully combined the seemingly opposing elements of mythology and history, iconoclasm and pious worship, freedom and strict monastic discipline, and sudden awakening (Sanskrit: bodhi ; Chinese: wu ; Japanese: satori ) and long master-disciple apprenticeships.",
  "During the Song dynasty the study of public cases became very sophisticated, as Zen monks arranged them into various categories, wrote verse commentaries on them, and advocated new techniques for meditating on their key words. Commentaries such as The Blue Cliff Record ( c. 1125; Chinese: Biyan lu ; Japanese Heikigan roku ) and The Gateless Barrier (1229; Chinese: Wumen guan ; Japanese: Mumon kan ) remain basic textbooks for Zen students to the present day. The public-case literature validates the sense of liberation and freedom felt by those experiencing spiritual awakening while, at the same time, placing the expression of those impulses under the supervision of well-disciplined senior monks. For this reason, Zen texts frequently assert that genuine awakening cannot be acquired through individual study alone but must be realized through the guidance of an authentic Zen teacher.",
  "During Japan’s medieval period (roughly the 12th through 15th centuries), Zen monks played a major role in introducing the arts and literature of Song-dynasty China to Japanese leaders. The Five Mountain (Japanese: Gozan) Zen temples, which were sponsored by the Japanese imperial family and military rulers, housed many monks who had visited China and had mastered the latest trends of Chinese learning. Monks from these temples were selected to lead trade missions to China, to administer governmental estates, and to teach neo-Confucianism , a form of Confucianism developed under the Song dynasty that combined cultivation of the self with concerns for social ethics and metaphysics. In this way, wealthy Zen monasteries, especially those located in the Japanese capital city of Kyōto , became centres for the importation and dissemination of Chinese techniques of printing, painting, calligraphy, poetics, ceramics, and garden design—the so-called Zen arts, or (in China) Song-dynasty arts.",
  "Apart from the elite Five Mountain institutions, Japanese Zen monks and nuns founded many monasteries and temples in the rural countryside. Unlike their urban counterparts, monks and nuns in rural Zen monasteries devoted more energy to religious matters than to Chinese arts and learning. Their daily lives focused on worship ceremonies, ritual periods of “sitting Zen” (Japanese: zazen ) meditation, the study of public cases, and the performance of religious services for lower-status merchants, warriors, and peasants. Rural Zen monks helped to popularize many Buddhist rituals now common in Japan, such as prayer rites for worldly benefits, conferment of precept lineages on lay people, funerals, ancestral memorials, and exorcisms. After the political upheavals of the 15th and 16th centuries, when much of the city of Kyōto was destroyed in a widespread civil war, monks from rural Zen lineages came to dominate all Zen institutions in Japan, including the urban ones that formerly enjoyed Five Mountain status.",
  "After the Tokugawa rulers of the Edo period (1603–1867) restored peace, Zen monasteries and all other religious institutions in Japan cooperated in the government’s efforts to regulate society. In this new political environment, Zen monks and other religious leaders taught a form of conventional morality (Japanese: tsūzoku dōtoku ) that owed more to Confucian than to Buddhist traditions; indeed, Buddhist teachings were used to justify the strict social hierarchy enforced by the government. Many Confucian teachers in turn adapted Zen Buddhist meditation techniques to “quiet sitting” (Japanese: seiza ), a Confucian contemplative practice. As a result of these developments, the social and religious distinctions between Zen practice and Confucianism became blurred.",
  "  When the Ming dynasty (1368–1661) in China began to collapse, many Chinese Zen monks sought refuge in Japan. Their arrival caused Japanese Zen monks to question whether their Japanese teachers or the new Chinese arrivals had more faithfully maintained the traditions of the ancient buddhas and patriarchs. The resultant search for authentic Zen roots prompted the development of sectarianism, not just between Japanese and Chinese Zen leaders but also within the existing Japanese Zen community. Eventually sectarian rivalry led to the emergence of three separate Japanese Zen lineages: Ōbaku (Chinese: Huanbo), Rinzai (Chinese: Linji), and Sōtō (Chinese: Caodong). Ignoring their similarities, each lineage exaggerated its distinctive features. Thus, both Rinzai and Sōtō emphasized their adherence to certain Song-dynasty practices, in contrast to the Ōbaku monasteries, which favoured Ming traditions, especially in such areas as ritual language, musical instruments, clothing, and temple architecture. People affiliated with Sōtō, by far the largest of the Japanese Zen lineages, stressed the accomplishments of their patriarch Dōgen (1200–53), whose chief work, Shōbōgenzō (1231–53; “Treasury of the True Dharma Eye”), is widely regarded as one of the great classics of Japanese Buddhism.",
  "During the first half of the 20th century, D.T. Suzuki (1870–1966), a Japanese Buddhist scholar and thinker, wrote numerous essays and books in English to introduce Zen ideals to Western audiences. Suzuki was born just after Japan began to adopt Western technology in an effort to catch up with Europe and America. He was strongly influenced by 19th-century Japanese Buddhist reformers who sought to cast off what they saw as the feudal social structures of the Tokugawa period and who advocated a more modern vision of Buddhism that could compete successfully with Christianity . Suzuki spent 11 years in the United States (1897–1908) as an assistant to Paul Carus (1852–1919), a German who had earned a doctorate in theology and philosophy before emigrating to America. Carus published a magazine to promote what he called the “Science of Religion,” a new religion compatible with science. During this period, Suzuki was also influenced by contemporary intellectual currents, such as the ideas of the German Protestant theologian Friedrich Schleiermacher (1768–1834), who had identified irrational intuition and feeling as the essence of religion, and of the American philosopher William James (1842–1910), who posited the possibility of nondualistic knowledge via “pure experience” as overcoming the dualism inherent in empiricism.",
  "Suzuki interpreted the episodes of spiritual awakening depicted in Zen public cases as proof of humankind’s ability to suddenly break through the boundaries of common, everyday, logical thought to achieve a nondualistic, pure experience in which distinctions such as self/other and right/wrong disappear. He characterized this experience as an expression of the irrational intuition that underlies all religions and all acts of artistic creation, regardless of culture or historical period, and that achieved its highest expression in the secular arts of Japan. Suzuki, therefore, interpreted Zen not as a form of Buddhism but as a Japanese cultural value with universal relevance. His use of Western theological and philosophical concepts to explain the Zen experience in modern ways influenced Nishida Kitarō (1870–1945) and other members of the Kyoto school of Japanese philosophy. In the early 20th century, many Japanese intellectuals described Zen as the underlying essence of Japanese culture or as the unique form of Japanese spirituality. As Japanese society became increasingly militaristic during the 1930s and ’40s, descriptions of Zen became more warlike, frequently invoking loyalty to the state, fearlessness, and mental tranquillity in the face of death. In 1938, for example, Suzuki described Zen as “a religion of will power” and identified Zen training with Bushido (the code of conduct of the Japanese warrior class) and Japanese swordsmanship.",
  "  When Suzuki’s books were reprinted after World War II , they found a ready audience in the United States and Britain among ex-servicemen who had acquired an interest in Japanese culture and among youths dissatisfied with postwar society. In particular, members of the new American literary and artistic movement known as the Beats looked to Zen for inspiration. In popular culture the word Zen became an adjective used to describe any spontaneous or free-form activity. Since the heyday of the Beat movement in the 1950s, however, academic studies of Zen have grown in complexity and sophistication, examining the role of Zen practices and Zen institutions in the religious lives of Buddhists in East Asia . In 1953 the Chinese Nationalist historian and diplomat Hu Shih (1891–1962) published an important essay on the history of Zen in China, in which he challenged Suzuki’s characterization of Zen as irrational and beyond logical understanding. Hu argued that Zen must be understood as a human institution and that scholarly descriptions of it must be based on verifiable historical evidence, not on psychological interpretations of the religious stories found in Zen’s public cases.",
  "Since 1953 a new generation of scholars has completely rewritten the history of Zen. They have made major strides both in documenting the historical development of the Zen school in East Asia and in understanding the religious and cultural contexts within which Zen literature, such as public cases, functioned as guides to spiritual truth. During the 1980s and ’90s, some Zen scholars and Zen priests in Japan advocated what they called “Critical Buddhism” in an effort to denounce any connection between Zen and illogical thought and any association between Zen institutions and social problems such as religious discrimination, cultural chauvinism, and militarism. Regardless of the ultimate fate of Critical Buddhism, it is clear that efforts to create a new Zen compatible with the demands of modern society will continue.",
  " Heinrich Dumoulin , Zen Buddhism: A History , 2 vol., trans. by James W. Heisig and Paul Knitter (1988–90; vol. 1 reissued with a new supplement on the Northern school of Chinese Zen, 1994; originally published in German, 1959), is the most detailed history available in English. Bernard Faure , The Rhetoric of Immediacy: A Cultural Critique of Chan/Zen Buddhism (1991), is an innovative analysis of Zen literature and the religious culture that produced it. Kenneth Kraft (ed.), Zen: Tradition and Transition (1988), is a compilation of essays by contemporary Zen teachers and academic scholars. Steven Heine and Dale S. Wright (eds.), The Kōan: Texts and Contexts in Zen Buddhism (2000), provides a multifaceted overview of public cases as a literary genre and a medium for Buddhist practice. Tao Yüan ( Daoyuan ; compiler), Records of the Transmission of the Lamp , trans. by Sohaku Ogata (1986), is the only translation of Daoyuan , Chingde chongdeng lu (1004), available in English that attempts to preserve the genealogical format and religious worldview of the original text.",
  " Robert E. Buswell, Jr. , The Formation of Ch’an Ideology in China and Korea (1989), is a translation and detailed analysis of the Vajrasamadhi-sutra . Bernard Faure , The Will to Orthodoxy: A Critical Genealogy of Northern Chan Buddhism , trans. from French (1997); and John R. McRae , The Northern School and the Formation of Early Ch’an Buddhism (1986), are detailed histories. John Jorgensen , “The ‘Imperial’ Lineage of Ch’an Buddhism: The Role of Confucian Ritual & Ancestor Worship in Ch’an’s Search for Legitimization in the Mid-T’ang Dynasty,” Papers on Far Eastern History , 35:89–134 (March 1987), is an analysis of the importance of Confucian ancestral rites for the Zen teachers patronized by Empress Wu and for the rival Zen sects of the Tang dynasty. Philip B. Yampolsky (trans.), The Platform Sutra of the Sixth Patriarch (1967), provides a detailed history of early Chinese Zen literature. Much of the above material is presented in a manner accessible to nonspecialists in John R. McRae,  Seeing Through Zen (2003).",
  " T. Griffith Foulk , “Myth, Ritual, and Monastic Practice in Sung Ch’an Buddhism,” in Patricia Buckley Ebrey and Peter N. Gregory (eds.), Religion and Society in T’ang and Sung China (1993), pp. 147–208, examines the religious worldview and practices of Zen Buddhist monks and nuns during the Song dynasty (960–1279). Peter N. Gregory (ed.), Traditions of Meditation in Chinese Buddhism (1986), analyzes the development of techniques of Zen meditation in relationship to the practices of other Chinese Buddhist traditions and to similar techniques in Korean Zen (Sōn). Peter N. Gregory (ed.), Sudden and Gradual: Approaches To Enlightenment in Chinese Thought (1987), examines approaches to awakening in Chinese Zen literature and in other areas of Chinese culture. Holmes Welch , The Practice of Chinese Buddhism, 1900–1950 (1967), explains how Zen monasteries functioned in China prior to the communist revolution.",
  " Robert E. Buswell, Jr. , The Korean Approach To Zen (1983), is a biographical study and translation of the writings of the Korean Zen monk Chinul (1158–1210), and Buswell’s The Zen Monastic Experience (1992) studies all aspects of Zen monastic life in the contemporary Koreas.",
  " Cuong Tu Nguyen , Zen in Medieval Vietnam (1997), is a history of Zen in premodern Vietnam and a translation of the Thien Uyen Tap Anh, a 14th-century collection of the biographies of outstanding Vietnamese Zen monks.",
  " Paula Kane Robinson Arai , Women Living Zen: Japanese Sōtō Buddhist Nuns (1998), is an overview of the lifestyle of contemporary Zen nuns. Helen J. Baroni , Ōbaku Zen: The Emergence of the Third Sect of Zen in Tokugawa, Japan (2000), is a history of the formation of Ōbaku as a separate branch of Japanese Zen.",
  " Carl Bielefeldt , Dōgen’s Manuals of Zen Meditation (1988), is a detailed analysis of the historical background and religious significance of the approach to Zen meditation advocated by Dōgen (1200–53). William M. Bodiford , Sōtō Zen in Medieval Japan (1993), is a three-part historical account of the history and impact of Dōgen and Zen in Japan.",
  " Martin Collcutt , Five Mountains (1981), studies the elite Zen institutions that were designated as having “Five Mountain” (Gozan) status. Janine Anderson Sawada , Confucian Values and Popular Zen (1993), offers an account of Sekimon Shingaku, a Confucian religious movement that adapted Zen Buddhist meditation techniques to formulate a secular form of mental cultivation called “quiet sitting” (Japanese seiza ). Duncan Ryuken Williams , The Other Side of Zen (2005), describes how temples in Tokugawa-period society served the religious needs of ordinary people. Philip B. Yampolsky (trans.), The Zen Master Hakuin (1971), is a biographical study and a translation of the writings of the important Japanese Zen monk Hakuin Ekaku (1688–1769).",
  "Although D.T. Suzuki was extremely prolific, the following works have exerted the largest influence: An Introduction To Zen Buddhism (1934, reissued 2004), Essays in Zen Buddhism (First Series) (1927, reissued 2000), Essays in Zen Buddhism (Second Series) (1933, reissued 1980), Essays in Zen Buddhism (Third Series) (1934, reissued 1985), and Zen and Japanese Culture (1959, reissued 1993). Suzuki’s interpretations of Zen, however, constituted a modern departure from the way the tradition had formulated its teachings.",
  "Suzuki’s interpretation of Zen has been the focus of numerous studies. Margaret H. Dornish , “Aspects of D.T. Suzuki’s Early Interpretations of Buddhism and Zen,” The Eastern Buddhist , new series, 3(1):47–66 (1970), is a sympathetic account of the role of 19th-century Western religious thought in D.T. Suzuki’s thought. Shih Hu , “Ch’an (Zen) Buddhism in China: Its History and Method,” Philosophy East and West 3(1):3–24 (April 1953), challenges Suzuki’s characterization of Zen as irrational and beyond logical understanding. Bernard Faure , Chan Insights and Oversights: An Epistemological Critique of the Chan Tradition (1993), is an innovative analysis of Zen concepts and metaphors as interpreted by later Zen apologists, especially Suzuki. Robert H. Sharf , “The Zen of Nationalism,” History of Religions , 33(1):1-43 (1993), is reprinted in Donald S. Lopez, Jr. (ed.), Curators of the Buddha: The Study of Buddhism Under Colonialism (1995), pp. 107–160, and analyzes Suzuki’s interpretations of Zen and the ways that they can be used to justify Japanese cultural chauvinism. James W. Heisig and John C. Maraldo (eds.), Rude Awakenings: Zen, the Kyoto School, & the Question of Nationalism (1995), is a collection of essays concerning the relationship (if any) between Suzuki’s interpretations of Zen, the Kyōto school of Japanese philosophy, and fascist ideology during the 1930s and ’40s. Brian Daizen Victoria ( Daizen Victoria ), Zen at War , 2nd ed. (2006), critiques the role that Zen intellectuals (such as Suzuki) as well as Zen temples and religious leaders played in Japanese militarism during the first half of the 20th century.",
  " Eugen Herrigel , Zen in the Art of Archery (1953, reissued 1999; originally published in German, 1948), is an extremely popular account of the author’s mystical experiences while learning archery in Japan during the 1920s; it has played a major role in popularizing D.T. Suzuki’s identification of Zen with Japanese martial arts. Shōji Yamada , “The Myth of Zen in the Art of Archery,” Japanese Journal of Religious Studies , 28(1-2):1–30 (2001), analyzes the process by which Eugen Herrigel (1884–1955) acquired his interpretation of Japanese archery as being a kind of Zen training. Carole Tonkinson (ed.), Big Sky Mind: Buddhism and the Beat Generation (1995), examines the role of Zen in the lives of the poets and artists known as the Beats."
]