[
  " big-bang model , widely held theory of the evolution of the universe . Its essential feature is the emergence of the universe from a state of extremely high temperature and density —the so-called big bang that occurred 13.8 billion years ago. Although this type of universe was proposed by Russian mathematician Aleksandr Friedmann and Belgian astronomer Georges Lemaître in the 1920s, the modern version was developed by Russian-born American physicist George Gamow and colleagues in the 1940s.",
  "  The big-bang model is based on two assumptions. The first is that Albert Einstein ’s general theory of relativity correctly describes the gravitational interaction of all matter . The second assumption, called the cosmological principle, states that an observer’s view of the universe depends neither on the direction in which he looks nor on his location. This principle applies only to the large-scale properties of the universe, but it does imply that the universe has no edge, so that the big-bang origin occurred not at a particular point in space but rather throughout space at the same time. These two assumptions make it possible to calculate the history of the cosmos after a certain epoch called the Planck time. Scientists have yet to determine what prevailed before Planck time.",
  "According to the big-bang model, the universe expanded rapidly from a highly compressed primordial state, which resulted in a significant decrease in density and temperature. Soon afterward, the dominance of matter over antimatter (as observed today) may have been established by processes that also predict proton decay. During this stage many types of elementary particles may have been present. After a few seconds, the universe cooled enough to allow the formation of certain nuclei. The theory predicts that definite amounts of hydrogen , helium , and lithium were produced. Their abundances agree with what is observed today. About one million years later the universe was sufficiently cool for atoms to form. The radiation that also filled the universe was then free to travel through space. This remnant of the early universe is the cosmic microwave background radiation—the “three degree” (actually 2.728 K) background radiation—discovered in 1965 by American physicists Arno A. Penzias and Robert W. Wilson.",
  "In addition to accounting for the presence of ordinary matter and radiation, the model predicts that the present universe should also be filled with neutrinos , fundamental particles with no mass or electric charge . The possibility exists that other relics from the early universe may eventually be discovered."
]