[
  "  binoculars , optical instrument, usually handheld, for providing a magnified stereoscopic view of distant objects. It consists of two similar telescopes , one for each eye, mounted on a single frame. A single thumbwheel may control the focus of both telescopes simultaneously, and provision may be made for adjusting the focus of each separately to allow for varying characteristics in the two eyes. Binoculars are designed to give an upright view that is correctly oriented left-to-right. Because they allow use of both eyes in a natural way, they are more comfortable than single telescopes, provide depth perception, and improve visual acuity by giving the human visual system two sets of data to process and combine.",
  " In most binoculars, each telescope is provided with two reflecting prisms . The prisms reinvert, or erect, the inverted image supplied by the objective of each telescope. They prescribe a folded path for the light rays, allowing a shorter overall length for the instrument. When the prisms used are of the Porro type ( see  optics: Reflecting prisms ), they also provide better depth perception at greater distances by allowing the two objectives to be set farther apart than the eyepieces. The arrangement of these prisms and the other optical components is shown in the illustration .",
  "The primary optical characteristics of a pair of binoculars are commonly described by two numbers, the first of which is followed by a multiplication sign—for instance, 7×50. The first number indicates the magnification (e.g., 7×, meaning “7 times”) and the second the diameter of the objective in millimetres (1 inch is about 25 millimetres). This latter figure is a measure of the light-gathering power of the instrument. For a given magnification, larger objectives produce a brighter image in dim light but also create a more massive pair of binoculars. Handheld binoculars designed for typical uses such as hunting, sports watching, nature study, or amateur astronomy range from about 6×30 to 10×50. Instruments having greater magnifications and light-gathering power are too heavy to hold steady, especially for long periods, but they can be fixed to a tripod or other mount.",
  "In applications in which depth perception is not important, a single telescope, called a monocular, may be employed. It is essentially one-half of a pair of binoculars and usually incorporates prisms in the light path.",
  "Opera glasses and field glasses are binoculars with simple, often inexpensive lens systems and narrow fields of view and are usually made with magnifications of 2.5× to 5×. The lenses used in most binoculars are coated on some or all of their air-to-glass surfaces to reduce reflections."
]