[
  "  bootlegging , in U.S. history, illegal traffic in liquor in violation of legislative restrictions on its manufacture, sale, or transportation. The word apparently came into general use in the Midwest in the 1880s to denote the practice of concealing flasks of illicit liquor in boot tops when going to trade with Native Americans. The term entered into the wider American vocabulary when the Eighteenth Amendment to the U.S. Constitution effected the national prohibition of alcohol from 1920 until its repeal in 1933.",
  "Prohibition ended the legal sale of liquor and thereby created demand for an illicit supply. The earliest bootleggers began smuggling foreign-made commercial liquor into the United States from across the Canadian and Mexican borders and along the seacoasts from ships under foreign registry. Their favourite sources of supply were the Bahamas , Cuba , and the French islands of Sainte-Pierre and Miquelon , off the southern coast of Newfoundland . A favourite rendezvous of the rum-running ships was a point opposite Atlantic City , New Jersey, just outside the 3-mile (5-km) limit beyond which the U.S. government lacked jurisdiction. The bootleggers anchored in this area and discharged their loads into high-powered craft that were built to outrace U.S. Coast Guard cutters.",
  "This type of smuggling became more risky and expensive when the U.S. Coast Guard began halting and searching ships at greater distances from the coast and using fast motor launches of its own. Bootleggers had other major sources of supply, however. Among these were millions of bottles of “medicinal” whiskey that were sold across drugstore counters on real or forged prescriptions. In addition, various American industries were permitted to use denatured alcohol, which had been mixed with obnoxious chemicals to render it unfit for drinking. Millions of gallons of this were illegally diverted, “washed” of noxious chemicals, mixed with tap water and perhaps a dash of real liquor for flavour, and sold to speakeasies or individual customers. Finally, bootleggers took to bottling their own concoctions of spurious liquor, and by the late 1920s stills making liquor from corn had become major suppliers. Faultily distilled batches of this “rotgut” could be dangerously impure and cause blindness, paralysis, and even death.",
  "Bootlegging helped lead to the establishment of American organized crime , which persisted long after the repeal of Prohibition. The distribution of liquor was necessarily more complex than other types of criminal activity, and organized gangs eventually arose that could control an entire local chain of bootlegging operations, from concealed distilleries and breweries through storage and transport channels to speakeasies, restaurants, nightclubs, and other retail outlets. These gangs tried to secure and enlarge territories in which they had a monopoly of distribution.",
  "The rise of the bootlegging led to a succession of gang wars and murders. A notorious incident was the Saint Valentine’s Day Massacre in Chicago in 1929: the Al Capone gang shot to death seven members of the rival George “Bugs” Moran gang. Gradually the gangs in different cities began to cooperate with one another, and they extended their methods of organizing beyond bootlegging to the narcotics traffic, gambling rackets, prostitution , labour racketeering, loan-sharking, and extortion. The national American crime syndicate, the Mafia , arose out of the coordinated activities of Italian bootleggers and other gangsters in New York City in the late 1920s and early ’30s.",
  "In 1933 Prohibition was abandoned. The bootlegger did not become extinct, however. In the early 21st century, alcohol was still prohibited in a number of U.S. counties and municipalities, and bootlegging continued to thrive as an illegal business."
]