[
  " Christmas , Christian festival celebrating the birth of Jesus . The English term Christmas (“mass on Christ’s day”) is of fairly recent origin. The earlier term Yule may have derived from the Germanic jōl or the Anglo-Saxon geōl , which referred to the feast of the winter solstice. The corresponding terms in other languages— Navidad in Spanish, Natale in Italian, Noël in French—all probably denote nativity. The German word Weihnachten denotes “hallowed night.” Since the early 20th century, Christmas has also been a secular family holiday, observed by Christians and non-Christians alike, devoid of Christian elements, and marked by an increasingly elaborate exchange of gifts. In this secular Christmas celebration, a mythical figure named Santa Claus plays the pivotal role.",
  "The early Christian community distinguished between the identification of the date of Jesus’ birth and the liturgical celebration of that event. The actual observance of the day of Jesus’ birth was long in coming. In particular, during the first two centuries of Christianity there was strong opposition to recognizing birthdays of martyrs or, for that matter, of Jesus. Numerous Church Fathers offered sarcastic comments about the pagan custom of celebrating birthdays when, in fact, saints and martyrs should be honoured on the days of their martyrdom—their true “birthdays,” from the church’s perspective.",
  "  The precise origin of assigning December 25 as the birth date of Jesus is unclear. The New Testament provides no clues in this regard. December 25 was first identified as the date of Jesus’ birth by Sextus Julius Africanus in 221 and later became the universally accepted date. One widespread explanation of the origin of this date is that December 25 was the Christianizing of the dies solis invicti nati (“day of the birth of the unconquered sun”), a popular holiday in the Roman Empire that celebrated the winter solstice as a symbol of the resurgence of the sun, the casting away of winter and the heralding of the rebirth of spring and summer. Indeed, after December 25 had become widely accepted as the date of Jesus’ birth, Christian writers frequently made the connection between the rebirth of the sun and the birth of the Son. One of the difficulties with this view is that it suggests a nonchalant willingness on the part of the Christian church to appropriate a pagan festival when the early church was so intent on distinguishing itself categorically from pagan beliefs and practices.",
  "A second view suggests that December 25 became the date of Jesus’ birth by a priori reasoning that identified the spring equinox as the date of the creation of the world and the fourth day of creation, when the light was created, as the day of Jesus’ conception (i.e., March 25). December 25, nine months later, then became the date of Jesus’ birth. For a long time the celebration of Jesus’ birth was observed in conjunction with his baptism, celebrated January 6.",
  "Christmas began to be widely celebrated with a specific liturgy in the 9th century but did not attain the liturgical importance of either Good Friday or Easter , the other two major Christian holidays. Roman Catholic churches celebrate the first Christmas mass at midnight, and Protestant churches have increasingly held Christmas candlelight services late on the evening of December 24. A special service of “lessons and carols” intertwines Christmas carols with Scripture readings narrating salvation history from the Fall in the Garden of Eden to the coming of Christ. The service, inaugurated by E.W. Benson and adopted at the University of Cambridge, has become widely popular.",
  "  None of the contemporary Christmas customs have their origin in theological or liturgical affirmations, and most are of fairly recent date. The Renaissance humanist Sebastian Brant recorded, in Das Narrenschiff (1494; The Ship of Fools ), the custom of placing branches of fir trees in houses. Even though there is some uncertainty about the precise date and origin of the tradition of the Christmas tree, it appears that fir trees decorated with apples were first known in Strasbourg in 1605. The first use of candles on such trees is recorded by a Silesian duchess in 1611. The Advent wreath—made of fir branches, with four candles denoting the four Sundays of the Advent season—is of even more recent origin, especially in North America. The custom, which began in the 19th century but had roots in the 16th, originally involved a fir wreath with 24 candles (the 24 days before Christmas, starting December 1), but the awkwardness of having so many candles on the wreath reduced the number to four. An analogous custom is the Advent calendar, which provides 24 openings, one to be opened each day beginning December 1. According to tradition, the calendar was created in the 19th century by a Munich housewife who tired of having to answer endlessly when Christmas would come. The first commercial calendars were printed in Germany in 1851. The intense preparation for Christmas that is part of the commercialization of the holiday has blurred the traditional liturgical distinction between Advent and the Christmas season, as can be seen by the placement of Christmas trees in sanctuaries well before December 25.",
  "    Toward the end of the 18th century the practice of giving gifts to family members became well established. Theologically, the feast day reminded Christians of God’s gift of Jesus to humankind even as the coming of the Wise Men, or Magi , to Bethlehem suggested that Christmas was somehow related to giving gifts. The practice of giving gifts, which goes back to the 15th century, contributed to the view that Christmas was a secular holiday focused on family and friends. This was one reason why Puritans in Old and New England opposed the celebration of Christmas and in both England and America succeeded in banning its observance.",
  "  The tradition of celebrating Christmas as a secular family holiday is splendidly illustrated by a number of English “Christmas” carols such as “Here We Come A-Wassailing” or “Deck the Halls.” It can also be seen in the practice of sending Christmas cards , which began in England in the 19th century. Moreover, in countries such as Austria and Germany, the connection between the Christian festival and the family holiday is made by identifying the Christ Child as the giver of gifts to the family. In some European countries, St. Nicholas appears on his feast day (December 6) bringing modest gifts of candy and other gifts to children. In North America the pre-Christmas role of the Christian saint Nicholas was transformed, under the influence of the poem “A Visit from St. Nicholas” (or “ ’Twas the Night Before Christmas”) , into the increasingly central role of Santa Claus as the source of Christmas gifts for the family. While both name and attire—a version of the traditional dress of bishop—of Santa Claus reveal his Christian roots, and his role of querying children about their past behaviour replicates that of St. Nicholas, he is seen as a secular figure. In Australia, where people attend open-air concerts of Christmas carols and have their Christmas dinner on the beach, Santa Claus wears red swimming trunks as well as a white beard.",
  "  In most European countries, gifts are exchanged on Christmas Eve, December 24, in keeping with the notion that the baby Jesus was born on the night of the 24th. The morning of December 25, however, has become the time for the exchange of gifts in North America. In 17th- and 18th-century Europe the modest exchange of gifts took place in the early hours of the 25th when the family returned home from the Christmas mass. When the evening of the 24th became the time for the exchange of gifts, the Christmas mass was set into the late afternoon of that day. In North America the centrality of the morning of the 25th of December as the time for the family to open presents has led, with the exception of Catholic and some Lutheran and Episcopal churches, to the virtual end of holding church services on that day, a striking illustration of the way societal customs influence liturgical practices.",
  "Given the importance of Christmas as one of the major Christian feast days, most European countries observe, under Christian influence, December 26 as a second Christmas holiday. This practice recalls the ancient Christian liturgical notion that the celebration of Christmas, as well as that of Easter and of Pentecost, should last the entire week. The weeklong observance, however, was successively reduced to Christmas day and a single additional holiday on December 26.",
  " Eastern Orthodox churches honour Christmas on December 25. However, for those that continue to use the Julian calendar for their liturgical observances, this date corresponds to January 7 on the Gregorian calendar . The churches of the Oriental Orthodox communion celebrate Christmas variously. For example, in Armenia, the first country to adopt Christianity as its official religion, the church uses its own calendar; the Armenian Apostolic Church honours January 6 as Christmas. In Ethiopia, where Christianity has had a home ever since the 4th century, the Ethiopian Orthodox Tewahedo Church celebrates Christmas on January 7. Most of the churches of the Syriac Orthodox Patriarchate of Antioch and All the East celebrate Christmas on December 25; at the Church of the Nativity in Bethlehem, however, the Syriac Orthodox celebrate Christmas on January 6 with the Armenian Apostolic Church. Congregations of the Coptic Orthodox Church of Alexandria follow the date of December 25 on the Julian calendar, which corresponds to Khiak 29 on the ancient Coptic calendar.",
  "With the spread of Christianity beyond Europe and North America, the celebration of Christmas was transferred to societies throughout the non-Western world. In many of these countries, Christians are not the majority population, and, therefore, the religious holiday has not become a cultural holiday. Christmas customs in these societies thus often echo Western traditions because the people were exposed to Christianity as a religion and cultural artifact of the West.",
  "In South and Central America, unique religious and secular traditions mark the Christmas celebration. In Mexico, on days leading up to Christmas, the search of Mary and Joseph for a place to stay is reenacted, and children try to break a piñata filled with toys and candy. Christmas is a great summer festival in Brazil, including picnics, fireworks, and other festivities as well as a solemn procession of priests to the church to celebrate midnight mass.",
  "In some parts of India the evergreen Christmas tree is replaced by the mango tree or the bamboo tree, and houses are decorated with mango leaves and paper stars. Christmas largely remains a Christian holiday and is otherwise not widely observed.",
  "Japan serves as illustration of a different sort. In that predominantly Shintō and Buddhist country, the secular aspects of the holiday—Christmas trees and decorations, even the singing of Christmas songs such as “Rudolph the Red-Nosed Reindeer” or “White Christmas”—are widely observed instead of the religious aspects."
]