[
  " churning of the ocean of milk , in Hinduism , one of the central events in the ever-continuing struggle between the  deva  s (gods) and the  asura  s (demons, or titans).",
  "The gods, who had become weakened as a result of a curse by the irascible sage Durvasas, invited the asura s to help them recover the elixir of immortality, the amrita , from the depths of the cosmic ocean. Mount Mandara—a spur of Mount Meru , the world axis—was torn out to use as a churning stick and was steadied at the bottom of the ocean by Vishnu in his avatar (incarnation) as the tortoise Kurma . The asura s held the head of the  naga  (half-human, half-cobra) Vasuki, who was procured for a churning rope, and the gods held his tail. When Vasuki’s head vomited forth poison that threatened to fall into the ocean and contaminate the amrita , the god Shiva took it and held it in his throat, a feat that turned his throat blue.",
  "In the churning of the ocean many wonderful treasures that became the prototypes for their earthly and heavenly counterparts were brought up from the depths: (1) Chandra, the moon, (2) parijata , a beautiful and fragrant tree now planted in Indra ’s heaven, (3) the four-tusked elephant Airavata, Indra’s mount, (4) Kamadhenu, the cow of plenty, (5) Madira, the goddess of wine, who became Varuni, the wife of Varuna, (6) Kalpavriksha, the wish-fulfilling tree, (7) the  apsara  s (celestial dancers), (8) the celestial horse Uccaihshravas, (9) the goddess Lakshmi , who became Vishnu’s wife, (10) Panchajanya, Vishnu’s conch, (11) Vishnu’s mace and magic bow, (12) various gems, and (13–14) Dhanvantari, the physician of the gods, who rose up out of the waters carrying in his hands the supreme treasure, the amrita .",
  "When the amrita appeared, the gods and the asura s fought over its possession, though they had originally agreed to share it equally. After many adventures, it was finally consumed by the gods, who were thus restored in strength."
]