[
  "  aromatic compound , any of a large class of unsaturated chemical compounds characterized by one or more planar rings of atoms joined by covalent bonds of two different kinds. The unique stability of these compounds is referred to as aromaticity. Although the term aromatic originally concerned odour, today its use in chemistry is restricted to compounds that have particular electronic, structural, or chemical properties. Aromaticity results from particular bonding arrangements that cause certain π (pi) electrons within a molecule to be strongly held. Aromaticity is often reflected in smaller than expected heats of combustion and hydrogenation and is associated with low reactivity.",
  " p   Benzene (C 6 H 6 ) is the best-known aromatic compound and the parent to which numerous other aromatic compounds are related. The six carbons of benzene are joined in a ring, having the planar geometry of a regular hexagon in which all of the C—C bond distances are equal. The six π electrons circulate in a region above and below the plane of the ring, each electron being shared by all six carbons, which maximizes the force of attraction between the nuclei (positive) and the electrons (negative). Equally important is the number of π electrons, which, according to molecular orbital theory, must be equal to 4 n + 2, in which n = 1, 2, 3, etc. For benzene with six π electrons, n = 1.",
  "The largest group of aromatic compounds are those in which one or more of the hydrogens of benzene are replaced by some other atom or group, as in toluene (C 6 H 5 CH 3 ) and benzoic acid (C 6 H 5 CO 2 H). Polycyclic aromatic compounds are assemblies of benzene rings that share a common side—for example, naphthalene (C 10 H 8 ). Heterocyclic aromatic compounds contain at least one atom other than carbon within the ring. Examples include pyridine (C 5 H 5 N), in which one nitrogen (N) replaces one CH group, and purine (C 5 H 4 N 4 ), in which two nitrogens replace two CH groups. Heterocyclic aromatic compounds, such as furan (C 4 H 4 O), thiophene (C 4 H 4 S), and pyrrole (C 4 H 4 NH), contain five-membered rings in which oxygen (O), sulfur (S), and NH, respectively, replace an HC=CH unit."
]