[
  {
    "id": "gallery-4",
    "title": "Gordon and Betty Moore Gallery 4: Living Systems",
    "tagline": "Explore life from DNA and cells to organisms and ecosystems.",
    "description": "Sometimes life is hard to observe, because it’s too tiny or fast or is hidden underground or in the ocean. Discover what you’ve been missing: use scientific tools to investigate living things of different sizes, the ecosystems they inhabit, and the processes they share.",
    "curator_statement": "Gallery 4 fosters an appreciation of the living world and the many ways to explore it. Using authentic scientific methods and tools, visitors learn about living things at different scales, the processes they share, and their ecosystems. Anchored by the Life Sciences Laboratory, a working laboratory that cultivates organisms for exhibits, the gallery is a dynamic space where contributions by the scientific and artistic communities come together to provide unique and engaging experiences. A Cells and Development section includes the renovated Microscope Imaging Station, which gives visitors a direct look through research-grade microscopes at stem cell biology and other aspects of development. Living Liquid is a new exhibit area that focuses on tiny drifting marine organisms called plankton as well as often-overlooked species in the Bay and the ocean beyond. Life around Us blends new and classic exhibits that examine familiar organisms and reveal their amazing behaviors and unusual features. Located at the eastern end of Pier 15, with a magnificent view of the Bay, the gallery invites an exploratory yet contemplative interaction with the biological world. Kristina Yu , Curator  Jennifer Frazier , Associate Curator",
    "short-summary": "The Gordon and Betty Moore Gallery 4: Living Systems is a museum gallery that explores life from DNA and cells to organisms and ecosystems. The gallery has a Cells and Development section which includes the renovated Microscope Imaging Station, which gives visitors a direct look through research-grade microscopes at stem cell biology and other aspects of development. There is also a Living Liquid area which focuses on tiny drifting marine organisms called plankton as well as often-overlooked species in the Bay and the ocean beyond. The Life around Us area blends new and classic exhibits that examine familiar organisms and reveal their amazing behaviors and unusual features.",
    "medium-summary": "The Gordon and Betty Moore Gallery 4: Living Systems is a museum gallery that explores life from DNA and cells to organisms and ecosystems. The gallery has a Cells and Development section which includes the renovated Microscope Imaging Station, which gives visitors a direct look through research-grade microscopes at stem cell biology and other aspects of development. The Living Liquid is a new exhibit area that focuses on tiny drifting marine organisms called plankton as well as often-overlooked species in the Bay and the ocean beyond. The Life around Us blends new and classic exhibits that examine familiar organisms and reveal their amazing behaviors and unusual features.",
    "keywords": [
      "Biology",
      "Life Sciences",
      "Microscope Imaging Station",
      "Living Liquid",
      "Life around Us",
      "Pier 15"
    ],
    "fun-facts": [
      "The Gordon and Betty Moore Gallery 4: Living Systems is home to the Life Sciences Laboratory, which cultivates organisms for exhibits.",
      "The gallery has a Cells and Development section which includes the renovated Microscope Imaging Station, which gives visitors a direct look through research-grade microscopes at stem cell biology and other aspects of development.",
      "The gallery has a Living Liquid exhibit area which focuses on tiny drifting marine organisms called plankton as well as often-overlooked species in the Bay and the ocean beyond."
    ]
  },
  {
    "id": "gallery-5",
    "title": "Gallery 5: Outdoor Exhibits",
    "tagline": "Explore winds, tides, and natural phenomena.",
    "description": "Investigate forces shaping the City, Bay, and region. Watch shifting winds and tides, reveal hidden life, shake a bridge, observe human behavior, and find new ways to notice the places we inhabit.",
    "curator_statement": "The guiding principle of the Gallery 5 is to support and expand the Exploratorium’s role as a community museum dedicated to awareness. Helping to reinvent the civic role of a public museum as a place to gather and exchange ideas, the gallery also exemplifies how direct observations of natural and urban phenomena can blossom into artistic endeavors, scientific investigations, and open-ended inquiries. The gallery features a combination of large- and small-scale exhibits, rotating art installations, and public programs  (including vendors, performance artists, and public exhibitions). Our defining location on the urban edge of the city and the Bay enhances visitors’ ability to perceive their surroundings with heightened precision and clarity that leads to deepened insight and understanding. The gallery team is also extending its efforts beyond the boundaries of the Exploratorium campus, developing community-based partnerships that stretch throughout San Francisco and the Bay Area to create interactive outposts that both engage and delight. Shawn Lani , Curator Eric Dimond, Associate Curator",
    "short-summary": "The Exploratorium is a museum with a variety of gallery exhibits that explore natural phenomena such as winds and tides. The curator statement for the gallery emphasizes the importance of the Exploratorium's role as a community museum and its dedication to awareness. The gallery features a combination of large- and small-scale exhibits, rotating art installations, and public programs. The team is also extending its efforts beyond the boundaries of the Exploratorium campus, developing community-based partnerships that stretch throughout San Francisco and the Bay Area.",
    "medium-summary": "The 8th grade museum gallery described is the Exploratorium's Gallery 5 which focuses on outdoor exhibits that explore winds, tides, and natural phenomena. The curator's statement explains that the guiding principle of the gallery is to support and expand the Exploratorium's role as a community museum. The gallery features a combination of large- and small-scale exhibits, rotating art installations, and public programs that engage and delight visitors. The defining location of the gallery on the urban edge of the city and the Bay enhances visitors' ability to perceive their surroundings with heightened precision and clarity.",
    "keywords": [
      "Winds",
      "tides",
      "natural phenomena",
      "Bay",
      "region",
      "human behavior",
      "noticing",
      "places",
      "San Francisco",
      "Exploratorium",
      "community museum",
      "awareness",
      "Eric Dimond",
      "Shawn Lani"
    ],
    "fun-facts": [
      "The Exploratorium is a museum in San Francisco, California, that explores science, art, and human perception.",
      "The Exploratorium has a rooftop garden.",
      "The Exploratorium has a \"Tinkering Studio\" where visitors can experiment with materials and tools."
    ]
  },
  {
    "id": "gallery-3",
    "title": "Bechtel Gallery 3: Seeing & Reflections",
    "tagline": "Experiment with light, mirrors, and bubbles.",
    "description": "Our eyes respond to light, but this is just one aspect of how we perceive the world. Playing with light is a great way to learn how it works. And investigating real phenomena can give you a deeper understanding of the scientific process.",
    "curator_statement": "Bechtel Gallery 3 is the heart of the Exploratorium, a place designed to spark and nurture visitors’ curiosity and challenge them to investigate natural phenomena for themselves—with tools and gentle guidance to catalyze their explorations. The gallery features many of our favorite classic exhibits, but it also introduces new exhibits and experimental prototypes that reflect our efforts to share current science as it advances. The primary activity in the gallery is experimentation in the broadest sense. Visitors are encouraged to discover things for themselves through exhibits designed as experiments, with opportunities for experimental variations and controls. Most importantly, visitors have a unique opportunity to learn-by-doing about the scientific process itself, the power of experiment to answer questions, and the roles of knowledge and creativity in discovering connections among diverse phenomena. Immersive and evocative experiences will inspire further explorations. Thomas Humphrey, Curator Richard O. Brown, Associate Curator",
    "short-summary": "This is a short summary of the Bechtel Gallery 3 at the Exploratorium Museum. This gallery is all about exploring light and its effects on the human eye. There are exhibits that allow visitors to experiment with light and mirrors, as well as bubbles. The curator's statement explains that this gallery is designed to spark curiosity in visitors and help them learn about the scientific process.",
    "medium-summary": "The Bechtel Gallery 3 is the heart of the Exploratorium. It is designed to spark and nurture visitors' curiosity and challenge them to investigate natural phenomena for themselves. The primary activity in the gallery is experimentation in the broadest sense. Visitors are encouraged to discover things for themselves through exhibits designed as experiments, with opportunities for experimental variations and controls.",
    "keywords": [
      "light",
      "mirrors",
      "bubbles",
      "eyes",
      "perception",
      "natural phenomena",
      "scientific process",
      "Exploratorium",
      "curiosity",
      "Thomas Humphrey",
      "Richard O. Brown"
    ],
    "fun-facts": [
      "The Bechtel Gallery 3 is the heart of the Exploratorium.",
      "The gallery features many of the Exploratorium's favorite classic exhibits.",
      "The gallery also introduces new exhibits and experimental prototypes that reflect the Exploratorium's efforts to share current science as it advances."
    ]
  },
  {
    "id": "gallery-1",
    "title": "Bernard and Barbro Osher Gallery 1: Human Phenomena",
    "tagline": "Experiment with thoughts, feelings, and social behavior.",
    "description": "Humans think, feel, and interact, and these phenomena are all open to scientific investigation and creative exploration. Here, you and others are the exhibits—so play with social interactions, observe others, and contribute your reflections.",
    "curator_statement": "The experiences in the Osher Gallery focus on cognition, emotion, social behavior, and the interplay between science, society, art, and culture. We all perceive the world, remember the past, look forward to the future, and communicate with each other—and both scientists and artists investigate how and why we do so. In this gallery, you can explore how your mind works and learn about the scientific study of human behavior through exhibits on emotion, language, memory, and pattern recognition. The space is also home to Science of Sharing , a project funded by the National Science Foundation to develop exhibits that let you experiment with cooperation, competition, and strategies for sharing resources. Here, you're the exhibit; the mechanisms presented here are just tools through which you can play with and reflect on your experiences. The gallery is also a venue for dynamic temporary exhibitions; the first was The Changing Face of What Is Normal , a collection of artifacts and experiences exploring the evolving nature of normality and the lives of those affected by mental illness. In addition, the Black Box offers a state-of-the-art immersive environment for large, media-based exhibitions by visiting artists. The gallery also features works by past and present Exploratorium artists-in-residence.  Pamela Winfrey , Curator  Hugh McDonald , Associate Curator",
    "short-summary": "Bernard and Barbro Osher Gallery 1: Human Phenomena is at the Exploratorium, which is a museum in San Francisco. It is a place where you can experiment with thoughts, feelings, and social behavior. Humans think, feel, and interact, and these phenomena are all open to scientific investigation and creative exploration. The experiences in the Osher Gallery focus on cognition, emotion, social behavior, and the interplay between science, society, art, and culture.",
    "medium-summary": "The Bernard and Barbro Osher Gallery of Human Phenomena is a museum gallery that focus on cognition, emotion, social behavior, and the interplay between science, society, art, and culture. In the gallery, visitors can explore how their mind works and learn about the scientific study of human behavior. The space also features Science of Sharing, a project funded by the National Science Foundation to develop exhibits that let visitors experiment with cooperation, competition, and strategies for sharing resources. The gallery also features works by past and present Exploratorium artists-in-residence.",
    "keywords": [
      "Cognition",
      "emotion",
      "social behavior",
      "language",
      "memory",
      "pattern recognition",
      "normality",
      "mental illness",
      "art",
      "science",
      "society",
      "sharing",
      "cooperation",
      "competition",
      "immersive environment",
      "visiting artists",
      "artists-in-residence"
    ],
    "fun-facts": [
      "The Bernard and Barbro Osher Gallery is a museum gallery located in the Exploratorium in San Francisco, California. The gallery focuses on cognition, emotion, social behavior, and the interplay between science, society, art, and culture."
    ]
  },
  {
    "id": "gallery-6",
    "title": "Fisher Bay Observatory Gallery 6: Observing Landscapes",
    "tagline": "Uncover the history, geography, and ecology of the Bay Area.",
    "description": "Natural and human forces interact to create the dynamic landscape surrounding us. Learn to uncover the stories embedded in a place by directly observing the geography, history, and ecology of the San Francisco Bay region.",
    "curator_statement": "This second-floor, indoor/outdoor exhibition space features spectacular views of the Bay and San Francisco’s northern waterfront, as well as its urban, downtown cityscape. The Fisher Bay Observatory Gallery  and Terrace use these views as an entry point for investigations of the history and dynamic processes in the local landscape, and the human impact. The exhibits, artworks, and instruments here probe the environment from multiple perspectives, such as physical and geographic sciences, ecology, astronomy, history, and contemporary experience. A small browsing library of maps and books from the past and present helps visitors explore ideas that shape the Bay Area. The Fisher Bay Observatory Gallery also introduces visitors to the process of observation, and the tools and methods scientists use to gather information about the world around us. Some instruments like cameras and telescopes help us observe the landscape directly, while other exhibits present live or archived data or, visualizations, and eventually video streams, creating a picture of our surroundings that we otherwise might never see. Susan Schwartzenberg , Curator",
    "short-summary": "The Fisher Bay Observatory Gallery is a museum gallery that explores the history, geography, and ecology of the Bay Area. The gallery has exhibits that investigate the environment from multiple perspectives, such as physical and geographic sciences, ecology, astronomy, history, and contemporary experience. The gallery also introduces visitors to the process of observation, and the tools and methods scientists use to gather information about the world around us.",
    "medium-summary": "The Fisher Bay Observatory Gallery is an exhibition space that features spectacular views of the Bay and San Francisco's northern waterfront, as well as its urban, downtown cityscape. The gallery uses these views as an entry point for investigations of the history and dynamic processes in the local landscape, and the human impact. The exhibits, artworks, and instruments here probe the environment from multiple perspectives, such as physical and geographic sciences, ecology, astronomy, history, and contemporary experience. The gallery also introduces visitors to the process of observation, and the tools and methods scientists use to gather information about the world around us.",
    "keywords": [
      "Landscape",
      "geography",
      "ecology",
      "history",
      "astronomy",
      "observation",
      "Bay Area"
    ],
    "fun-facts": [
      "The Fisher Bay Observatory Gallery has a library with books about the history and geography of the Bay Area.",
      "The gallery has a terrace with a view of the Bay and San Francisco’s northern waterfront.",
      "The gallery has exhibits that investigate the environment from multiple perspectives, such as physical and geographic sciences, ecology, astronomy, history, and contemporary experience."
    ]
  },
  {
    "id": "gallery-2",
    "title": "Gallery 2: Tinkering",
    "tagline": "Explore your creativity and our curious contraptions.",
    "description": "Making things and developing ideas by hand helps us construct understanding. Slow down, settle in, and make something personally meaningful—from playful contraptions to surprising connections between mechanical systems and natural phenomena.",
    "curator_statement": "A tall, fanciful, interactive Tinkerer’s Clock towers over Gallery 2, welcoming you to a public workshop area where you can make, build, or tinker, either alone or with others, as a way of exploring the world and your own creativity. Here, familiar materials are used in unfamiliar ways, and exhibits highlight the beauty—and, sometimes, whimsy—of scientific complexity and discovery. The Tinkering Studio is the heart of this gallery. In this immersive space, visitors use tools and materials to explore the intersection of science, art, and technology. We try experiments for the first time, or play along with other makers and artists. Whether expert of novice, we’re all learning together by making something that is personally meaningful. Adjacent to the gallery is the museum’s exhibit-building workshop, where most of our exhibits are made. Open to public view, you’ll see our staff working with a variety of materials—woodworking tools, drills, and lathes, for example—and some of our exhibits in various stages of development. The Learning Studio is also in the gallery space. It serves as a research-and-development lab for staff and artists/collaborators. Here, we try things out, make mistakes, get excited, become delighted, and every now and then stumble on to something great that we share with visitors in the Tinkering Studio and in professional development workshops for teachers and museum educators.  Mike Petrich and Karen Wilkinson, Curators ",
    "short-summary": "The Tinkerer’s Clock is a large, interactive clock in Gallery 2 of a museum. This gallery is a place where visitors can make things and explore their creativity. The Tinkering Studio is an immersive space where visitors can use tools and materials to explore the intersection of science, art, and technology.",
    "medium-summary": "Gallery 2 of the Exploratorium in San Francisco is a space for tinkering and creativity. It is home to the Tinkering Studio, an immersive space where visitors use tools and materials to explore the intersection of science, art, and technology. Adjacent to the gallery is the museum's exhibit-building workshop, where most of the museum's exhibits are made. The gallery also houses the Learning Studio, a research-and-development lab for staff and artists/collaborators.",
    "keywords": [
      "Tinkering",
      "Creativity",
      "Contraptions",
      "Making",
      "Understanding",
      "Playful",
      "Fanciful",
      "Interactive",
      "Public",
      "Workshop",
      "Studio",
      "Materials",
      "Science",
      "Art",
      "Technology",
      "Exhibit",
      "Building",
      "Research",
      "Development",
      "Lab",
      "Teacher",
      "Museum"
    ],
    "fun-facts": [
      "Gallery 2 is home to the Tinkering Studio, a space where visitors can use tools and materials to explore the intersection of science, art, and technology.",
      "The Tinkering Studio is adjacent to the exhibit-building workshop, where most of the museum's exhibits are made.",
      "The Learning Studio is also in Gallery 2 and serves as a research-and-development lab for staff and artists/collaborators."
    ]
  }
]